{"pros":{"0":"Highland St. is mostly commercial, with a collection of high-rise low-to-moderate residential buildings, as well as Crichton College.","1":"A 13-story high-rise building was constructed in 1966 and served as housing for the elderly [REF].","2":"Upon completion of the high-rise, the development had a total of 1002 units.","3":"It was also the last conventional public housing development constructed in New Orleans and originally consisted of a 13-floor high-rise and fourteen 3-floor units [REF].","4":"A sniper sat on top of the high-rise building, preventing the police and other from entering.","5":"Replacing the highrise were numerous low-income houses.","6":"Toll readers were located on gantries at the east highrise,[REF] but additional gantries on the east mainland were added to facilitate tolling on the new bridge once opened.","7":"From 1970 to 1990, All My Children was recorded at ABC's TV18 at 101 West 67th St, now a 50-story apartment tower.","8":"There is also council housing in the form of maisonettes plus four high-rise blocks.","9":"Entering the southwestern corner of Jefferson Davis Parish, LA 14 turns to resume its eastward course and crosses a high-rise fixed span bridge (built in 2013 to replace an aging swing bridge)[REF] over the wide and serpentine Bayou Lacassine.","10":"The Original Towers, nine-story high-rise residence halls designed primarily for freshmen, feature one-bedroom suites.","11":"Apartment blocks have been re-purposed as accommodation for employees of the State Agency.","12":"It was planned as a satellite city: a string of high-rise developments and designated commercial and industrial zones.","13":"In 1981 a new construction zone plan was designated, which had a less dense settlement plan and turned away from high rises.","14":"In the central business district, the lifting of height restrictions heralded the beginning of the city's change into a largely high-rise city [REF].","15":"It comprises of two high-rise apartment buildings, and features vertical hanging gardens.","16":"With the lifting of height restrictions in the post-World War II years, much of central Sydney's older stock of architecture was demolished to make way for modernist high rise buildings.","17":"The house was demolished in 1937 and the site was redeveloped as an apartment block.","18":"They get into trouble early on in the investigation when they and Roland Pryzbylewski drunkenly raid a Barksdale-controlled high rise tower and nearly incite a riot.","19":"Housing at BU is an unusually diverse melange, ranging from individual 19th-century brownstone townhouses and apartment buildings acquired by the school to large-scale high-rises built in the 1960s and 2000s.","20":"Construction on the rest of phase II, which included 19- and 26-story residential towers was finished in fall 2009.","21":"In 1986, Denise Kowal bought the triangle building and its 1950's addition to save it from demolition by speculators who wanted to build a high-rise on the property.","22":"The Fashion Mall is surrounded by a large mixed-use development consisting of several midrise office buildings (the tallest rises 18 stories), hotels, and stand-alone restaurants.","23":"Collingwood's housing consists of a large number of high-rise housing commission flats and a number of older single and double storey former workers cottages on small subdivisions.","24":"Families and the established middle class left Capitol Hill in a mass diaspora, selling off the family home to a developer interested in putting up a high-rise in its place or leaving the home abandoned.","25":"In the now-discredited belief that tearing down historic buildings and replacing them with modern architecture and high-rises would benefit cities, DURA bulldozed the bulk of Larimer Street in downtown.","26":"The deep elliptical crescent of Eyre Crescent was built around Canonmills (or Eyre) House which was replaced in 1880-1 by a United Presbyterian Church[REF][REF] which in turn has been replaced by a modern apartment block.","27":"It is a fairly large council scheme, which consists mostly of low-rise flats but also houses two 14 storey tower blocks (Greendykes House and Wauchope House).","28":"In the sixties six tower blocks were built, whilst all six remain a large project was undertaken to refurbish these tower blocks, to coincide with the building of the Edinburgh Royal Infirmary.","29":"The predominant feature of the area is the 22-storey tower block Martello Court, which accommodates 88 flats.","30":"Other high rise blocks in the area include Birnies Court, Fidra Court, Gunnet Court and Inchmickery Court amongst others.","31":"The housing mostly takes the form of maisonettes and three storey blocks of flats.","32":"The plan, a $220 million investment, includes a 29-story residential tower, a 10-story office building, and a two-story retail and entertainment building [REF].","33":"It is slated to have high rise condominiums, retail, and office space [REF].","34":"The apartment tower is easily identifiable from its \"L\" shape.","35":"The high-rise uses the modern architecture style, incorporating a great deal of glass and steel.","36":"It is an office high-rise with a multi-story parking garage.","37":"It was demolished in 1915 and replaced by the present high-rise office building, which opened in 1917 [REF].","38":"The Banco Group turned the Footscray Plaza into a $45 million apartment block of ten stories, with the old retail space expanded.","39":"The long-abandoned Kinnears rope factory site on Ballarat Road could be turned into a mini-suburb for 2,500 people including high-rise apartments, increasing the number of homes in Footscray by more than a quarter [REF].","40":"In the past most of the residences used to be small bungalows, which are now being replaced by high rise buildings.","41":"Sujata building was Santacruz's first high-rise (one with lift service) built by Raheja builders right across from the police station.","42":"This area is now being developed with the construction of highrise apartment and office blocks with one block complete[REF] and another under construction.","43":"This will be called Curzon Park and will feature a major low to mid-rise mixed-use scheme with residential, leisure and hotel facilities.","44":"Originally designed by Richard Rogers as part of the scheme for the Library of Birmingham, it was to have several residential towers however the architects pulled out when the library scheme was shelved.","45":"Most of the properties use deck access, but the ground floor flats are accessed via individual front doors.","46":"This was because the majority of electors lived in older tenements or newer Council blocks of flats where flat numbers were not specified.","47":"A four-storey stone residential tower, called the Tower of League, was built in the castle's south-west corner.","48":"Baird House is a four-storey tower block which was built in the 1960s.","49":"Ewing House is a five-storey tower block which was built in the 1960s.","50":"It is a six-storey tower block, which was opened in 1967, and has been used as a student hall of residence continually ever since.","51":"Turner House is a six-storey tower block which was built in the 1960s.","52":"Brewster House was a four-storey tower block which was built in the 1960s and used to house Undergraduate students (and tourists during summers) for the length of its use.","53":"During the 1920s and 1930s, many of the large gardens of the older mansions were subdivided and blocks of flats became a feature of the area [REF].","54":"In Toorak, some of the old property names live on as street names or the names of blocks of flats, carved out of or built on their sites.","55":"Further complementing the high rise developments was a low density development between Bangs and Bendigo Streets.","56":"A public housing high rise estate is located on King Street, adjoining Princes Gardens.","57":"The Northwest Expressway Corridor includes most of the large scale high-rises, office towers, and hotels outside of downtown (including the architecturally interesting 360 at Founders Plaza).","58":"It is also assumed that the Central Business District would be extended south, and new highrise construction will take place there.","59":"The French film Delicatessen (1991) is set in an apartment block led by a butcher who deals with the food crisis by luring new tenants to the apartment, killing them, and serving them as meat to the other residents.","60":"Most of North Wollongong is commercial or residential with many of Wollongong's highrises situated there.","61":"Matching the song's lyrics, Jagger is seen waiting for Keith Richards in the doorway of an apartment block.","62":"This station is at the heart of Nishi-Shinjuku's residential high rise area.","63":"It is made of three main areas, two former villages that were very close: Romanian Reșița ( or Olah Resitza) and Highland Reșița (, Eisenwerk Reschitza or Nemet Reschitza); a new area, recently built, made of tower blocks on a wide opened meadow, called Bârzava's Meadow [REF].","64":"Planned and constructed as an all-weather, concrete road with multiple lanes, its course is surrounded by high-rise buildings, residential complexes and public places such as parks and other large roads.","65":"Stephenson Tower, a 20 storey tower block on New Street station, will be served with a compulsory purchase order and demolished as part of the project as one of the towers will partially cover the footprint of the building.","66":"On the opposite side of Dale End, which occupies the site set for renovation, is a red brick 1970s midrise office block known as either Dale House or Century House, a multi-storey car park and ground floor, with a mezzanine level, retail space.","67":"The other large buildings, excluding the 110 metre residential tower, will have optional hotel space as well as residential space.","68":"2003 saw the S4R arrive with the 996 engine and twin high rise mufflers on the right hand side with a single sided swingarm along with an increase in power and torque (now up to 113HP) over the 916 powered S4.","69":"All four radio stations and TV outlet share studios on Meridian Street in downtown Indianapolis, and its transmitter tower is atop the nearby residential high-rise Riley Towers II.","70":"The offices seemed to be located in a large city high rise, probably an older building.","71":"Over the recent decades, the former fishing village has been transformed into an upper class residential suburb of George Town, with high-rises such as Straits Quay lining the coast [REF].","72":"The urbanisation of Tanjung Bungah began in the 1980s, leading to the construction of numerous residential high-rises along the shoreline [REF].","73":"Decades of urbanisation has also led to the mushrooming of residential high-rises at Tanjung Bungah.","74":"The city has a rich and varied culture, and the city is divided into three distinct zones: the medieval sector, the 19th century sector and the more densely populated post-war area, with its several apartment blocks [REF].","75":"In Kaisariani (Athens), fighting the attempt of the council to \"modernise\" the area by demolishing the houses of 4,000 families in order to build trade centres and blocks of flats.","76":"The buildings of the School also continued to grow with the construction of the Tower block, through which you still enter the School, and the combined gymnasium and concert hall - which in 1972 was converted into the School Theatre.","77":"In contrast to its direct neighbour Garath,which consists mainly of projects, Hellerhof is socially in a far better social situation because there is much detached and semi-detached housing and only a few blocks of flats.","78":"One can continually add to a modular building, including creating high rises [REF].","79":"She presents this segment from the Food 4 Life Kitchen on the 56th floor of Melbourne's Freshwater Place residential tower.","80":"Traditional building-height restrictions in the central Bridgetown area,[REF][REF] and the perseverance of Barbados authorities in not allowing full-scale conversion of Bridgetown's many traditional buildings into tall iron and glass works[REF] has led to many companies in Barbados choosing to locate in the Warrens area for their high-rise complexes [REF].","81":"The architecture in Leichhardt ranges from Victorian single fronted brick homes to modern new homes and apartment blocks.","82":"This area saw the development of numerous high-rise apartments (going up to 30 floors).","83":"Unlike Singapore, also a Straits Settlement, where many heritage buildings had to make way for modern skyscrapers and high-rise apartments due to rapid development and acute land scarcity, Penang's architectural heritage has enjoyed a better fate.","84":"He lives with his brother in a rundown tower block on the edge of Blackbury.","85":"He has been best friends with Victor for sixty years and they are neighbours on the same floor of Osprey Heights, a tower block in Craiglang.","86":"He has been best friends for sixty years with Jack, who also lives in the same tower block, Osprey Heights.","87":"In addition, two famous shopping malls - Gurney Plaza and Gurney Paragon - as well as numerous high-rise hotels and condominiums, are located along Gurney Drive [REF]."}}