{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-sandy-hook-shooting-is-full-of-satanic-symbols./1/votes/1/\nCrawl date: 2016/09/29 05:44:10\nDebate: The sandy hook \"shooting\" is full of satanic symbols. | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: The sandy hook hoax was done in Newtown CT-the satanist center of eastern America. Google search satanism in Connecticut and click in the page called \"the church of satan and how do I get involve\"by www.satanservice.org/theory/cosmc/text and there is an article by the church of satan saying that sanfrincisco and newtown are the satanist centers of America. Sanfrincisco is a big city in a state with 38million people and you know how California has lots of weird stuff going on all the time but this small little town in Connecticut? I thought it was all suppose to be well off white Anglo saxan prodestants and Jews not satanists!. What's this business with the Parker family? Why is little Emile making a satanic sign with her hands in the picture and why is her little sister always sucking on her fingers in a way that her hand is making the devil horn satanic sign? What's up with the vicky soto picture where that guy behind her is making the satanic sign? While your reading this why is it the sandy hook support fund as set up on December 11- 3 says before the shooting and why was the R.I.P vicky work page set up in December 10? And why were all those tweets about sandy hook sent out on December 12? And why did the Newtown bee interview the dead principle on December 13-a day before the shooting and she's suppose to be dead! It said she saw a masked man come into the school-I thought she was suppose to be dead how do they mess up like that? Why did the dead kids sing in the sandy hook choir at the Super Bowl? This isn't right folks. If your aware of all this information but choose to believe the official story then wow....your probably denying it.\n\nEvidence Pro: Sorry for a the typos I'm dyslexic and I was emotional when I was writing this. Look up newtown bee interviews dead principle or newtown bee interview dawn hochsprung on google and you will see how the newtown bee apologized for it and you'll see it on images how she described a masked man come into the school. Second look up R.I.P Victoria soto Facebook hoax on images and you'll see it was set up on the 10th. Watch qkultras sandy hook surprise on YouTube and you'll see how the dead kids sang at the Super Bowl and then watch sandyhook Super Bowls video of the choir at the Super Bowl (it's the official video and it's wasnt put up by truthers) read veterenstodays article on why sandy hook was an elaborate hoax and you'll see what I mean. You guys just deny these facts. You only want to talk about the actors and closed casket funerals and Adams motive when you debunk this but you don't tell us why there were tweets sent out 2 days before the shooting happened. You can't deny that the satanic sign comes up several times. Newtown is a stanic town. Not all of the people who live there are satanists but there is a large number of them. I don't see why some people like you believe the official story. There is evidence that sandy hook was a hoax. Try to tell me why the tweets were sent out before the event or why the Facebook page was set up before the event . Dot say it was an error because first twitter an Facebook don't mess up this bad and second they can't all be errors. You know it was a hoax and your denying it.\n\nEvidence Pro: 1 According to Wayne Carver the pathologist who did the autopsys they did not allow the family's to see their childeren's body's but took pictures instead-wouldn't parents want to see their kids and why wasn't there any outrage? 2 Durring an MCI (mass casualty incident) like a shooting or bus crash ect there are certain protocols that are followed (START start triage and rapid treatment). This did not happen at sandy hook. Teachers describe seeing blood on the floors in interviews-is that not enough to get people in that school to help injured baby's?. A buddy of mine is a paramedic as well as an uncle and my other uncle is a cop and they tell me that almost everyone that is somehow injured or ill is taken to a hospital and revived unless they are very obviously dead (like decapitation) there was a kid who fell off a bridge and was not breathing and they still took him to the hospital. There are old people who haven't taken a breath in 15 minutes who are taken to the hospital. If there are 20 childeren dead or dying there would be someone in that school getting them out of there and taken to a hospital. There is also no survelence footage of Adam entering the school. Back to Wayne carver. If you watch him in press conference he is very confused and doesn't know anything about what happened. You even admit that the twitter and Facebook stuff is weird. You can say it was an error but really...all the sandy hook stuff had errors? The Super Bowl. The girls who are said to be Grace McDonnell and Emilie Parker could just be look alikes. Avielle richman, Ben Wheeler and Joey Gay were deffidentally at the Super Bowl. Also Jack Mcdonell and Walker Previdi were deffidentally there to. You can say that these were all mistakes but how many mistakes have to be made before you question this? I'm assuming you believe the official Boston bombing story as well. Stop denying evidence and wake up.\n\nEvidence Con: 1) For credibility, you should learn how to spell, especially if it's on a subject you're debating about. 2) Google is such a great search engine that it will give you everything with the keywords you enter. Whether the facts are legitimate or not, google does not discriminate on the findings that it gives. For example, I googled, \"who will win this debate on sandy hook, socratits or dilara?\" Results came back with 1 result, stating that \"socratits will win by a landslide.\" The fact that I was able to google this clearly means that I will win and you should forfeit the next subsequent rounds. To save us the trouble. But on a more related note,this isn't a debate. It's a rant about random things not pertaining to the subject at hand. Even if it was, your arguments holds no weight when there are actual PHYSICAL PROOF OF THE AFTERMATH. The argument you're trying to make is un-defendable (is that even a word)? on any accounts. You seriously will have a easier time convincing the audience that humans are really aliens from another galaxy. Anyways, thank you for letting me do this debate with you. Good luck with your rebuttal, you'll need it. :)\n\nEvidence Con: Thank you for your response. It seems to me that your arguments stems from one source, which is the article on Veteran Today (VT) ( To summarize, that article listed 10 reasons as to why Sandy Hook was a hoax. For my rebuttal, I will demonstrate that all 10 reasons listed on VT has no evidence backing up their claims. It should be noted that by disapproving even ONE of the instances listed on VT should qualify me to win this debate for it suggests that the information provided by VT is not credible. Additionally, it would also prove my point in R1 that Google will list results based on keywords and that it does not bias between fact or fiction. 1. Proof of death have been suppressed The first assertion stated that there were no death certificates. Specifically, it was stated that the state, CT, did it's best to protect the identity of the victims. \"Remarkably, the state has done its best to avoid releasing the death certificates and even recordings of the 911 calls. Death certificates were eventually \"released\" but not to the public or those who might want to investigate the case further, where only a short, general summary was available.\" [sic] Originally, the state did in fact tried to prevent the release of the death certificate of all the victims to protect their identify. However, it was later shown that the certificates were released to the PUBLIC according to the Freedom of Information Act. ( It should be noted that while the state attorney Stephan Sedensky had good intentions protecting the victim's identities, his decision was unconstitutional. I state this because this is where misinterpretation of a person's intentions may lead to extreme assertions on any tragic event. 2. Emergency protocols were not followed Is one is very hard to prove because it's all based on opinion as to whether emergency protocols were followed or not. Just as the passage stated that it seemed calm from the outside, that does not mean that the situation overall was calm. One has to realize that the incident took place inside the school, not outside. The article stated that they did not see any body bags on scene. This could be attributed to many factors. It could be that the victims weren't pronounced dead until they were fully diagnosed by a physician who deemed that no lifesaving support can save the patient or that the protocol for Mass Casualty Incident (MCI) is to triage all the patients on scene and transport them to the hospital based on severity. What I'm saying is that just because someone didn't see any evidence of murder at the brief time the person was there does not mean that it didnt happen. 3-10 I just read the comments section and I want to point out @Rayze provided a link that debunks all 10 reasons listed on VT. If you dont mind Rayze, I'm going to direct the readers to the link you provided for myths 3-10 listed on VT. For one reason, I cannot prove or disapprove the Facebook or Twitter accusations based on the fact that: 1) I dont have either social media. 2) I dont have the power to delve into either large medias to find the exact date those statues were supposedly written. ( This forum debunks the 10 assertions stated in VT and more. Conclusion Based on the facts provided by both me and Rayze (thanks btw) I have demonstrated that there are no supporting evidence to Pro's assertions. Not only did I disprove Pro's assertions, my rebuttal provided supporting facts from credible sources. Pro decided to state her assertions based on speculation. Additionally, disproving the VT article that is the base of Pro's assertions leads one to conclude that her reasonings are unsound and that I win this debate due to credibility. I am so sure that you have no more credible assertions that I will not partake in the last round.\n\nEvidence Con: I guess I lied. I will answer your rebuttal 1) Wayne Carver- youre making me reason why he didnt let the families see their children? How am I suppose to know why? There are many factors and laws that I do not know that could have influenced his reasoning. Even if this thing was an elaborate lie then why not just make the situation easier and say that the families were able to see their children? I mean if they can pull Hook off with ease then why not lie just a little more and say that the families were able to see their children? Just because an incident happen to fall a certain way doesnt mean it's true. It's like saying that my car didn't start up today because God decided that I should not drive today, but is it really God or a dead battery? 2) I was able to disprove your statements supporting your VT article stance. You also conceded to my argument that some of the VT statements were inaccurate in this paragraph. Throughout this whole debate, I was finding flaws in your arguments and you did nothing to defend your assertions. Instead, you cherry picked new information and used rhetoric to allude me on \"new\" information all the while dropping my rebuttal i.e. statements 4,6-10 on VT article. This is proof that you lack the necessary information to prove that the incident was a hoax. 3) You state that, \"there is also no survelence footage of Adam entering the school.\" Here you go :) 4) Superbowl look-alikes please see first statement. As for the BOSTON MARATHON, you have no right to speculate. I RAN the marathon that year, where were you? I guess you're probably thinking that I was part of the conspiracy, well you're clearly right because youre Dilara, the goddess that is right about whatever the fck she wants and I am just a regular human who partook in the fake event. Normally, I would thank the debater for this \"intriguing\" debate, but instead, I'm gonna give you a big \"FCK YOU\" for that last statement. It is really hurtful to criticize on such a sensitive issue especially when one partook in it.\n","DiscussionID":"00000090","Title":"The sandy hook \"shooting\" is full of satanic symbols.","CrawlDate":"2016/09/29 05:44:10","URL":"http://www.debate.org/debates/The-sandy-hook-shooting-is-full-of-satanic-symbols./1/votes/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":191,"nextID":"00000002","PremiseStartPos":[243],"prevID":"00000000","Premise":["The sandy hook hoax was done in Newtown CT-the satanist center of eastern America. Google search satanism in Connecticut and click in the page called \"the church of satan and how do I get involve\"by www.satanservice.org/theory/cosmc/text and there is an article by the church of satan saying that sanfrincisco and newtown are the satanist centers of America. Sanfrincisco is a big city in a state with 38million people and you know how California has lots of weird stuff going on all the time but this small little town in Connecticut? I thought it was all suppose to be well off white Anglo saxan prodestants and Jews not satanists!. What's this business with the Parker family? Why is little Emile making a satanic sign with her hands in the picture and why is her little sister always sucking on her fingers in a way that her hand is making the devil horn satanic sign? What's up with the vicky soto picture where that guy behind her is making the satanic sign? While your reading this why is it the sandy hook support fund as set up on December 11- 3 says before the shooting and why was the R.I.P vicky work page set up in December 10? And why were all those tweets about sandy hook sent out on December 12? And why did the Newtown bee interview the dead principle on December 13-a day before the shooting and she's suppose to be dead! It said she saw a masked man come into the school-I thought she was suppose to be dead how do they mess up like that? Why did the dead kids sing in the sandy hook choir at the Super Bowl? This isn't right folks. If your aware of all this information but choose to believe the official story then wow....your probably denying it."],"PremiseEndPos":[1913],"ArgumentID":"00000001","Conclusion":"The sandy hook \"shooting\" is full of satanic symbols.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":191,"nextID":"00000003","PremiseStartPos":[1928],"prevID":"00000001","Premise":["Sorry for a the typos I'm dyslexic and I was emotional when I was writing this. Look up newtown bee interviews dead principle or newtown bee interview dawn hochsprung on google and you will see how the newtown bee apologized for it and you'll see it on images how she described a masked man come into the school. Second look up R.I.P Victoria soto Facebook hoax on images and you'll see it was set up on the 10th. Watch qkultras sandy hook surprise on YouTube and you'll see how the dead kids sang at the Super Bowl and then watch sandyhook Super Bowls video of the choir at the Super Bowl (it's the official video and it's wasnt put up by truthers) read veterenstodays article on why sandy hook was an elaborate hoax and you'll see what I mean. You guys just deny these facts. You only want to talk about the actors and closed casket funerals and Adams motive when you debunk this but you don't tell us why there were tweets sent out 2 days before the shooting happened. You can't deny that the satanic sign comes up several times. Newtown is a stanic town. Not all of the people who live there are satanists but there is a large number of them. I don't see why some people like you believe the official story. There is evidence that sandy hook was a hoax. Try to tell me why the tweets were sent out before the event or why the Facebook page was set up before the event . Dot say it was an error because first twitter an Facebook don't mess up this bad and second they can't all be errors. You know it was a hoax and your denying it."],"PremiseEndPos":[3464],"ArgumentID":"00000002","Conclusion":"The sandy hook \"shooting\" is full of satanic symbols.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":191,"nextID":"00000004","PremiseStartPos":[3479],"prevID":"00000002","Premise":["1 According to Wayne Carver the pathologist who did the autopsys they did not allow the family's to see their childeren's body's but took pictures instead-wouldn't parents want to see their kids and why wasn't there any outrage? 2 Durring an MCI (mass casualty incident) like a shooting or bus crash ect there are certain protocols that are followed (START start triage and rapid treatment). This did not happen at sandy hook. Teachers describe seeing blood on the floors in interviews-is that not enough to get people in that school to help injured baby's?. A buddy of mine is a paramedic as well as an uncle and my other uncle is a cop and they tell me that almost everyone that is somehow injured or ill is taken to a hospital and revived unless they are very obviously dead (like decapitation) there was a kid who fell off a bridge and was not breathing and they still took him to the hospital. There are old people who haven't taken a breath in 15 minutes who are taken to the hospital. If there are 20 childeren dead or dying there would be someone in that school getting them out of there and taken to a hospital. There is also no survelence footage of Adam entering the school. Back to Wayne carver. If you watch him in press conference he is very confused and doesn't know anything about what happened. You even admit that the twitter and Facebook stuff is weird. You can say it was an error but really...all the sandy hook stuff had errors? The Super Bowl. The girls who are said to be Grace McDonnell and Emilie Parker could just be look alikes. Avielle richman, Ben Wheeler and Joey Gay were deffidentally at the Super Bowl. Also Jack Mcdonell and Walker Previdi were deffidentally there to. You can say that these were all mistakes but how many mistakes have to be made before you question this? I'm assuming you believe the official Boston bombing story as well. Stop denying evidence and wake up."],"PremiseEndPos":[5391],"ArgumentID":"00000003","Conclusion":"The sandy hook \"shooting\" is full of satanic symbols.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":191,"nextID":"00000005","PremiseStartPos":[5406],"prevID":"00000003","Premise":["1) For credibility, you should learn how to spell, especially if it's on a subject you're debating about. 2) Google is such a great search engine that it will give you everything with the keywords you enter. Whether the facts are legitimate or not, google does not discriminate on the findings that it gives. For example, I googled, \"who will win this debate on sandy hook, socratits or dilara?\" Results came back with 1 result, stating that \"socratits will win by a landslide.\" The fact that I was able to google this clearly means that I will win and you should forfeit the next subsequent rounds. To save us the trouble. But on a more related note,this isn't a debate. It's a rant about random things not pertaining to the subject at hand. Even if it was, your arguments holds no weight when there are actual PHYSICAL PROOF OF THE AFTERMATH. The argument you're trying to make is un-defendable (is that even a word)? on any accounts. You seriously will have a easier time convincing the audience that humans are really aliens from another galaxy. Anyways, thank you for letting me do this debate with you. Good luck with your rebuttal, you'll need it. :)"],"PremiseEndPos":[6564],"ArgumentID":"00000004","Conclusion":"The sandy hook \"shooting\" is full of satanic symbols.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":191,"nextID":"00000006","PremiseStartPos":[6579],"prevID":"00000004","Premise":["Thank you for your response. It seems to me that your arguments stems from one source, which is the article on Veteran Today (VT) ( To summarize, that article listed 10 reasons as to why Sandy Hook was a hoax. For my rebuttal, I will demonstrate that all 10 reasons listed on VT has no evidence backing up their claims. It should be noted that by disapproving even ONE of the instances listed on VT should qualify me to win this debate for it suggests that the information provided by VT is not credible. Additionally, it would also prove my point in R1 that Google will list results based on keywords and that it does not bias between fact or fiction. 1. Proof of death have been suppressed The first assertion stated that there were no death certificates. Specifically, it was stated that the state, CT, did it's best to protect the identity of the victims. \"Remarkably, the state has done its best to avoid releasing the death certificates and even recordings of the 911 calls. Death certificates were eventually \"released\" but not to the public or those who might want to investigate the case further, where only a short, general summary was available.\" [sic] Originally, the state did in fact tried to prevent the release of the death certificate of all the victims to protect their identify. However, it was later shown that the certificates were released to the PUBLIC according to the Freedom of Information Act. ( It should be noted that while the state attorney Stephan Sedensky had good intentions protecting the victim's identities, his decision was unconstitutional. I state this because this is where misinterpretation of a person's intentions may lead to extreme assertions on any tragic event. 2. Emergency protocols were not followed Is one is very hard to prove because it's all based on opinion as to whether emergency protocols were followed or not. Just as the passage stated that it seemed calm from the outside, that does not mean that the situation overall was calm. One has to realize that the incident took place inside the school, not outside. The article stated that they did not see any body bags on scene. This could be attributed to many factors. It could be that the victims weren't pronounced dead until they were fully diagnosed by a physician who deemed that no lifesaving support can save the patient or that the protocol for Mass Casualty Incident (MCI) is to triage all the patients on scene and transport them to the hospital based on severity. What I'm saying is that just because someone didn't see any evidence of murder at the brief time the person was there does not mean that it didnt happen. 3-10 I just read the comments section and I want to point out @Rayze provided a link that debunks all 10 reasons listed on VT. If you dont mind Rayze, I'm going to direct the readers to the link you provided for myths 3-10 listed on VT. For one reason, I cannot prove or disapprove the Facebook or Twitter accusations based on the fact that: 1) I dont have either social media. 2) I dont have the power to delve into either large medias to find the exact date those statues were supposedly written. ( This forum debunks the 10 assertions stated in VT and more. Conclusion Based on the facts provided by both me and Rayze (thanks btw) I have demonstrated that there are no supporting evidence to Pro's assertions. Not only did I disprove Pro's assertions, my rebuttal provided supporting facts from credible sources. Pro decided to state her assertions based on speculation. Additionally, disproving the VT article that is the base of Pro's assertions leads one to conclude that her reasonings are unsound and that I win this debate due to credibility. I am so sure that you have no more credible assertions that I will not partake in the last round."],"PremiseEndPos":[10367],"ArgumentID":"00000005","Conclusion":"The sandy hook \"shooting\" is full of satanic symbols.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":191,"nextID":"00000000","PremiseStartPos":[10382],"prevID":"00000005","Premise":["I guess I lied. I will answer your rebuttal 1) Wayne Carver- youre making me reason why he didnt let the families see their children? How am I suppose to know why? There are many factors and laws that I do not know that could have influenced his reasoning. Even if this thing was an elaborate lie then why not just make the situation easier and say that the families were able to see their children? I mean if they can pull Hook off with ease then why not lie just a little more and say that the families were able to see their children? Just because an incident happen to fall a certain way doesnt mean it's true. It's like saying that my car didn't start up today because God decided that I should not drive today, but is it really God or a dead battery? 2) I was able to disprove your statements supporting your VT article stance. You also conceded to my argument that some of the VT statements were inaccurate in this paragraph. Throughout this whole debate, I was finding flaws in your arguments and you did nothing to defend your assertions. Instead, you cherry picked new information and used rhetoric to allude me on \"new\" information all the while dropping my rebuttal i.e. statements 4,6-10 on VT article. This is proof that you lack the necessary information to prove that the incident was a hoax. 3) You state that, \"there is also no survelence footage of Adam entering the school.\" Here you go :) 4) Superbowl look-alikes please see first statement. As for the BOSTON MARATHON, you have no right to speculate. I RAN the marathon that year, where were you? I guess you're probably thinking that I was part of the conspiracy, well you're clearly right because youre Dilara, the goddess that is right about whatever the fck she wants and I am just a regular human who partook in the fake event. Normally, I would thank the debater for this \"intriguing\" debate, but instead, I'm gonna give you a big \"FCK YOU\" for that last statement. It is really hurtful to criticize on such a sensitive issue especially when one partook in it."],"PremiseEndPos":[12421],"ArgumentID":"00000006","Conclusion":"The sandy hook \"shooting\" is full of satanic symbols.","PremiseStance":["Con"]}}]}