{"MetaData":{"Context":"URL: http://www.debate.org/debates/my-opinion/1/\nCrawl date: 2016/09/29 05:27:09\nDebate Issue: my opinion | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: Happiness as we all know is about bonds. It is about the feeling of being wanted; the sense of knowing that you are valued. Money cannot but happiness nor satisfaction, and money can never overvalue the moments of togetherness between couples. Yes in this materialistic world money counts for survival but i think money brings greediness, materialism, and ultimately no time to spend with partners because comes at the cost of time. Those times that one can spend with one's partner is an opportunity cost over money. In addition to this, materialistic life never gets satisfied. suppose a person has latest iphone and he is happy to have it because he feels superior and satisfied but technology changes every now and then. After few years new version of iphone will come in market leading to no satisfaction from the phone he possess at the time. Because of having a materialistic life, he has to work extra hour to earn money to have the latest phone. If one says,people with money do not necessarily need to work; rather they can invest in business to generate profit leading the couples to have quality time. I will say, if the couple does not go through some difficulties together their relationship cannot reap full satisfaction. As i earlier said, a better and happy life is created by sharing and caring for each other. If the couples are rich, they will not get chance to create special respect and love for each other. Emotions, relationship and absolute happiness can never be gained by money. Money is the creation of humans where as emotion is natural and a part of us. therefore, I say that the couple with less money is happier and satisfied.\n\nEvidence Pro: pemba forfeited this round. Con Don't make a debate if you don't want a debate. I win by default.\n\nEvidence Pro: pemba forfeited this round. Con Well okay then.\n\nEvidence Con: Hello, Pro, I accept your debate, may this be a thought provoking debate to ourselves and the voters. You say that all happiness is about bonds, and that happiness cannot be obtained via money, when this is simply not true; in fact, 50% of your happiness comes directly from your hard-coded genetics, of which you cannot change, and 10% of happiness is from your circumstances in life, A.K.A. money. Now, your genetics cannot be changed, but you financial status can, if you work hard enough you will usually end up with more money in your life. It's obvious, that a poor man will be much less happy than the middle-class family, but nothing much changes going up from there. As with the other 40%, that is from your actions in life, it can come from bonds, but it is not always that, as a person who loves art could get his whole lives worth from his love of making artwork, as well as with other hobbies, but bonds with a person can grow or die, and can make you happy, as well as make you sad. Sources: Sonja Lyubomirsky \"The How of Happiness\"\n\nEvidence Con: Don't make a debate if you don't want a debate. I win by default.\n\nEvidence Con: Well okay then.\n","DiscussionID":"00000053","Title":"my opinion","CrawlDate":"2016/09/29 05:27:09","URL":"http://www.debate.org/debates/my-opinion/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":95,"ConclusionEndPos":105,"nextID":"00000002","PremiseStartPos":[157],"prevID":"00000000","Premise":["Happiness as we all know is about bonds. It is about the feeling of being wanted; the sense of knowing that you are valued. Money cannot but happiness nor satisfaction, and money can never overvalue the moments of togetherness between couples. Yes in this materialistic world money counts for survival but i think money brings greediness, materialism, and ultimately no time to spend with partners because comes at the cost of time. Those times that one can spend with one's partner is an opportunity cost over money. In addition to this, materialistic life never gets satisfied. suppose a person has latest iphone and he is happy to have it because he feels superior and satisfied but technology changes every now and then. After few years new version of iphone will come in market leading to no satisfaction from the phone he possess at the time. Because of having a materialistic life, he has to work extra hour to earn money to have the latest phone. If one says,people with money do not necessarily need to work; rather they can invest in business to generate profit leading the couples to have quality time. I will say, if the couple does not go through some difficulties together their relationship cannot reap full satisfaction. As i earlier said, a better and happy life is created by sharing and caring for each other. If the couples are rich, they will not get chance to create special respect and love for each other. Emotions, relationship and absolute happiness can never be gained by money. Money is the creation of humans where as emotion is natural and a part of us. therefore, I say that the couple with less money is happier and satisfied."],"PremiseEndPos":[1816],"ArgumentID":"00000001","Conclusion":"my opinion","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":95,"ConclusionEndPos":105,"nextID":"00000003","PremiseStartPos":[1831],"prevID":"00000001","Premise":["pemba forfeited this round. Con Don't make a debate if you don't want a debate. I win by default."],"PremiseEndPos":[1929],"ArgumentID":"00000002","Conclusion":"my opinion","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":95,"ConclusionEndPos":105,"nextID":"00000004","PremiseStartPos":[1944],"prevID":"00000002","Premise":["pemba forfeited this round. Con Well okay then."],"PremiseEndPos":[1992],"ArgumentID":"00000003","Conclusion":"my opinion","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":95,"ConclusionEndPos":105,"nextID":"00000005","PremiseStartPos":[2007],"prevID":"00000003","Premise":["Hello, Pro, I accept your debate, may this be a thought provoking debate to ourselves and the voters. You say that all happiness is about bonds, and that happiness cannot be obtained via money, when this is simply not true; in fact, 50% of your happiness comes directly from your hard-coded genetics, of which you cannot change, and 10% of happiness is from your circumstances in life, A.K.A. money. Now, your genetics cannot be changed, but you financial status can, if you work hard enough you will usually end up with more money in your life. It's obvious, that a poor man will be much less happy than the middle-class family, but nothing much changes going up from there. As with the other 40%, that is from your actions in life, it can come from bonds, but it is not always that, as a person who loves art could get his whole lives worth from his love of making artwork, as well as with other hobbies, but bonds with a person can grow or die, and can make you happy, as well as make you sad. Sources: Sonja Lyubomirsky \"The How of Happiness\""],"PremiseEndPos":[3054],"ArgumentID":"00000004","Conclusion":"my opinion","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":95,"ConclusionEndPos":105,"nextID":"00000006","PremiseStartPos":[3069],"prevID":"00000004","Premise":["Don't make a debate if you don't want a debate. I win by default."],"PremiseEndPos":[3135],"ArgumentID":"00000005","Conclusion":"my opinion","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":95,"ConclusionEndPos":105,"nextID":"00000000","PremiseStartPos":[3150],"prevID":"00000005","Premise":["Well okay then."],"PremiseEndPos":[3166],"ArgumentID":"00000006","Conclusion":"my opinion","PremiseStance":["Con"]}}]}