{"MetaData":{"Context":"URL: http://debatewise.org/debates/2672-dollarization/\nCrawl date: 2016/10/03 20:49:59\nTitle: Dollarization - DebateWise\nNumber of arguments: 6\n\n\nClaim For: Full dollarization is the only exchange rate system that can protect countries from currency crises....\n\nEvidence Pro: Full dollarization is the only exchange rate system that can protect countries from currency crises. The Argentine and East Asian crises showed that partially fixed exchange rates expose countries to the risk of sharp falls in the exchange rate when speculators attack. Under dollarization there is no exchange rate to be attacked, so speculators have no role.\n\nEvidence Con: Currency crises can be better avoided under floating exchange rates. If the government does not try to fix the exchange rate, then the rate will constantly adjust, with gradual falls instead of sharp crises.\n\n\nClaim For: Dollarization reduces the risk of inflation. Governments, especially in developing countries, are v...\n\nEvidence Pro: Dollarization reduces the risk of inflation. Governments, especially in developing countries, are very bad at controlling inflation. They always want to increase short term growth at the expense of long term stability. Governments should tie their own hands through dollarization to make their anti-inflation rhetoric credible. The fear of high inflation is a major factor inhibiting investment in developing countries.\n\nEvidence Con: Other methods are available to limit inflationary tendencies. Independent central banks are widely used in the developed world, and can work for developing countries if effort is put in to designing the institutions correctly. It is ridiculous to suggest governments should restrict their own ability to help their economies, just because some governments have sometimes misused this power.\n\n\nClaim For: Monetary policy is not actually very useful. Countries are just as likely to abuse it and cause hig...\n\nEvidence Pro: Monetary policy is not actually very useful. Countries are just as likely to abuse it and cause high inflation as they are likely to use it correctly. Developing countries never truly have independent monetary policy anyway, their economies are heavily affected by the United States’ policies even without dollarization, since changes in the US interest rate change demand for their exports.\n\nEvidence Con: By losing the ability to set interest rates, governments lose the ability to help their country in a recession. When times are bad, they are unable to devalue their currency in order to increase demand and encourage recovery. Monetary policy is a key tool for managing your economy, and giving it up exposes countries to economic slumps that cannot be corrected. Unlike in a currency union the US sets monetary policy for its currency with complete disregard for the interests of dollarized countries.\n\n\nClaim For: It is likely that the US will eventually share the benefits of seigniorage. An International Monetar...\n\nEvidence Pro: It is likely that the US will eventually share the benefits of seigniorage. An International Monetary Stability Act proposing this has been debated in the US and although not passed, is still an issue of strong debate. Some future compromise is likely. In any case, the benefits of seignorage are small compared to the benefits of dollarization.\n\nEvidence Con: Dollarized countries lose 'Seigniorage benefits'. Issuing money means gains to the central bank, because you can buy goods with a new note but it does not cost much to produce it. These gains form part of government revenue. They can be significant: 9% of the Brazilian government budget comes from seigniorage. These gains are transferred to the US under dollarization.\n\n\nClaim For: Stabilising the exchange rate against the dollar means that the risks of trading between the countri...\n\nEvidence Pro: Stabilising the exchange rate against the dollar means that the risks of trading between the countries are reduced, and trade with the US will increase. This, in turn, promotes economic growth.\n\nEvidence Con: Further economic integration with the United States may not be a good thing. Countries will become dependent on the good-will of US trade policies. This is not worth the sacrifices. They will also be vulnerable to being outcompeted in export markerts by countries who have retained their own currency, which may well devalue over time relative to the dollar, making their exports relatively cheaper.\n\n\nClaim For: Countries currently operating some sort of fixed exchange rate (as many developing countries do) can...\n\nEvidence Pro: Countries currently operating some sort of fixed exchange rate (as many developing countries do) cannot operate as lenders of last resort anyway. A lack of lender of last resort functions can in fact promote a stronger, healthier banking system, and helps prevent the kind of 'crony capitalism' that bedevilled South East Asia. Banks cannot take on risky loans, relying on the central bank to bail them out if necessary.\n\nEvidence Con: Without an independent central bank, countries have no 'lender of last resort' to rescue banks if there is a banking crisis. This means people will have less faith in the banking system, and that any banking crisis will be disastrous.\n","DiscussionID":"00000064","Title":"Dollarization","CrawlDate":"2016/10/03 20:49:59","URL":"http://debatewise.org/debates/2672-dollarization/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":93,"ConclusionEndPos":107,"nextID":"00000002","PremiseStartPos":[4474],"prevID":"00000000","Premise":["Countries currently operating some sort of fixed exchange rate (as many developing countries do) can..."],"PremiseEndPos":[4578],"ArgumentID":"00000001","Conclusion":"Dollarization","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":93,"ConclusionEndPos":107,"nextID":"00000003","PremiseStartPos":[3733],"prevID":"00000001","Premise":["Stabilising the exchange rate against the dollar means that the risks of trading between the countri..."],"PremiseEndPos":[3837],"ArgumentID":"00000002","Conclusion":"Dollarization","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":93,"ConclusionEndPos":107,"nextID":"00000004","PremiseStartPos":[2869],"prevID":"00000002","Premise":["It is likely that the US will eventually share the benefits of seigniorage. An International Monetar..."],"PremiseEndPos":[2973],"ArgumentID":"00000003","Conclusion":"Dollarization","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":93,"ConclusionEndPos":107,"nextID":"00000005","PremiseStartPos":[1829],"prevID":"00000003","Premise":["Monetary policy is not actually very useful. Countries are just as likely to abuse it and cause hig..."],"PremiseEndPos":[1932],"ArgumentID":"00000004","Conclusion":"Dollarization","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":93,"ConclusionEndPos":107,"nextID":"00000006","PremiseStartPos":[872],"prevID":"00000004","Premise":["Dollarization reduces the risk of inflation. Governments, especially in developing countries, are v..."],"PremiseEndPos":[975],"ArgumentID":"00000005","Conclusion":"Dollarization","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":93,"ConclusionEndPos":107,"nextID":"00000007","PremiseStartPos":[156],"prevID":"00000005","Premise":["Full dollarization is the only exchange rate system that can protect countries from currency crises...."],"PremiseEndPos":[260],"ArgumentID":"00000006","Conclusion":"Dollarization","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":260,"nextID":"00000008","PremiseStartPos":[651],"prevID":"00000006","Premise":["Currency crises can be better avoided under floating exchange rates. If the government does not try to fix the exchange rate, then the rate will constantly adjust, with gradual falls instead of sharp crises."],"PremiseEndPos":[859],"ArgumentID":"00000007","Conclusion":"Full dollarization is the only exchange rate system that can protect countries from currency crises....","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":260,"nextID":"00000009","PremiseStartPos":[275],"prevID":"00000007","Premise":["Full dollarization is the only exchange rate system that can protect countries from currency crises. The Argentine and East Asian crises showed that partially fixed exchange rates expose countries to the risk of sharp falls in the exchange rate when speculators attack. Under dollarization there is no exchange rate to be attacked, so speculators have no role."],"PremiseEndPos":[636],"ArgumentID":"00000008","Conclusion":"Full dollarization is the only exchange rate system that can protect countries from currency crises....","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":872,"ConclusionEndPos":975,"nextID":"00000010","PremiseStartPos":[1425],"prevID":"00000008","Premise":["Other methods are available to limit inflationary tendencies. Independent central banks are widely used in the developed world, and can work for developing countries if effort is put in to designing the institutions correctly. It is ridiculous to suggest governments should restrict their own ability to help their economies, just because some governments have sometimes misused this power."],"PremiseEndPos":[1816],"ArgumentID":"00000009","Conclusion":"Dollarization reduces the risk of inflation. Governments, especially in developing countries, are v...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":872,"ConclusionEndPos":975,"nextID":"00000011","PremiseStartPos":[990],"prevID":"00000009","Premise":["Dollarization reduces the risk of inflation. Governments, especially in developing countries, are very bad at controlling inflation. They always want to increase short term growth at the expense of long term stability. Governments should tie their own hands through dollarization to make their anti-inflation rhetoric credible. The fear of high inflation is a major factor inhibiting investment in developing countries."],"PremiseEndPos":[1410],"ArgumentID":"00000010","Conclusion":"Dollarization reduces the risk of inflation. Governments, especially in developing countries, are v...","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":1829,"ConclusionEndPos":1932,"nextID":"00000012","PremiseStartPos":[2354],"prevID":"00000010","Premise":["By losing the ability to set interest rates, governments lose the ability to help their country in a recession. When times are bad, they are unable to devalue their currency in order to increase demand and encourage recovery. Monetary policy is a key tool for managing your economy, and giving it up exposes countries to economic slumps that cannot be corrected. Unlike in a currency union the US sets monetary policy for its currency with complete disregard for the interests of dollarized countries."],"PremiseEndPos":[2856],"ArgumentID":"00000011","Conclusion":"Monetary policy is not actually very useful. Countries are just as likely to abuse it and cause hig...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":1829,"ConclusionEndPos":1932,"nextID":"00000013","PremiseStartPos":[1947],"prevID":"00000011","Premise":["Monetary policy is not actually very useful. Countries are just as likely to abuse it and cause high inflation as they are likely to use it correctly. Developing countries never truly have independent monetary policy anyway, their economies are heavily affected by the United States’ policies even without dollarization, since changes in the US interest rate change demand for their exports."],"PremiseEndPos":[2339],"ArgumentID":"00000012","Conclusion":"Monetary policy is not actually very useful. Countries are just as likely to abuse it and cause hig...","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":2869,"ConclusionEndPos":2973,"nextID":"00000014","PremiseStartPos":[3349],"prevID":"00000012","Premise":["Dollarized countries lose 'Seigniorage benefits'. Issuing money means gains to the central bank, because you can buy goods with a new note but it does not cost much to produce it. These gains form part of government revenue. They can be significant: 9% of the Brazilian government budget comes from seigniorage. These gains are transferred to the US under dollarization."],"PremiseEndPos":[3720],"ArgumentID":"00000013","Conclusion":"It is likely that the US will eventually share the benefits of seigniorage. An International Monetar...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":2869,"ConclusionEndPos":2973,"nextID":"00000015","PremiseStartPos":[2988],"prevID":"00000013","Premise":["It is likely that the US will eventually share the benefits of seigniorage. An International Monetary Stability Act proposing this has been debated in the US and although not passed, is still an issue of strong debate. Some future compromise is likely. In any case, the benefits of seignorage are small compared to the benefits of dollarization."],"PremiseEndPos":[3334],"ArgumentID":"00000014","Conclusion":"It is likely that the US will eventually share the benefits of seigniorage. An International Monetar...","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":3733,"ConclusionEndPos":3837,"nextID":"00000016","PremiseStartPos":[4061],"prevID":"00000014","Premise":["Further economic integration with the United States may not be a good thing. Countries will become dependent on the good-will of US trade policies. This is not worth the sacrifices. They will also be vulnerable to being outcompeted in export markerts by countries who have retained their own currency, which may well devalue over time relative to the dollar, making their exports relatively cheaper."],"PremiseEndPos":[4461],"ArgumentID":"00000015","Conclusion":"Stabilising the exchange rate against the dollar means that the risks of trading between the countri...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":3733,"ConclusionEndPos":3837,"nextID":"00000017","PremiseStartPos":[3852],"prevID":"00000015","Premise":["Stabilising the exchange rate against the dollar means that the risks of trading between the countries are reduced, and trade with the US will increase. This, in turn, promotes economic growth."],"PremiseEndPos":[4046],"ArgumentID":"00000016","Conclusion":"Stabilising the exchange rate against the dollar means that the risks of trading between the countri...","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":4474,"ConclusionEndPos":4578,"nextID":"00000018","PremiseStartPos":[5029],"prevID":"00000016","Premise":["Without an independent central bank, countries have no 'lender of last resort' to rescue banks if there is a banking crisis. This means people will have less faith in the banking system, and that any banking crisis will be disastrous."],"PremiseEndPos":[5264],"ArgumentID":"00000017","Conclusion":"Countries currently operating some sort of fixed exchange rate (as many developing countries do) can...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":4474,"ConclusionEndPos":4578,"nextID":"00000000","PremiseStartPos":[4593],"prevID":"00000017","Premise":["Countries currently operating some sort of fixed exchange rate (as many developing countries do) cannot operate as lenders of last resort anyway. A lack of lender of last resort functions can in fact promote a stronger, healthier banking system, and helps prevent the kind of 'crony capitalism' that bedevilled South East Asia. Banks cannot take on risky loans, relying on the central bank to bail them out if necessary."],"PremiseEndPos":[5014],"ArgumentID":"00000018","Conclusion":"Countries currently operating some sort of fixed exchange rate (as many developing countries do) can...","PremiseStance":["Pro"]}}]}