{"MetaData":{"Context":"URL: http://www.debate.org/debates/Global-Warming-is-Man-Made/3/\nCrawl date: 2016/09/29 03:21:19\nOnline Debate: Global Warming is Man-Made | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: ==Clarification== I will be arguing that mankind IS the cause of global warming, my opponent will be arguing that mankind is NOT the main driver of modern climate change. My opponent, therefore, is arguing that the theory of anthropogenic climate change is incorrect. This is pretty straightforward. Abbreviations which might be used: AGW -- Anthropogenic global warming CR -- cosmic ray[s] TSI -- Total solar irradiation MWP -- Medieval Warm Period SSN -- Sun spot number PDO -- Pacific Decadal Oscillation LIA -- Little ice age ==Definitions== Global warming: The average increase in temperatures since the late 19th century. Man-Made: The literal definition is fairly obvious. In terms of this debate, man-made factors to climate change would be the emission of greenhouse gasses. Or, as the IPCC would describe man-made forcing, \"changes in the concentrations of radiatively active species (e.g., CO2, aerosols)\" [1]. Definitions are pretty common knowledge. Please, no trolling. ==Rules== 1. As stated above, no trolling 2. All arguments should be visible in the debate. However, sources can be posted on an external link. 3. A forfeit is a concession. If you PM me before you forfeit with a legitimate reason, I will discard this rule and ask voters to vote a tie. 4. The structure, rules, or definitions cannot be changed after you accept the debate (no semantics). However, if you wish to change the rules, or something else, for clarity, ask in the comments. 5. BOP is split evenly! ==Structure== R1: Acceptance R2: Present case. NO REBUTTALS R3: Rebuttals R4: Rebuttals and conclusion --> I have made this debate impossible to accept. I will directly challenge the person who is willing to accept this debate. Good luck! 1.\n\nEvidence Pro: I thank Roy for accepting this debate. He is one of the best debaters on the site and is very knowledgeable on this subject. It is a pleasure to debate him. ==There exists a scientific consensus== Before I continue, I would like to note this argument in and of itself does not prove that global warming is caused by man. Actual evidence should be the driving force behind this debate. The reason I chose to put this in my argument is simple: the science is not clear because of consensus, but a consensus exists because the evidence is clear. This evidence will be discussed later. A study published in Science reviewed the ISI web of science in order to take a survey of relevant climate literature as to what the causes of climate change are. The study failed to find a single paper which was in opposition to the consensus position, that the main driver of climate change is anthropogenic. 75% of the papers supported the consensus position, whereas 25% had no position (they were focused on things other than forgings, like impacts or paleoclimate) [1]. The study also noted how many organizations have come out supporting the idea of anthropogenic climate change. The IPCC, the American Meteorological Society, American Geophysical Union, and the American Association for the Advancement of Science have all concluded that the evidence for AGW is overwhelming [2]. NASA furthers this argument, noting “most of the leading scientific organizations worldwide have issued public statements endorsing this position”. They also argue “[n]inety-seven percent of climate scientists agree that climate-warming trends over the past century are very likely due to human activities” [3]. A 196 page report representing 13 governmental agencies, and written by 28 authors from scientific institutions, has stated “[t]he global warming of the past 50 years is due primarily to human-induced increases in heat-trapping gases” [4]. ==Climate sensitivity== As Roy is well aware, this is the key point in all of climate science (we have discussed this before in a PM). For those who are unaware, climate sensitivity is defined as how much warming is produced by a doubling of CO2. Both skeptics and AGW supporters agree that the direct effect of doubling CO2 is one degree C, the debate is over feedbacks [5]. First, what is a feedback? Climate skeptic Roy Spencer explains it fairly simply. He describes a forcing as how much temperature change occurs. A feedback determines how large the change in temperatures will be. Feedbacks refer to how clouds and other warming/cooling mechanisms change in response to a forcing (i.e. CO2, TSI, CRs). He also explains positive and negative feedbacks. Take a car, for example. The temperature forcing would be the sun beating down on the car. Opening the window slowly would cool the car, over time, and be a negative feedback. On the other hand, if you were to close the window, the car would warm (due to an enhanced greenhouse effect), which would be a positive feedback [6]. So the question is whether or not the climate is dominated by negative or positive feedbacks. There is even the possibility of there being no feedbacks, as the positive and negatives could cancel each other out. Research by climate skeptics published in Climate Research has demonstrated that climate sensitivity, based on model means, is 1.9 degrees C. Using differing methods of empirical approaches, they conclude that climate sensitivity is 1 – 1.6 degrees C [7]. Although these estimates shy towards having no net-amplifier, the no-amplification scenario still supports a strong influence of man on climate. In fact, to put an answer numerically, about 50% of the warming would be caused by man if there was no net-feedback [8]. Assuming no amplifier, research has found that “the largest contribution to the 20th century warming comes from anthropogenic sources” [9]. They find that of the ~0.7 degree C temperature rise in the 20th century (some estimates slightly higher), about 0.4 degrees of that are due to anthropogenic forgings, or about 57% of the warming (personal calculation from these skeptical studies and personal correspondence with their authors). A significant body of research notes that climate sensitivity is likely much higher. A review of the evidence in 2008 finds that mean climate sensitivity is 3 degrees C, with a range of 2 – 4.5 degrees C. Based on multiple lines of evidence, we see *almost* every which way to measure climate sensitivity leads to approximately the same result: a doubling of CO2 will lead to 3 degrees C of temperature rise [10]. The following graphic from the study corroborates this: The gray is the range (2 – 4.5 degrees C), the line in the center is on 3 degrees C, and the circles in the lines are the ‘very likely’ ranges. Most of them rest on the 3 degree mark, with some under and some above. Therefore, we can conclude that from these lines of evidence, mean sensitivity is about 3 degrees C. Another study replicates the above conclusions. The upper limit for climate sensitivity is around 4 degrees C, and certainly below 6 degrees C. Using a Bayesian statistical approach, which is “the dominant [method] in the literature”, these findings support the notion of climate sensitivity as maximum 4 degrees C, a mean of 3 degrees C, and likely not lower than 3 degrees [11]. The following graph [12] again details the results of many different studies. The best estimates generally center around 2.5 – 3 degrees C. Some evidence published in 2012 claims sensitivity is on the low end of the spectrum, however, still note that “[h]umanity is . . . responsible for the most recent period of warming from 1976 to 2010” [13]. The fact is, climate sensitivity is high and the climate system is predominated by positive feedback mechanisms. Whether it be due to changes in clouds, increased water vapor, or long-term albedo changes. With a climate sensitivity of 1 (no positive or negative forcings), anthropogenic CO2 still causes up to 50% of the warming. With a climate sensitivity of 3 degrees C, humanity is the main driver of climate from about 1976 through present (see, e.g., [13]). ==Paleoclimate== There is significant evidence from paleoclimate records that CO2 can have an effect on changes in the climate. Climate skeptic and paleoclimatologist Bob Carter emphasizes the importance of paleoclimate data. He compares climate to a piece of string. The current instrumental data (1850 – present) is a very short period of time, according to Carter. And when the ‘string’ is lengthened, we see a lot of climactic variability. Instead of looking at the recent past, we should look at the entire temperature record in order to get an accurate picture of the climate [14]. I will provide evidenc, contrary to what Carter believes, lengthening the string supports AGW theory. Over the Cenozoic Era, which began 66 million years ago, we see clear warming and cooling cycles caused by changes in CO2 concentrations. The sun increased slightly over that time period, whereas temperatures cooled. CO2, however, fell steadily through that time period. Plate tectonics was also accounted for. With natural forcings an unlikely cause, “CO2 was the dominant climate forcing in the Cenozoic” [15]. When you lengthen the ‘string’ over the course of the entire Phanerozoic (500 million years; begins at the Cambrian) there is still evidence of CO2 driving multiple climate changes. The GEOCARB study, published in 2001, is one of the definitive proxy records for CO2 concentrations within the last 500 million years. The study notes that “over the long term there is indeed a correlation between CO2 and paleotemperature” [16]. Evidence from the Vostok ice cores (specifically 240,000 before present), proves that CO2 has had an effect on temperatures. Although the initial forcing was orbital changes in the sun, CO2 “plays . . . a key role in amplifying the initial orbital forcing” and “the CO2 increase clearly precedes the Northern Hemi sphere deglaciation”. The study also notes that these forcings “are also at work for the present-day and future climate” [17]. There is also proof that it is warmer now than it has been since the MWP. In fact, it is warmer now than any year since 1400 AD [18]. Newer reconstructions continue to support this finding, and even extends the dataset. It finds that the Roman warm period (RWP) and the MWP as much cooler than today, and claims to have replicated previous ‘hockey stick’ studies [19]. The results are depicted below. Looking into the geologic past, we see strong evidence in favor of the idea that carbon dioxide can increase temperature. It logically follows that if humans continue to emit CO2, and other greenhouse gasses, that human emissions will increase temperatures. Conclusion: It is clear as to *why* a scientific consensus exists. There is overwhelming evidence that 1) climate sensitivity is likely high, 2) even if it wasn’t, anthropogenic forces still account for 50% or more of the warming (from CO2 alone, not counting methane and other greenhouse gases), and 3) that when you ‘lengthen’ the piece of string, there is still ample evidence ample evidence supporting the fact that CO2 can drive temperatures. The consensus itself does not prove AGW—but the evidence proves the consensus. CO2 is the main driver of recent temperature changes. Sources:\n\nEvidence Pro: == Rebuttals == R1) Solar cycle as a driver of climate It is good that Roy discards the idea that TSI can explain the modern temperature increase. Even skeptical climatologists are beginning to accept this, they note TSI can explain “virtually none” of the warming past 1950 [1]. Roy begins by citing a 1991 study by Friis-Christensen et al (his graph). The study purported to claim the solar cycle length correlated with temperatures. It must be noted Christensen’s temperature data ended in 1985, which ignores a huge portion of the warming which occurred in the 1990s. Christensen’s study was criticized for mathematical errors. A new paper has come out and corrected the errors from the original paper. The result was solar cycle length did not correlate well with temperature. Solar cycle length did correlate with temperatures until 1985—when the dataset for Friss-Christensen et al. ended—but after 1985, the correlation broke apart. Solar cycle length fell as temperatures began to dramatically increase. The correlation Roy uses in his graph has since been falsified [2]. The following graph shows the updated correlation: The mathematical errors are shown by this graph [3]: As can be seen, Roy’s source is flawed and newer measurements prove that solar cycle lengths cannot explain the modern warming. Roy then cites a paper purportedly claiming 72% of the earth’s increase in temperature is due to the solar cycle. Roy cites a skeptical blog, and the blog exaggerated the findings. 72% of the temperature change in the North Atlantic can be explained by solar fluctuations, according to the study—not global temperatures. If you go to the actual source it says “[w]e find for the Norwegian local stations investigated that 25–56% of the temperature increase the last 150 years may be attributed to the Sun” [emphasis added] [4]. You can see the study is looking into local stations, not global phenomena! Roy’s 72% number is an exaggeration and is in relation to one region, not the entire globe. Evidence shows global temperatures do NOT correlate with solar cycle lengths, and much of the evidence Roy uses relies upon local Norwegian data. Not global data. Therefore, Roy fails to prove that the sun correlates well with global temperature. R2) Cosmic rays and climate For cosmic rays to explain climate change, all of the following must be true: 1) the solar magnetic field must have a long-term negative trend, 2) the cosmic ray flux must have a long-term negative trend, 3) cosmic rays must create low level clouds, 4) low level clouds must have a long term negative trend [5]. The solar magnetic field actually has not changed much over the last 30 years. The correlation between temperature and cosmic rays is fairly weak. Even assuming that the correlation exists, it is about equal to the anti-correlation of TSI (which has been falling, and leading to cooling). Cosmic rays have had little overall impact on temperatures over the last few decades [6]. Have cosmic rays had a long-term negative trend? No. Cosmic rays have had no discernable trend from 1951 to 2006, and have stayed relatively stable [5]. Further, the GCR (galactic cosmic ray) flux only correlated with temperature between 1970 and 1985, and even then it lagged temperature. The correlation totally breaks down in the 1990s. The changes in the GCR flux cannot be the cause of more than 15% of the observed temperature increase [7]. In fact, some research has found the GCR flux is increasing. SkepticalScience, quoting Erlykin et al. 2013, notes “[r]ecent measurements of the cosmic ray intensity show that a former decrease with time has been reversed. Thus, even if cosmic rays enhanced cloud production, there would be a small global cooling, not warming” (emphasis original) [5]. If GCR’s have been causing a net-cooling, they cannot explain the warming trend. Do GCR’s cause low-level cloud cover? No. The correlation between GCR’s and cloud cover begins to disintegrate in 1989. By 1994, the correlation completely breaks apart, and there is no way that we can see changes in the GCR flux affecting low-level clouds, as can be seen in the graph [8]. Cosmic rays are red, versus low cloud cover (blue). We see little correlation between the two. Do low-level clouds have a negative effect on temperature? There is conflicting evidence here [5]. Regardless, GCR’s don’t seem to change cloud cover or correlate well with temperature. R3) The ‘pause’ Roy claims surface temperature has shown no trend recently. He is using RSS data. UAH data finds an increase of temperature over the same period [9]. Over such a short time period, it is impossible to get statistically significant results. So in order to reduce data uncertainty, I will change the data to 1970 – present. With this, we will always see a warming trend. However, if this ‘pause’ is significant, we should see a large change in trends. Using HADCRUT4 data, from 1970 – 1996 (‘pause’ began in 1996) we get .153 C/decade with a margin of error of 0.067. Then to see if the ‘pause’ significantly reduces this trend, I now extend the data from 1970 – 2014. What do I get? 0.165 degrees C per decade with a margin of error 0.030 [9]. We see no decrease in the overall trend, which would occur if the ‘pause’ were significant. And this method reduces data-uncertainty. So we see there is no statistically significant slowdown of the warming trend in HADCRUT4 data. The long-term trend of increasing temperatures is due to CO2. Short-term variability happens all the time; it does not mean that the long-term increase is going to stabilize forever. La Nina events have decreased surface warming. La Nina is an oscillation, it is not a long-term phenomena, and will revert to a positive trend eventually. Many models that account for these oscillations do reproduce the ‘pause’. When these factors are accounted for, greenhouse warming still continues to exist [10]. The assertion that models cannot account for the pause is simply incorrect. The oceans increased heat content, aerosol cooling, La Nina events, etc. all lead to cooling. The fact that any warming has happened at all (see my UAH & HADCRUT4 analysis) is supportive of idea that CO2 is a strong climate driver. R4) Paleoclimate Roy begins by claiming CO2 lags temperature. Although he cites no source (or at least, not in that paragraph) I know where he got the claim. I cited the exact paper with that claim last round! It claimed there was an 800 year lag between past climate changes and CO2 concentrations. What skeptics don't tell us—and what the paper actually said—is CO2 still acted as an amplifier to other climate changes (a positive feedback for the orbital forcing of the interglacial cycle). CO2 preceded northern hemispheric deglaciation. If you actually read the papers, which claim there to be a lag, they almost all note how CO2 acts as an amplifier and how the results do not contradict AGW. There is new research (Shakun et al.), which argued that CO2 preceded the end of the last ice age, and may have (in part) led to the warm interglacial in which we live today [11]. The following graph from the study demonstrates how CO2 may have been an important factor in the most recent deglaciation: Blue = temperature, Red (and yellow) = CO2 concentrations. The recent Shakun study demonstrates how CO2 may have, in part, ended the last ice age. Roy goes on to claim there is no correlation between CO2 and past temperatures. I followed his sources. The first one was temperature data and made no comments on correlation. Berner 2001 is the other source. I cited this exact study last round. I pulled a direct quote out of the study. I will reiterate it here, “over the long term there is indeed a correlation between CO2 and paleotemperature” [R2]. Using Roy’s sources, we see that CO2 does correlate with temperatures. Roy’s graph is also a oversimplification. It fails to mention that there ARE other forcings in climate. The other major forcing, the sun, does not correlate well with phanerzoic temperatures either. When the two are put together, there is a strong correlation [12]. The sun alone cannot account for temperatures, and CO2 alone cannot account for the temperatures. When put together, they do. This indicates that CO2 is a very important factor in determining climate. The following graph from the paper depicts the correlation when CO2 and the sun are put together: R5) Consensus I agree with Roy that consensus does not tell us whether or not science is correct. The consensus is not what makes the science clear. But there is a consensus because the science is clear. And Roy claims his data supports solar theory. However, I have adequately dismantled that argument using peer-reviewed research and Roy’s own sources. Roy attempts to claim I have the BOP. This is incorrect. A review of the rules in round one tells us, (rule 5) the BOP is split evenly. Therefore, Roy has an equally important role in disproving AGW as I do in proving it. Roy shows examples of the consensus failing. This can occur, but citing a few high profile cases back when science was less rigorous is not very compelling. Modern science requires empirical evidence for scientific claims. And as most experts believe in AGW, chances are, strong empirical evidence corroborates the theory. Roy makes a claim about catastrophic warming. This is not what we are debating, it is irrelevant. Roy claims climategate shows how scientists ‘suppress’ the science. A reading through the emails, in context, really shows no malice was intended [13]. Multiple independent panels have reviewed the emails, and concluded that no scientific malpractice was committed [14]. Conclusion The sun is not the cause of the recent warming trend. Paleoclimate continues to give credence to the idea that increased CO2 levels warm the climate. Man is the main driver of modern global warming. Sources:\n\nEvidence Pro: == Roy’s calculation == Roy’s assumption that warming is linear is simply untrue: Even though CO2 is the dominant climate driver of modern climate-change, it does not mean natural climate variability cannot occur in the system—it does occur. A few ‘pauses’ or unprecedented accelerations do occur. CO2 is logarithmic in relation to temperature. This means that every CO2 doubling has the same effect, even though each molecule warms less. For example, a doubling from 100 ppm to 200 ppm would have the same effect as a doubling from 280 to 560 ppm. Warming will only occur fairly linearly if each doubling occurs at the same rate. His calculation uses faulty assumptions. His 3 degrees C slope is from my former argument that CO2 sensitivity is around 3 degrees C. Sensitivity is for each CO2 doubling. His line begins in about 1970, and CO2 has not doubled from 1970 to now (in terms of the pre-industrial levels). In 1970 there was about 323 ppm of CO2, and in 2014 the number is around 400 [1][2]. So over that time period, CO2 increased 77 ppm. That would only be about 13.2% of a CO2 doubling. So .132 * 3 is about .4 degrees temperature rise since 1970. It has warmed about 0.5 degrees since the 1970s [3]. Therefore when Roy’s calculation is done correctly, CO2 is responsible for 80% of the temperature rise over that time period. == Climate model accuracy == Roy argues that global circulation models (GCMs) are inaccurate. This is untrue. Climate models actually have accurately reproduced temperature since 1900. GCMs cannot replicate warming without a CO2 forcing. GCM’s are only accurate when CO2 forcing is accounted for in hindcasts. This means that CO2 is a large forcing of modern climate. This can be demonstrated with the following graph [4]: Models also reproduced temperatures after the Mt. Pinatubo eruption. They correctly predicted the temporary 0.5 degrees C cooling after the eruption, meaning models can replicate temperature changes due to aerosol and sulfate forcings [4]. A paper published in Nature looked at each 15 year period since the 1950s. Their models were able to accurately produce those trends as well as many El Nino events. The study even commented on the pause. The authors note that the pause does not falsify model accuracy, as it is only “one realization where the decadal natural variability component of the model climate is generally not in phase with observations” [5]. In other words, it is the exception rather than the rule. Models accurately predict warming trends, one exception does not falsify the models. In fact, they note models still were able to predict recent trends in the Pacific—a huge portion of the world. Hansen’s 1988 model, unlike what skeptics claim, shows close correspondence with the actual temperature change. His model seemingly assumes more warming due to the fact he assumed 25% too much climate sensitivity. When the sensitivity is lowered to 3 degrees C, his scenario B correlates perfectly with observed temperatures [6]. The model offers evidence of a 3 degrees C climate sensitivity. Models can accurately hindcast warming which occurred in the last century and models can accurately predict the cooling forcings of aerosols. Further, the 1988 model predictions were correct, indicating that models can predict future temperatures. == The ‘pause’ == The argument that the ‘pause’ disproves global warming is incorrect. The fact that other forcings can *temporarily* blunt the warming effect of CO2 is not a nail in the coffin. Unless Roy denies the greenhouse effect, it is preposterous to claim that CO2 cannot influence temperatures. The fact that natural forcings have caused a short-term ‘pause’ does not disprove AGW. Some models actually have predicted the ‘pause’ [7]. The Met Office has released a report regarding the ‘pause’. They note that the earth’s heat content is still increasing, and is actually increasing faster than ever before. Surface warming has slowed due to the fact that the oceans have been accumulating more heat. This effect is temporary. Eventually, the ocean’s heat content will ‘max out’, and surface warming will resume. So CO2 is still warming the climate system [8]. As noted, this effect is temporary, and as heat continues to accumulate the oceans will warm, and surface temperatures will eventually begin to increase. CO2 forcing has not stopped—its heat is merely being distributed elsewhere. The earth’s surface has stopped warming not due to CO2 not being a greenhouse gas, but rather its heat content being distributed elsewhere. There is still doubt as to whether or not the ‘pause’ is real (as I noted last round). Tamino, a statistician, has worked out the data. Using each possible start date for the ‘pause’, he ran the p-value of statistical significance. For each start date, none of them reach the 95% statistical significance level. Therefore, no matter which data-set you use, no matter what start date you use, there is no proof of a statistically significant slowdown in global temperatures. The following chart [9] details the results: Therefore, there is little proof that a ‘pause’ is occurring at all. == Solar activity == Roy argues the sun caused the LIA and the MWP. I agree! CO2 was fairly stable in those time periods, so it could not have been the forcing. Climate reacts to whatever is forcing it to change at the time. As I convincingly argued (CON’s words), the sun cannot be the current forcing. CO2 has been increasing, and likely is the current climate forcing. I never said that the sun couldn’t affect climate. I merely stated that cosmic rays do not change the climate, and that the sun is not the driver of current climate change. As noted, solar forcing has been decreasing, meaning it cannot be the cause of modern warming. TSI has been falling, GCR’s have been increasing, and solar cycle lengths have fallen as temperature dramatically increased. The sun cannot be the forcing behind the current warming—it is impossible. I have cited many peer-reviewed studies corroborating those conclusions. == Paleoclimate == This entire argument proved that CO2 has the potential to change climate. CON claims I said CO2 does not correlate with temperature. This is a massive misinterpretation. I first cited the study which every paleoclimatologist uses in their datasets, the GEOCARB study. The study found that CO2 did correlate with temperature. I then cited Royer 2006, which noted how CO2 does correlate with temperature when 1) pH effects are corrected for, and 2) the sun is accounted for. The sun does not correlate with temperatures, but it obviously affects climate. It only correlates with temperatures when CO2 forcing is included. Therefore, we can conclude that CO2 is one of the main drivers of past climate. This proves that CO2 has the ability to warm the planet, meaning the increased emissions have had a warming effect. Research using proxy data over the last 500 million years find a climate sensitivity of 3 degrees C [9]. This supports the idea that the modern increase of CO2 concentrations are having a large effect on modern climate. Roy again claims the CO2 lag refutes AGW. I already responded to this. CO2 has lagged temperatures over the previous interglacial periods, I agree. But CO2 acts as an amplifier in those conditions. If CO2 amplifies temperature, it has a warming effect. If it has a warming effect, it can be a forcing. Therefore, CO2 has an effect on temperature, and can be the driving force behind modern climate change. The lag argument was solidly refuted last round. Roy also dropped my argument about CO2 causing the end of the last ice-age. This argument definitively proves that CO2 has a massive impact on temperatures. The fact that it is warmer now than in the MWP demonstrates that the current warming is unprecedented. I have proven that the modern warm period is warmer now than at any point during the past 2000+years. == Burden of proof == Roy claims I have not proven AGW. This is incorrect. When it comes to sensitivity, CO2 has a *direct* effect on temperature: each doubling causes about 1.1 degrees C warming. Using calculations from a skeptical physicist [10], this direct effect means that CO2 has caused over 50% of the recent warming. Sensitivity is likely much higher, about 3 degrees C. With higher sensitivity, CO2 causes more warming. This is corroborated with studies using many different methods. With the high sensitivity proven (R1), CO2 is the main factor of modern climate change. Roy dropped this argument. I proved there was a scientific consensus. This suggests the empirical evidence almost certainly corroborates AGW theory. I proved that CO2 is one of the main forcings in past climate. This is important because it dispels any doubts that CO2 has a large warming potential. In fact, paleoclimate proves 3 degrees sensitivity. Therefore, this also proves that CO2 is the main driver of modern climate change. I have proven that CO2 does change climate. The direct effect of CO2 (which no one disputes) causes over 50% of climate change, and when sensitivity is 3 degrees C, CO2 is the cause of the warming since 1970. I have upheld the BOP. Roy, on the other hand, has failed to explain *why* CO2 is either not a forcing, or that my sensitivity estimate is wrong. He drops the sensitivity argument, conceding that CO2 is the main driver of warming in the modern era. His alternative explanation, the sun, was eviscerated last round. His arguments about a ‘pause’ are also put into question, and his model argument is based upon flawed assumptions. I have, on many occasions, cited Roy’s evidence against him. Low sensitivity proves AGW, high sensitivity proves AGW, and Roy totally ignored that key point. Therefore, I have proven that AGW exists, whereas Roy fails to put a dent into the extremely well supported theory. Thanks for the debate, Roy, it was fun! Please, vote PRO!\n\nEvidence Con: I accept.\n\nEvidence Con: The sun drives of climate change The main driver of modern climate is solar activity. The energy output of the sun, called the irradiance. has been nearly constant in modern times, so that's not the cause. It is primarily the magnetic field of the sun which drives climate, and to a lesser extent the ultraviolet component of the irradiance. The magnet component varies dramatically. Norwegian scientists in the 1990's discovered that the single measure of solar activity that best predicts climate is the length of the previous solar cycle. “The most readily apparent cycle in solar activity is the cycle in sunspot activity. These solar cycles average eleven years in length, and they have ranged in length from nine years to beyond eighteen years.“ [1] The length of the solar predicts climate change as shown in the graph [2] below: The increase in CO2 is very close to exponential, so as Pro noted, AGW theory predicts a straight line temperature rise. The graph shows clearly that is not what has happened. Climate has been behaving according to solar activity. “A paper published [in 2012] in the Journal of Atmospheric and Solar-Terrestrial Physicsfinds that up to 72% of the temperature increase over the last 150 years can be explained by the length of solar cycles,” [3] The length of the solar cycle does not perfectly represent the sun effects, so it's likely that a more precise model would produce a more precise result. Cosmic rays affect cloud cover The physical theory that explains the correlation is summarized by Archibald: There are two main ways that changing solar activity affects terrestrial climate. Both have their origin in the strength of the Sun’s magnetic field. In the first route, a lower magnetic field strength results in less sunspot activity, which in turn mean less solar wind, which allows more galactic cosmic rays to get to Earth’s orbit. The neutron shower from galactic cosmic rays causes more cloud formation, which in turn reflects more sunlight back into space, making the Earth colder. … In the second route, the lower magnetic field strength results in a lower temperature of the Sun’s chromosphere, which in turn produces less ultraviolet light. That decreases the production of lower stratospheric ozone, and that decrease causes a negative North Atlantic Oscillation (a fluctuation in sea-level atmospheric pressure), making the Northern Hemisphere colder. This second route makes winters longer and colder without necessarily reducing peak summer temperatures. [4] If solar magnetic activity really changes cloud cover, the incident radiance on the earth should vary with the sun's magnetic activity. That has been observed just as the solar theory predicts. [5] Solar activity is measured historically by the formation of beryllium 10, which accumulates in sediments to provide a history of solar activity. “The Modern Warm Period from 1900 to 2008 is associated with a large decline in Be10 in ice cores, indicating a sustained higher level of solar activity in the twentieth century. There is also very close correlation between ice-rafted stone debris in the North Atlantic and Be10 levels over the last 10,000 years—another demonstration that solar activity controls climate.” [6] The correlation continues through to the present day. Solar activity predicts the 17+ year halt in global warming as the cycle has reached a flat peak and is starting downward. The pause in global warming is illustrated in this graph: [7]: The AGW computer models include irradiance, which is essentially constant, but the models take no account at all of the solar magnetic effects that correlate tightly with climate. AGW theorists now admit that the CO2 models cannot be tweaked to explain the pause. They are now proposing a variety of new theories to patch the failed old theory. [8] One theory is that for some reason all the warming is going into the deep oceans. Another theory is that atmospheric aerosols (i.e., soot) is reducing the size of rain drops causing clouds to be whiter and reflect more energy. There are other theories. The problem is that if there is any uncalculated factor that completely wipes out CO2 effects, that admits CO2 does not dominate climate. If uncalculated factors can be as large or larger than the CO2 effect, that admits that previous warming might have been the result of unknown factors as well. The premise of the AGW theory was that because all the other factors affecting climate were known, CO2 must have caused the warming from 1983 to 1996. Historically, solar activity drives climate with CO2 rising after there is warming Al Gore famously showed two graphs, one of temperature over time and one of CO2 over time. The shapes of the curves were similar, showing a high correlation. Mr. Gore never overlaid the graphs. Had he done so, it would have been apparent that CO2 levels were following the warming rather by hundreds of years rather than leading it. As the oceans warm, they can dissolve less CO2, which is then released into the atmosphere. The CO2 rise is in response to the solar magnetic effects that changed cloud cover to cause the basic climate change. Over long periods of earth's history, there is no relationship between CO2 and climate.[8] Consensus does not determine science Pro has the burden of proving that human activity has dominated climate. My burden is only to show that the anthropogenic theory is unproved. A scientific theory is wrong if it fails to explain or predict, and anthropogenic theory has clearly failed. I'm not obligated to prove an alternative theory, but I nonetheless shown that solar magnetic activity explains and predicts climate much better than CO2 theory. Since solar magnetic activity has dominated climate, anthropogenic causes cannot be dominant. AGW theorists admit that factors not in their computer models have been so large as to completely cancel greenhouse gas effects. for the past 17+ years. Pro stresses that it is not just that a consensus exists, but that the consensus is based on data. (Actually, the only real data is a general increase in temperature which solar theory better explains, and the rest is computer models that did not predict the hiatus.) But every scientific consensus has been supported by data that scientists at the time thought conclusive. A wrong consensus means that the data was incorrect or that it was incorrectly interpreted. The once near-unanimous consensus that the earth was the center of the universe was based upon the indisputable observation that the sky appears to rotate around the earth. The theory was found wrong only by more careful observations starting with the inconsistent behavior of the paths of planets in the sky. In the 1960s, the scientific consensus favored the Steady State Theory over the Big Bang Theory. The Big Bang Theory predicted the presence of microwave background radiation, so when the background radiation was discovered, the consensus changed rapidly. Not long ago, the learned scientific consensus was that homosexuality was a form of mental illness. Psychologists thought they had the data to prove it, but they were wrong; it is genetic. Modern scientists continue to make errors reflected in wrong consensus. A very strong scientific consensus has until the past few years supported the theory that in the human diet, saturated fat causes high serum cholesterol levels which in turn causes heart disease. It turns out the original theory was based upon falsified data. The landmark peer that \"proved\" the theory deliberately excluded data that falsified the theory. A couple of other bogus papers supported the theory, including one in which cholesterol was injected into vegetarian rabbits, who then quite predictably died. Studies over the past fifty years that attempted to confirm the theory instead disproved it. [9, 10] The originator of the cholesterol theory believed it, and he did a great job of selling the theory so it quickly reached consensus.. Many papers giving the “wrong” results were not allowed to be published, or the authors declined to submit them for fear of ruining their reputation. Some scientists published after they retired so that career retribution could not be inflicted. I recite the cholesterol consensus error because it's very close to the way anthropogenic global warming theory has achieved consensus. Early enthusiastic advocates sold the theory as the only possible explanation of the rapid rise of temperatures from 1983 to 1996. According to that data, not only was CO2 the cause, but climate sensitivity much have been very large, perhaps five or even ten. Now Pro's claim is that it is at least 0.7. If it is that low, then global warming is not a crisis. it's hardly worth noting. The bogus 97% consensus comes from surveying only journals that refuse to publish dissent. The Climategate scandal showed how eager AGW are to suppress dissent.\"In a November 15, 2005, email Mann expresses his satisfaction that Geophysical Research Letters is now firmly under the control of the climate change alarmists but laments that other publications still publish research by skeptics: “The Geophysical Research Letters leak may have been plugged up now with new editorial leadership there, but these guys always have Climate Research and Energy and Environment, and will go there if necessary.” [9] Very few papers scientific papers say anything about global warming as whole. For example, there are about 200 papers that show that the Medieval Warm Period and similar climate change existed worldwide, and that refute the bogus Hockey Stick argument for AGW. But the papers would not be counted as being in opposition to AGW. Besides, they are in the wrong journals. Virtually all the papers on solar theory -- there are hundreds -- are in specialist journals, not the surveyed climate journals. ------------------------------------------ Per the terms of of the debate, I'll put the reference list in the debate comments.\n\nEvidence Con: AGW Models fail, so the theory is wrong We have agreed on a couple of basic points of climate science: 1. If AGW is true then warming should occur as a straight line over time. 2. The heat output of the sun is not changing, so that isn't upsetting the straight line AGW So, if AGW has dominated climate over last century then we should see a straight line increase in temperature over the century, with just short term variations due to weather. Here is the temperature data. Pro told us in his initial argument that the minimum value for climate sensitivity under AGW is 3 degrees per century. He said it might be more, but it's at least three degrees. To test if AGW dominates climate, we can see how close the temperature data is to a straight line with a three dree slope. I took the temperature from Wikipedia [1] and added the line (in blue) predicted by AGW: Clearly AGW theory is wrong. It's possible that carbon dioxide is adding a temperature increase to climate just as AGW predicts, but that some other unaccounted factor is canceling the AGW before about 1980 and after about 2000. Our debate is about whether AGW dominates climate, so if it is try that an unknown factor completely changes climate from what AGW contributes, then it is the unknown factor that dominates, not AGW. Why did a theory so far from the data ever take hold? The problem AGW attempts to explain is the rise from about 1980 to 1996, and many atmospheric scientists could not come up with an explanation other than CO2. To explain all the pre-1980 data that did not conform, Professor Mann and his colleagues came up with the Hockey Stick curve, that purported to show that climate had not changed at all in the past 1000 years. The Hockey Stick turned out to be the product of a bad statistical method that selected proxies for temperature that were unrelated to temperature. The current Wikipedia article on the Hockey Stick shows the Medieval Warm Period and the Little Ice Age as global climate change. Both are explained by solar magnetic theory. The fatal blow to AGW theory is the lack of warming since 1996. The blue curve on the graph shows how far we are below the AGW theoretical prediction. Pro argues that the HADCru data shows some warming, but there is close to universal agreement that the models have failed. HADCru uses ground station data which focuses on urban areas that warm due to growth with surrounding population increase. The satellite data covers the whole earth with no such complications. NASA acknowledges the pause in global warming [2] the ‘pause’ in global surface temperature that began in 1997, according to some estimates, continues,” wrote David Whitehouse, who holds a doctorate in astrophysics and was the BBC’s science editor. “Statistically speaking there has been no trend in global temperatures over this period.” HADCru fully acknowledges the existence of the pause in global warming, but dutifully insists that the underlying AGW has just been overcome by other factors. Those factors must, of course, now dominate AGW. [3] Papers by von Storch [4] and Rasmussen [5], both previously vigorous defenders of AGW, show the AGW models have failed. Not only have the models failed, but there is no way to tweak them, say by changing climate sensitivity, to get them to fit the data. A book by Tisdale [6] shows graphically that the models cannot be fixed. Measures of Solar Activity Remember, I'm not obliged to explain why the AGW models have failed, only that there is no possibility that the AGW linear trend of 3 degrees per century, which Pro claimed as all but certain science, is not true so that AGW is not dominating climate. The exact nature of the sun's influence on climate is not known, and Pro argues convoincingly that the length of the solar cycle has not been born out as being as good a predictor as thought. Nonetheless the correlation to solar activity remains strong. The long Medieval Cold Period, the Medieval Warm Period, and the Little Ice Age all corrsponded to solar activity. [6] Right now we are in a period of decreasing sunspot activity [7]: That the correlation to sunspot activity is not perfect means no more than that climate is complex. To say that AGW dominates climate is unfounded, because there is all but universal agreement that the models have failed. Paleoclimate That CO2 lags warming is uncontested basic physics. As the oceans heat, CO2 comes out of solution and CO2 enters the atmosphere. If it amplifies heating trends, that is no proof that CO2 dominates climate. Whatever starts and ends the heating trend dominates climate and CO2 magnifies the swings in boith directions. Whether the present is warmer than the Medieval Warm Period or the Roman Warm Period is not the slightest proof of what caused any of the warming or cooling. What is does show is that substantial warming in past climate has happened without any CO2 effect. If we got nearly as warm as the present in the MWP. then whatever caused that was not CO2 and may be working now. The long history of climate shows very little relationship to CO2, and Pro acknoweldges that. So what factors were at work, and how do we know what is at work now? Variations in the earth's orbit are not nearly enough to explain the changes. We have some ideas, but there is nothing that's proved reliable, especially not AGW theory. Pro burden is no more than to prove that AGW dominates climate. He has not done so.\n\nEvidence Con: AGW exists, it but doesn't dominate climate Greenhouse gases cause warming, and I never claimed otherwise. Pro cited a skeptical climate scientist acknowledgment that AGW plays some role in climate. Our resolution is “Global warming is man made.” That might mean that global warming is entirely man made, in which case Pro has conceded it is not, because he has acknowledged that there are also natural causes. I didn't take that meaning. I said repeatedly that Pro must prove that climate is dominated by AGW. I must prove it does not. The proof of AGW would be a AGW math mathematical model of climate that accurately explains and predicts. Weather effects are yearly variations; climate comprises trends over several years. The AGW models fail because the models do not predict or explain climate the large trends in climate. For example, Pro acknowledges that Medieval Warm Period was due to solar activity, but the official IPCC models have no mechanism that explains the MWP. Because AGW models cannot explain the MWP, climate crisis advocates have fought consistently to make the MWP disappear as a global climate phenomena. The Hockey Stick got rid of it by a statistical error, but the data ultimately won. A change in climate acknowledged to be very close to modern warming is unexplained by the models we are supposed to accept as reliable. The pause in global warming is real Pro argued that an 17 year pause in global warming might just be “noise,” and he cited a scientific paper that allegedly shows that. That's bad science. Suppose an engineer designed a building taking into account all the other factors he knew to affect design, and the building subsequently collapsed. Consider: “The design models were correct. The building collapsed due to unknown factors categorized as noise. There is no need for further explanation.” Nonsense. Fundamental failures are not noise. An eighteen year failure of climate prediction shows that the model is defective. Since AGW is in the model, and something else canceled it, the unknown factor dominated climate over the period. I quoted both HADCru and NASA scientists as acknowledging the pause in global warming. The paper by AGW-advocate von Storch established that the current models cannot be tweaked to explain the pause. Pro found some oddball paper that made a model that shows a pause, but models can be made to do anything desired. AGW theory is not validated until after it makes accurate predictions. Making a new, unproved model means we are back to the starting point. Pro said that HADCru land data showed an increase. Year-to-year variations occur with weather, and so there is so uncertainty in the trends due to the accuracy of fitting a line through the weather-induced variations. The HADCru data shows 0.09 +/- 0.11 degree of global warming over the period of the pause, compared to the 0.4 to 1 degree predicted by the AGW models. None of the six global temperature data sets showed a statistically significant increase. [ The land data sets are the least accurate because increasing urbanization drives up the temperatures near many of the weather station locations, due to the so-called “heat island” effect. The satellite data is the most accurate because it samples the earth uniformly, and it shows no increase. HADCru scientists understand the large departure from the models, and acknowledge the pause. Pro said I acknowledged that the Sun could not be causing the pause in global warming. That's not true, but if it were true, it would not help Pro's case. If it's not the sun, then a completely unsuspected factor dominated climate and overwhelmed AGW. However, what I acknowledged was that the length of the previous solar cycle was not a good predictor. I presented the historical graph that showed the level of sunspot activity correlated well with the warmth of the MWP, the cold of the Little Ice Age, and the warming of the 20th century. Pro acknowledged the solar cause of those changes. Sunspots do not correlate to the heat output of the sun, so the effect on climate must be a different physical cause: magnetic field, cosmic rays, ultraviolet spectrum, or something else. It might be some complex combination of the effects. The graphs show that cold climate is associated with low sunspot activity and warm climate with high sunspot activity. The 20th century covered a long period of high sunspot activity, which explains the warming. Recently, sunspot activity has dropped, correlated to the pause. The number of sunspots remains a reliable longer term climate predictor. AGW predicts straight line temperature increase I presented a graph showing actual global temperatures and AGW predicting a strong straight line increase. My graph is accurate, but I should have better explained the AGW line in comparison to the actual climate data. Here is the graph, repeated from the earlier round: Temperature responds to the logarithm of greenhouse gas density, and greenhouse gas density has been increasing exponentially. The log of an exponential is a straight line. As far as I know, all climate scientists agree on this. Therefore, AGW should produce a straight line. Pro said that the models also include some natural effects like volcanoes, so the model predictions need not be a straight line increase. However, the debate resolution is that AGW dominates climate. While natural causes upset the perfect straight line behavior to some degree, they cannot dominate. While there may be some blips, like the blip of cold for a couple years from the eruption of Mt. Pinatubo, there should be no problem recognizing a straight line. The temperature data is not close to any straight line, so AGW is not dominating. We are far below what the models predict for the present year. The slope of the line of temperature increase over time depends both on climate sensitivity and the rate of carbon dioxide increase. The behavior of temperature with CO2 is logarithmic, so Pro's computation of what it should be is way off. Initially a small increase in CO2 produces a large increase in temperature, with later increases in CO2 having less and less effect. Suppose CO2 increased in units from 1 to 16, and that the increase from from 1 to 2 brought one degree of warming. That means that there would be four degrees of warming at 16, CO2 having doubled four times. Linear interpolation, which is what Pro did, between 1 and 16 says that there should be (1/15) of the 4 degrees, 0.27 degree, at 2 units. In fact, there was 1 degree of increase at the 2 unit point, four times as much as linear interpolation erroneously yields. The temperature rise is not line between 1 and 2 or between 2 and 4, or anywhere on the curve. I converted the combined effect of climate sensitivity and CO2 increase into a linear number of degrees increase per century increase. The official estimate by the US Environment Protection Agency, referencing the IPCC, is 2.2 to 6.1 degrees C by 2100. (I converted from the EPA's F) [ That's 2.6 to 7.1 degrees per century. The range includes both the allowed variation in the estimates of climate sensitivity and the possibility that CO2 output may drop near the end of the century, as substitutes for fossil fuels become more significant. Departure from exponential growth is in the future so I used 3 degrees per century to represent the low end of climate sensitivity estimates that AGW theory allows. It's a coincidence that matches 3 degrees for doubling CO2. The earth should have warmed by 0.4 to 1 degree since 2000, but in fact as measured by the satellites there was no change, and in all data sets show no statistically significant change. The graph shows temperature anomaly, so where the blue line ought to originate depends upon when one believes AGW began to dominate climate. AGW theory was invented to explain the temperature rise from about 1980 to 1996, so that's where I put the AGW prediction line. The Hockey stick claimed that nothing happened to climate for a thousand years before about 1970. If the claim is that AGW dominated the entire 20th century, then the line should start at 1900. If climate sensitivity is 0.7, way below any AGW official estimate, then the line is about 0.5 degree per century. and AGW no longer explains the rise in the 80s and 90s. Wrong consensus derives from common error When science reaches a wrong consensus, scientists point to the data that they used to proclaim that the wrong consensus is well founded. I gave several examples. For AGW, it was the rapid temperature increase in the 80s and 90s that “proved” the theory. Some AGW is in the climate, but the long pause proves it is not the dominant factor. Paleoclimate In the hundred million year history of climate, CO2 shows no relation to temperature. The laws of nature do not change. It's not enough to say that things were different back then. The changes in the orbit of the earth were too small to explain the climate variation. The likely missing link is the solar variation other than heat output that caused the MWP. CO2 released from the ocean will increase heating, and CO2 going back into solution will amplify cooling. Those are natural, not anthropogenic, factors and they do nothing to explain what drives the trend in either direction. (I wrongly identified my reference for the lag in CO2; it's 3-5.) The Debate Pro's rules for the debate say that we have an equal burden to prove that AGW does or not dominate climate. That's fine with me. If AGW was the dominant factor in climate, then we should have observed a straight line increase in temperature since 1980, and we clearly have not. Since Pro has not met his burden of showing that AGW dominates, I've met my burden to show it has not. Thanks to Pro for a fine debate. It will be most fascinating to people interested in logarithms.\n","DiscussionID":"00000003","Title":"Global Warming is Man-Made","CrawlDate":"2016/09/29 03:21:19","URL":"http://www.debate.org/debates/Global-Warming-is-Man-Made/3/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":138,"nextID":"00000002","PremiseStartPos":[190],"prevID":"00000000","Premise":["==Clarification== I will be arguing that mankind IS the cause of global warming, my opponent will be arguing that mankind is NOT the main driver of modern climate change. My opponent, therefore, is arguing that the theory of anthropogenic climate change is incorrect. This is pretty straightforward. Abbreviations which might be used: AGW -- Anthropogenic global warming CR -- cosmic ray[s] TSI -- Total solar irradiation MWP -- Medieval Warm Period SSN -- Sun spot number PDO -- Pacific Decadal Oscillation LIA -- Little ice age ==Definitions== Global warming: The average increase in temperatures since the late 19th century. Man-Made: The literal definition is fairly obvious. In terms of this debate, man-made factors to climate change would be the emission of greenhouse gasses. Or, as the IPCC would describe man-made forcing, \"changes in the concentrations of radiatively active species (e.g., CO2, aerosols)\" [1]. Definitions are pretty common knowledge. Please, no trolling. ==Rules== 1. As stated above, no trolling 2. All arguments should be visible in the debate. However, sources can be posted on an external link. 3. A forfeit is a concession. If you PM me before you forfeit with a legitimate reason, I will discard this rule and ask voters to vote a tie. 4. The structure, rules, or definitions cannot be changed after you accept the debate (no semantics). However, if you wish to change the rules, or something else, for clarity, ask in the comments. 5. BOP is split evenly! ==Structure== R1: Acceptance R2: Present case. NO REBUTTALS R3: Rebuttals R4: Rebuttals and conclusion --> I have made this debate impossible to accept. I will directly challenge the person who is willing to accept this debate. Good luck! 1."],"PremiseEndPos":[1924],"ArgumentID":"00000001","Conclusion":"Global Warming is Man-Made","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":138,"nextID":"00000003","PremiseStartPos":[1939],"prevID":"00000001","Premise":["I thank Roy for accepting this debate. He is one of the best debaters on the site and is very knowledgeable on this subject. It is a pleasure to debate him. ==There exists a scientific consensus== Before I continue, I would like to note this argument in and of itself does not prove that global warming is caused by man. Actual evidence should be the driving force behind this debate. The reason I chose to put this in my argument is simple: the science is not clear because of consensus, but a consensus exists because the evidence is clear. This evidence will be discussed later. A study published in Science reviewed the ISI web of science in order to take a survey of relevant climate literature as to what the causes of climate change are. The study failed to find a single paper which was in opposition to the consensus position, that the main driver of climate change is anthropogenic. 75% of the papers supported the consensus position, whereas 25% had no position (they were focused on things other than forgings, like impacts or paleoclimate) [1]. The study also noted how many organizations have come out supporting the idea of anthropogenic climate change. The IPCC, the American Meteorological Society, American Geophysical Union, and the American Association for the Advancement of Science have all concluded that the evidence for AGW is overwhelming [2]. NASA furthers this argument, noting “most of the leading scientific organizations worldwide have issued public statements endorsing this position”. They also argue “[n]inety-seven percent of climate scientists agree that climate-warming trends over the past century are very likely due to human activities” [3]. A 196 page report representing 13 governmental agencies, and written by 28 authors from scientific institutions, has stated “[t]he global warming of the past 50 years is due primarily to human-induced increases in heat-trapping gases” [4]. ==Climate sensitivity== As Roy is well aware, this is the key point in all of climate science (we have discussed this before in a PM). For those who are unaware, climate sensitivity is defined as how much warming is produced by a doubling of CO2. Both skeptics and AGW supporters agree that the direct effect of doubling CO2 is one degree C, the debate is over feedbacks [5]. First, what is a feedback? Climate skeptic Roy Spencer explains it fairly simply. He describes a forcing as how much temperature change occurs. A feedback determines how large the change in temperatures will be. Feedbacks refer to how clouds and other warming/cooling mechanisms change in response to a forcing (i.e. CO2, TSI, CRs). He also explains positive and negative feedbacks. Take a car, for example. The temperature forcing would be the sun beating down on the car. Opening the window slowly would cool the car, over time, and be a negative feedback. On the other hand, if you were to close the window, the car would warm (due to an enhanced greenhouse effect), which would be a positive feedback [6]. So the question is whether or not the climate is dominated by negative or positive feedbacks. There is even the possibility of there being no feedbacks, as the positive and negatives could cancel each other out. Research by climate skeptics published in Climate Research has demonstrated that climate sensitivity, based on model means, is 1.9 degrees C. Using differing methods of empirical approaches, they conclude that climate sensitivity is 1 – 1.6 degrees C [7]. Although these estimates shy towards having no net-amplifier, the no-amplification scenario still supports a strong influence of man on climate. In fact, to put an answer numerically, about 50% of the warming would be caused by man if there was no net-feedback [8]. Assuming no amplifier, research has found that “the largest contribution to the 20th century warming comes from anthropogenic sources” [9]. They find that of the ~0.7 degree C temperature rise in the 20th century (some estimates slightly higher), about 0.4 degrees of that are due to anthropogenic forgings, or about 57% of the warming (personal calculation from these skeptical studies and personal correspondence with their authors). A significant body of research notes that climate sensitivity is likely much higher. A review of the evidence in 2008 finds that mean climate sensitivity is 3 degrees C, with a range of 2 – 4.5 degrees C. Based on multiple lines of evidence, we see *almost* every which way to measure climate sensitivity leads to approximately the same result: a doubling of CO2 will lead to 3 degrees C of temperature rise [10]. The following graphic from the study corroborates this: The gray is the range (2 – 4.5 degrees C), the line in the center is on 3 degrees C, and the circles in the lines are the ‘very likely’ ranges. Most of them rest on the 3 degree mark, with some under and some above. Therefore, we can conclude that from these lines of evidence, mean sensitivity is about 3 degrees C. Another study replicates the above conclusions. The upper limit for climate sensitivity is around 4 degrees C, and certainly below 6 degrees C. Using a Bayesian statistical approach, which is “the dominant [method] in the literature”, these findings support the notion of climate sensitivity as maximum 4 degrees C, a mean of 3 degrees C, and likely not lower than 3 degrees [11]. The following graph [12] again details the results of many different studies. The best estimates generally center around 2.5 – 3 degrees C. Some evidence published in 2012 claims sensitivity is on the low end of the spectrum, however, still note that “[h]umanity is . . . responsible for the most recent period of warming from 1976 to 2010” [13]. The fact is, climate sensitivity is high and the climate system is predominated by positive feedback mechanisms. Whether it be due to changes in clouds, increased water vapor, or long-term albedo changes. With a climate sensitivity of 1 (no positive or negative forcings), anthropogenic CO2 still causes up to 50% of the warming. With a climate sensitivity of 3 degrees C, humanity is the main driver of climate from about 1976 through present (see, e.g., [13]). ==Paleoclimate== There is significant evidence from paleoclimate records that CO2 can have an effect on changes in the climate. Climate skeptic and paleoclimatologist Bob Carter emphasizes the importance of paleoclimate data. He compares climate to a piece of string. The current instrumental data (1850 – present) is a very short period of time, according to Carter. And when the ‘string’ is lengthened, we see a lot of climactic variability. Instead of looking at the recent past, we should look at the entire temperature record in order to get an accurate picture of the climate [14]. I will provide evidenc, contrary to what Carter believes, lengthening the string supports AGW theory. Over the Cenozoic Era, which began 66 million years ago, we see clear warming and cooling cycles caused by changes in CO2 concentrations. The sun increased slightly over that time period, whereas temperatures cooled. CO2, however, fell steadily through that time period. Plate tectonics was also accounted for. With natural forcings an unlikely cause, “CO2 was the dominant climate forcing in the Cenozoic” [15]. When you lengthen the ‘string’ over the course of the entire Phanerozoic (500 million years; begins at the Cambrian) there is still evidence of CO2 driving multiple climate changes. The GEOCARB study, published in 2001, is one of the definitive proxy records for CO2 concentrations within the last 500 million years. The study notes that “over the long term there is indeed a correlation between CO2 and paleotemperature” [16]. Evidence from the Vostok ice cores (specifically 240,000 before present), proves that CO2 has had an effect on temperatures. Although the initial forcing was orbital changes in the sun, CO2 “plays . . . a key role in amplifying the initial orbital forcing” and “the CO2 increase clearly precedes the Northern Hemi sphere deglaciation”. The study also notes that these forcings “are also at work for the present-day and future climate” [17]. There is also proof that it is warmer now than it has been since the MWP. In fact, it is warmer now than any year since 1400 AD [18]. Newer reconstructions continue to support this finding, and even extends the dataset. It finds that the Roman warm period (RWP) and the MWP as much cooler than today, and claims to have replicated previous ‘hockey stick’ studies [19]. The results are depicted below. Looking into the geologic past, we see strong evidence in favor of the idea that carbon dioxide can increase temperature. It logically follows that if humans continue to emit CO2, and other greenhouse gasses, that human emissions will increase temperatures. Conclusion: It is clear as to *why* a scientific consensus exists. There is overwhelming evidence that 1) climate sensitivity is likely high, 2) even if it wasn’t, anthropogenic forces still account for 50% or more of the warming (from CO2 alone, not counting methane and other greenhouse gases), and 3) that when you ‘lengthen’ the piece of string, there is still ample evidence ample evidence supporting the fact that CO2 can drive temperatures. The consensus itself does not prove AGW—but the evidence proves the consensus. CO2 is the main driver of recent temperature changes. Sources:"],"PremiseEndPos":[11316],"ArgumentID":"00000002","Conclusion":"Global Warming is Man-Made","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":138,"nextID":"00000004","PremiseStartPos":[11331],"prevID":"00000002","Premise":["== Rebuttals == R1) Solar cycle as a driver of climate It is good that Roy discards the idea that TSI can explain the modern temperature increase. Even skeptical climatologists are beginning to accept this, they note TSI can explain “virtually none” of the warming past 1950 [1]. Roy begins by citing a 1991 study by Friis-Christensen et al (his graph). The study purported to claim the solar cycle length correlated with temperatures. It must be noted Christensen’s temperature data ended in 1985, which ignores a huge portion of the warming which occurred in the 1990s. Christensen’s study was criticized for mathematical errors. A new paper has come out and corrected the errors from the original paper. The result was solar cycle length did not correlate well with temperature. Solar cycle length did correlate with temperatures until 1985—when the dataset for Friss-Christensen et al. ended—but after 1985, the correlation broke apart. Solar cycle length fell as temperatures began to dramatically increase. The correlation Roy uses in his graph has since been falsified [2]. The following graph shows the updated correlation: The mathematical errors are shown by this graph [3]: As can be seen, Roy’s source is flawed and newer measurements prove that solar cycle lengths cannot explain the modern warming. Roy then cites a paper purportedly claiming 72% of the earth’s increase in temperature is due to the solar cycle. Roy cites a skeptical blog, and the blog exaggerated the findings. 72% of the temperature change in the North Atlantic can be explained by solar fluctuations, according to the study—not global temperatures. If you go to the actual source it says “[w]e find for the Norwegian local stations investigated that 25–56% of the temperature increase the last 150 years may be attributed to the Sun” [emphasis added] [4]. You can see the study is looking into local stations, not global phenomena! Roy’s 72% number is an exaggeration and is in relation to one region, not the entire globe. Evidence shows global temperatures do NOT correlate with solar cycle lengths, and much of the evidence Roy uses relies upon local Norwegian data. Not global data. Therefore, Roy fails to prove that the sun correlates well with global temperature. R2) Cosmic rays and climate For cosmic rays to explain climate change, all of the following must be true: 1) the solar magnetic field must have a long-term negative trend, 2) the cosmic ray flux must have a long-term negative trend, 3) cosmic rays must create low level clouds, 4) low level clouds must have a long term negative trend [5]. The solar magnetic field actually has not changed much over the last 30 years. The correlation between temperature and cosmic rays is fairly weak. Even assuming that the correlation exists, it is about equal to the anti-correlation of TSI (which has been falling, and leading to cooling). Cosmic rays have had little overall impact on temperatures over the last few decades [6]. Have cosmic rays had a long-term negative trend? No. Cosmic rays have had no discernable trend from 1951 to 2006, and have stayed relatively stable [5]. Further, the GCR (galactic cosmic ray) flux only correlated with temperature between 1970 and 1985, and even then it lagged temperature. The correlation totally breaks down in the 1990s. The changes in the GCR flux cannot be the cause of more than 15% of the observed temperature increase [7]. In fact, some research has found the GCR flux is increasing. SkepticalScience, quoting Erlykin et al. 2013, notes “[r]ecent measurements of the cosmic ray intensity show that a former decrease with time has been reversed. Thus, even if cosmic rays enhanced cloud production, there would be a small global cooling, not warming” (emphasis original) [5]. If GCR’s have been causing a net-cooling, they cannot explain the warming trend. Do GCR’s cause low-level cloud cover? No. The correlation between GCR’s and cloud cover begins to disintegrate in 1989. By 1994, the correlation completely breaks apart, and there is no way that we can see changes in the GCR flux affecting low-level clouds, as can be seen in the graph [8]. Cosmic rays are red, versus low cloud cover (blue). We see little correlation between the two. Do low-level clouds have a negative effect on temperature? There is conflicting evidence here [5]. Regardless, GCR’s don’t seem to change cloud cover or correlate well with temperature. R3) The ‘pause’ Roy claims surface temperature has shown no trend recently. He is using RSS data. UAH data finds an increase of temperature over the same period [9]. Over such a short time period, it is impossible to get statistically significant results. So in order to reduce data uncertainty, I will change the data to 1970 – present. With this, we will always see a warming trend. However, if this ‘pause’ is significant, we should see a large change in trends. Using HADCRUT4 data, from 1970 – 1996 (‘pause’ began in 1996) we get .153 C/decade with a margin of error of 0.067. Then to see if the ‘pause’ significantly reduces this trend, I now extend the data from 1970 – 2014. What do I get? 0.165 degrees C per decade with a margin of error 0.030 [9]. We see no decrease in the overall trend, which would occur if the ‘pause’ were significant. And this method reduces data-uncertainty. So we see there is no statistically significant slowdown of the warming trend in HADCRUT4 data. The long-term trend of increasing temperatures is due to CO2. Short-term variability happens all the time; it does not mean that the long-term increase is going to stabilize forever. La Nina events have decreased surface warming. La Nina is an oscillation, it is not a long-term phenomena, and will revert to a positive trend eventually. Many models that account for these oscillations do reproduce the ‘pause’. When these factors are accounted for, greenhouse warming still continues to exist [10]. The assertion that models cannot account for the pause is simply incorrect. The oceans increased heat content, aerosol cooling, La Nina events, etc. all lead to cooling. The fact that any warming has happened at all (see my UAH & HADCRUT4 analysis) is supportive of idea that CO2 is a strong climate driver. R4) Paleoclimate Roy begins by claiming CO2 lags temperature. Although he cites no source (or at least, not in that paragraph) I know where he got the claim. I cited the exact paper with that claim last round! It claimed there was an 800 year lag between past climate changes and CO2 concentrations. What skeptics don't tell us—and what the paper actually said—is CO2 still acted as an amplifier to other climate changes (a positive feedback for the orbital forcing of the interglacial cycle). CO2 preceded northern hemispheric deglaciation. If you actually read the papers, which claim there to be a lag, they almost all note how CO2 acts as an amplifier and how the results do not contradict AGW. There is new research (Shakun et al.), which argued that CO2 preceded the end of the last ice age, and may have (in part) led to the warm interglacial in which we live today [11]. The following graph from the study demonstrates how CO2 may have been an important factor in the most recent deglaciation: Blue = temperature, Red (and yellow) = CO2 concentrations. The recent Shakun study demonstrates how CO2 may have, in part, ended the last ice age. Roy goes on to claim there is no correlation between CO2 and past temperatures. I followed his sources. The first one was temperature data and made no comments on correlation. Berner 2001 is the other source. I cited this exact study last round. I pulled a direct quote out of the study. I will reiterate it here, “over the long term there is indeed a correlation between CO2 and paleotemperature” [R2]. Using Roy’s sources, we see that CO2 does correlate with temperatures. Roy’s graph is also a oversimplification. It fails to mention that there ARE other forcings in climate. The other major forcing, the sun, does not correlate well with phanerzoic temperatures either. When the two are put together, there is a strong correlation [12]. The sun alone cannot account for temperatures, and CO2 alone cannot account for the temperatures. When put together, they do. This indicates that CO2 is a very important factor in determining climate. The following graph from the paper depicts the correlation when CO2 and the sun are put together: R5) Consensus I agree with Roy that consensus does not tell us whether or not science is correct. The consensus is not what makes the science clear. But there is a consensus because the science is clear. And Roy claims his data supports solar theory. However, I have adequately dismantled that argument using peer-reviewed research and Roy’s own sources. Roy attempts to claim I have the BOP. This is incorrect. A review of the rules in round one tells us, (rule 5) the BOP is split evenly. Therefore, Roy has an equally important role in disproving AGW as I do in proving it. Roy shows examples of the consensus failing. This can occur, but citing a few high profile cases back when science was less rigorous is not very compelling. Modern science requires empirical evidence for scientific claims. And as most experts believe in AGW, chances are, strong empirical evidence corroborates the theory. Roy makes a claim about catastrophic warming. This is not what we are debating, it is irrelevant. Roy claims climategate shows how scientists ‘suppress’ the science. A reading through the emails, in context, really shows no malice was intended [13]. Multiple independent panels have reviewed the emails, and concluded that no scientific malpractice was committed [14]. Conclusion The sun is not the cause of the recent warming trend. Paleoclimate continues to give credence to the idea that increased CO2 levels warm the climate. Man is the main driver of modern global warming. Sources:"],"PremiseEndPos":[21232],"ArgumentID":"00000003","Conclusion":"Global Warming is Man-Made","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":138,"nextID":"00000005","PremiseStartPos":[21247],"prevID":"00000003","Premise":["== Roy’s calculation == Roy’s assumption that warming is linear is simply untrue: Even though CO2 is the dominant climate driver of modern climate-change, it does not mean natural climate variability cannot occur in the system—it does occur. A few ‘pauses’ or unprecedented accelerations do occur. CO2 is logarithmic in relation to temperature. This means that every CO2 doubling has the same effect, even though each molecule warms less. For example, a doubling from 100 ppm to 200 ppm would have the same effect as a doubling from 280 to 560 ppm. Warming will only occur fairly linearly if each doubling occurs at the same rate. His calculation uses faulty assumptions. His 3 degrees C slope is from my former argument that CO2 sensitivity is around 3 degrees C. Sensitivity is for each CO2 doubling. His line begins in about 1970, and CO2 has not doubled from 1970 to now (in terms of the pre-industrial levels). In 1970 there was about 323 ppm of CO2, and in 2014 the number is around 400 [1][2]. So over that time period, CO2 increased 77 ppm. That would only be about 13.2% of a CO2 doubling. So .132 * 3 is about .4 degrees temperature rise since 1970. It has warmed about 0.5 degrees since the 1970s [3]. Therefore when Roy’s calculation is done correctly, CO2 is responsible for 80% of the temperature rise over that time period. == Climate model accuracy == Roy argues that global circulation models (GCMs) are inaccurate. This is untrue. Climate models actually have accurately reproduced temperature since 1900. GCMs cannot replicate warming without a CO2 forcing. GCM’s are only accurate when CO2 forcing is accounted for in hindcasts. This means that CO2 is a large forcing of modern climate. This can be demonstrated with the following graph [4]: Models also reproduced temperatures after the Mt. Pinatubo eruption. They correctly predicted the temporary 0.5 degrees C cooling after the eruption, meaning models can replicate temperature changes due to aerosol and sulfate forcings [4]. A paper published in Nature looked at each 15 year period since the 1950s. Their models were able to accurately produce those trends as well as many El Nino events. The study even commented on the pause. The authors note that the pause does not falsify model accuracy, as it is only “one realization where the decadal natural variability component of the model climate is generally not in phase with observations” [5]. In other words, it is the exception rather than the rule. Models accurately predict warming trends, one exception does not falsify the models. In fact, they note models still were able to predict recent trends in the Pacific—a huge portion of the world. Hansen’s 1988 model, unlike what skeptics claim, shows close correspondence with the actual temperature change. His model seemingly assumes more warming due to the fact he assumed 25% too much climate sensitivity. When the sensitivity is lowered to 3 degrees C, his scenario B correlates perfectly with observed temperatures [6]. The model offers evidence of a 3 degrees C climate sensitivity. Models can accurately hindcast warming which occurred in the last century and models can accurately predict the cooling forcings of aerosols. Further, the 1988 model predictions were correct, indicating that models can predict future temperatures. == The ‘pause’ == The argument that the ‘pause’ disproves global warming is incorrect. The fact that other forcings can *temporarily* blunt the warming effect of CO2 is not a nail in the coffin. Unless Roy denies the greenhouse effect, it is preposterous to claim that CO2 cannot influence temperatures. The fact that natural forcings have caused a short-term ‘pause’ does not disprove AGW. Some models actually have predicted the ‘pause’ [7]. The Met Office has released a report regarding the ‘pause’. They note that the earth’s heat content is still increasing, and is actually increasing faster than ever before. Surface warming has slowed due to the fact that the oceans have been accumulating more heat. This effect is temporary. Eventually, the ocean’s heat content will ‘max out’, and surface warming will resume. So CO2 is still warming the climate system [8]. As noted, this effect is temporary, and as heat continues to accumulate the oceans will warm, and surface temperatures will eventually begin to increase. CO2 forcing has not stopped—its heat is merely being distributed elsewhere. The earth’s surface has stopped warming not due to CO2 not being a greenhouse gas, but rather its heat content being distributed elsewhere. There is still doubt as to whether or not the ‘pause’ is real (as I noted last round). Tamino, a statistician, has worked out the data. Using each possible start date for the ‘pause’, he ran the p-value of statistical significance. For each start date, none of them reach the 95% statistical significance level. Therefore, no matter which data-set you use, no matter what start date you use, there is no proof of a statistically significant slowdown in global temperatures. The following chart [9] details the results: Therefore, there is little proof that a ‘pause’ is occurring at all. == Solar activity == Roy argues the sun caused the LIA and the MWP. I agree! CO2 was fairly stable in those time periods, so it could not have been the forcing. Climate reacts to whatever is forcing it to change at the time. As I convincingly argued (CON’s words), the sun cannot be the current forcing. CO2 has been increasing, and likely is the current climate forcing. I never said that the sun couldn’t affect climate. I merely stated that cosmic rays do not change the climate, and that the sun is not the driver of current climate change. As noted, solar forcing has been decreasing, meaning it cannot be the cause of modern warming. TSI has been falling, GCR’s have been increasing, and solar cycle lengths have fallen as temperature dramatically increased. The sun cannot be the forcing behind the current warming—it is impossible. I have cited many peer-reviewed studies corroborating those conclusions. == Paleoclimate == This entire argument proved that CO2 has the potential to change climate. CON claims I said CO2 does not correlate with temperature. This is a massive misinterpretation. I first cited the study which every paleoclimatologist uses in their datasets, the GEOCARB study. The study found that CO2 did correlate with temperature. I then cited Royer 2006, which noted how CO2 does correlate with temperature when 1) pH effects are corrected for, and 2) the sun is accounted for. The sun does not correlate with temperatures, but it obviously affects climate. It only correlates with temperatures when CO2 forcing is included. Therefore, we can conclude that CO2 is one of the main drivers of past climate. This proves that CO2 has the ability to warm the planet, meaning the increased emissions have had a warming effect. Research using proxy data over the last 500 million years find a climate sensitivity of 3 degrees C [9]. This supports the idea that the modern increase of CO2 concentrations are having a large effect on modern climate. Roy again claims the CO2 lag refutes AGW. I already responded to this. CO2 has lagged temperatures over the previous interglacial periods, I agree. But CO2 acts as an amplifier in those conditions. If CO2 amplifies temperature, it has a warming effect. If it has a warming effect, it can be a forcing. Therefore, CO2 has an effect on temperature, and can be the driving force behind modern climate change. The lag argument was solidly refuted last round. Roy also dropped my argument about CO2 causing the end of the last ice-age. This argument definitively proves that CO2 has a massive impact on temperatures. The fact that it is warmer now than in the MWP demonstrates that the current warming is unprecedented. I have proven that the modern warm period is warmer now than at any point during the past 2000+years. == Burden of proof == Roy claims I have not proven AGW. This is incorrect. When it comes to sensitivity, CO2 has a *direct* effect on temperature: each doubling causes about 1.1 degrees C warming. Using calculations from a skeptical physicist [10], this direct effect means that CO2 has caused over 50% of the recent warming. Sensitivity is likely much higher, about 3 degrees C. With higher sensitivity, CO2 causes more warming. This is corroborated with studies using many different methods. With the high sensitivity proven (R1), CO2 is the main factor of modern climate change. Roy dropped this argument. I proved there was a scientific consensus. This suggests the empirical evidence almost certainly corroborates AGW theory. I proved that CO2 is one of the main forcings in past climate. This is important because it dispels any doubts that CO2 has a large warming potential. In fact, paleoclimate proves 3 degrees sensitivity. Therefore, this also proves that CO2 is the main driver of modern climate change. I have proven that CO2 does change climate. The direct effect of CO2 (which no one disputes) causes over 50% of climate change, and when sensitivity is 3 degrees C, CO2 is the cause of the warming since 1970. I have upheld the BOP. Roy, on the other hand, has failed to explain *why* CO2 is either not a forcing, or that my sensitivity estimate is wrong. He drops the sensitivity argument, conceding that CO2 is the main driver of warming in the modern era. His alternative explanation, the sun, was eviscerated last round. His arguments about a ‘pause’ are also put into question, and his model argument is based upon flawed assumptions. I have, on many occasions, cited Roy’s evidence against him. Low sensitivity proves AGW, high sensitivity proves AGW, and Roy totally ignored that key point. Therefore, I have proven that AGW exists, whereas Roy fails to put a dent into the extremely well supported theory. Thanks for the debate, Roy, it was fun! Please, vote PRO!"],"PremiseEndPos":[31164],"ArgumentID":"00000004","Conclusion":"Global Warming is Man-Made","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":138,"nextID":"00000006","PremiseStartPos":[31179],"prevID":"00000004","Premise":["I accept."],"PremiseEndPos":[31189],"ArgumentID":"00000005","Conclusion":"Global Warming is Man-Made","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":138,"nextID":"00000007","PremiseStartPos":[31204],"prevID":"00000005","Premise":["The sun drives of climate change The main driver of modern climate is solar activity. The energy output of the sun, called the irradiance. has been nearly constant in modern times, so that's not the cause. It is primarily the magnetic field of the sun which drives climate, and to a lesser extent the ultraviolet component of the irradiance. The magnet component varies dramatically. Norwegian scientists in the 1990's discovered that the single measure of solar activity that best predicts climate is the length of the previous solar cycle. “The most readily apparent cycle in solar activity is the cycle in sunspot activity. These solar cycles average eleven years in length, and they have ranged in length from nine years to beyond eighteen years.“ [1] The length of the solar predicts climate change as shown in the graph [2] below: The increase in CO2 is very close to exponential, so as Pro noted, AGW theory predicts a straight line temperature rise. The graph shows clearly that is not what has happened. Climate has been behaving according to solar activity. “A paper published [in 2012] in the Journal of Atmospheric and Solar-Terrestrial Physicsfinds that up to 72% of the temperature increase over the last 150 years can be explained by the length of solar cycles,” [3] The length of the solar cycle does not perfectly represent the sun effects, so it's likely that a more precise model would produce a more precise result. Cosmic rays affect cloud cover The physical theory that explains the correlation is summarized by Archibald: There are two main ways that changing solar activity affects terrestrial climate. Both have their origin in the strength of the Sun’s magnetic field. In the first route, a lower magnetic field strength results in less sunspot activity, which in turn mean less solar wind, which allows more galactic cosmic rays to get to Earth’s orbit. The neutron shower from galactic cosmic rays causes more cloud formation, which in turn reflects more sunlight back into space, making the Earth colder. … In the second route, the lower magnetic field strength results in a lower temperature of the Sun’s chromosphere, which in turn produces less ultraviolet light. That decreases the production of lower stratospheric ozone, and that decrease causes a negative North Atlantic Oscillation (a fluctuation in sea-level atmospheric pressure), making the Northern Hemisphere colder. This second route makes winters longer and colder without necessarily reducing peak summer temperatures. [4] If solar magnetic activity really changes cloud cover, the incident radiance on the earth should vary with the sun's magnetic activity. That has been observed just as the solar theory predicts. [5] Solar activity is measured historically by the formation of beryllium 10, which accumulates in sediments to provide a history of solar activity. “The Modern Warm Period from 1900 to 2008 is associated with a large decline in Be10 in ice cores, indicating a sustained higher level of solar activity in the twentieth century. There is also very close correlation between ice-rafted stone debris in the North Atlantic and Be10 levels over the last 10,000 years—another demonstration that solar activity controls climate.” [6] The correlation continues through to the present day. Solar activity predicts the 17+ year halt in global warming as the cycle has reached a flat peak and is starting downward. The pause in global warming is illustrated in this graph: [7]: The AGW computer models include irradiance, which is essentially constant, but the models take no account at all of the solar magnetic effects that correlate tightly with climate. AGW theorists now admit that the CO2 models cannot be tweaked to explain the pause. They are now proposing a variety of new theories to patch the failed old theory. [8] One theory is that for some reason all the warming is going into the deep oceans. Another theory is that atmospheric aerosols (i.e., soot) is reducing the size of rain drops causing clouds to be whiter and reflect more energy. There are other theories. The problem is that if there is any uncalculated factor that completely wipes out CO2 effects, that admits CO2 does not dominate climate. If uncalculated factors can be as large or larger than the CO2 effect, that admits that previous warming might have been the result of unknown factors as well. The premise of the AGW theory was that because all the other factors affecting climate were known, CO2 must have caused the warming from 1983 to 1996. Historically, solar activity drives climate with CO2 rising after there is warming Al Gore famously showed two graphs, one of temperature over time and one of CO2 over time. The shapes of the curves were similar, showing a high correlation. Mr. Gore never overlaid the graphs. Had he done so, it would have been apparent that CO2 levels were following the warming rather by hundreds of years rather than leading it. As the oceans warm, they can dissolve less CO2, which is then released into the atmosphere. The CO2 rise is in response to the solar magnetic effects that changed cloud cover to cause the basic climate change. Over long periods of earth's history, there is no relationship between CO2 and climate.[8] Consensus does not determine science Pro has the burden of proving that human activity has dominated climate. My burden is only to show that the anthropogenic theory is unproved. A scientific theory is wrong if it fails to explain or predict, and anthropogenic theory has clearly failed. I'm not obligated to prove an alternative theory, but I nonetheless shown that solar magnetic activity explains and predicts climate much better than CO2 theory. Since solar magnetic activity has dominated climate, anthropogenic causes cannot be dominant. AGW theorists admit that factors not in their computer models have been so large as to completely cancel greenhouse gas effects. for the past 17+ years. Pro stresses that it is not just that a consensus exists, but that the consensus is based on data. (Actually, the only real data is a general increase in temperature which solar theory better explains, and the rest is computer models that did not predict the hiatus.) But every scientific consensus has been supported by data that scientists at the time thought conclusive. A wrong consensus means that the data was incorrect or that it was incorrectly interpreted. The once near-unanimous consensus that the earth was the center of the universe was based upon the indisputable observation that the sky appears to rotate around the earth. The theory was found wrong only by more careful observations starting with the inconsistent behavior of the paths of planets in the sky. In the 1960s, the scientific consensus favored the Steady State Theory over the Big Bang Theory. The Big Bang Theory predicted the presence of microwave background radiation, so when the background radiation was discovered, the consensus changed rapidly. Not long ago, the learned scientific consensus was that homosexuality was a form of mental illness. Psychologists thought they had the data to prove it, but they were wrong; it is genetic. Modern scientists continue to make errors reflected in wrong consensus. A very strong scientific consensus has until the past few years supported the theory that in the human diet, saturated fat causes high serum cholesterol levels which in turn causes heart disease. It turns out the original theory was based upon falsified data. The landmark peer that \"proved\" the theory deliberately excluded data that falsified the theory. A couple of other bogus papers supported the theory, including one in which cholesterol was injected into vegetarian rabbits, who then quite predictably died. Studies over the past fifty years that attempted to confirm the theory instead disproved it. [9, 10] The originator of the cholesterol theory believed it, and he did a great job of selling the theory so it quickly reached consensus.. Many papers giving the “wrong” results were not allowed to be published, or the authors declined to submit them for fear of ruining their reputation. Some scientists published after they retired so that career retribution could not be inflicted. I recite the cholesterol consensus error because it's very close to the way anthropogenic global warming theory has achieved consensus. Early enthusiastic advocates sold the theory as the only possible explanation of the rapid rise of temperatures from 1983 to 1996. According to that data, not only was CO2 the cause, but climate sensitivity much have been very large, perhaps five or even ten. Now Pro's claim is that it is at least 0.7. If it is that low, then global warming is not a crisis. it's hardly worth noting. The bogus 97% consensus comes from surveying only journals that refuse to publish dissent. The Climategate scandal showed how eager AGW are to suppress dissent.\"In a November 15, 2005, email Mann expresses his satisfaction that Geophysical Research Letters is now firmly under the control of the climate change alarmists but laments that other publications still publish research by skeptics: “The Geophysical Research Letters leak may have been plugged up now with new editorial leadership there, but these guys always have Climate Research and Energy and Environment, and will go there if necessary.” [9] Very few papers scientific papers say anything about global warming as whole. For example, there are about 200 papers that show that the Medieval Warm Period and similar climate change existed worldwide, and that refute the bogus Hockey Stick argument for AGW. But the papers would not be counted as being in opposition to AGW. Besides, they are in the wrong journals. Virtually all the papers on solar theory -- there are hundreds -- are in specialist journals, not the surveyed climate journals. ------------------------------------------ Per the terms of of the debate, I'll put the reference list in the debate comments."],"PremiseEndPos":[41190],"ArgumentID":"00000006","Conclusion":"Global Warming is Man-Made","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":138,"nextID":"00000008","PremiseStartPos":[41205],"prevID":"00000006","Premise":["AGW Models fail, so the theory is wrong We have agreed on a couple of basic points of climate science: 1. If AGW is true then warming should occur as a straight line over time. 2. The heat output of the sun is not changing, so that isn't upsetting the straight line AGW So, if AGW has dominated climate over last century then we should see a straight line increase in temperature over the century, with just short term variations due to weather. Here is the temperature data. Pro told us in his initial argument that the minimum value for climate sensitivity under AGW is 3 degrees per century. He said it might be more, but it's at least three degrees. To test if AGW dominates climate, we can see how close the temperature data is to a straight line with a three dree slope. I took the temperature from Wikipedia [1] and added the line (in blue) predicted by AGW: Clearly AGW theory is wrong. It's possible that carbon dioxide is adding a temperature increase to climate just as AGW predicts, but that some other unaccounted factor is canceling the AGW before about 1980 and after about 2000. Our debate is about whether AGW dominates climate, so if it is try that an unknown factor completely changes climate from what AGW contributes, then it is the unknown factor that dominates, not AGW. Why did a theory so far from the data ever take hold? The problem AGW attempts to explain is the rise from about 1980 to 1996, and many atmospheric scientists could not come up with an explanation other than CO2. To explain all the pre-1980 data that did not conform, Professor Mann and his colleagues came up with the Hockey Stick curve, that purported to show that climate had not changed at all in the past 1000 years. The Hockey Stick turned out to be the product of a bad statistical method that selected proxies for temperature that were unrelated to temperature. The current Wikipedia article on the Hockey Stick shows the Medieval Warm Period and the Little Ice Age as global climate change. Both are explained by solar magnetic theory. The fatal blow to AGW theory is the lack of warming since 1996. The blue curve on the graph shows how far we are below the AGW theoretical prediction. Pro argues that the HADCru data shows some warming, but there is close to universal agreement that the models have failed. HADCru uses ground station data which focuses on urban areas that warm due to growth with surrounding population increase. The satellite data covers the whole earth with no such complications. NASA acknowledges the pause in global warming [2] the ‘pause’ in global surface temperature that began in 1997, according to some estimates, continues,” wrote David Whitehouse, who holds a doctorate in astrophysics and was the BBC’s science editor. “Statistically speaking there has been no trend in global temperatures over this period.” HADCru fully acknowledges the existence of the pause in global warming, but dutifully insists that the underlying AGW has just been overcome by other factors. Those factors must, of course, now dominate AGW. [3] Papers by von Storch [4] and Rasmussen [5], both previously vigorous defenders of AGW, show the AGW models have failed. Not only have the models failed, but there is no way to tweak them, say by changing climate sensitivity, to get them to fit the data. A book by Tisdale [6] shows graphically that the models cannot be fixed. Measures of Solar Activity Remember, I'm not obliged to explain why the AGW models have failed, only that there is no possibility that the AGW linear trend of 3 degrees per century, which Pro claimed as all but certain science, is not true so that AGW is not dominating climate. The exact nature of the sun's influence on climate is not known, and Pro argues convoincingly that the length of the solar cycle has not been born out as being as good a predictor as thought. Nonetheless the correlation to solar activity remains strong. The long Medieval Cold Period, the Medieval Warm Period, and the Little Ice Age all corrsponded to solar activity. [6] Right now we are in a period of decreasing sunspot activity [7]: That the correlation to sunspot activity is not perfect means no more than that climate is complex. To say that AGW dominates climate is unfounded, because there is all but universal agreement that the models have failed. Paleoclimate That CO2 lags warming is uncontested basic physics. As the oceans heat, CO2 comes out of solution and CO2 enters the atmosphere. If it amplifies heating trends, that is no proof that CO2 dominates climate. Whatever starts and ends the heating trend dominates climate and CO2 magnifies the swings in boith directions. Whether the present is warmer than the Medieval Warm Period or the Roman Warm Period is not the slightest proof of what caused any of the warming or cooling. What is does show is that substantial warming in past climate has happened without any CO2 effect. If we got nearly as warm as the present in the MWP. then whatever caused that was not CO2 and may be working now. The long history of climate shows very little relationship to CO2, and Pro acknoweldges that. So what factors were at work, and how do we know what is at work now? Variations in the earth's orbit are not nearly enough to explain the changes. We have some ideas, but there is nothing that's proved reliable, especially not AGW theory. Pro burden is no more than to prove that AGW dominates climate. He has not done so."],"PremiseEndPos":[46647],"ArgumentID":"00000007","Conclusion":"Global Warming is Man-Made","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":138,"nextID":"00000000","PremiseStartPos":[46662],"prevID":"00000007","Premise":["AGW exists, it but doesn't dominate climate Greenhouse gases cause warming, and I never claimed otherwise. Pro cited a skeptical climate scientist acknowledgment that AGW plays some role in climate. Our resolution is “Global warming is man made.” That might mean that global warming is entirely man made, in which case Pro has conceded it is not, because he has acknowledged that there are also natural causes. I didn't take that meaning. I said repeatedly that Pro must prove that climate is dominated by AGW. I must prove it does not. The proof of AGW would be a AGW math mathematical model of climate that accurately explains and predicts. Weather effects are yearly variations; climate comprises trends over several years. The AGW models fail because the models do not predict or explain climate the large trends in climate. For example, Pro acknowledges that Medieval Warm Period was due to solar activity, but the official IPCC models have no mechanism that explains the MWP. Because AGW models cannot explain the MWP, climate crisis advocates have fought consistently to make the MWP disappear as a global climate phenomena. The Hockey Stick got rid of it by a statistical error, but the data ultimately won. A change in climate acknowledged to be very close to modern warming is unexplained by the models we are supposed to accept as reliable. The pause in global warming is real Pro argued that an 17 year pause in global warming might just be “noise,” and he cited a scientific paper that allegedly shows that. That's bad science. Suppose an engineer designed a building taking into account all the other factors he knew to affect design, and the building subsequently collapsed. Consider: “The design models were correct. The building collapsed due to unknown factors categorized as noise. There is no need for further explanation.” Nonsense. Fundamental failures are not noise. An eighteen year failure of climate prediction shows that the model is defective. Since AGW is in the model, and something else canceled it, the unknown factor dominated climate over the period. I quoted both HADCru and NASA scientists as acknowledging the pause in global warming. The paper by AGW-advocate von Storch established that the current models cannot be tweaked to explain the pause. Pro found some oddball paper that made a model that shows a pause, but models can be made to do anything desired. AGW theory is not validated until after it makes accurate predictions. Making a new, unproved model means we are back to the starting point. Pro said that HADCru land data showed an increase. Year-to-year variations occur with weather, and so there is so uncertainty in the trends due to the accuracy of fitting a line through the weather-induced variations. The HADCru data shows 0.09 +/- 0.11 degree of global warming over the period of the pause, compared to the 0.4 to 1 degree predicted by the AGW models. None of the six global temperature data sets showed a statistically significant increase. [ The land data sets are the least accurate because increasing urbanization drives up the temperatures near many of the weather station locations, due to the so-called “heat island” effect. The satellite data is the most accurate because it samples the earth uniformly, and it shows no increase. HADCru scientists understand the large departure from the models, and acknowledge the pause. Pro said I acknowledged that the Sun could not be causing the pause in global warming. That's not true, but if it were true, it would not help Pro's case. If it's not the sun, then a completely unsuspected factor dominated climate and overwhelmed AGW. However, what I acknowledged was that the length of the previous solar cycle was not a good predictor. I presented the historical graph that showed the level of sunspot activity correlated well with the warmth of the MWP, the cold of the Little Ice Age, and the warming of the 20th century. Pro acknowledged the solar cause of those changes. Sunspots do not correlate to the heat output of the sun, so the effect on climate must be a different physical cause: magnetic field, cosmic rays, ultraviolet spectrum, or something else. It might be some complex combination of the effects. The graphs show that cold climate is associated with low sunspot activity and warm climate with high sunspot activity. The 20th century covered a long period of high sunspot activity, which explains the warming. Recently, sunspot activity has dropped, correlated to the pause. The number of sunspots remains a reliable longer term climate predictor. AGW predicts straight line temperature increase I presented a graph showing actual global temperatures and AGW predicting a strong straight line increase. My graph is accurate, but I should have better explained the AGW line in comparison to the actual climate data. Here is the graph, repeated from the earlier round: Temperature responds to the logarithm of greenhouse gas density, and greenhouse gas density has been increasing exponentially. The log of an exponential is a straight line. As far as I know, all climate scientists agree on this. Therefore, AGW should produce a straight line. Pro said that the models also include some natural effects like volcanoes, so the model predictions need not be a straight line increase. However, the debate resolution is that AGW dominates climate. While natural causes upset the perfect straight line behavior to some degree, they cannot dominate. While there may be some blips, like the blip of cold for a couple years from the eruption of Mt. Pinatubo, there should be no problem recognizing a straight line. The temperature data is not close to any straight line, so AGW is not dominating. We are far below what the models predict for the present year. The slope of the line of temperature increase over time depends both on climate sensitivity and the rate of carbon dioxide increase. The behavior of temperature with CO2 is logarithmic, so Pro's computation of what it should be is way off. Initially a small increase in CO2 produces a large increase in temperature, with later increases in CO2 having less and less effect. Suppose CO2 increased in units from 1 to 16, and that the increase from from 1 to 2 brought one degree of warming. That means that there would be four degrees of warming at 16, CO2 having doubled four times. Linear interpolation, which is what Pro did, between 1 and 16 says that there should be (1/15) of the 4 degrees, 0.27 degree, at 2 units. In fact, there was 1 degree of increase at the 2 unit point, four times as much as linear interpolation erroneously yields. The temperature rise is not line between 1 and 2 or between 2 and 4, or anywhere on the curve. I converted the combined effect of climate sensitivity and CO2 increase into a linear number of degrees increase per century increase. The official estimate by the US Environment Protection Agency, referencing the IPCC, is 2.2 to 6.1 degrees C by 2100. (I converted from the EPA's F) [ That's 2.6 to 7.1 degrees per century. The range includes both the allowed variation in the estimates of climate sensitivity and the possibility that CO2 output may drop near the end of the century, as substitutes for fossil fuels become more significant. Departure from exponential growth is in the future so I used 3 degrees per century to represent the low end of climate sensitivity estimates that AGW theory allows. It's a coincidence that matches 3 degrees for doubling CO2. The earth should have warmed by 0.4 to 1 degree since 2000, but in fact as measured by the satellites there was no change, and in all data sets show no statistically significant change. The graph shows temperature anomaly, so where the blue line ought to originate depends upon when one believes AGW began to dominate climate. AGW theory was invented to explain the temperature rise from about 1980 to 1996, so that's where I put the AGW prediction line. The Hockey stick claimed that nothing happened to climate for a thousand years before about 1970. If the claim is that AGW dominated the entire 20th century, then the line should start at 1900. If climate sensitivity is 0.7, way below any AGW official estimate, then the line is about 0.5 degree per century. and AGW no longer explains the rise in the 80s and 90s. Wrong consensus derives from common error When science reaches a wrong consensus, scientists point to the data that they used to proclaim that the wrong consensus is well founded. I gave several examples. For AGW, it was the rapid temperature increase in the 80s and 90s that “proved” the theory. Some AGW is in the climate, but the long pause proves it is not the dominant factor. Paleoclimate In the hundred million year history of climate, CO2 shows no relation to temperature. The laws of nature do not change. It's not enough to say that things were different back then. The changes in the orbit of the earth were too small to explain the climate variation. The likely missing link is the solar variation other than heat output that caused the MWP. CO2 released from the ocean will increase heating, and CO2 going back into solution will amplify cooling. Those are natural, not anthropogenic, factors and they do nothing to explain what drives the trend in either direction. (I wrongly identified my reference for the lag in CO2; it's 3-5.) The Debate Pro's rules for the debate say that we have an equal burden to prove that AGW does or not dominate climate. That's fine with me. If AGW was the dominant factor in climate, then we should have observed a straight line increase in temperature since 1980, and we clearly have not. Since Pro has not met his burden of showing that AGW dominates, I've met my burden to show it has not. Thanks to Pro for a fine debate. It will be most fascinating to people interested in logarithms."],"PremiseEndPos":[56499],"ArgumentID":"00000008","Conclusion":"Global Warming is Man-Made","PremiseStance":["Con"]}}]}