{"MetaData":{"Context":"URL: http://www.debate.org/debates/With-Books-Or-With-Facebook/1/\nCrawl date: 2016/09/29 07:47:13\nDebate Issue: With Books Or With Facebook | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: Are You with Books? Or Facebook?\n\nEvidence Pro: Mandar forfeited this round. Con Facebook has superiority over books when it comes to: -communication -social -miscellaneous It has games that you can play, and books kill trees. You can talk to friends, family, and anyone else in the world. It has groups, pages, and much more content than books. You can read the contents of books on Facebook if you have a friend who posts it up over the Internet.\n\nEvidence Pro: Mandar forfeited this round. Con It was (not) going so well...\n\nEvidence Con: I accept this debate and will begin my argument in round 2 when Pro has chosen a side for books or for Facebook.\n\nEvidence Con: Facebook has superiority over books when it comes to: -communication -social -miscellaneous It has games that you can play, and books kill trees. You can talk to friends, family, and anyone else in the world. It has groups, pages, and much more content than books. You can read the contents of books on Facebook if you have a friend who posts it up over the Internet.\n\nEvidence Con: It was (not) going so well...\n","DiscussionID":"00000006","Title":"With Books Or With Facebook","CrawlDate":"2016/09/29 07:47:13","URL":"http://www.debate.org/debates/With-Books-Or-With-Facebook/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":139,"nextID":"00000002","PremiseStartPos":[191],"prevID":"00000000","Premise":["Are You with Books? Or Facebook?"],"PremiseEndPos":[224],"ArgumentID":"00000001","Conclusion":"With Books Or With Facebook","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":139,"nextID":"00000003","PremiseStartPos":[239],"prevID":"00000001","Premise":["Mandar forfeited this round. Con Facebook has superiority over books when it comes to: -communication -social -miscellaneous It has games that you can play, and books kill trees. You can talk to friends, family, and anyone else in the world. It has groups, pages, and much more content than books. You can read the contents of books on Facebook if you have a friend who posts it up over the Internet."],"PremiseEndPos":[640],"ArgumentID":"00000002","Conclusion":"With Books Or With Facebook","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":139,"nextID":"00000004","PremiseStartPos":[655],"prevID":"00000002","Premise":["Mandar forfeited this round. Con It was (not) going so well..."],"PremiseEndPos":[718],"ArgumentID":"00000003","Conclusion":"With Books Or With Facebook","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":139,"nextID":"00000005","PremiseStartPos":[733],"prevID":"00000003","Premise":["I accept this debate and will begin my argument in round 2 when Pro has chosen a side for books or for Facebook."],"PremiseEndPos":[846],"ArgumentID":"00000004","Conclusion":"With Books Or With Facebook","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":139,"nextID":"00000006","PremiseStartPos":[861],"prevID":"00000004","Premise":["Facebook has superiority over books when it comes to: -communication -social -miscellaneous It has games that you can play, and books kill trees. You can talk to friends, family, and anyone else in the world. It has groups, pages, and much more content than books. You can read the contents of books on Facebook if you have a friend who posts it up over the Internet."],"PremiseEndPos":[1229],"ArgumentID":"00000005","Conclusion":"With Books Or With Facebook","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":112,"ConclusionEndPos":139,"nextID":"00000000","PremiseStartPos":[1244],"prevID":"00000005","Premise":["It was (not) going so well..."],"PremiseEndPos":[1274],"ArgumentID":"00000006","Conclusion":"With Books Or With Facebook","PremiseStance":["Con"]}}]}