{"MetaData":{"Context":"URL: http://www.debate.org/debates/Gun-laws-need-to-be-more-strict-rather-than-banning-them/1/\nCrawl date: 2016/09/29 06:37:47\nDebate: Gun laws need to be more strict rather than banning them | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: I would like to thank my opponent for accepting this debate, if she decides to do so. I ask that me nor my opponent do not vote fo ourselves and if we fail to do so the other debator should get the better conduct vote. I assurt that gun laws need to be more strict rather than banning altogether. I ask my opponent to start her argument in the next round.\n\nEvidence Pro: Thanks for accepting the terms of this debate and may the best argument win. I would first like to start off by saying that no matter your age you should not be able to walk into a gun shop and buy a gun. Guns do not kill people rather people kill with guns. 1. TEST- People should have to get a test before they buy or use firearms. Think of it as an unlicensed driver behind the weel of a car. You are not shure they know all of the rules and regulations of the road, and they could kill or injure someone. People should be tested on gun safety, how to hold a gun correctly and have there eyes checked. Then a person should have to take a test to insure they are aware of how to be safe and safely operate the weapon. 2. BACKGROUND CHECKS- Background checks should be performed every time an individual buys a weapon. This will ensure the person is always allowed to buy and carry a firearm. This would reduce the around of criminals receiving firearms. 3.STORE CHECKS-The gun shops that buy and sell guns will be routinely checked so that we can ensure that they are following all procedures that are listed above 4. GUN LICENS- Every individual must obtain a gun license so that we can ensure they have past the test stated above just like a drivers license. The license must be renewed and a test given to assure the person can be safe and safely operate a firearm.\n\nEvidence Pro: My opponent states I have yet to respond to her arguments. I.\" Guns kill people. How else would people be committing crimes and such? With guns, not only can people kill others, it makes it less dangerous for them [it's not as likely they will get caught, since these are ranged weapons and they can shoot from a distance] to shoot people. Therefore, having a gun has two major outcomes; A) allows people to kill people, and B) indirectly encourages people to kill others, in that it is both easier and safer.\" People have been committing crimes without guns using things such as knives and different fighting methods. There are many ways to catch a shooter of a gun such as comparing shell casings, finger prints and firing residue. the shooter of a gun is almost always caught due to advances in technology. II. \"The Proposition is likely to state that guns are people's protection; without guns, they would not be able to protect themselves from the people that do have guns. Guess what? If people didn't have guns in the first place, they wouldn't be attacking those people, and so those people would not need protection!\" Guns have not always been around. In ancient times people have used rocks, fire, bow and arrow, axes, swords and daggers to protect themselves. People would still be attacked even though you take the guns out of the equation. III. \"More gun access means more deaths. I quote [awesomelibrary.org/guncontrol]: \"The Brady Center argues that when the civilian population has more access to guns, more teens and children die from gun wounds. For example, during a year when over 5,000 teens and children died from gun wounds in the USA, in Great Britain, where gun ownership is very restricted, 19 teens and children died from gun wounds.\" What does this tell us? The more people have guns, the more crimes are committed, the more people are killed. If we abolish the law that allows people to have guns, then the amount of deaths should GREATLY decrease.\" There are other things besides guns that can be used to kill people. It would be impossible to collect every gun in the whole U.S, so that is why laws need to be strengthened and guns not banned. IV. \"The Proposition may state that this a matter of public safety. Yes, it is a matter of public safety, BECAUSE of guns. Despite the fact that there will still be crimes and murder with or without guns, guns are responsible for the majority of these incidents.\" If we ban guns yes the amount of death due to guns will certainly go down. While the deaths by other methods will go up and we would have to ban those other methods as well. It would be much easier to change the laws than to ban guns. There would be an increase in smuggled guns in the U.S so you are creating more of a problem by banning guns. VI. \"The Constitution says in its second amendment: \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\" The Constitution clearly indicates guns are allowed to protect citizens. But now, times are changing, and the circumstances are different. Banning guns will help the safety of citizens even more. We need to make a constitutional amendment.\" This amendment states that \"the right of the people to keep and bear arms, shall not be infringed.\" if you ban guns you are infringing on Americans rights to keep and bear arms. The laws should be changed in a way that we are not infringing on peoples rights . When you are not allowed to have something you are more likely to have it, thus creating more of a problem. \"I'm not sure where you are located, but in most places people DO need gun licenses to own a gun, and they do go through these tests. Basically, what you are proposing is to keep the system the same. Guys, if we keep this system, the same amount of people will be murdered every year. WE NEED TO BAN GUNS.\" In most places you do not need a license to own a firearm but you do need one to carry it on your person. My opponents proposal would only create more of a problem with guns. The banning of all guns and the collection of all guns would be too much work. While changing the gun laws and adding more would be much easier. For these reasons I ask that you vote PRO\n\nEvidence Pro: 1.\"First of all, people are not so careless nowadays. They do not drop their guns. They don't leave as much evidence behind. It can be quite difficult to determine exactly where a person was shooting from, find all of the evidence, take it to the labs and go through the whole process to find out who it is. Because people are aware that the technology today can help to trace who the person is, chances are, by the time they DO figure out who it is, the person is long gone.\" In most cases criminals are not as smart as my opponent makes it seem. When someone shoots someone they are in a hurry to get away before they can be seen as the shooter. This means they are likely to be seen running away, leave the weapon used, leave prints or are saw on video. The criminal may be in the criminal data base and that would make them all the more easier to catch. 2.\"You are talking about history. Now is now. Yes, people can still be attacked, but how many people may be in possession of bows, arrows, axes, swords, rocks, and fire? True, there are knives, but the victim will have a much better chance of protecting themselves.\" I was simply stating that there are other methods of committing crimes. Banning guns are not going to stop all the murders, rapes, robbery etc. They may make them go down but the criminal population would find an alternative to guns such as using a knife or smuggling into the country. 3.\"ou also forget that I've stated earlier that banning normal citizens from having guns is different from banning everyone from having guns. The officials and police will still be allowed to have guns for the safety of the public. This gives the police and officials an advantage over anyone who has a mere knife or such.\" A criminal could easily take a cops gun and murder the cop. You are not completely fixing the gun problem. 4.\"It's a lot harder to kill someone without a gun. Using a gun, all you have to do is pull the trigger and BOOM, they're dead. End of story, end of a life. Also, there is less of a chance of someone dying from a knife wound than from a gun wound. Also, people die slower from a knife wound, so there's more of a chance of that person being found than a person who was shot and died quickly. Also, for those who can't get their hands on a gun because the test or their background excludes them, they, too, may attempt to smuggle guns into the U.S.. So smuggling is an issue either way.\" My opponent states that it would be alot harder to kill someone with a gun well I disagree. If you were walking down the street and suddenly someone comes out of nowhere and stabs you in the neck they could his your carotid artery and you could bleed to death in a matter of minutes. My opponent also states that you will have gun smuggling either way, if you ban guns gun smuggling will go up and become more of a problem. 5.\"he Constitution is not always right; they may not have anticipated these sort of circumstances. Times change. Situations change. Laws change. Is it a bad thing for an amendment to change, especially if it is for the better?\" This is still an amendment and you are still infringing on rights of Americans. The amendment is still in effect, because if it were not then Americans wouldn't have guns that needed to be banned. 6.\"'d like to weigh the impacts, here. Yes, the Proposition is right in that is would indeed be easier to make the laws more strict, because this is not changing much. People will still die out there of gun wounds. People will still be inflicted with psychological pains, an argument which my opponent has not yet refuted. Pain that marks them for life! Do you think it is easy to get over being shot? The want for revenge you feel when a loved one has been shot? The guilt that comes from surviving while no one else has? Furthermore, the guilt from shooting someone? No! These are irreparable hurts! THIS is the world the Proposition is supporting. A world where nearly everyone can have a gun. A world where people are suffering from such mental problems! To prevent people from dying out there, from hurting, from feeling such unnecessary pain, to BAN GUNS, please vote for the Opposition.\" There is a mom and her two sons and they are stab wound victims. The two boys do not survive but the mom does. She still feels the pain and sorrow of losing her two boys. Pain will still mark the scar were she was stabbed will still remind her of what happened. She will still have the want for revenge, and she will never forget that she was stabbed. We do not need to ban guns, people will still die and suffer. Banning guns will only make the world safer from guns not from everything or everyone else. I ask that you vote PRO because a gun ban would be harder to enforce, and that the banning of guns would only protect us from guns.\n\nEvidence Con: Hello, THE_OPINIONATOR, and thanks for challenging me to this debate. I'd first like to thank my opponent and assure him that I believe myself to be an honorable person, and will not vote or try to otherwise influence the outcome of this debate by asking others to. If I win, it will be because of my arguments and not because I cheated. First of all, I'd like to start off with a simple statement: Guns should be banned. Why? This is what I will be explaining in my first speech. I. Guns kill people. How else would people be committing crimes and such? With guns, not only can people kill others, it makes it less dangerous for them [it's not as likely they will get caught, since these are ranged weapons and they can shoot from a distance] to shoot people. Therefore, having a gun has two major outcomes; A) allows people to kill people, and B) indirectly encourages people to kill others, in that it is both easier and safer. II. The Proposition is likely to state that guns are people's protection; without guns, they would not be able to protect themselves from the people that do have guns. Guess what? If people didn't have guns in the first place, they wouldn't be attacking those people, and so those people would not need protection! III. More gun access means more deaths. I quote [awesomelibrary.org/guncontrol]: \"The Brady Center argues that when the civilian population has more access to guns, more teens and children die from gun wounds. For example, during a year when over 5,000 teens and children died from gun wounds in the USA, in Great Britain, where gun ownership is very restricted, 19 teens and children died from gun wounds.\" What does this tell us? The more people have guns, the more crimes are committed, the more people are killed. If we abolish the law that allows people to have guns, then the amount of deaths should GREATLY decrease. IV. The Proposition may state that this a matter of public safety. Yes, it is a matter of public safety, BECAUSE of guns. Despite the fact that there will still be crimes and murder with or without guns, guns are responsible for the majority of these incidents. V. I'd also like to point out that we are banning guns from normal citizens. That does not mean we should ban them all together. Police and other security officers [the likes] may still be in possession of a gun. This also means that public safety will be less of an issue, since the culprits will not have guns and the officials will. VI. The Constitution says in its second amendment: \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\" The Constitution clearly indicates guns are allowed to protect citizens. But now, times are changing, and the circumstances are different. Banning guns will help the safety of citizens even more. We need to make a constitutional amendment. I'd also like to ask my opponent to explain how he intends the gun laws to be more strict. Understand, people, that others like you are DYING out there. We cannot allow such an amount of mass deaths to happen. We have ignored it so far, and now we must face the truth; guns are bad. This requires a constitutional amendment. We need to ban guns. Thank you, all of you, once again, and please vote for the Opposition.\n\nEvidence Con: I'd like to, once again, thank you for initiating this debate. I agree with you on one term - no matter your age, you should not be able to walk into a gun shop and buy a gun. In fact, civilians should not be able to walk into a gun shop and buy a gun. I'd like to start off by refuting my opponent's points - \"1. TEST- People should have to get a test before they buy or use firearms. Think of it as an unlicensed driver behind the weel of a car. You are not shure they know all of the rules and regulations of the road, and they could kill or injure someone. People should be tested on gun safety, how to hold a gun correctly and have there eyes checked. Then a person should have to take a test to insure they are aware of how to be safe and safely operate the weapon. \"2. BACKGROUND CHECKS- Background checks should be performed every time an individual buys a weapon. This will ensure the person is always allowed to buy and carry a firearm. This would reduce the around of criminals receiving firearms. \"3.STORE CHECKS-The gun shops that buy and sell guns will be routinely checked so that we can ensure that they are following all procedures that are listed above \"4. GUN LICENS- Every individual must obtain a gun license so that we can ensure they have past the test stated above just like a drivers license. The license must be renewed and a test given to assure the person can be safe and safely operate a firearm.\" I'd like to supply a hypothetical situation in which a person could easily bypass all four of these. The test does not test the person's intentions - merely teaches him safety precautions and how to use the gun. If a criminal were to buy the gun, you would actually be enhancing his ability to use the gun. Is that what you want? If guns were not distributed in the first place, there would be no need to have a gun. If a person was intending to use the gun badly and had not yet done so, they would STILL be able to buy a gun. In addition, there are ways to forge your background. Even \"STORE CHECKS\" and \"GUN LICENS\" would not affect the probability of a person getting through this faulty system. I'm not sure where you are located, but in most places people DO need gun licenses to own a gun, and they do go through these tests. Basically, what you are proposing is to keep the system the same. Guys, if we keep this system, the same amount of people will be murdered every year. WE NEED TO BAN GUNS. Now onto my own point. I'd like to remind everyone that THE_OPINIONATOR has not yet refuted any of my arguments. Let's look at this from a psychological point of view. Shooting a person – what does that mean for the victim? For the murderer? Especially if it was by accident, the emotional stress can be extreme. They may get PTSD – Post traumatic stress disorder. This comes from being exposed to loud, sudden noises, emotional stress from having killed someone, brushing against death, having a loved one killed, and survivor guilt. Do you want people to experience these disorders? Guns in general are accident prone in many ways. How to prevent accidents? BAN GUNS. Thank you, and please vote for the Opposition.\n\nEvidence Con: \"People have been committing crimes without guns using things such as knives and different fighting methods. There are many ways to catch a shooter of a gun such as comparing shell casings, finger prints and firing residue. the shooter of a gun is almost always caught due to advances in technology.\" First of all, people are not so careless nowadays. They do not drop their guns. They don't leave as much evidence behind. It can be quite difficult to determine exactly where a person was shooting from, find all of the evidence, take it to the labs and go through the whole proccess to find out who it is. Because people are aware that the technology today can help to trace who the person is, chances are, by the time they DO figure out who it is, the person is long gone. \"Guns have not always been around. In ancient times people have used rocks, fire, bow and arrow, axes, swords and daggers to protect themselves. People would still be attacked even though you take the guns out of the equation.\" You are talking about history. Now is now. Yes, people can still be attacked, but how many people may be in possession of bows, arrows, axes, swords, rocks, and fire? True, there are knives, but the victim will have a much better chance of protecting themselves. You also forget that I've stated earlier that banning normal citizens from having guns is different from banning everyone from having guns. The officials and police will still be allowed to have guns for the safety of the public. This gives the police and officials an advantage over anyone who has a mere knife or such. \"There are other things besides guns that can be used to kill people. It would be impossible to collect every gun in the whole U.S, so that is why laws need to be strengthened and guns not banned.\" Once again, I have stated that police and protectors of civilians will have guns and can protect the people. Yes, some people will still have guns, but do you want people to have even MORE guns? Do you want these people to keep dying? If we cut off the supply of guns, there's going to be less bad people out there will guns and more protectors with guns. \"If we ban guns yes the amount of death due to guns will certainly go down. While the deaths by other methods will go up and we would have to ban those other methods as well. It would be much easier to change the laws than to ban guns. There would be an increase in smuggled guns in the U.S so you are creating more of a problem by banning guns.\" It's a lot harder to kill someone without a gun. Using a gun, all you have to do is pull the trigger and BOOM, they're dead. End of story, end of a life. Also, there is less of a chance of someone dying from a knife wound than from a gun wound. Also, people die slower from a knife wound, so there's more of a chance of that person being found than a person who was shot and died quickly. Also, for those who can't get their hands on a gun because the test or their background excludes them, they, too, may attempt to smuggle guns into the U.S.. So smuggling is an issue either way. \"if you ban guns you are infringing on Americans rights to keep and bear arms. The laws should be changed in a way that we are not infringing on peoples rights . When you are not allowed to have something you are more likely to have it, thus creating more of a problem.\" The Constitution is not always right; they may not have anticipated these sort of circumstances. Times change. Situations change. Laws change. Is it a bad thing for an amendment to change, especially if it is for the better? \"In most places you do not need a license to own a firearm but you do need one to carry it on your person.\" My mistake. But still, the point remains; it's not going to be changing much. People will STILL die. Because my opponent did not state any arguments in his first speech, my honor demands that this be my last speech. I'd like to weigh the impacts, here. Yes, the Proposition is right in that is would indeed be easier to make the laws more strict, because this is not changing much. People will still die out there of gun wounds. People will still be inflicted with psychological pains, an argument which my opponent has not yet refuted. Pain that marks them for life! Do you think it is easy to get over being shot? The want for revenge you feel when a loved one has been shot? The guilt that comes from surviving while no one else has? Furthermore, the guilt from shooting someone? No! These are irreparable hurts! THIS is the world the Proposition is supporting. A world where nearly everyone can have a gun. A world where people are suffering from such mental problems! To prevent people from dying out there, from hurting, from feeling such unnecessary pain, to BAN GUNS, please vote for the Opposition.\n\nEvidence Con: My opponent, THE_OPINIONATOR, did not state any contentions in his first speech and so I forfeit mine.\n","DiscussionID":"00000032","Title":"Gun laws need to be more strict rather than banning them","CrawlDate":"2016/09/29 06:37:47","URL":"http://www.debate.org/debates/Gun-laws-need-to-be-more-strict-rather-than-banning-them/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":191,"nextID":"00000002","PremiseStartPos":[243],"prevID":"00000000","Premise":["I would like to thank my opponent for accepting this debate, if she decides to do so. I ask that me nor my opponent do not vote fo ourselves and if we fail to do so the other debator should get the better conduct vote. I assurt that gun laws need to be more strict rather than banning altogether. I ask my opponent to start her argument in the next round."],"PremiseEndPos":[599],"ArgumentID":"00000001","Conclusion":"Gun laws need to be more strict rather than banning them","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":191,"nextID":"00000003","PremiseStartPos":[614],"prevID":"00000001","Premise":["Thanks for accepting the terms of this debate and may the best argument win. I would first like to start off by saying that no matter your age you should not be able to walk into a gun shop and buy a gun. Guns do not kill people rather people kill with guns. 1. TEST- People should have to get a test before they buy or use firearms. Think of it as an unlicensed driver behind the weel of a car. You are not shure they know all of the rules and regulations of the road, and they could kill or injure someone. People should be tested on gun safety, how to hold a gun correctly and have there eyes checked. Then a person should have to take a test to insure they are aware of how to be safe and safely operate the weapon. 2. BACKGROUND CHECKS- Background checks should be performed every time an individual buys a weapon. This will ensure the person is always allowed to buy and carry a firearm. This would reduce the around of criminals receiving firearms. 3.STORE CHECKS-The gun shops that buy and sell guns will be routinely checked so that we can ensure that they are following all procedures that are listed above 4. GUN LICENS- Every individual must obtain a gun license so that we can ensure they have past the test stated above just like a drivers license. The license must be renewed and a test given to assure the person can be safe and safely operate a firearm."],"PremiseEndPos":[1985],"ArgumentID":"00000002","Conclusion":"Gun laws need to be more strict rather than banning them","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":191,"nextID":"00000004","PremiseStartPos":[2000],"prevID":"00000002","Premise":["My opponent states I have yet to respond to her arguments. I.\" Guns kill people. How else would people be committing crimes and such? With guns, not only can people kill others, it makes it less dangerous for them [it's not as likely they will get caught, since these are ranged weapons and they can shoot from a distance] to shoot people. Therefore, having a gun has two major outcomes; A) allows people to kill people, and B) indirectly encourages people to kill others, in that it is both easier and safer.\" People have been committing crimes without guns using things such as knives and different fighting methods. There are many ways to catch a shooter of a gun such as comparing shell casings, finger prints and firing residue. the shooter of a gun is almost always caught due to advances in technology. II. \"The Proposition is likely to state that guns are people's protection; without guns, they would not be able to protect themselves from the people that do have guns. Guess what? If people didn't have guns in the first place, they wouldn't be attacking those people, and so those people would not need protection!\" Guns have not always been around. In ancient times people have used rocks, fire, bow and arrow, axes, swords and daggers to protect themselves. People would still be attacked even though you take the guns out of the equation. III. \"More gun access means more deaths. I quote [awesomelibrary.org/guncontrol]: \"The Brady Center argues that when the civilian population has more access to guns, more teens and children die from gun wounds. For example, during a year when over 5,000 teens and children died from gun wounds in the USA, in Great Britain, where gun ownership is very restricted, 19 teens and children died from gun wounds.\" What does this tell us? The more people have guns, the more crimes are committed, the more people are killed. If we abolish the law that allows people to have guns, then the amount of deaths should GREATLY decrease.\" There are other things besides guns that can be used to kill people. It would be impossible to collect every gun in the whole U.S, so that is why laws need to be strengthened and guns not banned. IV. \"The Proposition may state that this a matter of public safety. Yes, it is a matter of public safety, BECAUSE of guns. Despite the fact that there will still be crimes and murder with or without guns, guns are responsible for the majority of these incidents.\" If we ban guns yes the amount of death due to guns will certainly go down. While the deaths by other methods will go up and we would have to ban those other methods as well. It would be much easier to change the laws than to ban guns. There would be an increase in smuggled guns in the U.S so you are creating more of a problem by banning guns. VI. \"The Constitution says in its second amendment: \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\" The Constitution clearly indicates guns are allowed to protect citizens. But now, times are changing, and the circumstances are different. Banning guns will help the safety of citizens even more. We need to make a constitutional amendment.\" This amendment states that \"the right of the people to keep and bear arms, shall not be infringed.\" if you ban guns you are infringing on Americans rights to keep and bear arms. The laws should be changed in a way that we are not infringing on peoples rights . When you are not allowed to have something you are more likely to have it, thus creating more of a problem. \"I'm not sure where you are located, but in most places people DO need gun licenses to own a gun, and they do go through these tests. Basically, what you are proposing is to keep the system the same. Guys, if we keep this system, the same amount of people will be murdered every year. WE NEED TO BAN GUNS.\" In most places you do not need a license to own a firearm but you do need one to carry it on your person. My opponents proposal would only create more of a problem with guns. The banning of all guns and the collection of all guns would be too much work. While changing the gun laws and adding more would be much easier. For these reasons I ask that you vote PRO"],"PremiseEndPos":[6263],"ArgumentID":"00000003","Conclusion":"Gun laws need to be more strict rather than banning them","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":191,"nextID":"00000005","PremiseStartPos":[6278],"prevID":"00000003","Premise":["1.\"First of all, people are not so careless nowadays. They do not drop their guns. They don't leave as much evidence behind. It can be quite difficult to determine exactly where a person was shooting from, find all of the evidence, take it to the labs and go through the whole process to find out who it is. Because people are aware that the technology today can help to trace who the person is, chances are, by the time they DO figure out who it is, the person is long gone.\" In most cases criminals are not as smart as my opponent makes it seem. When someone shoots someone they are in a hurry to get away before they can be seen as the shooter. This means they are likely to be seen running away, leave the weapon used, leave prints or are saw on video. The criminal may be in the criminal data base and that would make them all the more easier to catch. 2.\"You are talking about history. Now is now. Yes, people can still be attacked, but how many people may be in possession of bows, arrows, axes, swords, rocks, and fire? True, there are knives, but the victim will have a much better chance of protecting themselves.\" I was simply stating that there are other methods of committing crimes. Banning guns are not going to stop all the murders, rapes, robbery etc. They may make them go down but the criminal population would find an alternative to guns such as using a knife or smuggling into the country. 3.\"ou also forget that I've stated earlier that banning normal citizens from having guns is different from banning everyone from having guns. The officials and police will still be allowed to have guns for the safety of the public. This gives the police and officials an advantage over anyone who has a mere knife or such.\" A criminal could easily take a cops gun and murder the cop. You are not completely fixing the gun problem. 4.\"It's a lot harder to kill someone without a gun. Using a gun, all you have to do is pull the trigger and BOOM, they're dead. End of story, end of a life. Also, there is less of a chance of someone dying from a knife wound than from a gun wound. Also, people die slower from a knife wound, so there's more of a chance of that person being found than a person who was shot and died quickly. Also, for those who can't get their hands on a gun because the test or their background excludes them, they, too, may attempt to smuggle guns into the U.S.. So smuggling is an issue either way.\" My opponent states that it would be alot harder to kill someone with a gun well I disagree. If you were walking down the street and suddenly someone comes out of nowhere and stabs you in the neck they could his your carotid artery and you could bleed to death in a matter of minutes. My opponent also states that you will have gun smuggling either way, if you ban guns gun smuggling will go up and become more of a problem. 5.\"he Constitution is not always right; they may not have anticipated these sort of circumstances. Times change. Situations change. Laws change. Is it a bad thing for an amendment to change, especially if it is for the better?\" This is still an amendment and you are still infringing on rights of Americans. The amendment is still in effect, because if it were not then Americans wouldn't have guns that needed to be banned. 6.\"'d like to weigh the impacts, here. Yes, the Proposition is right in that is would indeed be easier to make the laws more strict, because this is not changing much. People will still die out there of gun wounds. People will still be inflicted with psychological pains, an argument which my opponent has not yet refuted. Pain that marks them for life! Do you think it is easy to get over being shot? The want for revenge you feel when a loved one has been shot? The guilt that comes from surviving while no one else has? Furthermore, the guilt from shooting someone? No! These are irreparable hurts! THIS is the world the Proposition is supporting. A world where nearly everyone can have a gun. A world where people are suffering from such mental problems! To prevent people from dying out there, from hurting, from feeling such unnecessary pain, to BAN GUNS, please vote for the Opposition.\" There is a mom and her two sons and they are stab wound victims. The two boys do not survive but the mom does. She still feels the pain and sorrow of losing her two boys. Pain will still mark the scar were she was stabbed will still remind her of what happened. She will still have the want for revenge, and she will never forget that she was stabbed. We do not need to ban guns, people will still die and suffer. Banning guns will only make the world safer from guns not from everything or everyone else. I ask that you vote PRO because a gun ban would be harder to enforce, and that the banning of guns would only protect us from guns."],"PremiseEndPos":[11089],"ArgumentID":"00000004","Conclusion":"Gun laws need to be more strict rather than banning them","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":191,"nextID":"00000006","PremiseStartPos":[11104],"prevID":"00000004","Premise":["Hello, THE_OPINIONATOR, and thanks for challenging me to this debate. I'd first like to thank my opponent and assure him that I believe myself to be an honorable person, and will not vote or try to otherwise influence the outcome of this debate by asking others to. If I win, it will be because of my arguments and not because I cheated. First of all, I'd like to start off with a simple statement: Guns should be banned. Why? This is what I will be explaining in my first speech. I. Guns kill people. How else would people be committing crimes and such? With guns, not only can people kill others, it makes it less dangerous for them [it's not as likely they will get caught, since these are ranged weapons and they can shoot from a distance] to shoot people. Therefore, having a gun has two major outcomes; A) allows people to kill people, and B) indirectly encourages people to kill others, in that it is both easier and safer. II. The Proposition is likely to state that guns are people's protection; without guns, they would not be able to protect themselves from the people that do have guns. Guess what? If people didn't have guns in the first place, they wouldn't be attacking those people, and so those people would not need protection! III. More gun access means more deaths. I quote [awesomelibrary.org/guncontrol]: \"The Brady Center argues that when the civilian population has more access to guns, more teens and children die from gun wounds. For example, during a year when over 5,000 teens and children died from gun wounds in the USA, in Great Britain, where gun ownership is very restricted, 19 teens and children died from gun wounds.\" What does this tell us? The more people have guns, the more crimes are committed, the more people are killed. If we abolish the law that allows people to have guns, then the amount of deaths should GREATLY decrease. IV. The Proposition may state that this a matter of public safety. Yes, it is a matter of public safety, BECAUSE of guns. Despite the fact that there will still be crimes and murder with or without guns, guns are responsible for the majority of these incidents. V. I'd also like to point out that we are banning guns from normal citizens. That does not mean we should ban them all together. Police and other security officers [the likes] may still be in possession of a gun. This also means that public safety will be less of an issue, since the culprits will not have guns and the officials will. VI. The Constitution says in its second amendment: \"A well regulated militia, being necessary to the security of a free state, the right of the people to keep and bear arms, shall not be infringed.\" The Constitution clearly indicates guns are allowed to protect citizens. But now, times are changing, and the circumstances are different. Banning guns will help the safety of citizens even more. We need to make a constitutional amendment. I'd also like to ask my opponent to explain how he intends the gun laws to be more strict. Understand, people, that others like you are DYING out there. We cannot allow such an amount of mass deaths to happen. We have ignored it so far, and now we must face the truth; guns are bad. This requires a constitutional amendment. We need to ban guns. Thank you, all of you, once again, and please vote for the Opposition."],"PremiseEndPos":[14428],"ArgumentID":"00000005","Conclusion":"Gun laws need to be more strict rather than banning them","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":191,"nextID":"00000007","PremiseStartPos":[14443],"prevID":"00000005","Premise":["I'd like to, once again, thank you for initiating this debate. I agree with you on one term - no matter your age, you should not be able to walk into a gun shop and buy a gun. In fact, civilians should not be able to walk into a gun shop and buy a gun. I'd like to start off by refuting my opponent's points - \"1. TEST- People should have to get a test before they buy or use firearms. Think of it as an unlicensed driver behind the weel of a car. You are not shure they know all of the rules and regulations of the road, and they could kill or injure someone. People should be tested on gun safety, how to hold a gun correctly and have there eyes checked. Then a person should have to take a test to insure they are aware of how to be safe and safely operate the weapon. \"2. BACKGROUND CHECKS- Background checks should be performed every time an individual buys a weapon. This will ensure the person is always allowed to buy and carry a firearm. This would reduce the around of criminals receiving firearms. \"3.STORE CHECKS-The gun shops that buy and sell guns will be routinely checked so that we can ensure that they are following all procedures that are listed above \"4. GUN LICENS- Every individual must obtain a gun license so that we can ensure they have past the test stated above just like a drivers license. The license must be renewed and a test given to assure the person can be safe and safely operate a firearm.\" I'd like to supply a hypothetical situation in which a person could easily bypass all four of these. The test does not test the person's intentions - merely teaches him safety precautions and how to use the gun. If a criminal were to buy the gun, you would actually be enhancing his ability to use the gun. Is that what you want? If guns were not distributed in the first place, there would be no need to have a gun. If a person was intending to use the gun badly and had not yet done so, they would STILL be able to buy a gun. In addition, there are ways to forge your background. Even \"STORE CHECKS\" and \"GUN LICENS\" would not affect the probability of a person getting through this faulty system. I'm not sure where you are located, but in most places people DO need gun licenses to own a gun, and they do go through these tests. Basically, what you are proposing is to keep the system the same. Guys, if we keep this system, the same amount of people will be murdered every year. WE NEED TO BAN GUNS. Now onto my own point. I'd like to remind everyone that THE_OPINIONATOR has not yet refuted any of my arguments. Let's look at this from a psychological point of view. Shooting a person – what does that mean for the victim? For the murderer? Especially if it was by accident, the emotional stress can be extreme. They may get PTSD – Post traumatic stress disorder. This comes from being exposed to loud, sudden noises, emotional stress from having killed someone, brushing against death, having a loved one killed, and survivor guilt. Do you want people to experience these disorders? Guns in general are accident prone in many ways. How to prevent accidents? BAN GUNS. Thank you, and please vote for the Opposition."],"PremiseEndPos":[17592],"ArgumentID":"00000006","Conclusion":"Gun laws need to be more strict rather than banning them","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":191,"nextID":"00000008","PremiseStartPos":[17607],"prevID":"00000006","Premise":["\"People have been committing crimes without guns using things such as knives and different fighting methods. There are many ways to catch a shooter of a gun such as comparing shell casings, finger prints and firing residue. the shooter of a gun is almost always caught due to advances in technology.\" First of all, people are not so careless nowadays. They do not drop their guns. They don't leave as much evidence behind. It can be quite difficult to determine exactly where a person was shooting from, find all of the evidence, take it to the labs and go through the whole proccess to find out who it is. Because people are aware that the technology today can help to trace who the person is, chances are, by the time they DO figure out who it is, the person is long gone. \"Guns have not always been around. In ancient times people have used rocks, fire, bow and arrow, axes, swords and daggers to protect themselves. People would still be attacked even though you take the guns out of the equation.\" You are talking about history. Now is now. Yes, people can still be attacked, but how many people may be in possession of bows, arrows, axes, swords, rocks, and fire? True, there are knives, but the victim will have a much better chance of protecting themselves. You also forget that I've stated earlier that banning normal citizens from having guns is different from banning everyone from having guns. The officials and police will still be allowed to have guns for the safety of the public. This gives the police and officials an advantage over anyone who has a mere knife or such. \"There are other things besides guns that can be used to kill people. It would be impossible to collect every gun in the whole U.S, so that is why laws need to be strengthened and guns not banned.\" Once again, I have stated that police and protectors of civilians will have guns and can protect the people. Yes, some people will still have guns, but do you want people to have even MORE guns? Do you want these people to keep dying? If we cut off the supply of guns, there's going to be less bad people out there will guns and more protectors with guns. \"If we ban guns yes the amount of death due to guns will certainly go down. While the deaths by other methods will go up and we would have to ban those other methods as well. It would be much easier to change the laws than to ban guns. There would be an increase in smuggled guns in the U.S so you are creating more of a problem by banning guns.\" It's a lot harder to kill someone without a gun. Using a gun, all you have to do is pull the trigger and BOOM, they're dead. End of story, end of a life. Also, there is less of a chance of someone dying from a knife wound than from a gun wound. Also, people die slower from a knife wound, so there's more of a chance of that person being found than a person who was shot and died quickly. Also, for those who can't get their hands on a gun because the test or their background excludes them, they, too, may attempt to smuggle guns into the U.S.. So smuggling is an issue either way. \"if you ban guns you are infringing on Americans rights to keep and bear arms. The laws should be changed in a way that we are not infringing on peoples rights . When you are not allowed to have something you are more likely to have it, thus creating more of a problem.\" The Constitution is not always right; they may not have anticipated these sort of circumstances. Times change. Situations change. Laws change. Is it a bad thing for an amendment to change, especially if it is for the better? \"In most places you do not need a license to own a firearm but you do need one to carry it on your person.\" My mistake. But still, the point remains; it's not going to be changing much. People will STILL die. Because my opponent did not state any arguments in his first speech, my honor demands that this be my last speech. I'd like to weigh the impacts, here. Yes, the Proposition is right in that is would indeed be easier to make the laws more strict, because this is not changing much. People will still die out there of gun wounds. People will still be inflicted with psychological pains, an argument which my opponent has not yet refuted. Pain that marks them for life! Do you think it is easy to get over being shot? The want for revenge you feel when a loved one has been shot? The guilt that comes from surviving while no one else has? Furthermore, the guilt from shooting someone? No! These are irreparable hurts! THIS is the world the Proposition is supporting. A world where nearly everyone can have a gun. A world where people are suffering from such mental problems! To prevent people from dying out there, from hurting, from feeling such unnecessary pain, to BAN GUNS, please vote for the Opposition."],"PremiseEndPos":[22390],"ArgumentID":"00000007","Conclusion":"Gun laws need to be more strict rather than banning them","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":191,"nextID":"00000000","PremiseStartPos":[22405],"prevID":"00000007","Premise":["My opponent, THE_OPINIONATOR, did not state any contentions in his first speech and so I forfeit mine."],"PremiseEndPos":[22508],"ArgumentID":"00000008","Conclusion":"Gun laws need to be more strict rather than banning them","PremiseStance":["Con"]}}]}