{"MetaData":{"Context":"URL: http://www.debate.org/debates/Should-prostitution-be-legalized-in-the-United-States/1/\nCrawl date: 2016/09/29 04:15:59\nOnline Debate: Should prostitution be legalized in the United States | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: This debate will deal if prostitution should be legalized across the United States. Taking aside, whether it should be left up to the individual states or whether it be a federal law etc. I argue that prostitution, a person soliciting him or herself to another for services that are sexually is no more immoral than one soliciting any other services, be it yard work, plumbing, or a painter. It is a consumer's money for a producer's time and service. I also argue that whether one believes it is immoral or not, should that person's opinion control the entire country, as an example if one believes that interracial marriage is immoral they are entitled to their opinion however they don't have the right to trample other's marriage rights. Prostitution is Malum prohibitum as opposed to Malum en se. It is evil because certain law-makers have decided it is evil (similar to consuming alcohol in the 1920s) as opposed to Malum en se, it is evil in itself, (it has almost always been evil, e.g. murder) I would also argue that legalizing prostitution would allow for more checks, balances and controls in the business than are regulated. There will be much, much less people that are trafficked in from other countries to be forced into prostitution, and if they are they will be caught/saved sooner. My evidence supporting this is look at the amount of people at Wal-Mart or anyone working for a company that is somewhat reputable. How many of those people look like they are being forced to work there? Also to have any job in the United States you already need to provide multiple forms of identification including citizenship. By having more laws and inspectors check in on this, like they do at other legal business practices, it would make the entire business safer. Another point to make about this is how heavily the porn industry is controlled, on any pornography (dvd online versions simply edit this out for viewers sake) there is a disclaimer stating that every person in the video is willing and is 18 and no one was forced etc. etc. And this industries are extraordinarily scrutinized to minimize any possible issues. Overall points. Legalizing prostitution would make it safer for all involved. It isn't morally wrong, if you believe it is you don't have the right to impose this belief on others.\n\nEvidence Pro: I would like to thank you for accepting this debate and stimulating this topic and my brain. Excuse my lack of clarity/poor grammar etc. My first initiating or participating in a debate on this website. In regards to your first point I would like to see the study that you are citing. I would also like to point out that people can work any job to earn money for drugs, and whether you support drugs or not, we shouldn't prohibit a certain job because people in the business were drug addicts. Many people who work in smoke shops are tobacco addicts, coffee shops caffeine addicts. Although I understand these drugs aren't illegal my point being just because certain people use jobs to finance their unhealthy habits doesn't mean we should make the job illegal. \"30% of women involved in a study of street prostitution stated that they got involved in drugs after getting in the business. (psychologists believe this is to cope with trauma involved with prostitution).\" Source of statistic? which psychologists? also assuming that is true, many jobs turn people to drugs or alcohol to cope, many, many jobs require employees to drink caffeine (a drug) in order to keep up with their job and cope with the responsibilities. And then many people drink after their shift, to cope with the exhaustion of the work. closing point on this rebuttal, why people work a job, what they do with the money, how hard/traumatizing the job is, shouldn't dictate whether we should make the job legal or not, job is to hard or traumatizing? get another one, why many people don't go into the military, which also turns many people to drugs, albeit prescription ones. For your second point, STD would spread from one prostitute to another willing individual just as easily as it would from one consenting individual who met another consenting individual at a bar. If anything, the rules regarding prostitution would be very clearly laid out and no legitimate company wouldn't want to risk their employees dying or passing along diseases. Similar to how many companies currently have health codes, for example many kitchen jobs require employees to wear non-slip shoes, or to wear gloves when working with knives, or employees are required to wash hands upon leaving restroom. Many companies would require all sexual encounters to include protection at least for the long-term benefit of their employees which translates to bigger profits. As well as rigorous testing with the employees to prevent any spread that would look bad on their business. All of that aside I argue that if STDs are transmitted between to consenting adults it is no different than a man taking a woman out to dinner a show and an all around expensive date which then leads the woman to want to go to bed with him, and they transmit diseases to one another. Some may say that's immoral but to make sexual intercourse between consenting adults illegal infringes upon our basic rights of pursuit of happiness. My point of Loving v. Virginia was to highlight that although the supreme court realized that although some might not agree with interracial marriage, it is a constitutional right to a pursuit of happiness that shouldn't be infringed upon. (similar to recent same-sex rulings in Virginia). The American way and rights that were each entitled are that we have right to our own opinions however in terms of legality we should not infringe upon others constitutional rights (I know that was horribly written I hope you get my point) As for your point of violence in prostitution first I would appreciate a source. Second my argument isn't that prostitution is safe, my argument is that prostitution currently being illegal is unsafe, and legalizing it would make it safer. I did this by relating the sex trafficking aspect and asking how many people in service industries, for example massage business, (involve sensual touching of skin to skin privately) are assaulted with weapons? how many people at wal-mart are beaten by their boss. Those statistics support my view of prostitution in its current form with no checks or balances is unsafe. currently there are 24 legal brothels in Nevada, please look at interviews with those employees and see if they complain about suicide or being beaten etc. I would also like to point out that resorting to name calling or underhandedly calling into doubt my morals by saying that you feel I value sexual desires over safety of people, will not move this debate forward and instead shows what you need to do to win this debate. Valuable point by stating that is immoral because most believe it to be wrong, my point is that is it inherently wrong, or have we been raised to believe it is wrong, similar to interracial marriage and will people eventually realize that is doesn't cause harm so it isn't immoral.\n\nEvidence Pro: For you first point, you are correct I did point to certain jobs that lead to unhealthy habits as opposed to illegal habits, but as readers and voters will understand, illegal habits aren't inherently wrong because they are illegal, illegal habits are made illegal because of what they cause/do. Drug use leads to an unhealthy live-style and negative health effects etc. similar to an unhealthy lifestyle. My point being we shouldn't be using claiming something is bad because it contributes to illegal activity, that some might not think is particularly bad. If we were to assume all illegal activities are bad then this argument (over an illegal activity) would be pointless. I would also like to point out that you pointed out drug use as a reason to get into or an effect of the job. You also did not state ILLEGAL drug use, so I wasn't aware that you were talking about illegal drug-use, and any survey/interview asking prostitute about drug use would include the use of legal drugs such as caffeine, alcohol and tobacco. Even if we agreed taking illegal drugs is wrong, it doesn't change the fact that other jobs don't lead to illegal drug use and i propose that any interviews of current employees working in legal jobs would be much less inclined to admit illegal habits than people illegally working prostitutes that have already come clean with their illegal habits and jobs. Finally (on this point) this still all relates to prostitution while it is illegal, where I argue it isn't true and that any interviews and sources should only be valid if they are taken from currently legal prostitutes as those will be the ones that pertain to my argument, that legalizing it will overall make it safer. Thank you for bringing up the doctor point, about how legally practicing doctors must/do take extreme precautions in the name of safety and health. As opposed to an illegally operating doctors, e.g. one who is illegally performing abortions, are more than likely not taking all the same safety precautions.( ( ( Doctors are much much more likely to pick up a disease because they deal with sick people consistently a prostitute doesn't consistently deal with infected people. And even so doctors still take these extreme measures and do a great job of protecting themselves and others. So by making prostitution legal many many more checks would be involved, I will link a few (unbiased) interviews with legal prostitutes working in Nevada where many of them say they must be routinely check, where they have a right to decline a client at any time for any reason, (including a possible std), where they must legally be tested at least once a month, and are breaking the law if they operating with an infection, committing malpractice, AND the owner must cover all the medical expenses of whoever would become infected by the prostitute. These are current laws on the book. Doesn't that sound like a much much safer solution, than having no checks whatsoever? Here is a link to HIV rates in illegal prostitutes. following is a link to HIV rates in legal prostitutes where it is mandatory that they must be checked. \"since the opening of legal brothels in Nevada, there has never been a reported case of HIV or AIDS\" Also all of your quotes are coming from a biased journalist NOT A WORKING PROSTITUTE. I will link interviews with prostitutes, because I feel they are less likely to be biased than a journalist who has no experience working as a prostitute legally. As a final point, despite the hardships that these women may or may not suffer, in the United States of America, freedom is treasured to its highest as well the right to life, liberty and the pursuit of happiness. If these women want to explore their life, and exercises there liberty and their pursuit of happiness, without causing harm to others, they should not be punished for doing so.\n\nEvidence Con: I accept your challenge and am excited to debate with you. To begin, I would like to make a few definitions: -Prostitution: The act of having sex in exchange for money -Moral: considered right or good by most people -Safe: not involving or likely to involve danger, harm, or loss. I will negate the resolution that prostitution should be legalized across the United States. My first contention is the relation between drugs and prostitution. Prostitution and drugs have two main relations. One relation is the dependency of prostitution to continue drug habits. The second is the cause of prostitution on the drug industry. Both are equally catastrophic. In regards to the first relation, one of the main reasons that women get into the prostitution industry is to support drug addictions. It is estimated that 55% of women prostitutes were drug addicts before becoming prostitutes. Legalizing prostitution would make this avenue an obvious choice for drug addicts looking for more money to support their habits. In regards to the second relation, 30% of women involved in a study of street prostitution stated that they got involved in drugs after getting in the business (psychologists believe this is to cope with the trauma involved with prostitution). 15% of the women in the same study said that they became prostitutes and started using recreational drugs at the same time. My second contention is the spread of STD\"s. STD\"s, also known as sexually transmitted diseases, are the cause of millions of deaths worldwide yearly. In the year 2006, 2.9 million people died from STD\"s. STD\"s are most common in prostitutes and people involved in the sex industry. This is a clear reason why legalization of prostitution would be dangerous and detrimental to society because it would increase the spread of STD\"s across the United States. My third contention is domestic violence. In a study of adult prostitutes, it was reported that 82% of them had been physically assaulted. 83% had been threatened with a weapon. 68% had been raped while working as a prostitute. Another study reported that 50% of prostitutes reported that they were being kidnapped by pimps; 76% were beaten by pimps; and 79% were beaten by customers. To finish the statistics of physical abuse on prostitutes, one final study reported that 15% of all suicide victims are prostitutes and 75% of prostitutes attempted suicide. If these obvious, blatant statistics are not extremely clear reasons to why legalization of prostitution would not be beneficial to anyone, then I feel my opponent values sexual desires over the overall safety of people. I will now refute my opponent\"s points, although they were not clearly defined. Since he did not give a clear distinction of contentions, I will take some main points that I was able to draw from it and I will refute them. 1.Prostitution is not immoral. Even if it were immoral on a personal level, it should not dictate the entire country\"s decision. 2.Legalizing prostitution would decrease the amount of trafficking from other countries. In regards to my opponent\"s first contention. Let me refer you to the beginning of my argument when I clarified the definition of moral. Moral is determined by the general population. My opponent used the example of interracial marriage. He stated that if a person believed that interracial marriage was immoral, then it should not dictate the country\"s decision. Well, to refute that point, I would like to direct my opponent to look up the 1967 court case Loving v Virginia. That was the first time interracial marriage was made federally legal. Now one may ask, if opinions don\"t matter, then why was it ever illegal? The answer to that question is simple. Prior to 1967, interracial marriage was not acceptable and considered immoral. After civil rights movements, people started realizing that interracial marriage was not only acceptable, but also moral. Laws can be made based of morality since morality is based on the opinion of the general population. On the same note, prostitution is not moral because the general population considers it wrong. In regards to my second point. The resolution of the debate is talking about legalization of prostitution in the United States. Let me repeat, in the United States. So trafficking in other countries should be disregarded. So the only thing we can discuss is prostitution in the United States. I believe that my opponent was trying to imply that prostitutes get trafficked into the United States. I think my opponent is confusing prostitution with the sex slave industry. As well, it is very difficult to illegally smuggle anyone into the United States, so unless my opponent can provide statistics about the illegal importing of human beings for prostitution, then I believe the voters can disregard this point.\n\nEvidence Con: Don\"t worry too much about grammar, I am not a grammar nazi and am not perfect when it comes to grammar as well. I just like well thought out arguments that give me a good debate, which you have provided. To respond to your rebuttal against my first contention, I will provide my sources at the end of this session. I apologize for not originally getting those to you, normally I would in any other debate, but it slipped my mind as well as I saw no sources provided by you so I figured they were not necessary. Nonetheless, I will provide these sources at the end. To address your point about the smoke shop/coffee shop analogy. There is one major flaw in your argument. You stated \"just because people use jobs to finance their unhealthy habits doesn\"t mean we should make the job illegal\". I must say, I completely agree with you on that point, but the difference between what I was saying and what you believed I was saying is extremely different. I said we should stop a certain job because it is funding people\"s ILLEGAL habits. Unhealthy habits are a decision that people in America are legally allowed to make, illegal habits are not. You also stated that many jobs require employees to drink caffeine in order to keep up with their job and cope. I do not believe this to be true. I believe it is society that makes people turn to caffeine in order to keep up with their job. An example of this, is that I have been drinking coffee regularly since the 8th grade. I had no job, all I had was school, and school came easy to me. So I did not need the coffee, but any time I was tired, the common thing for anyone to say was \"drink a cup of coffee.\" The difference between this and the relationship between drugs and prostitution, is that I have never been stressed and someone tell me \"well just go do some drugs.\" To close on your rebuttal, prostitution causes use of illegal drugs to cope with the excessive trauma involved with their job. Not just the constant sexual intercourse with random strangers, but also the abuse, and mistreating they take from customers and pimps. You mentioned how the STD\"s spread the same as between two individuals who met at a bar or anywhere else for that matter, but you missed the point of what I was trying to get at. Let me use doctors as an example. When they treat people, they use excessive precaution, such as masks and gloves and washing their hands repeatedly. Even when the case is the flu or something to that extent, they would still take a lot of precaution. That is not because doctors are a different breed of human that are much less immune to diseases, but it is because they are continuously dealing with a lot of people who have different illnesses. If they pick up one of them they could give it to hundreds of people, and their likelihood of picking one up is much much higher than anyone else. Prostitution is exactly the same. Prostitutes aren\"t more or less likely to pick up an STD on a case-to-case basis, but they get with hundreds of people in a small period of time and they are more likely to pick one up and transmit it to another person before finding out they had it than someone who maybe gets with a different person every week. And again, the difference between interracial marriage is that it isn\"t used to fund illegal habits, it doesn\"t spread life threatening diseases, and it isn\"t associated with extremely common domestic violence. Again, I will provide the sources from my statistics that I stated earlier, at the end of this rebuttal. As you suggested, I took the time to go research interviews about these 24 legal brothels in Nevada, and the results were quite interesting. I would like to direct you to this website to see what I found: I would like to provide a few quotes from that article that I felt were important, although the entire article is quite interesting. -\"The brothel prostitutes often live in prison-like conditions, locked in or forbidden to leave.\" -\"\"[The brothels] look like wide trailers with barbed wire around them- little jails.\" The rooms all have panic buttons, but many women told [`the interviewer] that they had experienced violent and sexual abuse from the customers and pimps.\" -\"\"When prostitution is considered a legal job instead of a human rights violation,\" says Farley,`why should the state offer services for escape?\" More than 80% of those interviewed told Farley they wanted to leave prostitution.\" And in regards to your accusations of \"name calling\", I was not implying that you value sexual desires over the safety of people. It was a conditional statement starting with \"if\", you should know what that means. Citations: Page 2, first paragraph end of the paragraph. This reference was the one that I pulled for the psychologists\" reasoning behind the relationship between prostitution and drugs. This was where I got the statistics behind the relationship between prostitution and drugs. I got many statistics from this reference, I would greatly encourage you to read it, is very enlightening\n","DiscussionID":"00000079","Title":"Should prostitution be legalized in the United States","CrawlDate":"2016/09/29 04:15:59","URL":"http://www.debate.org/debates/Should-prostitution-be-legalized-in-the-United-States/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":192,"nextID":"00000002","PremiseStartPos":[244],"prevID":"00000000","Premise":["This debate will deal if prostitution should be legalized across the United States. Taking aside, whether it should be left up to the individual states or whether it be a federal law etc. I argue that prostitution, a person soliciting him or herself to another for services that are sexually is no more immoral than one soliciting any other services, be it yard work, plumbing, or a painter. It is a consumer's money for a producer's time and service. I also argue that whether one believes it is immoral or not, should that person's opinion control the entire country, as an example if one believes that interracial marriage is immoral they are entitled to their opinion however they don't have the right to trample other's marriage rights. Prostitution is Malum prohibitum as opposed to Malum en se. It is evil because certain law-makers have decided it is evil (similar to consuming alcohol in the 1920s) as opposed to Malum en se, it is evil in itself, (it has almost always been evil, e.g. murder) I would also argue that legalizing prostitution would allow for more checks, balances and controls in the business than are regulated. There will be much, much less people that are trafficked in from other countries to be forced into prostitution, and if they are they will be caught/saved sooner. My evidence supporting this is look at the amount of people at Wal-Mart or anyone working for a company that is somewhat reputable. How many of those people look like they are being forced to work there? Also to have any job in the United States you already need to provide multiple forms of identification including citizenship. By having more laws and inspectors check in on this, like they do at other legal business practices, it would make the entire business safer. Another point to make about this is how heavily the porn industry is controlled, on any pornography (dvd online versions simply edit this out for viewers sake) there is a disclaimer stating that every person in the video is willing and is 18 and no one was forced etc. etc. And this industries are extraordinarily scrutinized to minimize any possible issues. Overall points. Legalizing prostitution would make it safer for all involved. It isn't morally wrong, if you believe it is you don't have the right to impose this belief on others."],"PremiseEndPos":[2557],"ArgumentID":"00000001","Conclusion":"Should prostitution be legalized in the United States","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":192,"nextID":"00000003","PremiseStartPos":[2572],"prevID":"00000001","Premise":["I would like to thank you for accepting this debate and stimulating this topic and my brain. Excuse my lack of clarity/poor grammar etc. My first initiating or participating in a debate on this website. In regards to your first point I would like to see the study that you are citing. I would also like to point out that people can work any job to earn money for drugs, and whether you support drugs or not, we shouldn't prohibit a certain job because people in the business were drug addicts. Many people who work in smoke shops are tobacco addicts, coffee shops caffeine addicts. Although I understand these drugs aren't illegal my point being just because certain people use jobs to finance their unhealthy habits doesn't mean we should make the job illegal. \"30% of women involved in a study of street prostitution stated that they got involved in drugs after getting in the business. (psychologists believe this is to cope with trauma involved with prostitution).\" Source of statistic? which psychologists? also assuming that is true, many jobs turn people to drugs or alcohol to cope, many, many jobs require employees to drink caffeine (a drug) in order to keep up with their job and cope with the responsibilities. And then many people drink after their shift, to cope with the exhaustion of the work. closing point on this rebuttal, why people work a job, what they do with the money, how hard/traumatizing the job is, shouldn't dictate whether we should make the job legal or not, job is to hard or traumatizing? get another one, why many people don't go into the military, which also turns many people to drugs, albeit prescription ones. For your second point, STD would spread from one prostitute to another willing individual just as easily as it would from one consenting individual who met another consenting individual at a bar. If anything, the rules regarding prostitution would be very clearly laid out and no legitimate company wouldn't want to risk their employees dying or passing along diseases. Similar to how many companies currently have health codes, for example many kitchen jobs require employees to wear non-slip shoes, or to wear gloves when working with knives, or employees are required to wash hands upon leaving restroom. Many companies would require all sexual encounters to include protection at least for the long-term benefit of their employees which translates to bigger profits. As well as rigorous testing with the employees to prevent any spread that would look bad on their business. All of that aside I argue that if STDs are transmitted between to consenting adults it is no different than a man taking a woman out to dinner a show and an all around expensive date which then leads the woman to want to go to bed with him, and they transmit diseases to one another. Some may say that's immoral but to make sexual intercourse between consenting adults illegal infringes upon our basic rights of pursuit of happiness. My point of Loving v. Virginia was to highlight that although the supreme court realized that although some might not agree with interracial marriage, it is a constitutional right to a pursuit of happiness that shouldn't be infringed upon. (similar to recent same-sex rulings in Virginia). The American way and rights that were each entitled are that we have right to our own opinions however in terms of legality we should not infringe upon others constitutional rights (I know that was horribly written I hope you get my point) As for your point of violence in prostitution first I would appreciate a source. Second my argument isn't that prostitution is safe, my argument is that prostitution currently being illegal is unsafe, and legalizing it would make it safer. I did this by relating the sex trafficking aspect and asking how many people in service industries, for example massage business, (involve sensual touching of skin to skin privately) are assaulted with weapons? how many people at wal-mart are beaten by their boss. Those statistics support my view of prostitution in its current form with no checks or balances is unsafe. currently there are 24 legal brothels in Nevada, please look at interviews with those employees and see if they complain about suicide or being beaten etc. I would also like to point out that resorting to name calling or underhandedly calling into doubt my morals by saying that you feel I value sexual desires over safety of people, will not move this debate forward and instead shows what you need to do to win this debate. Valuable point by stating that is immoral because most believe it to be wrong, my point is that is it inherently wrong, or have we been raised to believe it is wrong, similar to interracial marriage and will people eventually realize that is doesn't cause harm so it isn't immoral."],"PremiseEndPos":[7384],"ArgumentID":"00000002","Conclusion":"Should prostitution be legalized in the United States","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":192,"nextID":"00000004","PremiseStartPos":[7399],"prevID":"00000002","Premise":["For you first point, you are correct I did point to certain jobs that lead to unhealthy habits as opposed to illegal habits, but as readers and voters will understand, illegal habits aren't inherently wrong because they are illegal, illegal habits are made illegal because of what they cause/do. Drug use leads to an unhealthy live-style and negative health effects etc. similar to an unhealthy lifestyle. My point being we shouldn't be using claiming something is bad because it contributes to illegal activity, that some might not think is particularly bad. If we were to assume all illegal activities are bad then this argument (over an illegal activity) would be pointless. I would also like to point out that you pointed out drug use as a reason to get into or an effect of the job. You also did not state ILLEGAL drug use, so I wasn't aware that you were talking about illegal drug-use, and any survey/interview asking prostitute about drug use would include the use of legal drugs such as caffeine, alcohol and tobacco. Even if we agreed taking illegal drugs is wrong, it doesn't change the fact that other jobs don't lead to illegal drug use and i propose that any interviews of current employees working in legal jobs would be much less inclined to admit illegal habits than people illegally working prostitutes that have already come clean with their illegal habits and jobs. Finally (on this point) this still all relates to prostitution while it is illegal, where I argue it isn't true and that any interviews and sources should only be valid if they are taken from currently legal prostitutes as those will be the ones that pertain to my argument, that legalizing it will overall make it safer. Thank you for bringing up the doctor point, about how legally practicing doctors must/do take extreme precautions in the name of safety and health. As opposed to an illegally operating doctors, e.g. one who is illegally performing abortions, are more than likely not taking all the same safety precautions.( ( ( Doctors are much much more likely to pick up a disease because they deal with sick people consistently a prostitute doesn't consistently deal with infected people. And even so doctors still take these extreme measures and do a great job of protecting themselves and others. So by making prostitution legal many many more checks would be involved, I will link a few (unbiased) interviews with legal prostitutes working in Nevada where many of them say they must be routinely check, where they have a right to decline a client at any time for any reason, (including a possible std), where they must legally be tested at least once a month, and are breaking the law if they operating with an infection, committing malpractice, AND the owner must cover all the medical expenses of whoever would become infected by the prostitute. These are current laws on the book. Doesn't that sound like a much much safer solution, than having no checks whatsoever? Here is a link to HIV rates in illegal prostitutes. following is a link to HIV rates in legal prostitutes where it is mandatory that they must be checked. \"since the opening of legal brothels in Nevada, there has never been a reported case of HIV or AIDS\" Also all of your quotes are coming from a biased journalist NOT A WORKING PROSTITUTE. I will link interviews with prostitutes, because I feel they are less likely to be biased than a journalist who has no experience working as a prostitute legally. As a final point, despite the hardships that these women may or may not suffer, in the United States of America, freedom is treasured to its highest as well the right to life, liberty and the pursuit of happiness. If these women want to explore their life, and exercises there liberty and their pursuit of happiness, without causing harm to others, they should not be punished for doing so."],"PremiseEndPos":[11263],"ArgumentID":"00000003","Conclusion":"Should prostitution be legalized in the United States","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":192,"nextID":"00000005","PremiseStartPos":[11278],"prevID":"00000003","Premise":["I accept your challenge and am excited to debate with you. To begin, I would like to make a few definitions: -Prostitution: The act of having sex in exchange for money -Moral: considered right or good by most people -Safe: not involving or likely to involve danger, harm, or loss. I will negate the resolution that prostitution should be legalized across the United States. My first contention is the relation between drugs and prostitution. Prostitution and drugs have two main relations. One relation is the dependency of prostitution to continue drug habits. The second is the cause of prostitution on the drug industry. Both are equally catastrophic. In regards to the first relation, one of the main reasons that women get into the prostitution industry is to support drug addictions. It is estimated that 55% of women prostitutes were drug addicts before becoming prostitutes. Legalizing prostitution would make this avenue an obvious choice for drug addicts looking for more money to support their habits. In regards to the second relation, 30% of women involved in a study of street prostitution stated that they got involved in drugs after getting in the business (psychologists believe this is to cope with the trauma involved with prostitution). 15% of the women in the same study said that they became prostitutes and started using recreational drugs at the same time. My second contention is the spread of STD\"s. STD\"s, also known as sexually transmitted diseases, are the cause of millions of deaths worldwide yearly. In the year 2006, 2.9 million people died from STD\"s. STD\"s are most common in prostitutes and people involved in the sex industry. This is a clear reason why legalization of prostitution would be dangerous and detrimental to society because it would increase the spread of STD\"s across the United States. My third contention is domestic violence. In a study of adult prostitutes, it was reported that 82% of them had been physically assaulted. 83% had been threatened with a weapon. 68% had been raped while working as a prostitute. Another study reported that 50% of prostitutes reported that they were being kidnapped by pimps; 76% were beaten by pimps; and 79% were beaten by customers. To finish the statistics of physical abuse on prostitutes, one final study reported that 15% of all suicide victims are prostitutes and 75% of prostitutes attempted suicide. If these obvious, blatant statistics are not extremely clear reasons to why legalization of prostitution would not be beneficial to anyone, then I feel my opponent values sexual desires over the overall safety of people. I will now refute my opponent\"s points, although they were not clearly defined. Since he did not give a clear distinction of contentions, I will take some main points that I was able to draw from it and I will refute them. 1.Prostitution is not immoral. Even if it were immoral on a personal level, it should not dictate the entire country\"s decision. 2.Legalizing prostitution would decrease the amount of trafficking from other countries. In regards to my opponent\"s first contention. Let me refer you to the beginning of my argument when I clarified the definition of moral. Moral is determined by the general population. My opponent used the example of interracial marriage. He stated that if a person believed that interracial marriage was immoral, then it should not dictate the country\"s decision. Well, to refute that point, I would like to direct my opponent to look up the 1967 court case Loving v Virginia. That was the first time interracial marriage was made federally legal. Now one may ask, if opinions don\"t matter, then why was it ever illegal? The answer to that question is simple. Prior to 1967, interracial marriage was not acceptable and considered immoral. After civil rights movements, people started realizing that interracial marriage was not only acceptable, but also moral. Laws can be made based of morality since morality is based on the opinion of the general population. On the same note, prostitution is not moral because the general population considers it wrong. In regards to my second point. The resolution of the debate is talking about legalization of prostitution in the United States. Let me repeat, in the United States. So trafficking in other countries should be disregarded. So the only thing we can discuss is prostitution in the United States. I believe that my opponent was trying to imply that prostitutes get trafficked into the United States. I think my opponent is confusing prostitution with the sex slave industry. As well, it is very difficult to illegally smuggle anyone into the United States, so unless my opponent can provide statistics about the illegal importing of human beings for prostitution, then I believe the voters can disregard this point."],"PremiseEndPos":[16106],"ArgumentID":"00000004","Conclusion":"Should prostitution be legalized in the United States","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":192,"nextID":"00000000","PremiseStartPos":[16121],"prevID":"00000004","Premise":["Don\"t worry too much about grammar, I am not a grammar nazi and am not perfect when it comes to grammar as well. I just like well thought out arguments that give me a good debate, which you have provided. To respond to your rebuttal against my first contention, I will provide my sources at the end of this session. I apologize for not originally getting those to you, normally I would in any other debate, but it slipped my mind as well as I saw no sources provided by you so I figured they were not necessary. Nonetheless, I will provide these sources at the end. To address your point about the smoke shop/coffee shop analogy. There is one major flaw in your argument. You stated \"just because people use jobs to finance their unhealthy habits doesn\"t mean we should make the job illegal\". I must say, I completely agree with you on that point, but the difference between what I was saying and what you believed I was saying is extremely different. I said we should stop a certain job because it is funding people\"s ILLEGAL habits. Unhealthy habits are a decision that people in America are legally allowed to make, illegal habits are not. You also stated that many jobs require employees to drink caffeine in order to keep up with their job and cope. I do not believe this to be true. I believe it is society that makes people turn to caffeine in order to keep up with their job. An example of this, is that I have been drinking coffee regularly since the 8th grade. I had no job, all I had was school, and school came easy to me. So I did not need the coffee, but any time I was tired, the common thing for anyone to say was \"drink a cup of coffee.\" The difference between this and the relationship between drugs and prostitution, is that I have never been stressed and someone tell me \"well just go do some drugs.\" To close on your rebuttal, prostitution causes use of illegal drugs to cope with the excessive trauma involved with their job. Not just the constant sexual intercourse with random strangers, but also the abuse, and mistreating they take from customers and pimps. You mentioned how the STD\"s spread the same as between two individuals who met at a bar or anywhere else for that matter, but you missed the point of what I was trying to get at. Let me use doctors as an example. When they treat people, they use excessive precaution, such as masks and gloves and washing their hands repeatedly. Even when the case is the flu or something to that extent, they would still take a lot of precaution. That is not because doctors are a different breed of human that are much less immune to diseases, but it is because they are continuously dealing with a lot of people who have different illnesses. If they pick up one of them they could give it to hundreds of people, and their likelihood of picking one up is much much higher than anyone else. Prostitution is exactly the same. Prostitutes aren\"t more or less likely to pick up an STD on a case-to-case basis, but they get with hundreds of people in a small period of time and they are more likely to pick one up and transmit it to another person before finding out they had it than someone who maybe gets with a different person every week. And again, the difference between interracial marriage is that it isn\"t used to fund illegal habits, it doesn\"t spread life threatening diseases, and it isn\"t associated with extremely common domestic violence. Again, I will provide the sources from my statistics that I stated earlier, at the end of this rebuttal. As you suggested, I took the time to go research interviews about these 24 legal brothels in Nevada, and the results were quite interesting. I would like to direct you to this website to see what I found: I would like to provide a few quotes from that article that I felt were important, although the entire article is quite interesting. -\"The brothel prostitutes often live in prison-like conditions, locked in or forbidden to leave.\" -\"\"[The brothels] look like wide trailers with barbed wire around them- little jails.\" The rooms all have panic buttons, but many women told [`the interviewer] that they had experienced violent and sexual abuse from the customers and pimps.\" -\"\"When prostitution is considered a legal job instead of a human rights violation,\" says Farley,`why should the state offer services for escape?\" More than 80% of those interviewed told Farley they wanted to leave prostitution.\" And in regards to your accusations of \"name calling\", I was not implying that you value sexual desires over the safety of people. It was a conditional statement starting with \"if\", you should know what that means. Citations: Page 2, first paragraph end of the paragraph. This reference was the one that I pulled for the psychologists\" reasoning behind the relationship between prostitution and drugs. This was where I got the statistics behind the relationship between prostitution and drugs. I got many statistics from this reference, I would greatly encourage you to read it, is very enlightening"],"PremiseEndPos":[21151],"ArgumentID":"00000005","Conclusion":"Should prostitution be legalized in the United States","PremiseStance":["Con"]}}]}