{"MetaData":{"Context":"URL: http://www.debate.org/debates/Groups-Cults-applying-BITE-mind-control-techniques-should-be-Banned/1/\nCrawl date: 2016/09/29 05:25:39\nOnline Debate: Groups/Cults applying BITE mind control techniques should be Banned! | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: There are many groups in society that practice some or all of the Behavior control, Information control, Thought control, Emotion control, Mind Control Techniques. Cults well known to have been implementing the BITE method to convert and keep believers are the Mormons and the Jehovah Witnesses, though Scientology and even many Evangelical Christian Cults, such as some Pentecostal Cults and Creationist Cults can also be found to practice some of or all of the aspects of the BITE model. The BITE model was developed by Steven Hassan href=\" target=\"blank\"> is an excerpt from the Cult Awareness and Information Library which I have shortened, but I've supplied the source so you can read more detail: \" Four Aspects of Mind Control (as it relates to people in cults) 1) INFORMATION CONTROL: Important information which is available to the general public is withheld from members and potential members. Deception is the basic feature of all cult recruitment. It is also what keeps people inside cults. Information is one of the best weapons against cults. 2) THOUGHT CONTROL: \"Truth\" and reality are distorted for those inside the group by subtly changing the definitions of common terms with new meanings through the use of code words, cliché's, and slogans. Different words make the members feel special and separate from outsiders. These different words confuse outsiders who want to understand what the group believes and talks about. The change in definitions of significant words keeps even the members from understanding their own beliefs. Leaders of cults repress questions by conditioning their members to employ \"thought-stopping\" statements, prayers, hymns, Bible verses, mantras, tongues or rituals to drown out doubt, questions, anxiety or uncertainty. \"I can't think about that.\" \"How can you question (the leaders) after all they have done?\" etc. The intention is to stop questions regarding the system or leaders. 3) EMOTION CONTROL: Guilt, fear and shame are projected onto the members, prompting blame toward themselves for their depression, lack of understanding, anxiety, or inability to cope, rather than examining the leaders, the group's policies, history, doctrines, scandals, and at times, even crimes. Phobic attitudes or behaviors are sometimes noticeable when attempts are made to converse with members regarding their belief in the group or its leaders. Fear, anger, rage or repetitious statements which only go in circles keep the members from thinking through to any rational conclusions. Fear of confrontation with family is common, resulting in very few people being rescued. 4) BEHAVIOR CONTROL: Tight control of behavior secures the leaders' position of authority and importance. The behavior control impresses members and outsiders to view the group as especially spiritual or successful. The leaders link the required behavior to their special \"revelation\" of a text of scripture. However the required behaviors are usually superficial controls, affecting appearances and outward activity rather than inward character. These can include grooming, daily activities, career choices, clothing, specific technology, posture, speech mannerisms, food choices, recreation, education, even decisions about marriage, sex and children. (They usually do not deter moral sin.) If a person does not conform, he may be urged to become more like an older group member; to follow the leaders' \"example\". OBEDIENCE TO THE HUMAN LEADERS IS THE MOST IMPORTANT LESSON TO LEARN. The leaders cannot totally control one's inner thoughts, but if they can command behavior, hearts and minds will usually follow. The behavior control isolates the members from society even more effectively. Source: Notice that mantras and speaking in tongues are used to control (block) thinking. Since speaking in tongues is completely bogus, as it has nothing whatsoever to do with the story of the original Pentecostal experience, it is strictly a thought blocking (control) exercise. So all cults that practice speaking in tongues should automatically come under suspicion. Creationist cults often use thought control tactics, such as demonstrated on the teaching literature for home schools proposed by Answers-in-Genesis where a False Analogy is used to connect Evolution with Evil and Creationism with Good, so children are deliberately taught that Evolution equates to Evil so if you believe in Evolution you are following Evil and if you believe in Creation you are following the Goodness of God. So Creationism is deliberately deceiving children into a Black & White, world of False Dichotomies. Which is evidently part of the BITE mind control technique by deceiving parents into thinking they are doing the right thing in practicing such mind control techniques on their children. Such is the Cult tactics of Answers-in-Genesis to keep a new generation of suckers that they can sell their nonsense to. I strongly believe that all religious groups should be investigated for such practices and depending on the severity of their use of BITE techniques apply one of the following: 1: Sever use of BITE: Charged with Mental Abuse of their constituents and banned from the nation. 2: Moderate use of BITE: Banned from using such practices and undergo regular audits on their practices. 3: Partial use of BITE: Warning to stop such practices and be forced to allow regular auditing of practices. Though some cults have had exposed their own practices of BITE which has been most helpful to Mental Health professionals. The Mormon Model: Jehovah Witness Model: href=\" target=\"blank\"> href=\" target=\"blank\"> Recovering from Scientology link: Earth Creationism: (From a Christian Link) a free thinking site: Ham instructing Parents to use Mind Control techniques on Children, including corporal punishment. href=\" target=\"blank\"> href=\" target=\"blank\"> href=\" target=\"blank\"> you to whoever accepts the Con Position.\n\nEvidence Pro: Thank You opiumfiend for accepting this Debate/Discussion on the misuse of BITE mind control techniques in society. In answer to your main points: 1: \"banning these groups is a violation of freedom of speech.\" I disagree, in that I don't advocate they would be banned from voicing their opinions in public nor even claiming their beliefs are valid in the public arena. BITE control is more about what goes on behind closed doors in the way they isolate and mind control individuals for the purpose of chastising them from thinking for themselves and remove their ability to rationalize beyond their indoctrination. Thus it is the deliberate mental abuse of the individuals under their control that this debate is about. Not what they assert in public. Thus freedom of speech is not an issue here. 2: Banning these groups would not deter them or result in them ceasing to operate. On this I agree, though banning really means that they cannot set up a public meeting place nor display, so they could never advertise their presence and they would be forced to go underground. Not having a public face, means that they cannot advertise for new membership nor can they have any public influence, such as lobby groups and support political campaigns. It is merely a clipping of their wings so they cannot fly. Though when they do gather and get reported as implementing BITE mind control techniques onto their victims, they will be castigated for it and the leaders should be charged with committing mental abuse of these victims. So the fines and even jail sentences for mental abuse of individuals should be an added deterrent from continuing their practices. So those that are not practicing severe BITE mind control should be fined and made to cease such practices and those that do implement a sever BITE regime should be disbanded and never allowed to set up their operation again. The non-severe cases should then have their practices audited regularly or if reported by concerned families and friends of victims, especially if they have reasonable evidence and reasons for suspicion. The Banned group leadership and clergy should be monitored as would suspected terrorists be monitored and have regular assessments made of their activities. As their crime is also a crime against humanity. Those who can commit and organize such mental abuse to hapless individuals are evidently Sociopaths. Sociopaths are the more likely to plan and implement the control of others for their own gain. They are often clever and plan well ahead. They are better at concealing their crimes than psychopaths. So it is often likely that they will commit the same abuse of others in the future as they have gained both psychological and financial rewards from such abuse in the past. technically, all those groups that practice such mind control techniques are CULTS. Ken Ham through \"Answers-in-Genesis\" is trying to establish himself as a Cult Leader. He appears to be succeeding there at the moment if the numbers of home schoolers attending his fallacious, Indoctrinate, B.I.T.E. and whip/strap your children, lectures are anything to go on. Though BITE techniques may also be a factor in recruiting terrorists, though some studies show that terrorism is a much more complex issue and possibly has much to do with misdirected altruism and a sense of vengeance, in people with poorly formed contextual concepts or frontal cortex, though sociopathy also is an issue with the prefrontal cortex and the rest of the limbic system. is no mention of mind control, here in \"The Mind Of The Terrorist\", though it does mention the frontal cortex and social conditioning problems. An article demonstrating that Ken Ham is not only a liar, but a very bad teacher. We always knew this, as he was supposedly a science teacher in Queensland, Australia. Yet his knowledge of science, especially evolution, is beyond pathetic. Those children in Queensland are far better off with him lowering the Intelligence of U.S. children. reason I'm attacking Ken Ham here is because I've read nearly all his nonsense, where he scares his indoctrinated victims by asserting that Atheists are not only out to steal their children, but Atheists will eat their children. BITE indoctrinated individuals may actually believe this, because their brains are almost Mash. After a severe BITE indoctrination, people will believe anything their leaders tell them, because their brains have had all Rational, Critical Thinking capabilities destroyed. They are now mindless sycophants to the leadership. This is what the Usurpers like Ken Ham want. A way of keeping the money coming in, in spite of the world on average becoming more Rational. to you Con. I've got a Creationist child to Barbecue!\n\nEvidence Pro: Sorry to read that Opiumfiend! Though I admit that even I find it a difficult subject to debate against such evidence, so I admire you for having a go. Not the sort of subject I would have chosen to be Con on, so I hope you can grab a debate that it is easier to cut your debating teeth on. I was thinking this debate would go unchallenged. Anyway, Thanks again for your input and best of luck on future debates!! Hope to debate a more worthwhile subject with you some day. I suppose I should have put this in the Opinions section instead of trying to make it a debate! Thanks M8! Cheers! BTW: Since con announced the need to forfeit, I should not get any conduct points awarded against Con's forfeit. Conduct points should only go against debaters who just don't forfeit without announcement or asking to be excused.\n\nEvidence Con: Hello this is my first debate i look forward to it. i hope i can provide a reasonable/interesting argument. i don't feel strongly about this subject but i was able to identify a few main points as to why i think this is inappropriate. i should add that i don't support these groups or ideas personally. My first argument relates to the subject of freedom of speech and the right to gather etc. The act of banning these groups would involve the government investigating these groups, their beliefs, practices and then deciding as to whether these ideas or methods of teaching are appropriate or not. if they were found to be inappropriate such as in the case of implementing BITE tactics, The government would then tell the members they are no longer allowed to congregate or operate. so that raises the following problems. at what point is the group a group?. are 3 people allowed to gather in the method you are proposing to band what about 6 or 12 or 40?. are ex-members allowed to see each other? how do you police who they do and do not network with. for example. what's to stop the ex-leader going and visiting ex-members in their homes or continuing doing what they are doing?. And it's not just the leaders who are the problem. other members who have been brainwashed may still gather and encourage each other into the ideas further still, even without the leader or outside of a group/organisation setting. also banning this group would mean telling them that their beliefs/ideologies are wrong and are not allowed to congregate because of this. a think tank is legal,debate clubs are legal. they can discus and debate any idea they want. i can discuss any belief or philosophy with anyone i choose in any setting. it is unjust to prosecute or censor a groups beliefs or philosophy. now you may argue that the difference between these groups and others is their method of coercion, but isn't everything a matter of coercion. this debate is coercion. whenever i discuss an opposing idea with someone i am trying to coerce them. laws are coercion, education is coercion, a sales pitch is coercion. all groups with a unified philosophy are trying to coerce others into agreeing with their ideas. now obviously this, BITE method you mention is arguably a far more sinister form of coercion. and i would agree that it is. but any law that would ban these groups encroaches to much on freedom and liberty. and it's for these reasons that gangs or racist groups are not illegal either. because it means the government are deciding who can and cannot congregate and what ideas they can and cannot discuss and the methods of teaching,discussing or ritual they can and cannot use. plus these groups are very well ingrained in their beliefs and life styles simply banning them or separating the members will most likely not be enough to deter them from actually wanting to be together or to live together etc. as i stated before, it would be impossible to stop the members networking, even if their main organisation or place of residence was closed. and just to add on that last point about networking, they would simply operate underground. which is also the reason gangs are not illegal. so in summery my main points or arguments are. banning these groups is a violation of freedom of speech. banning these groups would not deter them or result in them ceasing to operate.\n\nEvidence Con: I have to forfeit this debate. the only arguments i can offer relate to the fact that the banning would be to difficult to apply or that the banning would drive the cults under ground. however in the cases of Ken Ham this would be a good thing as it would remove their ability to operate in the midst of our society legally. sorry for the lack of interesting debate. this is my first debate on this website. And it's not a topic i feel strongly about so it's difficult to argue. you win :)\n\nEvidence Con: thank you\n","DiscussionID":"00000057","Title":"Groups/Cults applying BITE mind control techniques should be Banned!","CrawlDate":"2016/09/29 05:25:39","URL":"http://www.debate.org/debates/Groups-Cults-applying-BITE-mind-control-techniques-should-be-Banned/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":221,"nextID":"00000002","PremiseStartPos":[273],"prevID":"00000000","Premise":["There are many groups in society that practice some or all of the Behavior control, Information control, Thought control, Emotion control, Mind Control Techniques. Cults well known to have been implementing the BITE method to convert and keep believers are the Mormons and the Jehovah Witnesses, though Scientology and even many Evangelical Christian Cults, such as some Pentecostal Cults and Creationist Cults can also be found to practice some of or all of the aspects of the BITE model. The BITE model was developed by Steven Hassan href=\" target=\"blank\"> is an excerpt from the Cult Awareness and Information Library which I have shortened, but I've supplied the source so you can read more detail: \" Four Aspects of Mind Control (as it relates to people in cults) 1) INFORMATION CONTROL: Important information which is available to the general public is withheld from members and potential members. Deception is the basic feature of all cult recruitment. It is also what keeps people inside cults. Information is one of the best weapons against cults. 2) THOUGHT CONTROL: \"Truth\" and reality are distorted for those inside the group by subtly changing the definitions of common terms with new meanings through the use of code words, cliché's, and slogans. Different words make the members feel special and separate from outsiders. These different words confuse outsiders who want to understand what the group believes and talks about. The change in definitions of significant words keeps even the members from understanding their own beliefs. Leaders of cults repress questions by conditioning their members to employ \"thought-stopping\" statements, prayers, hymns, Bible verses, mantras, tongues or rituals to drown out doubt, questions, anxiety or uncertainty. \"I can't think about that.\" \"How can you question (the leaders) after all they have done?\" etc. The intention is to stop questions regarding the system or leaders. 3) EMOTION CONTROL: Guilt, fear and shame are projected onto the members, prompting blame toward themselves for their depression, lack of understanding, anxiety, or inability to cope, rather than examining the leaders, the group's policies, history, doctrines, scandals, and at times, even crimes. Phobic attitudes or behaviors are sometimes noticeable when attempts are made to converse with members regarding their belief in the group or its leaders. Fear, anger, rage or repetitious statements which only go in circles keep the members from thinking through to any rational conclusions. Fear of confrontation with family is common, resulting in very few people being rescued. 4) BEHAVIOR CONTROL: Tight control of behavior secures the leaders' position of authority and importance. The behavior control impresses members and outsiders to view the group as especially spiritual or successful. The leaders link the required behavior to their special \"revelation\" of a text of scripture. However the required behaviors are usually superficial controls, affecting appearances and outward activity rather than inward character. These can include grooming, daily activities, career choices, clothing, specific technology, posture, speech mannerisms, food choices, recreation, education, even decisions about marriage, sex and children. (They usually do not deter moral sin.) If a person does not conform, he may be urged to become more like an older group member; to follow the leaders' \"example\". OBEDIENCE TO THE HUMAN LEADERS IS THE MOST IMPORTANT LESSON TO LEARN. The leaders cannot totally control one's inner thoughts, but if they can command behavior, hearts and minds will usually follow. The behavior control isolates the members from society even more effectively. Source: Notice that mantras and speaking in tongues are used to control (block) thinking. Since speaking in tongues is completely bogus, as it has nothing whatsoever to do with the story of the original Pentecostal experience, it is strictly a thought blocking (control) exercise. So all cults that practice speaking in tongues should automatically come under suspicion. Creationist cults often use thought control tactics, such as demonstrated on the teaching literature for home schools proposed by Answers-in-Genesis where a False Analogy is used to connect Evolution with Evil and Creationism with Good, so children are deliberately taught that Evolution equates to Evil so if you believe in Evolution you are following Evil and if you believe in Creation you are following the Goodness of God. So Creationism is deliberately deceiving children into a Black & White, world of False Dichotomies. Which is evidently part of the BITE mind control technique by deceiving parents into thinking they are doing the right thing in practicing such mind control techniques on their children. Such is the Cult tactics of Answers-in-Genesis to keep a new generation of suckers that they can sell their nonsense to. I strongly believe that all religious groups should be investigated for such practices and depending on the severity of their use of BITE techniques apply one of the following: 1: Sever use of BITE: Charged with Mental Abuse of their constituents and banned from the nation. 2: Moderate use of BITE: Banned from using such practices and undergo regular audits on their practices. 3: Partial use of BITE: Warning to stop such practices and be forced to allow regular auditing of practices. Though some cults have had exposed their own practices of BITE which has been most helpful to Mental Health professionals. The Mormon Model: Jehovah Witness Model: href=\" target=\"blank\"> href=\" target=\"blank\"> Recovering from Scientology link: Earth Creationism: (From a Christian Link) a free thinking site: Ham instructing Parents to use Mind Control techniques on Children, including corporal punishment. href=\" target=\"blank\"> href=\" target=\"blank\"> href=\" target=\"blank\"> you to whoever accepts the Con Position."],"PremiseEndPos":[6190],"ArgumentID":"00000001","Conclusion":"Groups/Cults applying BITE mind control techniques should be Banned!","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":221,"nextID":"00000003","PremiseStartPos":[6205],"prevID":"00000001","Premise":["Thank You opiumfiend for accepting this Debate/Discussion on the misuse of BITE mind control techniques in society. In answer to your main points: 1: \"banning these groups is a violation of freedom of speech.\" I disagree, in that I don't advocate they would be banned from voicing their opinions in public nor even claiming their beliefs are valid in the public arena. BITE control is more about what goes on behind closed doors in the way they isolate and mind control individuals for the purpose of chastising them from thinking for themselves and remove their ability to rationalize beyond their indoctrination. Thus it is the deliberate mental abuse of the individuals under their control that this debate is about. Not what they assert in public. Thus freedom of speech is not an issue here. 2: Banning these groups would not deter them or result in them ceasing to operate. On this I agree, though banning really means that they cannot set up a public meeting place nor display, so they could never advertise their presence and they would be forced to go underground. Not having a public face, means that they cannot advertise for new membership nor can they have any public influence, such as lobby groups and support political campaigns. It is merely a clipping of their wings so they cannot fly. Though when they do gather and get reported as implementing BITE mind control techniques onto their victims, they will be castigated for it and the leaders should be charged with committing mental abuse of these victims. So the fines and even jail sentences for mental abuse of individuals should be an added deterrent from continuing their practices. So those that are not practicing severe BITE mind control should be fined and made to cease such practices and those that do implement a sever BITE regime should be disbanded and never allowed to set up their operation again. The non-severe cases should then have their practices audited regularly or if reported by concerned families and friends of victims, especially if they have reasonable evidence and reasons for suspicion. The Banned group leadership and clergy should be monitored as would suspected terrorists be monitored and have regular assessments made of their activities. As their crime is also a crime against humanity. Those who can commit and organize such mental abuse to hapless individuals are evidently Sociopaths. Sociopaths are the more likely to plan and implement the control of others for their own gain. They are often clever and plan well ahead. They are better at concealing their crimes than psychopaths. So it is often likely that they will commit the same abuse of others in the future as they have gained both psychological and financial rewards from such abuse in the past. technically, all those groups that practice such mind control techniques are CULTS. Ken Ham through \"Answers-in-Genesis\" is trying to establish himself as a Cult Leader. He appears to be succeeding there at the moment if the numbers of home schoolers attending his fallacious, Indoctrinate, B.I.T.E. and whip/strap your children, lectures are anything to go on. Though BITE techniques may also be a factor in recruiting terrorists, though some studies show that terrorism is a much more complex issue and possibly has much to do with misdirected altruism and a sense of vengeance, in people with poorly formed contextual concepts or frontal cortex, though sociopathy also is an issue with the prefrontal cortex and the rest of the limbic system. is no mention of mind control, here in \"The Mind Of The Terrorist\", though it does mention the frontal cortex and social conditioning problems. An article demonstrating that Ken Ham is not only a liar, but a very bad teacher. We always knew this, as he was supposedly a science teacher in Queensland, Australia. Yet his knowledge of science, especially evolution, is beyond pathetic. Those children in Queensland are far better off with him lowering the Intelligence of U.S. children. reason I'm attacking Ken Ham here is because I've read nearly all his nonsense, where he scares his indoctrinated victims by asserting that Atheists are not only out to steal their children, but Atheists will eat their children. BITE indoctrinated individuals may actually believe this, because their brains are almost Mash. After a severe BITE indoctrination, people will believe anything their leaders tell them, because their brains have had all Rational, Critical Thinking capabilities destroyed. They are now mindless sycophants to the leadership. This is what the Usurpers like Ken Ham want. A way of keeping the money coming in, in spite of the world on average becoming more Rational. to you Con. I've got a Creationist child to Barbecue!"],"PremiseEndPos":[10949],"ArgumentID":"00000002","Conclusion":"Groups/Cults applying BITE mind control techniques should be Banned!","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":221,"nextID":"00000004","PremiseStartPos":[10964],"prevID":"00000002","Premise":["Sorry to read that Opiumfiend! Though I admit that even I find it a difficult subject to debate against such evidence, so I admire you for having a go. Not the sort of subject I would have chosen to be Con on, so I hope you can grab a debate that it is easier to cut your debating teeth on. I was thinking this debate would go unchallenged. Anyway, Thanks again for your input and best of luck on future debates!! Hope to debate a more worthwhile subject with you some day. I suppose I should have put this in the Opinions section instead of trying to make it a debate! Thanks M8! Cheers! BTW: Since con announced the need to forfeit, I should not get any conduct points awarded against Con's forfeit. Conduct points should only go against debaters who just don't forfeit without announcement or asking to be excused."],"PremiseEndPos":[11782],"ArgumentID":"00000003","Conclusion":"Groups/Cults applying BITE mind control techniques should be Banned!","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":221,"nextID":"00000005","PremiseStartPos":[11797],"prevID":"00000003","Premise":["Hello this is my first debate i look forward to it. i hope i can provide a reasonable/interesting argument. i don't feel strongly about this subject but i was able to identify a few main points as to why i think this is inappropriate. i should add that i don't support these groups or ideas personally. My first argument relates to the subject of freedom of speech and the right to gather etc. The act of banning these groups would involve the government investigating these groups, their beliefs, practices and then deciding as to whether these ideas or methods of teaching are appropriate or not. if they were found to be inappropriate such as in the case of implementing BITE tactics, The government would then tell the members they are no longer allowed to congregate or operate. so that raises the following problems. at what point is the group a group?. are 3 people allowed to gather in the method you are proposing to band what about 6 or 12 or 40?. are ex-members allowed to see each other? how do you police who they do and do not network with. for example. what's to stop the ex-leader going and visiting ex-members in their homes or continuing doing what they are doing?. And it's not just the leaders who are the problem. other members who have been brainwashed may still gather and encourage each other into the ideas further still, even without the leader or outside of a group/organisation setting. also banning this group would mean telling them that their beliefs/ideologies are wrong and are not allowed to congregate because of this. a think tank is legal,debate clubs are legal. they can discus and debate any idea they want. i can discuss any belief or philosophy with anyone i choose in any setting. it is unjust to prosecute or censor a groups beliefs or philosophy. now you may argue that the difference between these groups and others is their method of coercion, but isn't everything a matter of coercion. this debate is coercion. whenever i discuss an opposing idea with someone i am trying to coerce them. laws are coercion, education is coercion, a sales pitch is coercion. all groups with a unified philosophy are trying to coerce others into agreeing with their ideas. now obviously this, BITE method you mention is arguably a far more sinister form of coercion. and i would agree that it is. but any law that would ban these groups encroaches to much on freedom and liberty. and it's for these reasons that gangs or racist groups are not illegal either. because it means the government are deciding who can and cannot congregate and what ideas they can and cannot discuss and the methods of teaching,discussing or ritual they can and cannot use. plus these groups are very well ingrained in their beliefs and life styles simply banning them or separating the members will most likely not be enough to deter them from actually wanting to be together or to live together etc. as i stated before, it would be impossible to stop the members networking, even if their main organisation or place of residence was closed. and just to add on that last point about networking, they would simply operate underground. which is also the reason gangs are not illegal. so in summery my main points or arguments are. banning these groups is a violation of freedom of speech. banning these groups would not deter them or result in them ceasing to operate."],"PremiseEndPos":[15170],"ArgumentID":"00000004","Conclusion":"Groups/Cults applying BITE mind control techniques should be Banned!","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":221,"nextID":"00000006","PremiseStartPos":[15185],"prevID":"00000004","Premise":["I have to forfeit this debate. the only arguments i can offer relate to the fact that the banning would be to difficult to apply or that the banning would drive the cults under ground. however in the cases of Ken Ham this would be a good thing as it would remove their ability to operate in the midst of our society legally. sorry for the lack of interesting debate. this is my first debate on this website. And it's not a topic i feel strongly about so it's difficult to argue. you win :)"],"PremiseEndPos":[15675],"ArgumentID":"00000005","Conclusion":"Groups/Cults applying BITE mind control techniques should be Banned!","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":221,"nextID":"00000000","PremiseStartPos":[15690],"prevID":"00000005","Premise":["thank you"],"PremiseEndPos":[15700],"ArgumentID":"00000006","Conclusion":"Groups/Cults applying BITE mind control techniques should be Banned!","PremiseStance":["Con"]}}]}