{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-News-Media-Is-Biased-Against-the-Positive-Aspects-of-Gun-Ownership/1/\nCrawl date: 2016/09/29 03:45:56\nOnline Debate: The News Media Is Biased Against the Positive Aspects of Gun Ownership | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: Round 1 is for acceptance, Round 4 is for rebuttals. Since most debates about gun control end up devolving into an argument on the semantics of the 2nd amendment I'd like to engage a fresh perspective. The issue mentioned in the title is key to the reason why so much negative public perception is directed at guns, and thus why many people shudder at the thought of unrestricted gun ownership. The position I am taking is that the media, while not always intentionally, has shown a clear bias in reporting stories that convey the negatives of gun usage and ownership. Simultaneously, they have failed to give the same treatment towards the stories which exhibit the positives of everyday citizens using guns. My opponent should be of the position that the media fairly covers both the positive and negative occurrences of gun usage, with no inherent bias towards either side. Keep in mind: this is NOT a debate about the second amendment or its legitimacy. The only topic for discussion here is the news coverage of gun-related incidents. I eagerly await a willing opponent.\n\nEvidence Pro: I thank bluesteel for accepting this debate. That being said, I believe that there may be misunderstanding in what I meant by \"Positive Aspects\". By that, I am referring to instances of defensive gun uses, not cases of citizens keeping their guns safely locked up. Nonetheless, I will show that the media is quick to blame the gun rather than the individual holding the gun, and also prove that DGU (defensive gun use) receives much less coverage in the media, despite the fact that it occurs more commonly than violent crimes committed with guns. In mass acts of public terrorism (ie campus shootings, school shootings, etc.), the media focuses on the gun rather than the individual(s) involved, and also blatantly omits information and events concerning the positive usage of guns in such situations. In order to prove this point, I intend to present a case study on the 2002 campus shooting at Virginia's Appalachian School of Law. A disgruntled Nigerian student killed the dean, a professor, and another student before being subdued by a group of students. This brief account is the way that most people heard the event, and as a result calls for more gun control were common. Yet one key piece of information is missing from this account: the attacker was subdued not by physical force alone, but by two students grabbing guns from their cars and pointing it at the shooter, then subduing him. In reality, this key fact was hidden from the public by the bias of the news media. Out of 208 stories relating to the incident, a mere four accounts included the fact that the students used guns in the process. 72 had related information that the attacker was stopped by students, but as said before, only four mentioned that guns were involved. As for the ones that chose to omit this key fact? The Washington Post said that they pounced on the gunman until help arrived, without alluding to the fact that the display of guns is what subdued the gunman in the first place. By stark contrast to this minuscule coverage of the positive DGU, 68 of the 208 news articles (including the aforementioned Washington Post one) felt it necessary to detail that the gunman had a \".380 semiautomatic pistol\". So, they give the attention to the gun used to commit the crime, which could have been any gun or even a non-gun instrument, yet neglect the key detail of how guns were used in the stoppage of any further loss of life? Furthermore, it can clearly be observed that the media, while not always intentionally, has galvanized public sentiment against guns with its relentless coverage of incidents like the Va Tech shooting, Columbine, Arizona incident with Rep. Giffords, etc. Nearly everyone has heard of these incidents, and in all the coverage the focus centered around how bad guns were and why the perpetrators were able to obtain them. While these incidents are \"household names\" in terms of mass public terrorism, certain lesser known instances involving shooters being stopped have received considerably less press. Survey any group of Americans, and I guarantee that the public awareness of the incident when \"an assistant principal at Pearl High School in Mississippi retrieved his legally owned Colt .45 from his car and stopped a student shooter after that student killed two people\" is much less than the Virginia Tech massacre. Or how \"at an eighth-grade school dance in Pennsylvania, a boy fatally shot a teacher and wounded two students before the owner of the dance hall brought the killing to a halt with his own gun\". Why? By the very nature of the \"sensationalized\" media, as you called it, it proves much more newsworthy to report incidents with massive losses of life rather than ones with, by news standards, \"normal\" amounts of deaths which were prevented from escalating by DGU. Within this bias towards the remarkable stories, key instances about positive DGU is less available to the public, and as a result public opinion reflects a prevailing belief that having guns around is a threat and that DGU is an unfeasible course of action. The intensive focus on guns in gun-related instances represents a double standard by the media as well, as opposed to their method of covering non-gun acts of violence. In non-gun acts of violence, the focus somehow seems to shift to the individual and not the instruments they used to commit their deeds. I have yet to hear of any stories which focused on Ryder trucks or ammonium nitrate in the aftermath of the OKC bombings. Nor have I heard of any debates focusing on the knives and buzz saws used in the twisted crimes of Jeffrey. Similarly, there has never been an outpouring of support for a ban on such instruments after these incidents. Instead, media coverage was centered on the past lives of the perpetrators, with almost zero focus on the instruments used to commit the crimes. Even though these instruments were just as important to the crimes as guns were in the Va Tech shooting, the media paid no attention to them, and as a result more public sentiment was felt towards the crimes themselves. By contrast, when people recall the Virginia Tech shootings, they are inclined to bring up the fact that Seung-hei Cho was able to obtain a weapon despite the restrictions. Yet when a similar incident happened on that same campus, involving a student being stabbed, I heard zero articles focused on the dangers of having knives. In summary, while mass murder cases with guns do feature a great deal of coverage about the perpetrators, they also feature an equal, if not greater, amount of coverage on the guns themselves. This greatly differs from the scant attention paid to the instruments of non-gun crimes, even though the Ryder truck and ammonium nitrate was just as important to the OKC bombing as guns were to the cases of school shootings. I believe that in my presented argument, I have clearly exhibited the media's penchant to frame guns as only being used for destruction. This, however, only encompasses the scope of nationally-newsworthy incidents. I intend to further display the logical reasons as to why even the local media features an embedded bias towards broadcasting DGU as opposed to gun incidents where blood is spilled. In the meantime, I await my opponent's responses to my arguments presented thus far. References (Excerpt from John Lott's book The Bias against Guns)\n\nEvidence Pro: I thank bluesteel for the thought-provoking rebuttal. Admittedly, I believe that using only one case as a method to convey the media bias is not the most effective way. Therefore, I will use this round to illustrate the broader media bias which is present in the everyday news events involving guns. In effect, I will also address some of the points made by my opponent in his previous rebuttal and disprove them. In the same way, my opponent never proves that anyone in the media is PURPOSELY ignoring self-defense stories and PURPOSELY covering high-profile bad uses of guns, to INTENTIONALLY distort public perceptions. While I cannot read the media's minds, I can certainly provide a heap of evidence which would suggest that stories involving malicious usage of guns receive far more attention than the good uses. Furthermore, I can prove that the media purposely chooses to emphasize the negative aspects of guns in other manners than just accounts of incidents. First, I'd like to present the most blatantly extreme example of INTENTIONAL, CONFESSED media bias in reporting about guns. This incident was clearly meant to advance left-wing views of banning assault weapons, and was not just an honest mistake, but a clear case of intentionally falsified journalism in order to spread a viewpont held by CNN. In short, NRA president Wayne Lapierre was the one who called out CNN for deliberately faking a report on the danger of fully automatic assault weapons, the ban on which was set to expire next year. [1] CNN fired an automatic AK-47 at cinderblocks, but with the semiautomatic civilian example being intentionally shot into the ground to convince viewers that the banned version was so much more destructive. This epitomizes irresponsible, fabricated journalism, and correlates with the stance that the media has always possessed (albeit in a less obvious manner which I will explain). If this does not qualify as bias, I don't know what is. I believe that my opponent will be hard-pressed to deny the bias lying in this incident, nor will he be able to find a similar example of an intentionally fabricated story by a major media outlet used to advance a pro-gun standpoint. A gun being used in a home invasion, or to kill one non-famous person, is going to get the same coverage as a gun used to protect a home in self-defense. My opponent's complaint is unfair. National news syndicates don't report local incidents. Really? I have evidence which would suggest otherwise. That is, evidence that suggests that they report local incidents of gun tragedies, rather than acts of crime prevention with guns. To prove this, I will recall my opponent's reference to thearmedcitizen.com, a website run by the NRA. That alone should point to the limited audience such a website will receive. My opponent also presents the erroneous claim that \"if the media was biased, they would refuse to report these incidents at all\". Bias is not necessarily a complete exclusion of the opposing side; it is merely a clear preference for one side over the other. My opponent's reference to The Armed Citizen only furthers the argument of bias against guns. This site along with its counterpart keepandbeararms.com, serve as the two major archives of defensive gun use incidents. John Lott did extensive research into the composition of these stories reported on here, and at the time of his research a shocking 40% of the archived stories during 2001 on these two sites had not even been published in top 100 newspapers. [2] There were just 37 present in the top 10, with 26 being published in either the Houston Chronicle or Dallas Morning News. Now, my opponent may further argue that local stories should not merit coverage by these major papers. Yet, statistics on the nation's three top newspapers suggest that gun crimes have received such expanded coverage. The same cannot be said for defensive gun stories. In the same year of 2001: -New York Times published 104 articles on gun crimes that year, for a total of 50,745 words on the subject (gun crimes meaning actual reportings of gun violence). Roughly 1/3 of those stories were from outside the New York area. By contrast, there was only one 163-word story about a DGU in the New York area. -USA Today, which has no geographical limitations, contained 5,660 words on gun crimes and zero on DGUs. -Washington Post contained 46,884 words on gun crime (1/4 from outside the DC area) as opposed to three stories on DGU amounting to 953 words. In the entire top 10 national newspapers, only 13 other incidents of DGU were reported, compared to a countless number of stories on the other end of the gun violence spectrum. My opponent's claim that local news stories about gun crimes receive equal coverage as DGU is clearly refuted by this wide-reaching examination of major newspapers. Why these stories of gun crimes prove any more newsworthy than cases of DGU is beyond explanation, yet the news media still chooses to show an overwhelming preference for reporting the negative usage of guns over the positives. This preference does not stop at reporting gun-involved incidents, however. In the New York Times. the stories relating to discussions of gun policies and gun research were COMPLETELY slanted towards the anti-gun side. Nine experts who, through their own previous works, had expressed strongly pro-gun control views, were cited a total of twenty times. Gary Kleck, the man behind the \"2.5 million DGUs per year\" statistic, was the only expert who had a somewhat neutral stance on the issue, and he was cited once. How many academics against gun laws were cited in the two year period assessed? Zlich. Not that they are non-existent. After all, the year before data was collected for this particular assesment, 294 academics had come together to write a letter informing Congress that the new proposed gun laws were \"ill-advised\". The New York Times represents unbalanced journalism which displayed an undeniable bias in not letting a single academic opposing gun control express their views. [2] This ensured that the general public remains uninformed about the potential benefits of guns. Similar statistics to the ones presented for newspapers manifest within TV reporting on the subject. The stories of 2001 on the three major news networks: 190,000 words in stories on gun crimes, with only one 580 word story about an off-duty officer preventing a school shooting. Despite the fact that numerous estimates place the number of DGUs at between 1 to 3 million per year in the United States (a rate much greater than the number of gun homicides), the coverage reflects a much different story. Despite the fact that many DGUs provide newsworthy events, such as a life saved by the defensive use of a gun, the print and TV media chooses to overwhelmingly ignore such cases and instead report on the typical case of a tragic death attributed to guns. Furthermore, just as the NY Times likes to ignore the opinions of the academics who contradict the anti-gunners, TV exhibits the same bias. Good Morning America is easily the worst offender in terms of media bias. Despite stories of heroism with guns in that year, such as a killer in Michigan being stopped from firing at passing cars by a concealed permit holder, GMA opted instead to broadcast less newsworthy incidents which were rather typical incidents of gun violence, incidents which shouldn't have made it to the national news if the one in Michigan didn't. [2] Yet this kind of blatant preference epitomizes the stance of the media today: galvanize public sentiments about guns while not allowing the other side of the issue to come through. The CNN story was an all too obvious example, and the unbalanced coverage by other major media outlets accomplishes the same bias, albeit in a less obvious manner. I have provided evidence that proves the media bias, it is up to Con to say otherwise. [1] [2]\n\nEvidence Pro: Thanks to bluesteel for a very engaging and informative debate. My opponent concluded his last round with a statement chock-full of sweeping overgeneralizations and assumptions. My opponent's only real example is one CNN story... While the CNN story is not my only example, it certainly is a concrete one where the bias is obvious. I did describe this as an extreme incident, yet its bearing cannot be entirely discounted. In the time context of an expiring assault weapons ban, the story deliberately tried to galvanize emotional response to this fact. To call this a pro-gun story in any respect, as my opponent alluded to, is completely preposterous. Yes, the semi-auto AK-47 could have penetrated the cinderblock, but that was not the issue that CNN tried to get across. The point of the comparison was to deliberately exhibit a damage \"gradient\" between semi-auto and fully automatic weapons. If viewers, especially those who responsibly own semi-automatic rifles, would have seen a truly accurate comparison, they would have perceived little difference in stopping power between what they safely own and what is banned. Such a thought would destroy the credibility of banning automatic weapons, and CNN tried to avoid instilling such a thought by deliberately manipulating the study. Next, my opponent claims that this intentional example of bias is \"counter-balanced\" by a slew of factors, all of which are inaccurate. Appalachian Law School - My opponent has repeatedly accused Bridges and Lott of being in some kind of \"conspiracy\" to fabricate the details in order to advance a pro-gun viewpoint. Not only is this faulty reasoning, but it incorrectly assumes that Bridges is wrong and Besen is right. Both accounts of the incident have been placed in encyclopedic accounts of the shooting, so to say that one account is patently false is unfounded. Neither account has been proved or disproved without a doubt, so my opponent cannot reasonably assume that Bridges is lying. Furthermore, this incident does not negate the CNN story or the other examples of media bias against guns. As I said before, despite the fact that neither account was proved right or wrong beyond a reasonable doubt, the media accounts still chose to favor the student \"pouncing on the gunman\" rather than \"pointing their guns\". NRA-Backed Website - My opponent claims that because The Armed Citizen collected a story about a not guilty verdict in a shooting case, and \"classified it as a DGU\", the website should not be taken seriously. If one looks at this story, it was an acquittal of a student charged with attempted murder in an alleged case of SELF-DEFENSE. This is perfectly in-line with the site's intentions of collecting stories PERTAINING TO defensive gun-use. This does not limit their coverage to stories solely describing the details of a DGU. While on the subject of this website, I should also address my opponent's argument that based on what I had said earlier, \"60% of DGUs are covered by a top 100 newspaper\". First off, The Armed Citizen is in no way a comprehensive listing of all newsworthy DGUs (not just showing a gun). When I said 40% weren't covered, this means that 40% of the stories on that specific site weren't covered in a top 100 newspaper. Furthermore, if my opponent were to argue that these archived stories are adequate evidence to counter-balance the bias against guns, he would have to show that the geographical distribution of the reported occurrences is near uniformly correlating to population size. If a state like Nebraska has more covered stories than a large state like California or New York is not, then this does still indicate a media bias. After all, since it is well known that gun crimes (and logically DGUs) occur much more frequently in urban areas than rural ones, then clearly a large urban state being low on this list would indicate a systematic exclusion of stories covering beneficial usage of guns. Kleck Study - Perhaps this is the most strikingly overgeneralized of my opponent's points. He claims in his last sentence that this study contained DGU's that were all hostile gun displays. To single out the methodology of Kleck's study is inherently wrong. Studies obtaining lower figures for DGUs, such as the NCVS, also have their fair share of criticism. Hemenway's study is not exempt from it either. Furthermore, the Kleck study has absolutely nothing to do with media bias. It was a study published in a criminology journal, and has evolved into a frequently cited statistic. It was never intended to advance any viewpoint, as Kleck himself is a self-described liberal with moderate views on gun-control. My opponent tries to cite this \"flawed\" study as a refutation of the media bias, yet ignores the fact that it was intended for academic purposes and not to be cited by members of both sides of the gun debate. As can be seen, my opponent's closing points are faulty counter-examples, while the CNN story can be legitimately viewed as an anti-gun story. My opponent also claims that the media is not anti-gun just because it reports more gun crimes. This is true, but there are other methods that it shows its bias. Let us examine my opponent's analogy to foiled terrorist plots. This analogy does not fit the situation at hand with the media. Yes, a successful terrorist plot deservedly merits more coverage than a foiled one. But this is not the case with the media and gun stories. What makes the stories about average, every-day citizens discharging a gun, saving innocent lives in the process, less newsworthy than a child who gets a hold of his parents' irresponsibly placed gun and causes a tragedy? To address the point of contention about local news being more watched than national news, we must consider the more profound effect that hearing or reading something within the national news has upon a viewer. The importance of the story is magnified, and it reaches a wider audience. With national newspapers and television having their clear bias towards reporting gun crimes. And while there may not be 2.5 million newsworthy DGUs to report, there are certainly more than the combined total of around 5,000 words that the mainstream national news gave them. To answer the question over what Lott counted as a gun crime, it was strictly limited to objective accounts of domestic incidents of gun crime (a story about Afghanistan would not qualify). Lott also did count the WSJ in his study of newspapers; they reported zero DGUs in that year as well. Furthermore, if legitimate, newsworthy DGUs are as rare as my opponent claims, why don't they get more attention? Fox News also detracts nothing from the media bias, since by my opponent's own admission it is more far-right than CNN is far-left. Therefore, it is bound to attract an audience that already agrees that guns are beneficial, and airing more stories about DGUs won't affect them. By contrast, when left-leaning sources like CNN and the NY Times do not objectively report the issue, their audiences (composed of more moderate types along with liberals) will hear few stories about beneficial gun usage. To conclude, I will leave with a thought to consider. When the media, national or local, reports a story about an unfortunate gun tragedy or accident, it is almost always tailed by some kind of resulting campaign or push for more stringent gun control laws. However, it is unheard of for a report about a heroic DGU, if it manages to be shown, to be accompanied by a call for more access to guns by law-abiding citizens. The fact that so many people are skeptic of repeated studies showing high numbers of DGUs speaks to the manner in which the media has conveyed them to the general public. As a result of these factors, along with the presented evidence, I encourage a Pro vote.\n\nEvidence Con: Thanks for the topic DoctorZhiva. We should both agree in this debate that the news media is SENSATIONALIST. Obviously, they want to put out stories that viewers find interesting, so they are not going to report on what I ate for lunch (unless it was a 20 pound burger). So obviously the media is going to report a lot of bad things that guns do - like murders, robberies, etc. My opponent must prove that in the reporting of these events, the media has a track record of always blaming the gun itself, rather than the person holding it. He cannot just show that the media tends to cover criminal shootings and NOT average citizens who keep their guns safely locked up and never have their kids shoot themselves with an improperly stored weapon. That wouldn't make an interesting story: \"for today's 10 o'clock news, let's look to Jonathan Smith, who keeps his gun locked up safely. Here is the gun safe. Here is a picture of his gun. Here is a picture of Jonathan. Isn't that amazing. Gun locks? Wow, technology... The teleprompter says \"vamp for 10 minutes\" now. I don't know what to say. Um, so, guns are awesome right. Let me read you from the NRA fact sheet...\" In fact, if the media were to read fact sheets from lobbying groups on either side, that would be bias. The media is supposed to report the facts of a story. For definition purposes, the news media means actual news, not opinion pundits (like Rachel Maddow), who can express their own opinions. I will show that the media reports just as many self-defense episodes as other shootings. They don't purposely ignore self-defense. For example, this website, which hasn't been updated since February, keeps a record of every news story on gun self-defenses. It has 15 stories from one ONE WEEK in February 2011. Obviously, the media reports A LOT of stories on self-defense. Every time the website updated, it found more than 10 self-defenses reported every week in the media. Since the media is sensationalist, there aren't any other positive aspects of guns for them to report on. They're not going to be doing story after story about how hunting deer is awesome and helps put dinner on the table in rural California. I await my opponent's response.\n\nEvidence Con: Thanks for the quick reply DoctorZhiva. ==Rebuttal== R1) School shootings My opponent claims there is widespread bias in the media in their coverage of campus shootings because they PURPOSELY misrepresent the facts and refuse to cover the fact that guns were involved in self-defense. However, he cites ONE INCIDENT at Virginia's Appalachian School of Law to prove this. Let me show the problems with this argument. First, my opponent says that of 208 news stories, only 4 mentioned that students used guns in the process to subdue the gunman. However, he HIMSELF says that only 72 of those articles even mentioned AT ALL that the gunman was subdued. Secondly, this seems really curious – is it really the case that 68 publications purposely lied about how the gunman was subdued? That really would prove widespread bias. Let's assume for a second that the Associated Press made a MISTAKE when covering the issue and talked to the wrong person, who gave them a false account (that the gunman was pounced on rather than subdued with two guns). Most small time local publications merely print the Associated Press story, without editing. So this only proves that there was ONE mistake, re-printed 68 times, not that 68 publications purposely distorted facts. But most importantly, the above Associated Press example is theoretical. In all actuality, it is most likely that the two students who claimed they used guns likely lied about their role in subduing the shooter, to gain popularity or to emphasize the good use of guns (when being interviewed by authors like Trent Lott, who have a clear pro-gun agenda). There are two CONFLICTING accounts of how Peter Odighizuwa (the Nigerian gunman) was subdued. The first account is from Tracy Bridges. He claims that he and Mikael Gross, both unbeknownst to each other, ran to their cars to retrieve their guns, since Gross was a cop at the time and Bridges a county sheriff. They approached Odighizuwa and Bridges yelled for Odighizuwa to drop his gun, which he did, and was then subdued by several other unarmed students, including Ted Besen and Todd Ross. [1] The second account is the Ted Besen account. According to Besen, Odighizuwa, out of ammo, set down his gun and started mocking people. [2] Besen, a former Marine and police officer at the time, took this opportunity to engage in a physical confrontation with Odighizuwa and knock him to the ground, where he was then subdued and held down by other students, like Todd Ross. Only after Odighizuwa was ALREADY subdued did Besen report seeing Tracy Bridges and Mikael Gross arrive with their guns, too late to be of any assistance. While Besen and Ross held Odighizuwa down, Gross then went back to his car yet again to retrieve handcuffs to detain Odighizuwa until police arrived. [3] The account that is most likely TRUE is the Besen account. Bridges is most likely lying to gain attention from pro-gun advocates and to gain glory. It is surprising that Gross doesn't seem to back his account. There is also additional evidence to back Besen's account. \"Additional witnesses at the scene stated they did not see Bridges or Gross with their guns at the time Besen started subduing Odighizuwa.\" [4] The official police report also notes that Odighizuwa dropped his gun because the magazine was empty (NOT because he had a gun pointed at him). [4] So additional witnesses AND the police report both back Besen's account. So ultimately, the 68 sources that reported that students subdued Odighizuwa by jumping on him were CORRECT and the 4 that noted Bridges account were WRONG, did not give Besen the credit that he DESERVES, AND were examples of bad journalism. The more legitimate sources, like the Washington Post, actually did their homework, read the police report, and interviewed multiple witnesses before going to press, rather than merely printing what Bridges told them (which 4 local publications and Trent Lott did). Lott and my opponent never tell us why we should prefer Bridge's account to the truth. The last thing my opponent complains about is that the media reported what type of gun was used by the shooter. That's just good reporting; there's no reason for the media to leave out this fact. A reporters job is to report all the facts. My opponent's next evidence is that Virginia Tech, Columbine, and the Gabriel Giffords shooting get a lot of coverage in the press, whereas incidents of self-defense don't get the same coverage. This has nothing to do with guns and everything do with sensationalism. A story where no one died (because someone pulled a gun in self-defense) is not going to get as many listeners as a story about a school shooting where 32 people died and 25 were injured (Virginia Tech). My opponent never proves that the coverage of these incidents focused on the guns to the exclusion of the shooters. In fact, I followed the coverage of all three very closely and nearly every article blamed the shootings on highly disturbed individuals and tracked the lives of those individuals, trying to explain how they became so mentally disturbed. People are far more interest in WHY someone would choose to go on killing spree and not so much in how they obtained their gun. For example, the Columbine coverage focused a great deal on how the shooters were social outcasts, how they were goths and wore weird clothing and seemed to revel in suffering, how they listened to Marilyn Manson, how they played violent video games, and how they were likely extremely depressed. There was some coverage of how they obtained their weapons because it actually was kind of problematic; the two shotguns they got from a gun show, and it WAS fair for the media coverage to point out how firearm laws that are enforced on gun shops were not being enforced at gun shows; they also purchased a handgun from a friend (Mark Manes), who was jailed for selling a gun to a minor. To be fair, a lot of the coverage also focused on the 99 improvised explosive devices they build using the internet; the bombs, in many ways, inspired more fear than the guns did. If so much of the coverage focused on the guns laws, then why did Michael Moore have so much success in educating the U.S. on the Columbine shooting and gun laws in the US with his documentary Bowling for Columbine? No one would have watched that movie if all the coverage already focused on guns. The coverage of Seung-Hui Cho and Jared Loughner also focused FAR more on their troubled pasts than in how they obtained their weapons. Both were extremely mentally deranged. Some news articles did correctly question why people who had many marks on their records as having mental problems could be allowed to buy a firearm; mental illness needs to have a better way of being catalogued so it appears on background checks. Cho was diagnosed with severe depression and selective mutism since he was a child; Loughner's college told him he could not come back until he got a mental health assessment. You have to also realize that much of the coverage didn't even focus on guns, but for example on the acts of heroism, like the teacher who got shot holding the classroom door closed at Virginia Tech or the aid to Giffords who likely saved her life. The Fort Hood shootings, for example, also covered, in depth, how the shooter was ultimately brought down by five shots from police Sergeant Mark Todd. The coverage doesn't ignore the use of guns for self-defense. Let's look to an analogy. 9/11 is sensationalist, so it gets A LOT of coverage because a lot of people died. The 39 incidents where the FBI foiled the terror plot before it even got off the ground get no coverage. [5] This doesn't mean that the media doesn't believe that the FBI should foil terror plots. It just means they are a business. In the same way, the media covering massacres and not making a HUGE deal over self-defense incidents where no one died is not because they don't believe that guns are good and can be used in self-defense, it's just business. The fact is, small incidents are small incident. A gun being used in a home invasion, or to kill one non-famous person, is going to get the same coverage as a gun used to protect a home in self-defense. My opponent's complaint is unfair. National news syndicates don't report local incidents. R2) Double standard My opponent claims that no articles focus on bombs when bombings occur. Are you kidding me? SO MANY articles on Columbine focused on the 99 bombs they made and how it was too easy to make bombs with ingredients you can buy at a hardware store, using the internet; articles even explained in depth how they made the bombs (even though this was exactly the kind of info people didn't want available on the internet). For the Oklahoma City Bombing, which my opponent cites, Wikipedia cites TWENTY articles on how McVeigh gathered the materials, WHAT materials he bought, and how he fabricated them into a bomb. After 9/11, everyone focused on box cutters and how they got on the planes. The anthrax attacks made everyone focus on the new threat from bioweapons. The Sarin Gas attacks on the Tokyo subway made people obsessed with the threat that terrorist groups could obtain chemical weapons. The media and people ARE obsessed with weapons. In fact, they're obsessed with nearly every detail of a gruesome event, not just the weapon used. My opponent claims all the Virginia Tech coverage focused on how Cho obtained the guns, but many articles focused merely on his background. And it's not illegitimate when a tragedy occurs to ask how someone so deranged obtained a gun. Unless my opponent can show another case study that the coverage of Cho was biased, this point will fail. He should have at least cited one article on Virginia Tech. Lastly, my opponent never refutes my point that local news report at least 10-20 local self-defense incidents a week. That's a lot; if the media was biased, they would refuse to report these incidents at all. The last thing I leave you with is that bias must be intentional. To prove I'm biased against black people, you'd have to prove that my personal mindset is racist; if I own a small business and hire two white people, this doesn't prove I hate black people. In the same way, my opponent never proves that anyone in the media is PURPOSELY ignoring self-defense stories and PURPOSELY covering high-profile bad uses of guns, to INTENTIONALLY distort public perceptions. [1] Helping to Stop a Killer: Students Went After Law School Gunman\" by Rex Bowman, Richmond Times Dispatch [2] Gun Lobby says media downplayed role of gun owners in subduing shooter,\" by Rick Montgomery, The Kansas City Star, Mar. 06, 2002 [3] Man who confronted 2002 law school shooter says Gingrich wrong on arming students by Chris Kahn, the Associated Press [4] A Tragedy Compounded by Jim Oliphant, the Legal Times, June 20, 2002 [5]\n\nEvidence Con: Thanks for the response DocZhiva. R1) CNN example My opponent claims he can show systematic intentional and purposeful bias in the media and offers up one example, probably the only good example he has offered thus far, of CNN fabricating a story. This is obviously an example of bad, unfair, and biased journalism but it does not prove anything systematic and the journalists who fabricated the story were punished. This fabrication is counter-balanced by fabrications from pro-gun advocates that embellish DGU's (defense gun usages), for example the fabricated Tracy Bridges story that TWO pro-gun authors then published in their books as a \"case study\" on media bias against guns. The second fabrication comes from the study my opponent cites that there are \"2.5 million DGU's per year.\" My opponent claims there are multiple studies proving this, but there is only one, the Gary Kleck study. If there are other studies, they reproduce the same flawed methodology. ===Refutation of the Gary Kleck Study=== This \"study\" is actually just a survey handed out by Gary Kleck, asking people to self-report how often they used their guns in self-defense. According to The Times Online (UK), \"Of nearly 5,000 American adults polled, 1.326 percent -- or 66 -- were determined by Kleck to have relied on guns for personal protection against criminals in the previous year. The rest is basic math -- too basic, some statisticians argue. Take 1.326 percent of all U.S. adults not incarcerated, and you arrive at the conclusion that Americans use their guns 2.5 million times a year for defense.\" [1] However, a similar survey that actually asked respondents to describe their \"self-defense\" episodes found that most of the episodes were actually \"hostile gun displays\" such as a gang flashing their guns at another gang (supposedly to \"deter a fight\"). The Times Online continues: \"‘Who knows what `self-defense' means?' asked David Hemenway of Harvard University's Injury Control Center. For instance, a thug who shoots in a gang clash might argue he was just defending himself, Hemenway said. So Hemenway crafted surveys of his own. From interviews conducted in 1996 and 1999 involving about 4,500 total respondents, Hemenway found that most acknowledged acts of self-defense were ‘hostile gun displays' rather than ‘socially desirable' moves to halt a crime. Hemenway recently flipped through stories told by respondents describing their acts of self-defense. Here's one: `The police called. The alarm in my building went off so I went there to shut it off. Two men were outside my building, so from my car I shot at the ground near them.' Hemenway paused. ‘That's self-defense?' he asked. ‘Here's another,' the researcher said. ‘A 58-year-old male is watching TV with a holster strapped on him. He tells us, `I was watching a movie, and he (an acquaintance) interrupted me. I yelled that I was going to shoot him, and he ran to his car.' ‘I'm thinking, are these the best stories they can tell?' Hemenway said.\" [1] So most DGU's are actually hostile gun displays (HGD's). This would explain why newspapers don't report them all the time – because LEGITIMATE DGU's are actually pretty uncommon. ====================== Lastly, my opponent must show systematic bias. The liberal bias towards guns on CNN or the NY Times is going to be counter-balanced by the conservative bias in the treatment of the issue on Fox News and the Wall Street Journal, both sources which my opponent never includes in his statistics or case studies. The very last thing to consider is that the CNN story technically didn't lie about the destructive potential of fully automatic assault rifles – they CAN punch through a cinderblock. They only lied about the destructive potential of semi-automatic assault rifles. If anything, this is a PRO-GUN story because the federal government was considering banning only fully automatic assault rifles; had a \"real\" test aired, it could have made the public demand that semi-automatic varieties be banned as well. R2) Major national newspapers don't cover DGU's in equal proportion to gun crimes Firstly, it's not bias to cover one thing rather than another, it's sensationalism. Death sells. My opponent NEVER ANSWERS the argument that the news covers terrorist acts in disproportion to foiled terrorist plots. That doesn't mean the media PREFERS successful terrorist plots to unsuccessful ones or is an advocate for successful terrorist plots. Second, as I've stated, a story about a gun crime is not inherently anti-gun, depending on the coverage. If all the story covers is the facts, what people take away from the story will depend on what they already believe. If a pro-gun person hears the story, he will shake his head and say \"it's that horrible person's fault, I hate murderers.\" If an anti-gun person hears the story, they will think \"wow, I wish guns were banned.\" So a murder with a gun is not inherently an \"anti-gun story.\" Thirdly, this presumes that crimes and DGU's occur in equal proportion in real life. If DGU's are far more rare than crimes, newspapers are just reporting these stories as they come in. Since the Hemenway study finds that most DGU's are actually hostile gun displays, then major newspapers ARE reporting many of the DGU's that are captured by the Gary Kleck study since many of those DGU's are actually gun crimes (like gang \"self-defense\" shootings). But Kleck never asked people to describe their DGU. Apparently when a DGU is described in detail, John Lott suddenly realizes that these are crimes are not DGU's, like the person from the Hemenway study who said he threatened to shoot an acquaintance for disrupting his movie and that was self defense. This is an obvious problem with any studies that involve self-reporting. Fourthly, local news is watched much more commonly than national news, so it shouldn't be a problem since my opponent agrees that all these stories ARE covered by local news. According to Pew Research, 54% of Americans watch LOCAL news. [2] 31% consume online news, the majority of which visit aggregator sites, like Google or Yahoo, which include local news stories (Google has an entire SECTION for local news). [2] So when my opponent says that 40% of the articles on pro-NRA sites were not published by top newspapers, ALL of those articles were still published. The NRA is just linking to local newspapers. 60% being published by top national newspapers is also A LOT. ALSO, some of these aren't really DGU's. For example, the Armed Citizen, under their DGU section, links to an article which found that an ex-Temple law student was found \"not guilty\" in court of attempted murder for shooting a classmate during an argument. [3] That's a DGU??? That's a DGU that John Lott believes the national news is REMISS in not reporting??? Now my opponent looks at the top 3 national newspapers and then the top 10 and says reporting on gun crimes is more common than reporting on DGU's. This would not show bias if gun crimes are far more common than DGU's. There are approximately 1 million crimes in the US each year, many of which are performed with guns. [4] We don't know the number of LEGITIMATE DGU's, but it's likely much lower than 1 million. In addition, my opponent himself admits that 60% of DGU's ARE covered by a top 100 newspaper. The same can't be said for gun crimes, as a percentage. Clearly far fewer than 60% of crimes committed with a gun are reported by a top 100 newspaper, considering how many there are. So DGU's actually receive coverage in disproportion to their occurrence. Lastly, this study was done in 2001. I question how many of the \"gun crime\" stories in the NY Times were about gun crimes in Afghanistan, considering our troops had just entered the country. For example, would this NY Times story about a gun crime in Pakistan be included in the study: My opponent next claims that the NY Times NEVER cites pro-gun authors. This is just patently false. The NY Times decided to run an op-ed by John Lott in 2006, in spite of accusations that the data set he was referring to contained fraudulent data. [5] One final note: Frank Zimring, a criminologist from UC Berkeley, once noted how ridiculous it is that anyone who suggests reasonable laws to prevent crime is considered \"anti-gun.\" Someone who advocates that we strengthen laws to prevent the mentally deranged from acquiring guns is an \"anti-gun advocate.\" Zimring points out that the NRA has essentially framed the issue so there is no middle ground and no such thing as a \"moderate\" viewpoint in this debate. So if John Lott classifies an author or article as anti-gun merely for suggesting sane laws to prevent crime, that is not truly an \"anti-gun\" piece. R3) The 3 major news networks John Lott studied the \"3 major news networks\" for media bias towards guns. By the 3 major news networks, he means \"ABC, CBS and NBC.\" He of course excludes Fox News from his study, which completely invalidates the results. I bet Lott excluded the Wall Street Journal and the National Review from his newspaper study as well. It's easy to show that the media is biased when you only study left-leaning news and EXCLUDE right-leaning news from your study. In fact, according to Pew, Fox News is viewed as far more conservatively biased than any other network is liberally biased. [6] This also shows how outdated the Lott study is, given that the top 3 major news networks today are Fox News, MSNBC, and CNN. The topic is present tense - \"is biased\" - so outdated studies shouldn't apply. Also, the majority of Americans watch local news, not national news, so this doesn't even matter. I don't even know how studying Morning News is legitimate, since their coverage is so different from nightly news. So ultimately, my opponent's only real example is one CNN story, which is counter-balanced by the fabricated Tracy Bridges DGU at Appalachian Law School - sown far and wide by John Lott as a famous DGU, the NRA-backed websites that consider \"being declared not guilty of murder\" as a DGU, and all the DGU's from the Kleck study that were actually hostile gun displays. [1] [2] [3] [4] [5] [6]\n\nEvidence Con: Thanks for the debate DocZhiva! Unfortunately, my opponent's final round falls woefully short of winning him the debate and he drops or fails to answer a number of KEY arguments that I made. 1. Frank Zimring The first argument my opponent fails to answer is from Frank Zimring, where he points out how ridiculous it is that the pro-gun lobby labels anyone pushing for sane gun policies as \"anti-gun.\" My opponent claims, in his last paragraph, that every major gun incident, like Virginia Tech, leads to more gun control laws. But it's possible to be pro-gun and in favor of sane controls on gun ownership. Following Virginia Tech and the Gabrielle Giffords shooting, many people questioned how two individuals that had been diagnosed as mentally ill could STILL so easily acquire a gun. Laws that further restrict criminals and the mentally deranged from owning guns should not be labeled \"anti-gun.\" Yet that's precisely what the Lott study does. Dropping this argument destroys my opponent's studies, since they label many stories as anti-gun that are clearly not anti-gun. Zimring acknowledges that we need to start labeling certain positions as \"moderate,\" such as positions that support gun ownership for law abiding citizens but try to take guns from the mentally deranged. 2. Reporting a gun crime is not \"anti-gun\" My opponent never answers this argument. Every argument my opponent makes, except the one CNN example, hinge on this argument that the media reports more gun crimes than DGU's. But reporting a gun crime is not \"anti-gun.\" When I hear a story about someone like Jared Loughner murdering a bunch of people, I think, \"wow, there are a lot of scary people out there;\" I DON'T think \"wow, there are a lot of scary guns out there.\" Guns are just a tool. If someone hears a story about someone being bludgeoned to death with a hammer, they don't suddenly become scared of hammers. So unless someone is already anti-gun, they are unlikely to be convinced by a gun crime to ban guns, and people who are already anti-gun are unlikely to be dissuaded by hearing about one DGU. Also, reporting gun crimes rather than foiled gun crimes (DGU's) is motivated by sensationalism and gaining more viewership, NOT to bias the audience intentionally. My opponent responds to this with my own analogy. He says, \"Yes, a successful terrorist plot deservedly merits more coverage than a foiled one.\" Then why does a FOILED shooting spree deserve MORE coverage than a successful shooting spree? My opponent claims it does, but without warrant. 3. There are far more gun crimes than DGU's My opponent never answers this directly. Remember, I provided FBI statistics that there are approximately 1 million gun crimes each year. I also provided the Hemenway study, which shows that of the supposed 2.5 million DGU's each year, a MAJORITY of them are actually hostile gun displays. So if there are 1 million gun crimes, 2.3 million hostile guns displays, and 200,000 DGU's each year, it's not surprising that the media reports far more on gun crimes than DGU's because gun crimes are FAR MORE COMMON IN ACTUALITY. This is not bias; this is just good, fair reporting. My opponent questions the methodology of the Hemenway study, but never directly refutes it. All my opponent does is say there are criticisms of a DIFFERENT study (NCVS), which I never cited, and then says, \"Hemenway's study is not exempt from it [the criticism] either.\" But my opponent never tells us what these criticisms are. Remember, I provided Hemenway's methodology IN DEPTH. While Kleck merely sent out thousands of paper surveys and found that 66 people claimed to have had a DGU, Hemenway spent YEARS conducting in-depth interviews, asking respondents to describe their DGU's IN DEPTH, if they claimed to have had a DGU. Remember that one person who claimed to have had a DGU got a call from the alarm company that the alarm in his building had gone off. He drove to his apartment building, saw two men standing near a car outside talking and shot at them (without even verifying they were trying to break in). That's not a DGU, but a hostile gun display. Remember the other example: someone threatened to shoot at an acquaintance who interrupted his movie. That's not a defensive gun use. So Hemenway concluded that a MAJORITY of people who CLAIMED to have had a DGU had actually used their gun in a hostile way, if you actually evaluated the DGU on its merits. So most DGU's should actually be classified as \"gun crimes.\" So again, if gun crimes are FAR more common than DGU's, the media is doing nothing wrong reporting more on gun crimes than on DGU's. This refutes ALL of my opponent's studies and leaves him only with his one CNN example. It was a HUGE mistake for my opponent not to DIRECTLY answer the Hemenway study and to defend his Kleck study's methodology, since this takes out 99% of his case. 4. NRA-backed websites My opponent claims that these websites do not publish every single DGU, but that actually IS the intent of these websites; to publish EVERY SINGLE DGU that they can find. Remember, we saw with the Hemenway study that DGU's are actually FAR RARER than some people would like us to believe. The Lott study tried to show, using these websites, that national news is ignoring these stories. But still, 100% of these stories WERE published, usually by local newspapers. National newspapers rarely report small local stories, like a store clerk using a gun to defend his store against a robbery. Imagine that on the front page of the NY Times – they would quickly lose readership. The Fort Hood shooting, in contrast, is obviously newsworthy, even though the shooting did not occur in New York. In addition, remember a lot of these stories aren't REAL DGU's. Remember the story about the Ex-Temple Law study being declared not guilty of murder? (published on The Armed Citizen website) My opponent claims that this WAS a DGU because the law student claimed it was self-defense. However, just because the court failed to provide sufficient evidence to prove \"beyond a reasonable doubt\" it wasn't self-defense doesn't mean it was (OJ was declared not guilty then wrote a book about how he killed his wife). The Ex-Temple law student shot another student SIX TIMES outside a night club because he claimed the other student had tried to tackle him. That doesn't sound like self-defense. Not every incident that someone claims is a DGU actually is; most are actually hostile gun uses. Lastly, Pew Research says more people read and watch local news than national news, so it doesn't really matter what national news does, when local news is preferred, ESPECIALLY for these type of stories. If someone gets shot in a gang shooting, that's not going to be reporting nationally just like if someone defends his car from a would-be thief with a gun, that's also not going to be reported nationally. I proved in this debate that local DGU's and local crimes are both equally likely to be reported by local news, so there's no bias. 5. Fox News My opponent CONCEDES that Fox News is biased pro-gun, as a conservative news channel, but he claims that since MSNBC attracts liberals and CNN attracts moderates, these are the people who need to be swayed pro-gun, so there's still bias. This makes no sense though. A lot of Pew studies show that people seek news channels that confirm their views, so those viewers weren't going to change their minds anyway. Secondly, my opponent basically agrees that on a holistic scale, the different stations balance each other out. How is the media, on balance, biased if one station is massively conservatively biased and one station is liberally biased (MSNBC) and one station is moderate (CNN). Also, CNN DOES present a moderate viewpoint on guns; remember, it was not one of the 3 \"major\" networks studied by Lott. They have tried very hard to seem unbiased, such as firing Lou Dobbs. So ultimately, I clearly win this point because any bias in liberal media, like the one fabricated CNN report, is going to counter-balanced by conservative sources like Fox News and conservative publications (mostly owned by Rupert Murdoch) like the National Review, The Weekly Standard, The American Spectator, The New American, The CS Monitor, etc. My opponent SHOULD have the burden to prove bias on a holistic scale, not in one isolated case. Remember, the Lott study (as my opponent admits) excludes ALL conservative sources. That's convenient. 6. The CNN story Ok it was fabricated, but again, my opponent must prove the resolution holistically. Also, it was fabricated to show that semi-automatic weapons are LESS dangerous than they actually are; if anything, that serves a pro-gun agenda. My opponent claims that people who OWN semi-automatic guns were falsely induced by the story to ban fully automatic guns BUT THIS IS RIDICULOUS. Most owners of semi-automatic AK-47's belong to the NRA, and even if they're not official members, they are definitely anti-gun control and pro-gun. The VAST MAJORITY of gun control advocates do not own a gun, and definitely not an AK-47. So if anything, the story made people feel safer about semi-automatic weapons, thinking they cannot punch through a cinderblock. Even if you think the story was unfair, it's still counter-balanced by the Appalachian law school fabrication and more holistic bias in conservative publications. 7. Appalachian law school My opponent claims I'm assuming that Bridges is wrong and Besen is right. I presented two sources for this; one said that eyewitnesses saw Besen tackle the shooter but DID NOT see Bridges with a gun; another said the POLICE REPORT backed up Besen's version of events. Besen is clearly telling the truth about tackling the gunman; Bridges is clearly lying that he brought down the shooter using a gun. The fact that John Lott and another author would WIDELY TOUT this event to show media bias shows that the pro-gun lobby is just as guilty of deception as CNN. My opponent's other defense is that Bridges' account is cited by an encyclopedia, but that encyclopedia is Wikipedia, and it ultimately proves, using eyewitnesses and the police report, that Bridges is lying. So, as my opponent puts it, the reason \"the media accounts still chose to favor the student ‘pouncing on the gunman' rather than ‘pointing their guns'\" was because the first was true and the latter wasn't. Besen pounced on the gunman and saved the day. Bridges WASN'T EVEN THERE AT THE TIME (according to eye witnesses). Bridges lied about the timeline, hoping to be viewed as a hero. And Lott spread the lie far and wide. Ultimately, two lies don't make a right, but they do make a Con Vote. ==RECAP== 1. Gun crime \"studies\" => refuted by DGU's being so uncommon compared to crimes (Hemenway study) => refuted by conservative biased sources (Fox News, The Weekly Standard, etc) counter-balancing liberal ones => refuted by fair reporting by local news => refuted by argument that \"reporting a crime\" does not equal \"anti-gun agenda\" => refuted by many DGU's from the studies actually being hostile gun uses (shooting an unarmed man 6 times is not self-defense, even if you're found ‘not guilty' of murder) 2. CNN example => refuted because it's not all that anti-gun, given it paints semi-automatic weapons in a very positive light => refuted by lies on the other side as well (Appalachian law example) => only one example, not enough to prove systematic bias 3. Appalachian law example => completely turned against my opponent (Bridges lied, Lott spread the lie) Those were all the argument in the debate, and they have been clearly refuted. Vote Con.\n","DiscussionID":"00000106","Title":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","CrawlDate":"2016/09/29 03:45:56","URL":"http://www.debate.org/debates/The-News-Media-Is-Biased-Against-the-Positive-Aspects-of-Gun-Ownership/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":226,"nextID":"00000002","PremiseStartPos":[278],"prevID":"00000000","Premise":["Round 1 is for acceptance, Round 4 is for rebuttals. Since most debates about gun control end up devolving into an argument on the semantics of the 2nd amendment I'd like to engage a fresh perspective. The issue mentioned in the title is key to the reason why so much negative public perception is directed at guns, and thus why many people shudder at the thought of unrestricted gun ownership. The position I am taking is that the media, while not always intentionally, has shown a clear bias in reporting stories that convey the negatives of gun usage and ownership. Simultaneously, they have failed to give the same treatment towards the stories which exhibit the positives of everyday citizens using guns. My opponent should be of the position that the media fairly covers both the positive and negative occurrences of gun usage, with no inherent bias towards either side. Keep in mind: this is NOT a debate about the second amendment or its legitimacy. The only topic for discussion here is the news coverage of gun-related incidents. I eagerly await a willing opponent."],"PremiseEndPos":[1354],"ArgumentID":"00000001","Conclusion":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":226,"nextID":"00000003","PremiseStartPos":[1369],"prevID":"00000001","Premise":["I thank bluesteel for accepting this debate. That being said, I believe that there may be misunderstanding in what I meant by \"Positive Aspects\". By that, I am referring to instances of defensive gun uses, not cases of citizens keeping their guns safely locked up. Nonetheless, I will show that the media is quick to blame the gun rather than the individual holding the gun, and also prove that DGU (defensive gun use) receives much less coverage in the media, despite the fact that it occurs more commonly than violent crimes committed with guns. In mass acts of public terrorism (ie campus shootings, school shootings, etc.), the media focuses on the gun rather than the individual(s) involved, and also blatantly omits information and events concerning the positive usage of guns in such situations. In order to prove this point, I intend to present a case study on the 2002 campus shooting at Virginia's Appalachian School of Law. A disgruntled Nigerian student killed the dean, a professor, and another student before being subdued by a group of students. This brief account is the way that most people heard the event, and as a result calls for more gun control were common. Yet one key piece of information is missing from this account: the attacker was subdued not by physical force alone, but by two students grabbing guns from their cars and pointing it at the shooter, then subduing him. In reality, this key fact was hidden from the public by the bias of the news media. Out of 208 stories relating to the incident, a mere four accounts included the fact that the students used guns in the process. 72 had related information that the attacker was stopped by students, but as said before, only four mentioned that guns were involved. As for the ones that chose to omit this key fact? The Washington Post said that they pounced on the gunman until help arrived, without alluding to the fact that the display of guns is what subdued the gunman in the first place. By stark contrast to this minuscule coverage of the positive DGU, 68 of the 208 news articles (including the aforementioned Washington Post one) felt it necessary to detail that the gunman had a \".380 semiautomatic pistol\". So, they give the attention to the gun used to commit the crime, which could have been any gun or even a non-gun instrument, yet neglect the key detail of how guns were used in the stoppage of any further loss of life? Furthermore, it can clearly be observed that the media, while not always intentionally, has galvanized public sentiment against guns with its relentless coverage of incidents like the Va Tech shooting, Columbine, Arizona incident with Rep. Giffords, etc. Nearly everyone has heard of these incidents, and in all the coverage the focus centered around how bad guns were and why the perpetrators were able to obtain them. While these incidents are \"household names\" in terms of mass public terrorism, certain lesser known instances involving shooters being stopped have received considerably less press. Survey any group of Americans, and I guarantee that the public awareness of the incident when \"an assistant principal at Pearl High School in Mississippi retrieved his legally owned Colt .45 from his car and stopped a student shooter after that student killed two people\" is much less than the Virginia Tech massacre. Or how \"at an eighth-grade school dance in Pennsylvania, a boy fatally shot a teacher and wounded two students before the owner of the dance hall brought the killing to a halt with his own gun\". Why? By the very nature of the \"sensationalized\" media, as you called it, it proves much more newsworthy to report incidents with massive losses of life rather than ones with, by news standards, \"normal\" amounts of deaths which were prevented from escalating by DGU. Within this bias towards the remarkable stories, key instances about positive DGU is less available to the public, and as a result public opinion reflects a prevailing belief that having guns around is a threat and that DGU is an unfeasible course of action. The intensive focus on guns in gun-related instances represents a double standard by the media as well, as opposed to their method of covering non-gun acts of violence. In non-gun acts of violence, the focus somehow seems to shift to the individual and not the instruments they used to commit their deeds. I have yet to hear of any stories which focused on Ryder trucks or ammonium nitrate in the aftermath of the OKC bombings. Nor have I heard of any debates focusing on the knives and buzz saws used in the twisted crimes of Jeffrey. Similarly, there has never been an outpouring of support for a ban on such instruments after these incidents. Instead, media coverage was centered on the past lives of the perpetrators, with almost zero focus on the instruments used to commit the crimes. Even though these instruments were just as important to the crimes as guns were in the Va Tech shooting, the media paid no attention to them, and as a result more public sentiment was felt towards the crimes themselves. By contrast, when people recall the Virginia Tech shootings, they are inclined to bring up the fact that Seung-hei Cho was able to obtain a weapon despite the restrictions. Yet when a similar incident happened on that same campus, involving a student being stabbed, I heard zero articles focused on the dangers of having knives. In summary, while mass murder cases with guns do feature a great deal of coverage about the perpetrators, they also feature an equal, if not greater, amount of coverage on the guns themselves. This greatly differs from the scant attention paid to the instruments of non-gun crimes, even though the Ryder truck and ammonium nitrate was just as important to the OKC bombing as guns were to the cases of school shootings. I believe that in my presented argument, I have clearly exhibited the media's penchant to frame guns as only being used for destruction. This, however, only encompasses the scope of nationally-newsworthy incidents. I intend to further display the logical reasons as to why even the local media features an embedded bias towards broadcasting DGU as opposed to gun incidents where blood is spilled. In the meantime, I await my opponent's responses to my arguments presented thus far. References (Excerpt from John Lott's book The Bias against Guns)"],"PremiseEndPos":[7733],"ArgumentID":"00000002","Conclusion":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":226,"nextID":"00000004","PremiseStartPos":[7748],"prevID":"00000002","Premise":["I thank bluesteel for the thought-provoking rebuttal. Admittedly, I believe that using only one case as a method to convey the media bias is not the most effective way. Therefore, I will use this round to illustrate the broader media bias which is present in the everyday news events involving guns. In effect, I will also address some of the points made by my opponent in his previous rebuttal and disprove them. In the same way, my opponent never proves that anyone in the media is PURPOSELY ignoring self-defense stories and PURPOSELY covering high-profile bad uses of guns, to INTENTIONALLY distort public perceptions. While I cannot read the media's minds, I can certainly provide a heap of evidence which would suggest that stories involving malicious usage of guns receive far more attention than the good uses. Furthermore, I can prove that the media purposely chooses to emphasize the negative aspects of guns in other manners than just accounts of incidents. First, I'd like to present the most blatantly extreme example of INTENTIONAL, CONFESSED media bias in reporting about guns. This incident was clearly meant to advance left-wing views of banning assault weapons, and was not just an honest mistake, but a clear case of intentionally falsified journalism in order to spread a viewpont held by CNN. In short, NRA president Wayne Lapierre was the one who called out CNN for deliberately faking a report on the danger of fully automatic assault weapons, the ban on which was set to expire next year. [1] CNN fired an automatic AK-47 at cinderblocks, but with the semiautomatic civilian example being intentionally shot into the ground to convince viewers that the banned version was so much more destructive. This epitomizes irresponsible, fabricated journalism, and correlates with the stance that the media has always possessed (albeit in a less obvious manner which I will explain). If this does not qualify as bias, I don't know what is. I believe that my opponent will be hard-pressed to deny the bias lying in this incident, nor will he be able to find a similar example of an intentionally fabricated story by a major media outlet used to advance a pro-gun standpoint. A gun being used in a home invasion, or to kill one non-famous person, is going to get the same coverage as a gun used to protect a home in self-defense. My opponent's complaint is unfair. National news syndicates don't report local incidents. Really? I have evidence which would suggest otherwise. That is, evidence that suggests that they report local incidents of gun tragedies, rather than acts of crime prevention with guns. To prove this, I will recall my opponent's reference to thearmedcitizen.com, a website run by the NRA. That alone should point to the limited audience such a website will receive. My opponent also presents the erroneous claim that \"if the media was biased, they would refuse to report these incidents at all\". Bias is not necessarily a complete exclusion of the opposing side; it is merely a clear preference for one side over the other. My opponent's reference to The Armed Citizen only furthers the argument of bias against guns. This site along with its counterpart keepandbeararms.com, serve as the two major archives of defensive gun use incidents. John Lott did extensive research into the composition of these stories reported on here, and at the time of his research a shocking 40% of the archived stories during 2001 on these two sites had not even been published in top 100 newspapers. [2] There were just 37 present in the top 10, with 26 being published in either the Houston Chronicle or Dallas Morning News. Now, my opponent may further argue that local stories should not merit coverage by these major papers. Yet, statistics on the nation's three top newspapers suggest that gun crimes have received such expanded coverage. The same cannot be said for defensive gun stories. In the same year of 2001: -New York Times published 104 articles on gun crimes that year, for a total of 50,745 words on the subject (gun crimes meaning actual reportings of gun violence). Roughly 1/3 of those stories were from outside the New York area. By contrast, there was only one 163-word story about a DGU in the New York area. -USA Today, which has no geographical limitations, contained 5,660 words on gun crimes and zero on DGUs. -Washington Post contained 46,884 words on gun crime (1/4 from outside the DC area) as opposed to three stories on DGU amounting to 953 words. In the entire top 10 national newspapers, only 13 other incidents of DGU were reported, compared to a countless number of stories on the other end of the gun violence spectrum. My opponent's claim that local news stories about gun crimes receive equal coverage as DGU is clearly refuted by this wide-reaching examination of major newspapers. Why these stories of gun crimes prove any more newsworthy than cases of DGU is beyond explanation, yet the news media still chooses to show an overwhelming preference for reporting the negative usage of guns over the positives. This preference does not stop at reporting gun-involved incidents, however. In the New York Times. the stories relating to discussions of gun policies and gun research were COMPLETELY slanted towards the anti-gun side. Nine experts who, through their own previous works, had expressed strongly pro-gun control views, were cited a total of twenty times. Gary Kleck, the man behind the \"2.5 million DGUs per year\" statistic, was the only expert who had a somewhat neutral stance on the issue, and he was cited once. How many academics against gun laws were cited in the two year period assessed? Zlich. Not that they are non-existent. After all, the year before data was collected for this particular assesment, 294 academics had come together to write a letter informing Congress that the new proposed gun laws were \"ill-advised\". The New York Times represents unbalanced journalism which displayed an undeniable bias in not letting a single academic opposing gun control express their views. [2] This ensured that the general public remains uninformed about the potential benefits of guns. Similar statistics to the ones presented for newspapers manifest within TV reporting on the subject. The stories of 2001 on the three major news networks: 190,000 words in stories on gun crimes, with only one 580 word story about an off-duty officer preventing a school shooting. Despite the fact that numerous estimates place the number of DGUs at between 1 to 3 million per year in the United States (a rate much greater than the number of gun homicides), the coverage reflects a much different story. Despite the fact that many DGUs provide newsworthy events, such as a life saved by the defensive use of a gun, the print and TV media chooses to overwhelmingly ignore such cases and instead report on the typical case of a tragic death attributed to guns. Furthermore, just as the NY Times likes to ignore the opinions of the academics who contradict the anti-gunners, TV exhibits the same bias. Good Morning America is easily the worst offender in terms of media bias. Despite stories of heroism with guns in that year, such as a killer in Michigan being stopped from firing at passing cars by a concealed permit holder, GMA opted instead to broadcast less newsworthy incidents which were rather typical incidents of gun violence, incidents which shouldn't have made it to the national news if the one in Michigan didn't. [2] Yet this kind of blatant preference epitomizes the stance of the media today: galvanize public sentiments about guns while not allowing the other side of the issue to come through. The CNN story was an all too obvious example, and the unbalanced coverage by other major media outlets accomplishes the same bias, albeit in a less obvious manner. I have provided evidence that proves the media bias, it is up to Con to say otherwise. [1] [2]"],"PremiseEndPos":[15672],"ArgumentID":"00000003","Conclusion":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":226,"nextID":"00000005","PremiseStartPos":[15687],"prevID":"00000003","Premise":["Thanks to bluesteel for a very engaging and informative debate. My opponent concluded his last round with a statement chock-full of sweeping overgeneralizations and assumptions. My opponent's only real example is one CNN story... While the CNN story is not my only example, it certainly is a concrete one where the bias is obvious. I did describe this as an extreme incident, yet its bearing cannot be entirely discounted. In the time context of an expiring assault weapons ban, the story deliberately tried to galvanize emotional response to this fact. To call this a pro-gun story in any respect, as my opponent alluded to, is completely preposterous. Yes, the semi-auto AK-47 could have penetrated the cinderblock, but that was not the issue that CNN tried to get across. The point of the comparison was to deliberately exhibit a damage \"gradient\" between semi-auto and fully automatic weapons. If viewers, especially those who responsibly own semi-automatic rifles, would have seen a truly accurate comparison, they would have perceived little difference in stopping power between what they safely own and what is banned. Such a thought would destroy the credibility of banning automatic weapons, and CNN tried to avoid instilling such a thought by deliberately manipulating the study. Next, my opponent claims that this intentional example of bias is \"counter-balanced\" by a slew of factors, all of which are inaccurate. Appalachian Law School - My opponent has repeatedly accused Bridges and Lott of being in some kind of \"conspiracy\" to fabricate the details in order to advance a pro-gun viewpoint. Not only is this faulty reasoning, but it incorrectly assumes that Bridges is wrong and Besen is right. Both accounts of the incident have been placed in encyclopedic accounts of the shooting, so to say that one account is patently false is unfounded. Neither account has been proved or disproved without a doubt, so my opponent cannot reasonably assume that Bridges is lying. Furthermore, this incident does not negate the CNN story or the other examples of media bias against guns. As I said before, despite the fact that neither account was proved right or wrong beyond a reasonable doubt, the media accounts still chose to favor the student \"pouncing on the gunman\" rather than \"pointing their guns\". NRA-Backed Website - My opponent claims that because The Armed Citizen collected a story about a not guilty verdict in a shooting case, and \"classified it as a DGU\", the website should not be taken seriously. If one looks at this story, it was an acquittal of a student charged with attempted murder in an alleged case of SELF-DEFENSE. This is perfectly in-line with the site's intentions of collecting stories PERTAINING TO defensive gun-use. This does not limit their coverage to stories solely describing the details of a DGU. While on the subject of this website, I should also address my opponent's argument that based on what I had said earlier, \"60% of DGUs are covered by a top 100 newspaper\". First off, The Armed Citizen is in no way a comprehensive listing of all newsworthy DGUs (not just showing a gun). When I said 40% weren't covered, this means that 40% of the stories on that specific site weren't covered in a top 100 newspaper. Furthermore, if my opponent were to argue that these archived stories are adequate evidence to counter-balance the bias against guns, he would have to show that the geographical distribution of the reported occurrences is near uniformly correlating to population size. If a state like Nebraska has more covered stories than a large state like California or New York is not, then this does still indicate a media bias. After all, since it is well known that gun crimes (and logically DGUs) occur much more frequently in urban areas than rural ones, then clearly a large urban state being low on this list would indicate a systematic exclusion of stories covering beneficial usage of guns. Kleck Study - Perhaps this is the most strikingly overgeneralized of my opponent's points. He claims in his last sentence that this study contained DGU's that were all hostile gun displays. To single out the methodology of Kleck's study is inherently wrong. Studies obtaining lower figures for DGUs, such as the NCVS, also have their fair share of criticism. Hemenway's study is not exempt from it either. Furthermore, the Kleck study has absolutely nothing to do with media bias. It was a study published in a criminology journal, and has evolved into a frequently cited statistic. It was never intended to advance any viewpoint, as Kleck himself is a self-described liberal with moderate views on gun-control. My opponent tries to cite this \"flawed\" study as a refutation of the media bias, yet ignores the fact that it was intended for academic purposes and not to be cited by members of both sides of the gun debate. As can be seen, my opponent's closing points are faulty counter-examples, while the CNN story can be legitimately viewed as an anti-gun story. My opponent also claims that the media is not anti-gun just because it reports more gun crimes. This is true, but there are other methods that it shows its bias. Let us examine my opponent's analogy to foiled terrorist plots. This analogy does not fit the situation at hand with the media. Yes, a successful terrorist plot deservedly merits more coverage than a foiled one. But this is not the case with the media and gun stories. What makes the stories about average, every-day citizens discharging a gun, saving innocent lives in the process, less newsworthy than a child who gets a hold of his parents' irresponsibly placed gun and causes a tragedy? To address the point of contention about local news being more watched than national news, we must consider the more profound effect that hearing or reading something within the national news has upon a viewer. The importance of the story is magnified, and it reaches a wider audience. With national newspapers and television having their clear bias towards reporting gun crimes. And while there may not be 2.5 million newsworthy DGUs to report, there are certainly more than the combined total of around 5,000 words that the mainstream national news gave them. To answer the question over what Lott counted as a gun crime, it was strictly limited to objective accounts of domestic incidents of gun crime (a story about Afghanistan would not qualify). Lott also did count the WSJ in his study of newspapers; they reported zero DGUs in that year as well. Furthermore, if legitimate, newsworthy DGUs are as rare as my opponent claims, why don't they get more attention? Fox News also detracts nothing from the media bias, since by my opponent's own admission it is more far-right than CNN is far-left. Therefore, it is bound to attract an audience that already agrees that guns are beneficial, and airing more stories about DGUs won't affect them. By contrast, when left-leaning sources like CNN and the NY Times do not objectively report the issue, their audiences (composed of more moderate types along with liberals) will hear few stories about beneficial gun usage. To conclude, I will leave with a thought to consider. When the media, national or local, reports a story about an unfortunate gun tragedy or accident, it is almost always tailed by some kind of resulting campaign or push for more stringent gun control laws. However, it is unheard of for a report about a heroic DGU, if it manages to be shown, to be accompanied by a call for more access to guns by law-abiding citizens. The fact that so many people are skeptic of repeated studies showing high numbers of DGUs speaks to the manner in which the media has conveyed them to the general public. As a result of these factors, along with the presented evidence, I encourage a Pro vote."],"PremiseEndPos":[23500],"ArgumentID":"00000004","Conclusion":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":226,"nextID":"00000006","PremiseStartPos":[23515],"prevID":"00000004","Premise":["Thanks for the topic DoctorZhiva. We should both agree in this debate that the news media is SENSATIONALIST. Obviously, they want to put out stories that viewers find interesting, so they are not going to report on what I ate for lunch (unless it was a 20 pound burger). So obviously the media is going to report a lot of bad things that guns do - like murders, robberies, etc. My opponent must prove that in the reporting of these events, the media has a track record of always blaming the gun itself, rather than the person holding it. He cannot just show that the media tends to cover criminal shootings and NOT average citizens who keep their guns safely locked up and never have their kids shoot themselves with an improperly stored weapon. That wouldn't make an interesting story: \"for today's 10 o'clock news, let's look to Jonathan Smith, who keeps his gun locked up safely. Here is the gun safe. Here is a picture of his gun. Here is a picture of Jonathan. Isn't that amazing. Gun locks? Wow, technology... The teleprompter says \"vamp for 10 minutes\" now. I don't know what to say. Um, so, guns are awesome right. Let me read you from the NRA fact sheet...\" In fact, if the media were to read fact sheets from lobbying groups on either side, that would be bias. The media is supposed to report the facts of a story. For definition purposes, the news media means actual news, not opinion pundits (like Rachel Maddow), who can express their own opinions. I will show that the media reports just as many self-defense episodes as other shootings. They don't purposely ignore self-defense. For example, this website, which hasn't been updated since February, keeps a record of every news story on gun self-defenses. It has 15 stories from one ONE WEEK in February 2011. Obviously, the media reports A LOT of stories on self-defense. Every time the website updated, it found more than 10 self-defenses reported every week in the media. Since the media is sensationalist, there aren't any other positive aspects of guns for them to report on. They're not going to be doing story after story about how hunting deer is awesome and helps put dinner on the table in rural California. I await my opponent's response."],"PremiseEndPos":[25729],"ArgumentID":"00000005","Conclusion":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":226,"nextID":"00000007","PremiseStartPos":[25744],"prevID":"00000005","Premise":["Thanks for the quick reply DoctorZhiva. ==Rebuttal== R1) School shootings My opponent claims there is widespread bias in the media in their coverage of campus shootings because they PURPOSELY misrepresent the facts and refuse to cover the fact that guns were involved in self-defense. However, he cites ONE INCIDENT at Virginia's Appalachian School of Law to prove this. Let me show the problems with this argument. First, my opponent says that of 208 news stories, only 4 mentioned that students used guns in the process to subdue the gunman. However, he HIMSELF says that only 72 of those articles even mentioned AT ALL that the gunman was subdued. Secondly, this seems really curious – is it really the case that 68 publications purposely lied about how the gunman was subdued? That really would prove widespread bias. Let's assume for a second that the Associated Press made a MISTAKE when covering the issue and talked to the wrong person, who gave them a false account (that the gunman was pounced on rather than subdued with two guns). Most small time local publications merely print the Associated Press story, without editing. So this only proves that there was ONE mistake, re-printed 68 times, not that 68 publications purposely distorted facts. But most importantly, the above Associated Press example is theoretical. In all actuality, it is most likely that the two students who claimed they used guns likely lied about their role in subduing the shooter, to gain popularity or to emphasize the good use of guns (when being interviewed by authors like Trent Lott, who have a clear pro-gun agenda). There are two CONFLICTING accounts of how Peter Odighizuwa (the Nigerian gunman) was subdued. The first account is from Tracy Bridges. He claims that he and Mikael Gross, both unbeknownst to each other, ran to their cars to retrieve their guns, since Gross was a cop at the time and Bridges a county sheriff. They approached Odighizuwa and Bridges yelled for Odighizuwa to drop his gun, which he did, and was then subdued by several other unarmed students, including Ted Besen and Todd Ross. [1] The second account is the Ted Besen account. According to Besen, Odighizuwa, out of ammo, set down his gun and started mocking people. [2] Besen, a former Marine and police officer at the time, took this opportunity to engage in a physical confrontation with Odighizuwa and knock him to the ground, where he was then subdued and held down by other students, like Todd Ross. Only after Odighizuwa was ALREADY subdued did Besen report seeing Tracy Bridges and Mikael Gross arrive with their guns, too late to be of any assistance. While Besen and Ross held Odighizuwa down, Gross then went back to his car yet again to retrieve handcuffs to detain Odighizuwa until police arrived. [3] The account that is most likely TRUE is the Besen account. Bridges is most likely lying to gain attention from pro-gun advocates and to gain glory. It is surprising that Gross doesn't seem to back his account. There is also additional evidence to back Besen's account. \"Additional witnesses at the scene stated they did not see Bridges or Gross with their guns at the time Besen started subduing Odighizuwa.\" [4] The official police report also notes that Odighizuwa dropped his gun because the magazine was empty (NOT because he had a gun pointed at him). [4] So additional witnesses AND the police report both back Besen's account. So ultimately, the 68 sources that reported that students subdued Odighizuwa by jumping on him were CORRECT and the 4 that noted Bridges account were WRONG, did not give Besen the credit that he DESERVES, AND were examples of bad journalism. The more legitimate sources, like the Washington Post, actually did their homework, read the police report, and interviewed multiple witnesses before going to press, rather than merely printing what Bridges told them (which 4 local publications and Trent Lott did). Lott and my opponent never tell us why we should prefer Bridge's account to the truth. The last thing my opponent complains about is that the media reported what type of gun was used by the shooter. That's just good reporting; there's no reason for the media to leave out this fact. A reporters job is to report all the facts. My opponent's next evidence is that Virginia Tech, Columbine, and the Gabriel Giffords shooting get a lot of coverage in the press, whereas incidents of self-defense don't get the same coverage. This has nothing to do with guns and everything do with sensationalism. A story where no one died (because someone pulled a gun in self-defense) is not going to get as many listeners as a story about a school shooting where 32 people died and 25 were injured (Virginia Tech). My opponent never proves that the coverage of these incidents focused on the guns to the exclusion of the shooters. In fact, I followed the coverage of all three very closely and nearly every article blamed the shootings on highly disturbed individuals and tracked the lives of those individuals, trying to explain how they became so mentally disturbed. People are far more interest in WHY someone would choose to go on killing spree and not so much in how they obtained their gun. For example, the Columbine coverage focused a great deal on how the shooters were social outcasts, how they were goths and wore weird clothing and seemed to revel in suffering, how they listened to Marilyn Manson, how they played violent video games, and how they were likely extremely depressed. There was some coverage of how they obtained their weapons because it actually was kind of problematic; the two shotguns they got from a gun show, and it WAS fair for the media coverage to point out how firearm laws that are enforced on gun shops were not being enforced at gun shows; they also purchased a handgun from a friend (Mark Manes), who was jailed for selling a gun to a minor. To be fair, a lot of the coverage also focused on the 99 improvised explosive devices they build using the internet; the bombs, in many ways, inspired more fear than the guns did. If so much of the coverage focused on the guns laws, then why did Michael Moore have so much success in educating the U.S. on the Columbine shooting and gun laws in the US with his documentary Bowling for Columbine? No one would have watched that movie if all the coverage already focused on guns. The coverage of Seung-Hui Cho and Jared Loughner also focused FAR more on their troubled pasts than in how they obtained their weapons. Both were extremely mentally deranged. Some news articles did correctly question why people who had many marks on their records as having mental problems could be allowed to buy a firearm; mental illness needs to have a better way of being catalogued so it appears on background checks. Cho was diagnosed with severe depression and selective mutism since he was a child; Loughner's college told him he could not come back until he got a mental health assessment. You have to also realize that much of the coverage didn't even focus on guns, but for example on the acts of heroism, like the teacher who got shot holding the classroom door closed at Virginia Tech or the aid to Giffords who likely saved her life. The Fort Hood shootings, for example, also covered, in depth, how the shooter was ultimately brought down by five shots from police Sergeant Mark Todd. The coverage doesn't ignore the use of guns for self-defense. Let's look to an analogy. 9/11 is sensationalist, so it gets A LOT of coverage because a lot of people died. The 39 incidents where the FBI foiled the terror plot before it even got off the ground get no coverage. [5] This doesn't mean that the media doesn't believe that the FBI should foil terror plots. It just means they are a business. In the same way, the media covering massacres and not making a HUGE deal over self-defense incidents where no one died is not because they don't believe that guns are good and can be used in self-defense, it's just business. The fact is, small incidents are small incident. A gun being used in a home invasion, or to kill one non-famous person, is going to get the same coverage as a gun used to protect a home in self-defense. My opponent's complaint is unfair. National news syndicates don't report local incidents. R2) Double standard My opponent claims that no articles focus on bombs when bombings occur. Are you kidding me? SO MANY articles on Columbine focused on the 99 bombs they made and how it was too easy to make bombs with ingredients you can buy at a hardware store, using the internet; articles even explained in depth how they made the bombs (even though this was exactly the kind of info people didn't want available on the internet). For the Oklahoma City Bombing, which my opponent cites, Wikipedia cites TWENTY articles on how McVeigh gathered the materials, WHAT materials he bought, and how he fabricated them into a bomb. After 9/11, everyone focused on box cutters and how they got on the planes. The anthrax attacks made everyone focus on the new threat from bioweapons. The Sarin Gas attacks on the Tokyo subway made people obsessed with the threat that terrorist groups could obtain chemical weapons. The media and people ARE obsessed with weapons. In fact, they're obsessed with nearly every detail of a gruesome event, not just the weapon used. My opponent claims all the Virginia Tech coverage focused on how Cho obtained the guns, but many articles focused merely on his background. And it's not illegitimate when a tragedy occurs to ask how someone so deranged obtained a gun. Unless my opponent can show another case study that the coverage of Cho was biased, this point will fail. He should have at least cited one article on Virginia Tech. Lastly, my opponent never refutes my point that local news report at least 10-20 local self-defense incidents a week. That's a lot; if the media was biased, they would refuse to report these incidents at all. The last thing I leave you with is that bias must be intentional. To prove I'm biased against black people, you'd have to prove that my personal mindset is racist; if I own a small business and hire two white people, this doesn't prove I hate black people. In the same way, my opponent never proves that anyone in the media is PURPOSELY ignoring self-defense stories and PURPOSELY covering high-profile bad uses of guns, to INTENTIONALLY distort public perceptions. [1] Helping to Stop a Killer: Students Went After Law School Gunman\" by Rex Bowman, Richmond Times Dispatch [2] Gun Lobby says media downplayed role of gun owners in subduing shooter,\" by Rick Montgomery, The Kansas City Star, Mar. 06, 2002 [3] Man who confronted 2002 law school shooter says Gingrich wrong on arming students by Chris Kahn, the Associated Press [4] A Tragedy Compounded by Jim Oliphant, the Legal Times, June 20, 2002 [5]"],"PremiseEndPos":[36613],"ArgumentID":"00000006","Conclusion":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":226,"nextID":"00000008","PremiseStartPos":[36628],"prevID":"00000006","Premise":["Thanks for the response DocZhiva. R1) CNN example My opponent claims he can show systematic intentional and purposeful bias in the media and offers up one example, probably the only good example he has offered thus far, of CNN fabricating a story. This is obviously an example of bad, unfair, and biased journalism but it does not prove anything systematic and the journalists who fabricated the story were punished. This fabrication is counter-balanced by fabrications from pro-gun advocates that embellish DGU's (defense gun usages), for example the fabricated Tracy Bridges story that TWO pro-gun authors then published in their books as a \"case study\" on media bias against guns. The second fabrication comes from the study my opponent cites that there are \"2.5 million DGU's per year.\" My opponent claims there are multiple studies proving this, but there is only one, the Gary Kleck study. If there are other studies, they reproduce the same flawed methodology. ===Refutation of the Gary Kleck Study=== This \"study\" is actually just a survey handed out by Gary Kleck, asking people to self-report how often they used their guns in self-defense. According to The Times Online (UK), \"Of nearly 5,000 American adults polled, 1.326 percent -- or 66 -- were determined by Kleck to have relied on guns for personal protection against criminals in the previous year. The rest is basic math -- too basic, some statisticians argue. Take 1.326 percent of all U.S. adults not incarcerated, and you arrive at the conclusion that Americans use their guns 2.5 million times a year for defense.\" [1] However, a similar survey that actually asked respondents to describe their \"self-defense\" episodes found that most of the episodes were actually \"hostile gun displays\" such as a gang flashing their guns at another gang (supposedly to \"deter a fight\"). The Times Online continues: \"‘Who knows what `self-defense' means?' asked David Hemenway of Harvard University's Injury Control Center. For instance, a thug who shoots in a gang clash might argue he was just defending himself, Hemenway said. So Hemenway crafted surveys of his own. From interviews conducted in 1996 and 1999 involving about 4,500 total respondents, Hemenway found that most acknowledged acts of self-defense were ‘hostile gun displays' rather than ‘socially desirable' moves to halt a crime. Hemenway recently flipped through stories told by respondents describing their acts of self-defense. Here's one: `The police called. The alarm in my building went off so I went there to shut it off. Two men were outside my building, so from my car I shot at the ground near them.' Hemenway paused. ‘That's self-defense?' he asked. ‘Here's another,' the researcher said. ‘A 58-year-old male is watching TV with a holster strapped on him. He tells us, `I was watching a movie, and he (an acquaintance) interrupted me. I yelled that I was going to shoot him, and he ran to his car.' ‘I'm thinking, are these the best stories they can tell?' Hemenway said.\" [1] So most DGU's are actually hostile gun displays (HGD's). This would explain why newspapers don't report them all the time – because LEGITIMATE DGU's are actually pretty uncommon. ====================== Lastly, my opponent must show systematic bias. The liberal bias towards guns on CNN or the NY Times is going to be counter-balanced by the conservative bias in the treatment of the issue on Fox News and the Wall Street Journal, both sources which my opponent never includes in his statistics or case studies. The very last thing to consider is that the CNN story technically didn't lie about the destructive potential of fully automatic assault rifles – they CAN punch through a cinderblock. They only lied about the destructive potential of semi-automatic assault rifles. If anything, this is a PRO-GUN story because the federal government was considering banning only fully automatic assault rifles; had a \"real\" test aired, it could have made the public demand that semi-automatic varieties be banned as well. R2) Major national newspapers don't cover DGU's in equal proportion to gun crimes Firstly, it's not bias to cover one thing rather than another, it's sensationalism. Death sells. My opponent NEVER ANSWERS the argument that the news covers terrorist acts in disproportion to foiled terrorist plots. That doesn't mean the media PREFERS successful terrorist plots to unsuccessful ones or is an advocate for successful terrorist plots. Second, as I've stated, a story about a gun crime is not inherently anti-gun, depending on the coverage. If all the story covers is the facts, what people take away from the story will depend on what they already believe. If a pro-gun person hears the story, he will shake his head and say \"it's that horrible person's fault, I hate murderers.\" If an anti-gun person hears the story, they will think \"wow, I wish guns were banned.\" So a murder with a gun is not inherently an \"anti-gun story.\" Thirdly, this presumes that crimes and DGU's occur in equal proportion in real life. If DGU's are far more rare than crimes, newspapers are just reporting these stories as they come in. Since the Hemenway study finds that most DGU's are actually hostile gun displays, then major newspapers ARE reporting many of the DGU's that are captured by the Gary Kleck study since many of those DGU's are actually gun crimes (like gang \"self-defense\" shootings). But Kleck never asked people to describe their DGU. Apparently when a DGU is described in detail, John Lott suddenly realizes that these are crimes are not DGU's, like the person from the Hemenway study who said he threatened to shoot an acquaintance for disrupting his movie and that was self defense. This is an obvious problem with any studies that involve self-reporting. Fourthly, local news is watched much more commonly than national news, so it shouldn't be a problem since my opponent agrees that all these stories ARE covered by local news. According to Pew Research, 54% of Americans watch LOCAL news. [2] 31% consume online news, the majority of which visit aggregator sites, like Google or Yahoo, which include local news stories (Google has an entire SECTION for local news). [2] So when my opponent says that 40% of the articles on pro-NRA sites were not published by top newspapers, ALL of those articles were still published. The NRA is just linking to local newspapers. 60% being published by top national newspapers is also A LOT. ALSO, some of these aren't really DGU's. For example, the Armed Citizen, under their DGU section, links to an article which found that an ex-Temple law student was found \"not guilty\" in court of attempted murder for shooting a classmate during an argument. [3] That's a DGU??? That's a DGU that John Lott believes the national news is REMISS in not reporting??? Now my opponent looks at the top 3 national newspapers and then the top 10 and says reporting on gun crimes is more common than reporting on DGU's. This would not show bias if gun crimes are far more common than DGU's. There are approximately 1 million crimes in the US each year, many of which are performed with guns. [4] We don't know the number of LEGITIMATE DGU's, but it's likely much lower than 1 million. In addition, my opponent himself admits that 60% of DGU's ARE covered by a top 100 newspaper. The same can't be said for gun crimes, as a percentage. Clearly far fewer than 60% of crimes committed with a gun are reported by a top 100 newspaper, considering how many there are. So DGU's actually receive coverage in disproportion to their occurrence. Lastly, this study was done in 2001. I question how many of the \"gun crime\" stories in the NY Times were about gun crimes in Afghanistan, considering our troops had just entered the country. For example, would this NY Times story about a gun crime in Pakistan be included in the study: My opponent next claims that the NY Times NEVER cites pro-gun authors. This is just patently false. The NY Times decided to run an op-ed by John Lott in 2006, in spite of accusations that the data set he was referring to contained fraudulent data. [5] One final note: Frank Zimring, a criminologist from UC Berkeley, once noted how ridiculous it is that anyone who suggests reasonable laws to prevent crime is considered \"anti-gun.\" Someone who advocates that we strengthen laws to prevent the mentally deranged from acquiring guns is an \"anti-gun advocate.\" Zimring points out that the NRA has essentially framed the issue so there is no middle ground and no such thing as a \"moderate\" viewpoint in this debate. So if John Lott classifies an author or article as anti-gun merely for suggesting sane laws to prevent crime, that is not truly an \"anti-gun\" piece. R3) The 3 major news networks John Lott studied the \"3 major news networks\" for media bias towards guns. By the 3 major news networks, he means \"ABC, CBS and NBC.\" He of course excludes Fox News from his study, which completely invalidates the results. I bet Lott excluded the Wall Street Journal and the National Review from his newspaper study as well. It's easy to show that the media is biased when you only study left-leaning news and EXCLUDE right-leaning news from your study. In fact, according to Pew, Fox News is viewed as far more conservatively biased than any other network is liberally biased. [6] This also shows how outdated the Lott study is, given that the top 3 major news networks today are Fox News, MSNBC, and CNN. The topic is present tense - \"is biased\" - so outdated studies shouldn't apply. Also, the majority of Americans watch local news, not national news, so this doesn't even matter. I don't even know how studying Morning News is legitimate, since their coverage is so different from nightly news. So ultimately, my opponent's only real example is one CNN story, which is counter-balanced by the fabricated Tracy Bridges DGU at Appalachian Law School - sown far and wide by John Lott as a famous DGU, the NRA-backed websites that consider \"being declared not guilty of murder\" as a DGU, and all the DGU's from the Kleck study that were actually hostile gun displays. [1] [2] [3] [4] [5] [6]"],"PremiseEndPos":[46778],"ArgumentID":"00000007","Conclusion":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":226,"nextID":"00000000","PremiseStartPos":[46793],"prevID":"00000007","Premise":["Thanks for the debate DocZhiva! Unfortunately, my opponent's final round falls woefully short of winning him the debate and he drops or fails to answer a number of KEY arguments that I made. 1. Frank Zimring The first argument my opponent fails to answer is from Frank Zimring, where he points out how ridiculous it is that the pro-gun lobby labels anyone pushing for sane gun policies as \"anti-gun.\" My opponent claims, in his last paragraph, that every major gun incident, like Virginia Tech, leads to more gun control laws. But it's possible to be pro-gun and in favor of sane controls on gun ownership. Following Virginia Tech and the Gabrielle Giffords shooting, many people questioned how two individuals that had been diagnosed as mentally ill could STILL so easily acquire a gun. Laws that further restrict criminals and the mentally deranged from owning guns should not be labeled \"anti-gun.\" Yet that's precisely what the Lott study does. Dropping this argument destroys my opponent's studies, since they label many stories as anti-gun that are clearly not anti-gun. Zimring acknowledges that we need to start labeling certain positions as \"moderate,\" such as positions that support gun ownership for law abiding citizens but try to take guns from the mentally deranged. 2. Reporting a gun crime is not \"anti-gun\" My opponent never answers this argument. Every argument my opponent makes, except the one CNN example, hinge on this argument that the media reports more gun crimes than DGU's. But reporting a gun crime is not \"anti-gun.\" When I hear a story about someone like Jared Loughner murdering a bunch of people, I think, \"wow, there are a lot of scary people out there;\" I DON'T think \"wow, there are a lot of scary guns out there.\" Guns are just a tool. If someone hears a story about someone being bludgeoned to death with a hammer, they don't suddenly become scared of hammers. So unless someone is already anti-gun, they are unlikely to be convinced by a gun crime to ban guns, and people who are already anti-gun are unlikely to be dissuaded by hearing about one DGU. Also, reporting gun crimes rather than foiled gun crimes (DGU's) is motivated by sensationalism and gaining more viewership, NOT to bias the audience intentionally. My opponent responds to this with my own analogy. He says, \"Yes, a successful terrorist plot deservedly merits more coverage than a foiled one.\" Then why does a FOILED shooting spree deserve MORE coverage than a successful shooting spree? My opponent claims it does, but without warrant. 3. There are far more gun crimes than DGU's My opponent never answers this directly. Remember, I provided FBI statistics that there are approximately 1 million gun crimes each year. I also provided the Hemenway study, which shows that of the supposed 2.5 million DGU's each year, a MAJORITY of them are actually hostile gun displays. So if there are 1 million gun crimes, 2.3 million hostile guns displays, and 200,000 DGU's each year, it's not surprising that the media reports far more on gun crimes than DGU's because gun crimes are FAR MORE COMMON IN ACTUALITY. This is not bias; this is just good, fair reporting. My opponent questions the methodology of the Hemenway study, but never directly refutes it. All my opponent does is say there are criticisms of a DIFFERENT study (NCVS), which I never cited, and then says, \"Hemenway's study is not exempt from it [the criticism] either.\" But my opponent never tells us what these criticisms are. Remember, I provided Hemenway's methodology IN DEPTH. While Kleck merely sent out thousands of paper surveys and found that 66 people claimed to have had a DGU, Hemenway spent YEARS conducting in-depth interviews, asking respondents to describe their DGU's IN DEPTH, if they claimed to have had a DGU. Remember that one person who claimed to have had a DGU got a call from the alarm company that the alarm in his building had gone off. He drove to his apartment building, saw two men standing near a car outside talking and shot at them (without even verifying they were trying to break in). That's not a DGU, but a hostile gun display. Remember the other example: someone threatened to shoot at an acquaintance who interrupted his movie. That's not a defensive gun use. So Hemenway concluded that a MAJORITY of people who CLAIMED to have had a DGU had actually used their gun in a hostile way, if you actually evaluated the DGU on its merits. So most DGU's should actually be classified as \"gun crimes.\" So again, if gun crimes are FAR more common than DGU's, the media is doing nothing wrong reporting more on gun crimes than on DGU's. This refutes ALL of my opponent's studies and leaves him only with his one CNN example. It was a HUGE mistake for my opponent not to DIRECTLY answer the Hemenway study and to defend his Kleck study's methodology, since this takes out 99% of his case. 4. NRA-backed websites My opponent claims that these websites do not publish every single DGU, but that actually IS the intent of these websites; to publish EVERY SINGLE DGU that they can find. Remember, we saw with the Hemenway study that DGU's are actually FAR RARER than some people would like us to believe. The Lott study tried to show, using these websites, that national news is ignoring these stories. But still, 100% of these stories WERE published, usually by local newspapers. National newspapers rarely report small local stories, like a store clerk using a gun to defend his store against a robbery. Imagine that on the front page of the NY Times – they would quickly lose readership. The Fort Hood shooting, in contrast, is obviously newsworthy, even though the shooting did not occur in New York. In addition, remember a lot of these stories aren't REAL DGU's. Remember the story about the Ex-Temple Law study being declared not guilty of murder? (published on The Armed Citizen website) My opponent claims that this WAS a DGU because the law student claimed it was self-defense. However, just because the court failed to provide sufficient evidence to prove \"beyond a reasonable doubt\" it wasn't self-defense doesn't mean it was (OJ was declared not guilty then wrote a book about how he killed his wife). The Ex-Temple law student shot another student SIX TIMES outside a night club because he claimed the other student had tried to tackle him. That doesn't sound like self-defense. Not every incident that someone claims is a DGU actually is; most are actually hostile gun uses. Lastly, Pew Research says more people read and watch local news than national news, so it doesn't really matter what national news does, when local news is preferred, ESPECIALLY for these type of stories. If someone gets shot in a gang shooting, that's not going to be reporting nationally just like if someone defends his car from a would-be thief with a gun, that's also not going to be reported nationally. I proved in this debate that local DGU's and local crimes are both equally likely to be reported by local news, so there's no bias. 5. Fox News My opponent CONCEDES that Fox News is biased pro-gun, as a conservative news channel, but he claims that since MSNBC attracts liberals and CNN attracts moderates, these are the people who need to be swayed pro-gun, so there's still bias. This makes no sense though. A lot of Pew studies show that people seek news channels that confirm their views, so those viewers weren't going to change their minds anyway. Secondly, my opponent basically agrees that on a holistic scale, the different stations balance each other out. How is the media, on balance, biased if one station is massively conservatively biased and one station is liberally biased (MSNBC) and one station is moderate (CNN). Also, CNN DOES present a moderate viewpoint on guns; remember, it was not one of the 3 \"major\" networks studied by Lott. They have tried very hard to seem unbiased, such as firing Lou Dobbs. So ultimately, I clearly win this point because any bias in liberal media, like the one fabricated CNN report, is going to counter-balanced by conservative sources like Fox News and conservative publications (mostly owned by Rupert Murdoch) like the National Review, The Weekly Standard, The American Spectator, The New American, The CS Monitor, etc. My opponent SHOULD have the burden to prove bias on a holistic scale, not in one isolated case. Remember, the Lott study (as my opponent admits) excludes ALL conservative sources. That's convenient. 6. The CNN story Ok it was fabricated, but again, my opponent must prove the resolution holistically. Also, it was fabricated to show that semi-automatic weapons are LESS dangerous than they actually are; if anything, that serves a pro-gun agenda. My opponent claims that people who OWN semi-automatic guns were falsely induced by the story to ban fully automatic guns BUT THIS IS RIDICULOUS. Most owners of semi-automatic AK-47's belong to the NRA, and even if they're not official members, they are definitely anti-gun control and pro-gun. The VAST MAJORITY of gun control advocates do not own a gun, and definitely not an AK-47. So if anything, the story made people feel safer about semi-automatic weapons, thinking they cannot punch through a cinderblock. Even if you think the story was unfair, it's still counter-balanced by the Appalachian law school fabrication and more holistic bias in conservative publications. 7. Appalachian law school My opponent claims I'm assuming that Bridges is wrong and Besen is right. I presented two sources for this; one said that eyewitnesses saw Besen tackle the shooter but DID NOT see Bridges with a gun; another said the POLICE REPORT backed up Besen's version of events. Besen is clearly telling the truth about tackling the gunman; Bridges is clearly lying that he brought down the shooter using a gun. The fact that John Lott and another author would WIDELY TOUT this event to show media bias shows that the pro-gun lobby is just as guilty of deception as CNN. My opponent's other defense is that Bridges' account is cited by an encyclopedia, but that encyclopedia is Wikipedia, and it ultimately proves, using eyewitnesses and the police report, that Bridges is lying. So, as my opponent puts it, the reason \"the media accounts still chose to favor the student ‘pouncing on the gunman' rather than ‘pointing their guns'\" was because the first was true and the latter wasn't. Besen pounced on the gunman and saved the day. Bridges WASN'T EVEN THERE AT THE TIME (according to eye witnesses). Bridges lied about the timeline, hoping to be viewed as a hero. And Lott spread the lie far and wide. Ultimately, two lies don't make a right, but they do make a Con Vote. ==RECAP== 1. Gun crime \"studies\" => refuted by DGU's being so uncommon compared to crimes (Hemenway study) => refuted by conservative biased sources (Fox News, The Weekly Standard, etc) counter-balancing liberal ones => refuted by fair reporting by local news => refuted by argument that \"reporting a crime\" does not equal \"anti-gun agenda\" => refuted by many DGU's from the studies actually being hostile gun uses (shooting an unarmed man 6 times is not self-defense, even if you're found ‘not guilty' of murder) 2. CNN example => refuted because it's not all that anti-gun, given it paints semi-automatic weapons in a very positive light => refuted by lies on the other side as well (Appalachian law example) => only one example, not enough to prove systematic bias 3. Appalachian law example => completely turned against my opponent (Bridges lied, Lott spread the lie) Those were all the argument in the debate, and they have been clearly refuted. Vote Con."],"PremiseEndPos":[58426],"ArgumentID":"00000008","Conclusion":"The News Media Is Biased Against the Positive Aspects of Gun Ownership","PremiseStance":["Con"]}}]}