{"MetaData":{"Context":"URL: http://www.debate.org/debates/Albus-Dumbledore-is-a-more-powerful-wizard-then-Voldemort./1/\nCrawl date: 2016/09/29 05:21:17\nOnline Debate: Albus Dumbledore is a more powerful wizard then Voldemort. | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: I accept! :)\n\nEvidence Pro: Thank you for the initial food for thought. There is no doubt in my mind that both characters are extremely powerful wizards. Both have their undeniable strengths, as well as flaws, and weaknesses, but neither of the latter take away from their greatness. I believe Albus Dumbledore to be more powerful of a wizard than Voldemort. To begin my side of this debate, here are my first two points: 1) Albus Dumbledore was the only one Voldemort has ever feared. This is mentioned throughout the series. Example from Philosopher's Stone. \"My dear Professor, surely a sensible person like yourself can call him by his name? All this 'You-Know-Who' nonsense - for eleven years I have been trying to persuade people to call him by his proper name: Voldemort.\" Professor McGonagall flinched, but Dumbledore, who was unsticking two lemon drops, seemed not to notice. \"It all gets so confusing if we keep saying 'You-Know-Who.' I have never seen any reason to be frightened of saying Voldemort's name.\" \"I know you haven't,\" said Professor McGonagall, sounding half exasperated, half admiring. \"But you're different. Everyone knows you're the only one You-Know- oh, all right, Voldemort, was frightened of.\" Albus never feared Voldemort. I find it speaks volumes that a most powerful wizard such as Voldemort would fear anyone. The significance in this is that Voldemort must highly regard Albus' powers, otherwise, I doubt he'd be bothered, just as he would towards all others. 2) Voldemort couldn't, then wouldn't attempt to kill Albus, himself. In Order of the Phoenix, during their duel, Voldemort tried to kill Albus. He was unsuccessful. In Half Blood Prince, Voldemort sent others (Draco Malfoy, Severus Snape) to kill Albus. Malfoy was unsuccessful. While Snape was indeed successful in ending Albus' life, little did Voldemort know at the time, that it wasn't carried through under his orders, at all. I see no other reason why Voldemort wouldn't want to keep trying to kill Albus himself, unless their duel made it clear to him, that he, himself couldn't. If Voldemort were to be more powerful, that wouldn't have stopped him. Looking forward to your next few points :)\n\nEvidence Pro: 3) The things which Voldemort knew not! (While Albus did) Voldemort has always thought himself superior to others. - He thought he was the only one who knew of the room of requirement (Deathly Hallows). While Albus didnt claim to know it all, he did find the room, and was the first one to tell Harry of it (Goblet of fire). - Magic always leaves a trace. Voldemort created, hid, then felt certain that no one would ever find his horcruxes. Albus was able to track, find some, and greatly help in their undoing. - Death. Voldemort has always feared his own mortality. He went to the length of creating 6 horcruxes, plus another one unknowingly. He consumed unicorn blood. All these, just to keep a tether to life, no matter the cost. Albus thought of death as the next great adventure. He knew there was not a reason to fear one's death, as it eventually comes to everyone. - Prophecy's hold. Voldemort took the bit of prophecy he knew of as if it were written it stone, as if he had no choice but to follow through with it. He was so blinded by its existence, that he himself ended up putting it in motion, thus making Harry his equal. Albus knew that prophecies are just that - prophecies (from the dictionary: prediction or guess. the act of uttering such a message) do not mean you must follow through. Albus knew a person has the free will to turn around, and walk away from a prophecy. Albus also knew Voldemort well enough to know that he wouldnt walk away from it. - Love. One of the greatest, most powerful powers in existence. Voldemort knew none of it, underestimated its power, and understood none of it, either. Albus knew of it, used it for the greater good (Philosopher's Stone), as well as against Voldemort (Goblet of Fire). 4) Elder Wand. The wand chooses the wizard. For a wand to work properly for its owner, it either has to choose him/ her, or to be won, so that it allies itself with its owner. Voldemort clearly does not fully understand this. He tries to figure out who he'd have to kill (as he sees no other way to accomplish it, which also speaks of his lack of understanding) in order to get the Elder wand to ally with him, and only him. He fails miserably. Albus knew all this, and in his brilliance, orchestrated the passing of the Elder wand o another wizard (not Voldemort). Albus won the Elder wand fair and square. Voldemort resorted to stealth, and then killing to get the wand, in attempt to try and properly earn its loyalty. The wand could never be 100% loyal to Voldemort, who didnt take the proper steps to find out who is really belonged to, and earn its allegiance. \"Maybe a man in a million could unite the Hallows, Harry. I was fit only to possess the meanest of them, the least extraordinary. I was fit to own the Elder Wand, and not to boast of it, and not to kill with it. I was permitted to tame and to use it, because I took it, not for gain, but to save others from it.\" 5) Powers, or Skills. Like I said before, both wizards possess incredible powers. Its tough to pick the stronger one. However, I believe Albus Dumbledore to be the more well rounded, powerful wizard. Its not only about how brilliant one's marks are at school. Its also about other achievements, too, such as legacies left behind you in the end (silly example, but it meant a lot to Albus: chocolate frog card, anyone?), contribution to the community at large (Ministry, Order of the Phoenix), passing on the knowledge and skills to younger generations (Hogwarts). \"It is our choices...that show what we truly are, far more than our abilities.\" To mention only some of his many varied powers/ skills shown throughout the books, Albus has: - Sheer brilliance. Time & time again, he has played a huge part in thwarting Voldemort over the years: for examples, Order of the Phoenix, evoking the ancient magic which played part in keeping Harry safe through the years (along with the magic which Lily evoked, of course), Mirror of erised, etc. Then eventually playing a big role in his demise, as well. - Transfiguration. - Patronus, and patronus messages. - Legilimency, and occulemency. - Does not need a cloak to become invisible (also known as, very powerful disillusionment charm). - Wandless magic. - Alchemy. - Speaks Mermish, another unknown language (Half Blood Prince), understands Parseltongue. - Firestorm. - Last on my limited list here, we must not forget that Albus was tempted by power in his youth (Deathly Hallows, Grindelwald). Its not that he does not possess any dark powers, but rather he chooses not to use them (Minerva McGonagall says so in the first book), and he chooses not to fall prey to the quest for power like he did as a young man. :)\n\nEvidence Pro: Both wizards are extremely powerful, each in their own right. In this friendly debate, we've had to nitpick somewhat. Hope you have enjoyed reading both sides. Onto my last part in this debate. #1 Voldemort may end up winning his battles on a tactical ground. However, Albus Dumbledore would win on a strategic ground. In the long run, which type of win would prove more useful? Examples of a tactical win: the loss of lives of Cedric Diggory (Goblet of Fire), and a year later Sirius Black (Order of the Phoenix). Examples of a strategic win: a quick re-group of the Order of the Phoenix (Goblet of Fire), capture of several death eaters (Order of the Phoenix), and exposing Voldemort's return to the community at large (Order of the Phoenix). #2 Voldemort may not care about others, but his tactics aren't full-proof. There is always the chance of his careless actions back-firing. Examples: Voldemort's attempt to put Harry under the imperius curse (Goblet of Fire). Voldemort possession attempt of Harry. (Order of the Phoenix). #3 Ambition. Knowledge is power. Voldemort: \"You do not seek to kill me, Dumbledore? Above such brutality, are you?\" Dumbledore: \"We both know there are other ways of destroying a man, Tom. Merely taking your life would not satisfy me, I admit.\" Voldemort: \"There is nothing worse than death, Dumbledore!\" Dumbledore: \"You are quite wrong. Indeed, your failure to understand that there are things much worse than death has always been your greatest weakness.\" Albus: \"His knowledge remained woefully incomplete, Harry! That which Voldemort does not value, he takes no trouble to comprehend. Of house-elves and children's tales, of love, loyalty and innocence, Voldemort knows and understands nothing. Nothing. That they all have a power beyond his own, a power beyond the reach of any magic, is a truth that he has never grasped.\" #4 The Elder wand. Albus Dumbledore: \"I was fit only to possess the meanest of them, the least extraordinary. I was fit to own the Elder Wand, and not to boast of it, and not to kill with it. I was permitted to tame and to use it, because I took it, not for gain, but to save others from it.\" As we crossed each other on this point, I see no further reason to re-hash. #5 Dumbledore admits he cannot win - Voldemort has more extensive knowledge of magic than any other wizard alive. Please see my quote above, regarding to Voldemort's knowledge remaining woefully incomplete! Also, do you think his knowledge, powers, etc. would prove useful outside his very own personal gain, or agenda? Dumbledore: \"You call it 'greatness,' what you have been doing, do you?\" Riddle: \"Certainly. I have experimented; I have pushed the boundaries of magic further, perhaps, than they have ever been pushed -\" Dumbledore: \"Of some kinds of magic. Of some. Of others, you remain...forgive me...woefully ignorant.\" Riddle: \"The old argument. But nothing I have seen in the world has supported your famous pronouncements that love is more powerful than my kind of magic, Dumbledore.\" Looking forward to your comments, and votes :o)\n\nEvidence Con: Hello. As this is KJCharmed03's and my first debate, we went with a light topic, based off of the Harry Potter series by JK Rowling. Today the resolution we are debating is Albus Dumbledore is a more powerful wizard then Voldemort. KJCharmed03 will take the Affirmative side, supporting the statement that Dumbledore is superior to the dark lord. I however disagree with the statement. I believe that Voldemort is actually better in almost all aspects. The rules of this debate are simple: -This round is ONLY for acceptance and introduction. No arguments shall be made this round. -The last speaker cannot make any new points. Only Rebuttals. -Playing Nice is mandatory. I await your acceptance Good Luck.\n\nEvidence Con: Very well then. Argument 1: Voldemort has a much bigger and better skill set. Both men are masters of magic, that is true. HOWEVER we have to ask ourselves what defines what is a master of magic. The word master means the ability to control, use or manipulate magic. This is a flaw as by that definition the something is magic and any wizard or witch can control, use AND manipulate magic, whether it's for the good or bad. This means someone as useless as Nevile Longbottom is still a master of magic. But does that mean he could stand up to Lord Voldemort? NO! Saying that Dumbledore is a master of magic is irrelevant because every magical person is a master of magic and there is no official scale of mastery. To further my argument here is some skills Dumbledore never did accomplish: - Inferi creation and control (Use these to swarm Dumbledore in a fight) -Wand versatility (If wand breaks during battle simply take another) -Parsletounge (Create and use snakes to attack Albus) -Flying (Taking the high ground, or in this case air) -Possession (Possess bystanders to attack Dumbledore) And other Dark spells. Get my point? Great, lets move on. Argument #2 Does not care about innocent bystanders Like any good dictator Voldemort does not care if others get hurt in the quest of power. In fact here is a point from the very man himself Albus Dumbledore: \"His knowledge remained woefully incomplete, Harry! That which Voldemort does not value, he takes no trouble to comprehend. Of house-elves and children's tales, of love, loyalty and innocence, Voldemort knows and understands nothing. Nothing. That they all have a power beyond his own, a power beyond the reach of any magic, is a truth that he has never grasped.\" How true Dumbledore, how true. You win. Morally. In the face of battle this can be an advantage. If these two dueled in a public area with lots of people and some gut hurt and/or died, would Voldemort stop the fight to check on the hurt? NO! Even in an area with a couple bystanders Voldemort could use these people has minions with his possession abilities to attack Dumbledore or create Inferi with them or turn them into snakes or whatever. Voldemort will use anything as a weapon , even people. I await your response Thank you.\n\nEvidence Con: Hmm... Interesting. Argument #3: Ambition Voldemort's only goal was to gain more power. No matter the cost. If Voldemort had lived for 10 more years he would have gotten more powerful. So would have Dumbledore, but because power is the goal of Voldemort he would have gotten more then Dumbledore. Dumbledore did not care about being the best. He cared for what is right. Voldemort was sick for power and this is not a good trait in many people, but when warriors like Alexander and Napoleon wanted power they got it. Politically and Mentally. I argue this could be said the same in Wizardry. Voldemort would have had more time to gather knowledge of ancient dark magic and as I always say: Knowledge is Power. Argument #4: The Elder Wand This is a difficult argument, but I still think Voldemort wins on this one. Both have owned the Elder Wand. One may argue that Dumbledore has the advantage because he actually owned the wand, but do remember Voldemort does not suffer from this problem unless he is dueling it's master. Because Harry was the final master it would be fair to say that neither in a duel would be considered master of the elder wand. Besides, if a weak wizard who was the master of the elder wand beat an amazing wizard with a regular wand it would not be the power of the weaker wizard who beat the better wizard, it would be the power of the wand that beat the better wizard. See what I'm saying? The Elder Wand does not mean that Dumbledore is the better wizard but perhaps he has the better wand. Wands and power are two different things. If Dumbledore had not possessed the Elder Wand I think Voldemort would have killed him. ITS ABOUT THE WIZARD, NOT THE WAND! Argument #5 Dumbledore admits he cannot win! If one does not believe he can't win, then he won't be able to. In the fifth book Dumbledore says that Voldemort has a more extensive knowledge of magic then any other wizard alive and that even his own most powerful defensive spells and charms (with the elder wand) would be insufficient if he came back to full power. If these two giants of magic were at top power and in a duel Voldemort would at least beat his best defensive charms. If Dumbledore could win wouldn't he, a man with genius-level intellect at least say that he's got a good shot of winning? He just does not seem confident. Furthermore, this proves my statement of Knowledge is Power. Dumbledore confirms that the more you know about magic, the more powerful you become, again saying that Voldemort is more powerful. He also confirms my first argument which was that Voldemort is more skilled. He confirms this by saying that his very best defensive spells would do squat to save him. I will wait for however long it takes Once more, Thanks.\n\nEvidence Con: Ah... The Fun part \" Albus Dumbledore was the only one Voldemort has ever feared. This is mentioned throughout the series.\" I would have liked you to have expanded on this point. Why was he afraid? Did Voldemort fear his skills? Or Dumbledore's mind? I think that Voldemort did not fear the skills of Albus, but rather his genius, his mind, his values. This stems from the fact that Dumbledore saw through the illusions of Tom Riddle when the brilliant student was at Hogwarts. The oh-so charming boy was every teachers favorite, but not Dumbledore. No. Albus knew what was in the inside of the boy and Tom knew that Albus knew. This would have led to Tom fearing that the truth about him would be revealed. The fear of the genius of the professor continued into adulthood and may have affected Voldemort in the duel in the atrium. The fear is only of Dumbledore's knowledge. Now, before you go \"HYPOCRITE! You said Knowledge is Power!\" Dumbledore admitted that Voldemort has more extensive knowledge of magic then any other wizard. This again proves that Voldemort is more powerful and that he ash nothing about Albus to fear. \"Voldemort couldn't, then wouldn't attempt to kill Albus, himself\" First of all, Voldemort was not at max power at the time of the duel in the atrium. If the fight had been later the fight might have not been a stand-still. Plus at the time Albus was using the Elder Wand, boosting his power immensely. If the two fought at max power (WITHOUT a wand that makes a wizard vs. wizard duel into a wizard vs. wizard and wand duel) Voldemort would have won. My whole point is that Voldemort was still recovering from being reborn and NOT at max strength at the time of the duel at the atrium. In the second part of your second point you mentioned that Voldemort did NOT go to kill Dumbledore himself instead having his lackeys do the dirty work. \"In Half Blood Prince, Voldemort sent others (Draco Malfoy, Severus Snape) to kill Albus. Malfoy was unsuccessful. While Snape was indeed successful in ending Albus' life, little did Voldemort know at the time, that it wasn't carried through under his orders, at all,I see no other reason why Voldemort wouldn't want to keep trying to kill Albus himself, unless their duel made it clear to him, that he, himself couldn't. If Voldemort were to be more powerful, that wouldn't have stopped him.\" This entire part is irrelevant and has nothing to do with the power of the two. . And again, Voldemort was not at top condition. Voldemort was more powerful, just not then. He was also distracted. Voldemort was at the atrium to kill Harry, not Dumbledore. \"The things which Voldemort knew not! (While Albus did)\" Most of the stuff you mentioned are once more, irrelevant to the power struggle. How does knowing about the room of requirement make you more powerful? Seriously, will one room save Dumbledore in the middle of battle? We are comparing wizardry, not comparing them finding rooms. Does accepting death make you a better wizard? Can loving another person suddenly boost your skills? Wouldn't Voldemort be able to use the trail of magic against Dumbledore? I already admitted Dumbledore was the superior morally, but we are talking about power and abilities. Not morals. \"Elder Wand. The wand chooses the wizard. For a wand to work properly for its owner, it either has to choose him/ her, or to be won, so that it allies itself with its owner.\" For starters, check out my turn in round three argument #4. Also here is a quote from the Harry Potter wiki \"It appears that the Elder Wand is still somewhat more powerful than other wands, even when the user has not mastered it, as seen when it was in the hands of Lord Voldemort. However, Voldemort was a very powerful wizard even without special artefacts to aid him. It is unknown to what extent his power was boosted by the wand, but it is certain that he never unlocked its full power, because he was never the Wand's true master. Voldemort himself sensed, and was immensely frustrated by, this fact.\" Nuff said. \"Powers, or Skills\" You listed a few skills Dumbledore has, and I will list them on whether or not they are useful in a battle against Voldemort. -Transfiguration (Voldemort can also do this ) -Patronus (Useless unless Voldemort summons dementors) -Legilimency and Occulemency (Voldemort is just as good if not better at this) -Non-Cloak Invisibility (Fairly useless as the wand would still be visible and therefore Dumbledore could be found) -Alchemy (Again, useless in a fight) -Multilingual (Still useless) -Firestorm (Once more Voldemort is just as good if not better with this spell) THERE!!! Is it not clear? Voldemort's skills are just too good for the morals of Dumbledore. Either Voldemort can match the skills of Dumbledore or the skills of Dumbledore are useless. I want to thank KJCharmed03 for accepting this debate no matter who wins. VOTE CON! Resources used: And Once again thanks and vote con!\n","DiscussionID":"00000105","Title":"Albus Dumbledore is a more powerful wizard then Voldemort.","CrawlDate":"2016/09/29 05:21:17","URL":"http://www.debate.org/debates/Albus-Dumbledore-is-a-more-powerful-wizard-then-Voldemort./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":144,"ConclusionEndPos":202,"nextID":"00000002","PremiseStartPos":[254],"prevID":"00000000","Premise":["I accept! :)"],"PremiseEndPos":[267],"ArgumentID":"00000001","Conclusion":"Albus Dumbledore is a more powerful wizard then Voldemort.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":144,"ConclusionEndPos":202,"nextID":"00000003","PremiseStartPos":[282],"prevID":"00000001","Premise":["Thank you for the initial food for thought. There is no doubt in my mind that both characters are extremely powerful wizards. Both have their undeniable strengths, as well as flaws, and weaknesses, but neither of the latter take away from their greatness. I believe Albus Dumbledore to be more powerful of a wizard than Voldemort. To begin my side of this debate, here are my first two points: 1) Albus Dumbledore was the only one Voldemort has ever feared. This is mentioned throughout the series. Example from Philosopher's Stone. \"My dear Professor, surely a sensible person like yourself can call him by his name? All this 'You-Know-Who' nonsense - for eleven years I have been trying to persuade people to call him by his proper name: Voldemort.\" Professor McGonagall flinched, but Dumbledore, who was unsticking two lemon drops, seemed not to notice. \"It all gets so confusing if we keep saying 'You-Know-Who.' I have never seen any reason to be frightened of saying Voldemort's name.\" \"I know you haven't,\" said Professor McGonagall, sounding half exasperated, half admiring. \"But you're different. Everyone knows you're the only one You-Know- oh, all right, Voldemort, was frightened of.\" Albus never feared Voldemort. I find it speaks volumes that a most powerful wizard such as Voldemort would fear anyone. The significance in this is that Voldemort must highly regard Albus' powers, otherwise, I doubt he'd be bothered, just as he would towards all others. 2) Voldemort couldn't, then wouldn't attempt to kill Albus, himself. In Order of the Phoenix, during their duel, Voldemort tried to kill Albus. He was unsuccessful. In Half Blood Prince, Voldemort sent others (Draco Malfoy, Severus Snape) to kill Albus. Malfoy was unsuccessful. While Snape was indeed successful in ending Albus' life, little did Voldemort know at the time, that it wasn't carried through under his orders, at all. I see no other reason why Voldemort wouldn't want to keep trying to kill Albus himself, unless their duel made it clear to him, that he, himself couldn't. If Voldemort were to be more powerful, that wouldn't have stopped him. Looking forward to your next few points :)"],"PremiseEndPos":[2451],"ArgumentID":"00000002","Conclusion":"Albus Dumbledore is a more powerful wizard then Voldemort.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":144,"ConclusionEndPos":202,"nextID":"00000004","PremiseStartPos":[2466],"prevID":"00000002","Premise":["3) The things which Voldemort knew not! (While Albus did) Voldemort has always thought himself superior to others. - He thought he was the only one who knew of the room of requirement (Deathly Hallows). While Albus didnt claim to know it all, he did find the room, and was the first one to tell Harry of it (Goblet of fire). - Magic always leaves a trace. Voldemort created, hid, then felt certain that no one would ever find his horcruxes. Albus was able to track, find some, and greatly help in their undoing. - Death. Voldemort has always feared his own mortality. He went to the length of creating 6 horcruxes, plus another one unknowingly. He consumed unicorn blood. All these, just to keep a tether to life, no matter the cost. Albus thought of death as the next great adventure. He knew there was not a reason to fear one's death, as it eventually comes to everyone. - Prophecy's hold. Voldemort took the bit of prophecy he knew of as if it were written it stone, as if he had no choice but to follow through with it. He was so blinded by its existence, that he himself ended up putting it in motion, thus making Harry his equal. Albus knew that prophecies are just that - prophecies (from the dictionary: prediction or guess. the act of uttering such a message) do not mean you must follow through. Albus knew a person has the free will to turn around, and walk away from a prophecy. Albus also knew Voldemort well enough to know that he wouldnt walk away from it. - Love. One of the greatest, most powerful powers in existence. Voldemort knew none of it, underestimated its power, and understood none of it, either. Albus knew of it, used it for the greater good (Philosopher's Stone), as well as against Voldemort (Goblet of Fire). 4) Elder Wand. The wand chooses the wizard. For a wand to work properly for its owner, it either has to choose him/ her, or to be won, so that it allies itself with its owner. Voldemort clearly does not fully understand this. He tries to figure out who he'd have to kill (as he sees no other way to accomplish it, which also speaks of his lack of understanding) in order to get the Elder wand to ally with him, and only him. He fails miserably. Albus knew all this, and in his brilliance, orchestrated the passing of the Elder wand o another wizard (not Voldemort). Albus won the Elder wand fair and square. Voldemort resorted to stealth, and then killing to get the wand, in attempt to try and properly earn its loyalty. The wand could never be 100% loyal to Voldemort, who didnt take the proper steps to find out who is really belonged to, and earn its allegiance. \"Maybe a man in a million could unite the Hallows, Harry. I was fit only to possess the meanest of them, the least extraordinary. I was fit to own the Elder Wand, and not to boast of it, and not to kill with it. I was permitted to tame and to use it, because I took it, not for gain, but to save others from it.\" 5) Powers, or Skills. Like I said before, both wizards possess incredible powers. Its tough to pick the stronger one. However, I believe Albus Dumbledore to be the more well rounded, powerful wizard. Its not only about how brilliant one's marks are at school. Its also about other achievements, too, such as legacies left behind you in the end (silly example, but it meant a lot to Albus: chocolate frog card, anyone?), contribution to the community at large (Ministry, Order of the Phoenix), passing on the knowledge and skills to younger generations (Hogwarts). \"It is our choices...that show what we truly are, far more than our abilities.\" To mention only some of his many varied powers/ skills shown throughout the books, Albus has: - Sheer brilliance. Time & time again, he has played a huge part in thwarting Voldemort over the years: for examples, Order of the Phoenix, evoking the ancient magic which played part in keeping Harry safe through the years (along with the magic which Lily evoked, of course), Mirror of erised, etc. Then eventually playing a big role in his demise, as well. - Transfiguration. - Patronus, and patronus messages. - Legilimency, and occulemency. - Does not need a cloak to become invisible (also known as, very powerful disillusionment charm). - Wandless magic. - Alchemy. - Speaks Mermish, another unknown language (Half Blood Prince), understands Parseltongue. - Firestorm. - Last on my limited list here, we must not forget that Albus was tempted by power in his youth (Deathly Hallows, Grindelwald). Its not that he does not possess any dark powers, but rather he chooses not to use them (Minerva McGonagall says so in the first book), and he chooses not to fall prey to the quest for power like he did as a young man. :)"],"PremiseEndPos":[7151],"ArgumentID":"00000003","Conclusion":"Albus Dumbledore is a more powerful wizard then Voldemort.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":144,"ConclusionEndPos":202,"nextID":"00000005","PremiseStartPos":[7166],"prevID":"00000003","Premise":["Both wizards are extremely powerful, each in their own right. In this friendly debate, we've had to nitpick somewhat. Hope you have enjoyed reading both sides. Onto my last part in this debate. #1 Voldemort may end up winning his battles on a tactical ground. However, Albus Dumbledore would win on a strategic ground. In the long run, which type of win would prove more useful? Examples of a tactical win: the loss of lives of Cedric Diggory (Goblet of Fire), and a year later Sirius Black (Order of the Phoenix). Examples of a strategic win: a quick re-group of the Order of the Phoenix (Goblet of Fire), capture of several death eaters (Order of the Phoenix), and exposing Voldemort's return to the community at large (Order of the Phoenix). #2 Voldemort may not care about others, but his tactics aren't full-proof. There is always the chance of his careless actions back-firing. Examples: Voldemort's attempt to put Harry under the imperius curse (Goblet of Fire). Voldemort possession attempt of Harry. (Order of the Phoenix). #3 Ambition. Knowledge is power. Voldemort: \"You do not seek to kill me, Dumbledore? Above such brutality, are you?\" Dumbledore: \"We both know there are other ways of destroying a man, Tom. Merely taking your life would not satisfy me, I admit.\" Voldemort: \"There is nothing worse than death, Dumbledore!\" Dumbledore: \"You are quite wrong. Indeed, your failure to understand that there are things much worse than death has always been your greatest weakness.\" Albus: \"His knowledge remained woefully incomplete, Harry! That which Voldemort does not value, he takes no trouble to comprehend. Of house-elves and children's tales, of love, loyalty and innocence, Voldemort knows and understands nothing. Nothing. That they all have a power beyond his own, a power beyond the reach of any magic, is a truth that he has never grasped.\" #4 The Elder wand. Albus Dumbledore: \"I was fit only to possess the meanest of them, the least extraordinary. I was fit to own the Elder Wand, and not to boast of it, and not to kill with it. I was permitted to tame and to use it, because I took it, not for gain, but to save others from it.\" As we crossed each other on this point, I see no further reason to re-hash. #5 Dumbledore admits he cannot win - Voldemort has more extensive knowledge of magic than any other wizard alive. Please see my quote above, regarding to Voldemort's knowledge remaining woefully incomplete! Also, do you think his knowledge, powers, etc. would prove useful outside his very own personal gain, or agenda? Dumbledore: \"You call it 'greatness,' what you have been doing, do you?\" Riddle: \"Certainly. I have experimented; I have pushed the boundaries of magic further, perhaps, than they have ever been pushed -\" Dumbledore: \"Of some kinds of magic. Of some. Of others, you remain...forgive me...woefully ignorant.\" Riddle: \"The old argument. But nothing I have seen in the world has supported your famous pronouncements that love is more powerful than my kind of magic, Dumbledore.\" Looking forward to your comments, and votes :o)"],"PremiseEndPos":[10243],"ArgumentID":"00000004","Conclusion":"Albus Dumbledore is a more powerful wizard then Voldemort.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":144,"ConclusionEndPos":202,"nextID":"00000006","PremiseStartPos":[10258],"prevID":"00000004","Premise":["Hello. As this is KJCharmed03's and my first debate, we went with a light topic, based off of the Harry Potter series by JK Rowling. Today the resolution we are debating is Albus Dumbledore is a more powerful wizard then Voldemort. KJCharmed03 will take the Affirmative side, supporting the statement that Dumbledore is superior to the dark lord. I however disagree with the statement. I believe that Voldemort is actually better in almost all aspects. The rules of this debate are simple: -This round is ONLY for acceptance and introduction. No arguments shall be made this round. -The last speaker cannot make any new points. Only Rebuttals. -Playing Nice is mandatory. I await your acceptance Good Luck."],"PremiseEndPos":[10965],"ArgumentID":"00000005","Conclusion":"Albus Dumbledore is a more powerful wizard then Voldemort.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":144,"ConclusionEndPos":202,"nextID":"00000007","PremiseStartPos":[10980],"prevID":"00000005","Premise":["Very well then. Argument 1: Voldemort has a much bigger and better skill set. Both men are masters of magic, that is true. HOWEVER we have to ask ourselves what defines what is a master of magic. The word master means the ability to control, use or manipulate magic. This is a flaw as by that definition the something is magic and any wizard or witch can control, use AND manipulate magic, whether it's for the good or bad. This means someone as useless as Nevile Longbottom is still a master of magic. But does that mean he could stand up to Lord Voldemort? NO! Saying that Dumbledore is a master of magic is irrelevant because every magical person is a master of magic and there is no official scale of mastery. To further my argument here is some skills Dumbledore never did accomplish: - Inferi creation and control (Use these to swarm Dumbledore in a fight) -Wand versatility (If wand breaks during battle simply take another) -Parsletounge (Create and use snakes to attack Albus) -Flying (Taking the high ground, or in this case air) -Possession (Possess bystanders to attack Dumbledore) And other Dark spells. Get my point? Great, lets move on. Argument #2 Does not care about innocent bystanders Like any good dictator Voldemort does not care if others get hurt in the quest of power. In fact here is a point from the very man himself Albus Dumbledore: \"His knowledge remained woefully incomplete, Harry! That which Voldemort does not value, he takes no trouble to comprehend. Of house-elves and children's tales, of love, loyalty and innocence, Voldemort knows and understands nothing. Nothing. That they all have a power beyond his own, a power beyond the reach of any magic, is a truth that he has never grasped.\" How true Dumbledore, how true. You win. Morally. In the face of battle this can be an advantage. If these two dueled in a public area with lots of people and some gut hurt and/or died, would Voldemort stop the fight to check on the hurt? NO! Even in an area with a couple bystanders Voldemort could use these people has minions with his possession abilities to attack Dumbledore or create Inferi with them or turn them into snakes or whatever. Voldemort will use anything as a weapon , even people. I await your response Thank you."],"PremiseEndPos":[13237],"ArgumentID":"00000006","Conclusion":"Albus Dumbledore is a more powerful wizard then Voldemort.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":144,"ConclusionEndPos":202,"nextID":"00000008","PremiseStartPos":[13252],"prevID":"00000006","Premise":["Hmm... Interesting. Argument #3: Ambition Voldemort's only goal was to gain more power. No matter the cost. If Voldemort had lived for 10 more years he would have gotten more powerful. So would have Dumbledore, but because power is the goal of Voldemort he would have gotten more then Dumbledore. Dumbledore did not care about being the best. He cared for what is right. Voldemort was sick for power and this is not a good trait in many people, but when warriors like Alexander and Napoleon wanted power they got it. Politically and Mentally. I argue this could be said the same in Wizardry. Voldemort would have had more time to gather knowledge of ancient dark magic and as I always say: Knowledge is Power. Argument #4: The Elder Wand This is a difficult argument, but I still think Voldemort wins on this one. Both have owned the Elder Wand. One may argue that Dumbledore has the advantage because he actually owned the wand, but do remember Voldemort does not suffer from this problem unless he is dueling it's master. Because Harry was the final master it would be fair to say that neither in a duel would be considered master of the elder wand. Besides, if a weak wizard who was the master of the elder wand beat an amazing wizard with a regular wand it would not be the power of the weaker wizard who beat the better wizard, it would be the power of the wand that beat the better wizard. See what I'm saying? The Elder Wand does not mean that Dumbledore is the better wizard but perhaps he has the better wand. Wands and power are two different things. If Dumbledore had not possessed the Elder Wand I think Voldemort would have killed him. ITS ABOUT THE WIZARD, NOT THE WAND! Argument #5 Dumbledore admits he cannot win! If one does not believe he can't win, then he won't be able to. In the fifth book Dumbledore says that Voldemort has a more extensive knowledge of magic then any other wizard alive and that even his own most powerful defensive spells and charms (with the elder wand) would be insufficient if he came back to full power. If these two giants of magic were at top power and in a duel Voldemort would at least beat his best defensive charms. If Dumbledore could win wouldn't he, a man with genius-level intellect at least say that he's got a good shot of winning? He just does not seem confident. Furthermore, this proves my statement of Knowledge is Power. Dumbledore confirms that the more you know about magic, the more powerful you become, again saying that Voldemort is more powerful. He also confirms my first argument which was that Voldemort is more skilled. He confirms this by saying that his very best defensive spells would do squat to save him. I will wait for however long it takes Once more, Thanks."],"PremiseEndPos":[15993],"ArgumentID":"00000007","Conclusion":"Albus Dumbledore is a more powerful wizard then Voldemort.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":144,"ConclusionEndPos":202,"nextID":"00000000","PremiseStartPos":[16008],"prevID":"00000007","Premise":["Ah... The Fun part \" Albus Dumbledore was the only one Voldemort has ever feared. This is mentioned throughout the series.\" I would have liked you to have expanded on this point. Why was he afraid? Did Voldemort fear his skills? Or Dumbledore's mind? I think that Voldemort did not fear the skills of Albus, but rather his genius, his mind, his values. This stems from the fact that Dumbledore saw through the illusions of Tom Riddle when the brilliant student was at Hogwarts. The oh-so charming boy was every teachers favorite, but not Dumbledore. No. Albus knew what was in the inside of the boy and Tom knew that Albus knew. This would have led to Tom fearing that the truth about him would be revealed. The fear of the genius of the professor continued into adulthood and may have affected Voldemort in the duel in the atrium. The fear is only of Dumbledore's knowledge. Now, before you go \"HYPOCRITE! You said Knowledge is Power!\" Dumbledore admitted that Voldemort has more extensive knowledge of magic then any other wizard. This again proves that Voldemort is more powerful and that he ash nothing about Albus to fear. \"Voldemort couldn't, then wouldn't attempt to kill Albus, himself\" First of all, Voldemort was not at max power at the time of the duel in the atrium. If the fight had been later the fight might have not been a stand-still. Plus at the time Albus was using the Elder Wand, boosting his power immensely. If the two fought at max power (WITHOUT a wand that makes a wizard vs. wizard duel into a wizard vs. wizard and wand duel) Voldemort would have won. My whole point is that Voldemort was still recovering from being reborn and NOT at max strength at the time of the duel at the atrium. In the second part of your second point you mentioned that Voldemort did NOT go to kill Dumbledore himself instead having his lackeys do the dirty work. \"In Half Blood Prince, Voldemort sent others (Draco Malfoy, Severus Snape) to kill Albus. Malfoy was unsuccessful. While Snape was indeed successful in ending Albus' life, little did Voldemort know at the time, that it wasn't carried through under his orders, at all,I see no other reason why Voldemort wouldn't want to keep trying to kill Albus himself, unless their duel made it clear to him, that he, himself couldn't. If Voldemort were to be more powerful, that wouldn't have stopped him.\" This entire part is irrelevant and has nothing to do with the power of the two. . And again, Voldemort was not at top condition. Voldemort was more powerful, just not then. He was also distracted. Voldemort was at the atrium to kill Harry, not Dumbledore. \"The things which Voldemort knew not! (While Albus did)\" Most of the stuff you mentioned are once more, irrelevant to the power struggle. How does knowing about the room of requirement make you more powerful? Seriously, will one room save Dumbledore in the middle of battle? We are comparing wizardry, not comparing them finding rooms. Does accepting death make you a better wizard? Can loving another person suddenly boost your skills? Wouldn't Voldemort be able to use the trail of magic against Dumbledore? I already admitted Dumbledore was the superior morally, but we are talking about power and abilities. Not morals. \"Elder Wand. The wand chooses the wizard. For a wand to work properly for its owner, it either has to choose him/ her, or to be won, so that it allies itself with its owner.\" For starters, check out my turn in round three argument #4. Also here is a quote from the Harry Potter wiki \"It appears that the Elder Wand is still somewhat more powerful than other wands, even when the user has not mastered it, as seen when it was in the hands of Lord Voldemort. However, Voldemort was a very powerful wizard even without special artefacts to aid him. It is unknown to what extent his power was boosted by the wand, but it is certain that he never unlocked its full power, because he was never the Wand's true master. Voldemort himself sensed, and was immensely frustrated by, this fact.\" Nuff said. \"Powers, or Skills\" You listed a few skills Dumbledore has, and I will list them on whether or not they are useful in a battle against Voldemort. -Transfiguration (Voldemort can also do this ) -Patronus (Useless unless Voldemort summons dementors) -Legilimency and Occulemency (Voldemort is just as good if not better at this) -Non-Cloak Invisibility (Fairly useless as the wand would still be visible and therefore Dumbledore could be found) -Alchemy (Again, useless in a fight) -Multilingual (Still useless) -Firestorm (Once more Voldemort is just as good if not better with this spell) THERE!!! Is it not clear? Voldemort's skills are just too good for the morals of Dumbledore. Either Voldemort can match the skills of Dumbledore or the skills of Dumbledore are useless. I want to thank KJCharmed03 for accepting this debate no matter who wins. VOTE CON! Resources used: And Once again thanks and vote con!"],"PremiseEndPos":[20955],"ArgumentID":"00000008","Conclusion":"Albus Dumbledore is a more powerful wizard then Voldemort.","PremiseStance":["Con"]}}]}