{"MetaData":{"Context":"URL: http://www.debate.org/debates/God/4/\nCrawl date: 2016/09/29 06:33:57\nDebate: God | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: Respectfully, i do not even have to argue with you to win this debate. You have already committed a logical fallacy, the fallacy is called \"Ad Hominem.\" These words translate to \"personal attack.\" --This type of an ad hominem argument is a form of genetic fallacy. Arguments of this kind focus not on the evidence for a view but on the character of the person advancing it; they seek to discredit positions by discrediting those who hold them. It is always important to attack arguments, rather than arguers, and this is where arguments that commit the ad hominem fallacy fall down. [cited from Before i even rebuttal, i am considered \"nuts.\" I am deductively reasoning that it does not matter what i say, regardless how cogent my arguments may be, because i am already discredited within your mind; and it is due to opinion and not supported factual information.\n\nEvidence Pro: Respectfully, I am going to restate my last argument. I am not entirely sure if you understood what i was saying. _________________________________________________________________________________________________ Respectfully, i do not even have to argue with you to win this debate. You have already committed a logical fallacy, the fallacy is called \"Ad Hominem.\" These words translate to \"personal attack.\" --This type of an ad hominem argument is a form of genetic fallacy. Arguments of this kind focus not on the evidence for a view but on the character of the person advancing it; they seek to discredit positions by discrediting those who hold them. It is always important to attack arguments, rather than arguers, and this is where arguments that commit the ad hominem fallacy fall down. [cited from Before i even rebuttal, i am considered \"nuts.\" I am deductively reasoning that it does not matter what i say, regardless how cogent my arguments may be, because i am already discredited within your mind; and it is due to opinion and not supported factual information. _________________________________________________________________________________________________ In short: You discredited yourself, and your arguments. Thus, if i merely point out your fallacy, i would win the debate. Consequently, I did point out your fallacy, and the winner is now in the hands of the voter.\n\nEvidence Con: With all we know in Science, History, The Law, and The Medical Field, how can you still say there is a God? You can't see us from the moon, so what makes you think that you can be seen from anywhere in the universe? If you say that God knows all, and created all, then you're nuts. I was also told that Santa was real, and the easter bunny, when I was young, I've grown up now and have done my research, and believe in truth, and think that all religion is false and can only cause harm to humans and mankind. Prove me wrong if you can.\n\nEvidence Con: In order to find the truth, you must get rid of all your own beliefs and open your mind to what is real. God is just a word that some human came up with years ago, to try to explain who we are. What we are is more important. We are all made of atoms, (not to be confused with Adam) these are so small that you can only see them with an electron microscope. God the creator of the Universe (whatever that is) is at the time it was created. The universe is so fast that most people can't comprehend how big it really is. 93 billion light years, yes light years old. It takes 8.4 seconds for the suns rays to reach the earth. Thats forever. You'll never know that time. I've heard them say what about free will, well if we had free will, we would be able to convert are atoms into anything we wanted to, therefore no free will. To think that someone that made us in his own image, and is up above the earth watching us and telling us how to behave is crazy, and not realistic. However, science which can prove how we die, what's in our bodies, and the medical field that helps us stay healthy and live longer, because they have mixed atoms together to make medication for us. The law that uses DNA, to convict outlaws, to prove beyond a reasonable doubt, then we have to believe in science about how we got here. We also have to believe in history, which tells us that people used to think the world was flat, so it's reasonable to think that they didn't have the science of today, and didn't know about atoms, and the solar system, let alone the universe. To think that God put man on this earth, and had a plan for him is so far out there. If I were to say God spoke to me today, you would have me put away for being crazy, but in the time of Jesus they thought that God is how it was. No one know what caused the universe so people want to believe in God as an overseer of the planets. The truth of the matter is, it's all in everyone own head to how they believe, otherwise we would all think the same thing and worship God and the image of God Jesus or Mohammad, depending on who you ask, all this leads me to believe there is no God, and no heaven as most people see it. Heaven is here on earth, and what we do as a human to make it better for all. Don't think so small of what is good for you and your family, but what, with everything we know today, and knowing that not all believe, we are all different. Believe in something until it proves you wrong, and it's all different for everyone. If you can prove me wrong please do. I don't think you can.\n\nEvidence Con: You are right, I just reread how I put this debate into words, and it was an attack. Not on you personally but on principals of debating. Sorry for that....YOU WIN\n","DiscussionID":"00000092","Title":"God","CrawlDate":"2016/09/29 06:33:57","URL":"http://www.debate.org/debates/God/4/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":82,"ConclusionEndPos":85,"nextID":"00000002","PremiseStartPos":[137],"prevID":"00000000","Premise":["Respectfully, i do not even have to argue with you to win this debate. You have already committed a logical fallacy, the fallacy is called \"Ad Hominem.\" These words translate to \"personal attack.\" --This type of an ad hominem argument is a form of genetic fallacy. Arguments of this kind focus not on the evidence for a view but on the character of the person advancing it; they seek to discredit positions by discrediting those who hold them. It is always important to attack arguments, rather than arguers, and this is where arguments that commit the ad hominem fallacy fall down. [cited from Before i even rebuttal, i am considered \"nuts.\" I am deductively reasoning that it does not matter what i say, regardless how cogent my arguments may be, because i am already discredited within your mind; and it is due to opinion and not supported factual information."],"PremiseEndPos":[1001],"ArgumentID":"00000001","Conclusion":"God","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":82,"ConclusionEndPos":85,"nextID":"00000003","PremiseStartPos":[1016],"prevID":"00000001","Premise":["Respectfully, I am going to restate my last argument. I am not entirely sure if you understood what i was saying. _________________________________________________________________________________________________ Respectfully, i do not even have to argue with you to win this debate. You have already committed a logical fallacy, the fallacy is called \"Ad Hominem.\" These words translate to \"personal attack.\" --This type of an ad hominem argument is a form of genetic fallacy. Arguments of this kind focus not on the evidence for a view but on the character of the person advancing it; they seek to discredit positions by discrediting those who hold them. It is always important to attack arguments, rather than arguers, and this is where arguments that commit the ad hominem fallacy fall down. [cited from Before i even rebuttal, i am considered \"nuts.\" I am deductively reasoning that it does not matter what i say, regardless how cogent my arguments may be, because i am already discredited within your mind; and it is due to opinion and not supported factual information. _________________________________________________________________________________________________ In short: You discredited yourself, and your arguments. Thus, if i merely point out your fallacy, i would win the debate. Consequently, I did point out your fallacy, and the winner is now in the hands of the voter."],"PremiseEndPos":[2405],"ArgumentID":"00000002","Conclusion":"God","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":82,"ConclusionEndPos":85,"nextID":"00000004","PremiseStartPos":[2420],"prevID":"00000002","Premise":["With all we know in Science, History, The Law, and The Medical Field, how can you still say there is a God? You can't see us from the moon, so what makes you think that you can be seen from anywhere in the universe? If you say that God knows all, and created all, then you're nuts. I was also told that Santa was real, and the easter bunny, when I was young, I've grown up now and have done my research, and believe in truth, and think that all religion is false and can only cause harm to humans and mankind. Prove me wrong if you can."],"PremiseEndPos":[2957],"ArgumentID":"00000003","Conclusion":"God","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":82,"ConclusionEndPos":85,"nextID":"00000005","PremiseStartPos":[2972],"prevID":"00000003","Premise":["In order to find the truth, you must get rid of all your own beliefs and open your mind to what is real. God is just a word that some human came up with years ago, to try to explain who we are. What we are is more important. We are all made of atoms, (not to be confused with Adam) these are so small that you can only see them with an electron microscope. God the creator of the Universe (whatever that is) is at the time it was created. The universe is so fast that most people can't comprehend how big it really is. 93 billion light years, yes light years old. It takes 8.4 seconds for the suns rays to reach the earth. Thats forever. You'll never know that time. I've heard them say what about free will, well if we had free will, we would be able to convert are atoms into anything we wanted to, therefore no free will. To think that someone that made us in his own image, and is up above the earth watching us and telling us how to behave is crazy, and not realistic. However, science which can prove how we die, what's in our bodies, and the medical field that helps us stay healthy and live longer, because they have mixed atoms together to make medication for us. The law that uses DNA, to convict outlaws, to prove beyond a reasonable doubt, then we have to believe in science about how we got here. We also have to believe in history, which tells us that people used to think the world was flat, so it's reasonable to think that they didn't have the science of today, and didn't know about atoms, and the solar system, let alone the universe. To think that God put man on this earth, and had a plan for him is so far out there. If I were to say God spoke to me today, you would have me put away for being crazy, but in the time of Jesus they thought that God is how it was. No one know what caused the universe so people want to believe in God as an overseer of the planets. The truth of the matter is, it's all in everyone own head to how they believe, otherwise we would all think the same thing and worship God and the image of God Jesus or Mohammad, depending on who you ask, all this leads me to believe there is no God, and no heaven as most people see it. Heaven is here on earth, and what we do as a human to make it better for all. Don't think so small of what is good for you and your family, but what, with everything we know today, and knowing that not all believe, we are all different. Believe in something until it proves you wrong, and it's all different for everyone. If you can prove me wrong please do. I don't think you can."],"PremiseEndPos":[5528],"ArgumentID":"00000004","Conclusion":"God","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":82,"ConclusionEndPos":85,"nextID":"00000000","PremiseStartPos":[5543],"prevID":"00000004","Premise":["You are right, I just reread how I put this debate into words, and it was an attack. Not on you personally but on principals of debating. Sorry for that....YOU WIN"],"PremiseEndPos":[5707],"ArgumentID":"00000005","Conclusion":"God","PremiseStance":["Con"]}}]}