{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-Internet-The-Last-True-Example-of-Free-Speech-Net-Neutrality/1/votes/2/\nCrawl date: 2016/09/29 04:25:51\nOnline Debate: The Internet: The Last True Example of Free Speech (Net Neutrality) | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: NOTE: DO NOT TAKE THIS DEBATE IF YOU ARE GOING TO DEBATE THAT THE INTERNET IS OUR LAST VESTAGE OF FREE SPEECH. THAT IS NOT THE TOPIC OF THIS DEBATE. NET NEUTRALITY IS. I believe that Net Neutrality should be spared, and should be kept away from Virgin Media's grubby, greedy hands. For those who don't know, I'll summarize net neutrality in a simple way. Net neutrality is what lets you sit at your computer, hop on the internet, and visit every site on the internet at the same speed. Now, granted it will not always be the same each visit. There is sure to be differing ammounts of content on each site your computer has to process. What Virgin Media plans to do, is 'throttle' your internet. Which means, they can tell your computer to fo fast to one site, but slow to another. And they do this because, most people would pay to be in the fast lane. They can also block access entirely to sites you normally go to, and redirect you to sites their sponsors create. Which means, if Google doesn't pay Virgin Media, typing google.com in the address bar will take you to a site like fetchfido.com, who has paid Virgin Media. The only way to get to Google, is to pay. Now, I believe the internet is the last vessel of our free speech. TV isn't. It's controlled by a group of people who care more about displaying an interesting story than the truth they promise. Same goes for newspapers/magazines. On the internet, everybody's oppinion is virtually the same. Nobody has a higher authority than another on the internet, except in a controlled situation. If Virgin Media takes that away, they're taking away one of our most primary rights.\n\nEvidence Pro: JoeBob, you make a good point. Businesses are free to try what they would like to attempt to make money, that much is true. Customers are also free to try whichever company they would like based on a multitude of factors, none of which are outside of the obvious. But that is not what Virgin Media is proposing. The way it will go is, they will enforce this whether it is purchased or not. In other words, they are not giving customers the option to try their new 'service'; they are forcing it on everybody and recieving money from the ones who want it gone. What this is doing is esentially enslaving the internet. Like in the business world, the internet is a free market for ideas and oppinions. When Virgin Media does this, they're basically saying \"Your oppinion doesn't matter because you don't have money.\" Now, I'm not sure if there really is a law like this, but it seems there would be a law that those with a certain ammount of power (big businesses controlling utilities, for example) cannot use that power to infringe on the basic rights this country was founded on. What I'm trying to say is, isn't it illegal to infringe on the rights of the people for money? If it wasn't, we might as well allow slavery while we're at it. I know those are two different levels of importance but in escense, it's the same thing. Taking away the rights of another person so you can make money. To make something clear, the way Virgin Media is predicted to 'throttle' the internet would make using the internet so slow that it is near unusable. And to the person in the comments, this isn't an internet service. It's a throttle on the internet as a whole. A brace on the entire internet, if you will. So you can't just switch at will. Sprint, Embarq, Cox, all of it will be 'throttled' by Virgin's plan.\n\nEvidence Pro: Here is a bit from the main net neutrality supporting site, savetheinternet.com, under the FAQ section. Who wants to get rid of net neutrality? The nation's largest telephone and cable companies -- including AT&T, Verizon, Comcast and Time Warner -- want to be Internet gatekeepers, deciding which Web sites go fast or slow and which won't load at all. They want to tax content providers to guarantee speedy delivery of their data. They want to discriminate in favor of their own search engines, Internet phone services, and streaming video -- while slowing down or blocking their competitors. Which means it isn't just Virgin Media that's heading into this. They're followed by many other companies as well. Now, I know you might think, \"Well, people can just switch to Embarq or one of the 'safe' IPs\" But that wouldn't work exactly as planned. Why wouldn't Embarq take that opportunity to raise their prices? No matter how you look at it, we have to pay more. I know that sounds a bit greedy, but in times like this, with our economy as unstable as it is, this simply cannot turn out well. Otherwise, my arguments on the unethical nature of net neutrality still stand. I can understand if you don't intend to disagree with them, as well. As the consumer, I can't begin to think of a scenario where getting rid of net neutrality would be beneficial. Either way, I had fun. And it looks net neutrality is winning. I hear action was recently taken against Comcast. Thanks for the fun debate and good luck.\n\nEvidence Con: Mr Believer (Pro), thank you for proposing this interesting topic. Pro is in favor of internet neutrality, or transparency, or equality, or freedom - as opposed to the controls proposed by Virgin Media to limit access to certain sites based on bandwidth or advertising arrangements. Well, while I agree that a China-esque approach to Internet control sounds dreadful, this scheme is not being proposed by a government but by a corporation, which is also one of the last vestiges of real freedom. Corporations can do whatever they like in the free market. If they want to sell pickled rabbit turds, they can. They are free to try...and fail. As such, Virgin Media is free to try this bandwidth throttling scheme. If their customers like it, they will prosper. If their customers hate it, they will fail and the customers will switch to other vendors. If no other vendors currently exist, I promise you they soon will. In the United States, telephony was once controlled by a very small cabal of large corporations. However, people didn't like the policies of those corporations, and now we have dozens of contract-free, internet-based and cell-based telephone company options. While Virgin's scheme sounds dastardly, it is merely an expression of the free market. They are free to try. If you, the consumer, don't like their service, don't pay for it. Net Neutrality is not in danger.\n\nEvidence Con: I think my opponent may have a false notion of what Virgin's throttling really is. Virgin Media is an internet service provider (ISP) in the UK, just like AOL, Comcast, and NetZero in the US (or globally). An ISP is merely a company that gives an individual access to the internet, it does not in any way affect the internet itself. An ISP is like a window that lets you look at internet content. The internet, of course, is a giant web of servers spread all over the world. No one controls all of it, and everyone who owns a server wants it to run as fast as possible. Virgin's throttling is a system of controlling the bandwidth of the data uploading and downloading through their internet access servers. If you are a Virgin customer in the UK, then you are essentially looking at the internet through Virgin's window, which allows Virgin to block or slow down parts of the view (web pages) at their whim. If you are not a Virgin customer, then Virgin's policies have no effect upon your internet access. If you are an AOL customer, you are viewing the internet through AOL's window which is subject to AOL's policies or shady business deals and no one else's. Conclusion: Virgin's throttling only affects Virgin customers, and if they get angry, they will change provider.\n\nEvidence Con: All corporate schemes to force people to pay for their web sites to run faster are simply schemes to maximize profits. Let them. If they anger their customers, then a new generation of ISP companies will rise to replace them, just as the VOIP telephone companies have appeared to challenge traditional telephony. Returning to the issue of freedom of speech and net neutrality: Free speech is the first defined and protected right in the United States. It has succeeded in protecting all forms of speech, including political and social, for centuries. It is fully intact. Regulations on media do not limit free speech, they limit corporate activities. And skewed news reporting is a business decision. If you think Fox News is shallow or biased, watch BBC. We have a news marketplace. I have a dozen news channels standard in my TV package. They are all skewed to reflect the policies of the corporations that run them. You stated initially that net neutrality was about the freedom to access all web sites at the same speed. But web access is already limited by the user's computer, OS, browser, and ISP, as well as the web site's design, plugins, and servers. All of these elements are corporate products and are tweaked to perform in certain ways beyond your control. You then claimed that the internet represents free speech because the traditional media, as I described above, is biased by corporate interests. However, the internet is biased by personal interests. Blogs don't represent some higher truth, they represent the opinion of one person, who is probably not a well-informed expert. The article on Wikipedia on \"cardiology\" may have been written by an angry teenager and not a team of eminent cardiologists. Also, most blogs have tiny readerships. They are little more than personal journals sharing personal opinions with a small number of like-minded friends. This does not spread ideas or information. In fact, as demonstrated by my Wikipedia example, the \"information\" on the internet is largely untrustworthy, and untrustworthy information is completely worthless. Conclusions: (1) My opponent's claim that throttling schemes or other attempts to alter internet access threatens net neutrality is False because there is no such thing as net neutrality. The internet is already governed by and predicated upon corporate interests. (2) My opponent's claim that the internet represents the \"last vessel of free speech\" is False for two reasons: (a) The internet already is just as biased as traditional forms of media, and (b) the right to free speech as strong today as when it was drafted in the Bill of Rights. It is false to equate corporate access to information with the freedom of expression. Therefore, vote Con to acknowledge that the internet is not a magical land of pure ideals and freedoms - it is simply another imperfect tool for exchanging imperfect information, and corporate attempts to alter its functions are no different from corporate controls on everything else. I thank my opponent for an interesting debate!\n","DiscussionID":"00000029","Title":"The Internet: The Last True Example of Free Speech (Net Neutrality)","CrawlDate":"2016/09/29 04:25:51","URL":"http://www.debate.org/debates/The-Internet-The-Last-True-Example-of-Free-Speech-Net-Neutrality/1/votes/2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":225,"nextID":"00000002","PremiseStartPos":[277],"prevID":"00000000","Premise":["NOTE: DO NOT TAKE THIS DEBATE IF YOU ARE GOING TO DEBATE THAT THE INTERNET IS OUR LAST VESTAGE OF FREE SPEECH. THAT IS NOT THE TOPIC OF THIS DEBATE. NET NEUTRALITY IS. I believe that Net Neutrality should be spared, and should be kept away from Virgin Media's grubby, greedy hands. For those who don't know, I'll summarize net neutrality in a simple way. Net neutrality is what lets you sit at your computer, hop on the internet, and visit every site on the internet at the same speed. Now, granted it will not always be the same each visit. There is sure to be differing ammounts of content on each site your computer has to process. What Virgin Media plans to do, is 'throttle' your internet. Which means, they can tell your computer to fo fast to one site, but slow to another. And they do this because, most people would pay to be in the fast lane. They can also block access entirely to sites you normally go to, and redirect you to sites their sponsors create. Which means, if Google doesn't pay Virgin Media, typing google.com in the address bar will take you to a site like fetchfido.com, who has paid Virgin Media. The only way to get to Google, is to pay. Now, I believe the internet is the last vessel of our free speech. TV isn't. It's controlled by a group of people who care more about displaying an interesting story than the truth they promise. Same goes for newspapers/magazines. On the internet, everybody's oppinion is virtually the same. Nobody has a higher authority than another on the internet, except in a controlled situation. If Virgin Media takes that away, they're taking away one of our most primary rights."],"PremiseEndPos":[1914],"ArgumentID":"00000001","Conclusion":"The Internet: The Last True Example of Free Speech (Net Neutrality)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":225,"nextID":"00000003","PremiseStartPos":[1929],"prevID":"00000001","Premise":["JoeBob, you make a good point. Businesses are free to try what they would like to attempt to make money, that much is true. Customers are also free to try whichever company they would like based on a multitude of factors, none of which are outside of the obvious. But that is not what Virgin Media is proposing. The way it will go is, they will enforce this whether it is purchased or not. In other words, they are not giving customers the option to try their new 'service'; they are forcing it on everybody and recieving money from the ones who want it gone. What this is doing is esentially enslaving the internet. Like in the business world, the internet is a free market for ideas and oppinions. When Virgin Media does this, they're basically saying \"Your oppinion doesn't matter because you don't have money.\" Now, I'm not sure if there really is a law like this, but it seems there would be a law that those with a certain ammount of power (big businesses controlling utilities, for example) cannot use that power to infringe on the basic rights this country was founded on. What I'm trying to say is, isn't it illegal to infringe on the rights of the people for money? If it wasn't, we might as well allow slavery while we're at it. I know those are two different levels of importance but in escense, it's the same thing. Taking away the rights of another person so you can make money. To make something clear, the way Virgin Media is predicted to 'throttle' the internet would make using the internet so slow that it is near unusable. And to the person in the comments, this isn't an internet service. It's a throttle on the internet as a whole. A brace on the entire internet, if you will. So you can't just switch at will. Sprint, Embarq, Cox, all of it will be 'throttled' by Virgin's plan."],"PremiseEndPos":[3731],"ArgumentID":"00000002","Conclusion":"The Internet: The Last True Example of Free Speech (Net Neutrality)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":225,"nextID":"00000004","PremiseStartPos":[3746],"prevID":"00000002","Premise":["Here is a bit from the main net neutrality supporting site, savetheinternet.com, under the FAQ section. Who wants to get rid of net neutrality? The nation's largest telephone and cable companies -- including AT&T, Verizon, Comcast and Time Warner -- want to be Internet gatekeepers, deciding which Web sites go fast or slow and which won't load at all. They want to tax content providers to guarantee speedy delivery of their data. They want to discriminate in favor of their own search engines, Internet phone services, and streaming video -- while slowing down or blocking their competitors. Which means it isn't just Virgin Media that's heading into this. They're followed by many other companies as well. Now, I know you might think, \"Well, people can just switch to Embarq or one of the 'safe' IPs\" But that wouldn't work exactly as planned. Why wouldn't Embarq take that opportunity to raise their prices? No matter how you look at it, we have to pay more. I know that sounds a bit greedy, but in times like this, with our economy as unstable as it is, this simply cannot turn out well. Otherwise, my arguments on the unethical nature of net neutrality still stand. I can understand if you don't intend to disagree with them, as well. As the consumer, I can't begin to think of a scenario where getting rid of net neutrality would be beneficial. Either way, I had fun. And it looks net neutrality is winning. I hear action was recently taken against Comcast. Thanks for the fun debate and good luck."],"PremiseEndPos":[5252],"ArgumentID":"00000003","Conclusion":"The Internet: The Last True Example of Free Speech (Net Neutrality)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":225,"nextID":"00000005","PremiseStartPos":[5267],"prevID":"00000003","Premise":["Mr Believer (Pro), thank you for proposing this interesting topic. Pro is in favor of internet neutrality, or transparency, or equality, or freedom - as opposed to the controls proposed by Virgin Media to limit access to certain sites based on bandwidth or advertising arrangements. Well, while I agree that a China-esque approach to Internet control sounds dreadful, this scheme is not being proposed by a government but by a corporation, which is also one of the last vestiges of real freedom. Corporations can do whatever they like in the free market. If they want to sell pickled rabbit turds, they can. They are free to try...and fail. As such, Virgin Media is free to try this bandwidth throttling scheme. If their customers like it, they will prosper. If their customers hate it, they will fail and the customers will switch to other vendors. If no other vendors currently exist, I promise you they soon will. In the United States, telephony was once controlled by a very small cabal of large corporations. However, people didn't like the policies of those corporations, and now we have dozens of contract-free, internet-based and cell-based telephone company options. While Virgin's scheme sounds dastardly, it is merely an expression of the free market. They are free to try. If you, the consumer, don't like their service, don't pay for it. Net Neutrality is not in danger."],"PremiseEndPos":[6651],"ArgumentID":"00000004","Conclusion":"The Internet: The Last True Example of Free Speech (Net Neutrality)","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":225,"nextID":"00000006","PremiseStartPos":[6666],"prevID":"00000004","Premise":["I think my opponent may have a false notion of what Virgin's throttling really is. Virgin Media is an internet service provider (ISP) in the UK, just like AOL, Comcast, and NetZero in the US (or globally). An ISP is merely a company that gives an individual access to the internet, it does not in any way affect the internet itself. An ISP is like a window that lets you look at internet content. The internet, of course, is a giant web of servers spread all over the world. No one controls all of it, and everyone who owns a server wants it to run as fast as possible. Virgin's throttling is a system of controlling the bandwidth of the data uploading and downloading through their internet access servers. If you are a Virgin customer in the UK, then you are essentially looking at the internet through Virgin's window, which allows Virgin to block or slow down parts of the view (web pages) at their whim. If you are not a Virgin customer, then Virgin's policies have no effect upon your internet access. If you are an AOL customer, you are viewing the internet through AOL's window which is subject to AOL's policies or shady business deals and no one else's. Conclusion: Virgin's throttling only affects Virgin customers, and if they get angry, they will change provider."],"PremiseEndPos":[7943],"ArgumentID":"00000005","Conclusion":"The Internet: The Last True Example of Free Speech (Net Neutrality)","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":225,"nextID":"00000000","PremiseStartPos":[7958],"prevID":"00000005","Premise":["All corporate schemes to force people to pay for their web sites to run faster are simply schemes to maximize profits. Let them. If they anger their customers, then a new generation of ISP companies will rise to replace them, just as the VOIP telephone companies have appeared to challenge traditional telephony. Returning to the issue of freedom of speech and net neutrality: Free speech is the first defined and protected right in the United States. It has succeeded in protecting all forms of speech, including political and social, for centuries. It is fully intact. Regulations on media do not limit free speech, they limit corporate activities. And skewed news reporting is a business decision. If you think Fox News is shallow or biased, watch BBC. We have a news marketplace. I have a dozen news channels standard in my TV package. They are all skewed to reflect the policies of the corporations that run them. You stated initially that net neutrality was about the freedom to access all web sites at the same speed. But web access is already limited by the user's computer, OS, browser, and ISP, as well as the web site's design, plugins, and servers. All of these elements are corporate products and are tweaked to perform in certain ways beyond your control. You then claimed that the internet represents free speech because the traditional media, as I described above, is biased by corporate interests. However, the internet is biased by personal interests. Blogs don't represent some higher truth, they represent the opinion of one person, who is probably not a well-informed expert. The article on Wikipedia on \"cardiology\" may have been written by an angry teenager and not a team of eminent cardiologists. Also, most blogs have tiny readerships. They are little more than personal journals sharing personal opinions with a small number of like-minded friends. This does not spread ideas or information. In fact, as demonstrated by my Wikipedia example, the \"information\" on the internet is largely untrustworthy, and untrustworthy information is completely worthless. Conclusions: (1) My opponent's claim that throttling schemes or other attempts to alter internet access threatens net neutrality is False because there is no such thing as net neutrality. The internet is already governed by and predicated upon corporate interests. (2) My opponent's claim that the internet represents the \"last vessel of free speech\" is False for two reasons: (a) The internet already is just as biased as traditional forms of media, and (b) the right to free speech as strong today as when it was drafted in the Bill of Rights. It is false to equate corporate access to information with the freedom of expression. Therefore, vote Con to acknowledge that the internet is not a magical land of pure ideals and freedoms - it is simply another imperfect tool for exchanging imperfect information, and corporate attempts to alter its functions are no different from corporate controls on everything else. I thank my opponent for an interesting debate!"],"PremiseEndPos":[11007],"ArgumentID":"00000006","Conclusion":"The Internet: The Last True Example of Free Speech (Net Neutrality)","PremiseStance":["Con"]}}]}