{"MetaData":{"Context":"URL: http://www.debate.org/debates/Traditional-Families-vs.-Contemporary-Families/1/\nCrawl date: 2016/09/29 06:21:50\nOnline Debate: Traditional Families vs. Contemporary Families | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: Essentially, it is better for children to grow up in a traditional home because it gives them a sense of love and respect. But what about the ones that are in a same sex marriage and want to adopt a child? How will they grow up in society? Is it better for a child to grow up in a 'Traditional' Family or a 'Contemporary' Family\n\nEvidence Pro: I agree with what your trying to say, but have you seen how society is? Society has turned cold and although there are people out there who will love and cherish their child, they society won't. The child will get bullied and laughed at. The world is like that now a days.\n\nEvidence Pro: LeiLei forfeited this round. Con Consider my case rested I guess. Here's a nice story about an adopted family of two lesbian moms so I can say I used a source.\n\nEvidence Con: For the sake of this argument I am going to assume that the parents in either situation are kind loving parents who respect and support their child. Are you saying that a child cannot get the same love and respect from two same sex parents? why would the child grow up any differently? Perhaps the child growing up in the \"non traditional\" family will have a different world view. Possibly a much more caring open minded one. I don't see any reason to believe that having two moms or two dads who love and support you would be in any way damaging.\n\nEvidence Con: If you agree than perhaps you can save us both some time and concede the debate. Society once held that black people wouldn't be any good at sports (how laughably wrong they were) and that AIDS was created by homosexuals. This may come as a shock but society has this little habit of being wrong. it also has a habit of changing it's way of thinking and coming around to new ways of thinking. As more \"non traditional\" families emerge society will come to understand and respect them. Society has never liked new things. Society is like the only child being told it's getting a new sibling, It will kick and scream for a bit but will eventually come around. Society is not the issue however. The issue is the family dynamic itself and whether or not it will work in a non traditional family. You have yet to give me any evidence to support your claim that a child in a home with gay parents cannot get the love and respect of a child in a home with straight parents. In fact you have agreed with me that there would be no difference at all.\n\nEvidence Con: Consider my case rested I guess. Here's a nice story about an adopted family of two lesbian moms so I can say I used a source.\n","DiscussionID":"00000008","Title":"Traditional Families vs. Contemporary Families","CrawlDate":"2016/09/29 06:21:50","URL":"http://www.debate.org/debates/Traditional-Families-vs.-Contemporary-Families/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":178,"nextID":"00000002","PremiseStartPos":[230],"prevID":"00000000","Premise":["Essentially, it is better for children to grow up in a traditional home because it gives them a sense of love and respect. But what about the ones that are in a same sex marriage and want to adopt a child? How will they grow up in society? Is it better for a child to grow up in a 'Traditional' Family or a 'Contemporary' Family"],"PremiseEndPos":[559],"ArgumentID":"00000001","Conclusion":"Traditional Families vs. Contemporary Families","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":178,"nextID":"00000003","PremiseStartPos":[574],"prevID":"00000001","Premise":["I agree with what your trying to say, but have you seen how society is? Society has turned cold and although there are people out there who will love and cherish their child, they society won't. The child will get bullied and laughed at. The world is like that now a days."],"PremiseEndPos":[847],"ArgumentID":"00000002","Conclusion":"Traditional Families vs. Contemporary Families","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":178,"nextID":"00000004","PremiseStartPos":[862],"prevID":"00000002","Premise":["LeiLei forfeited this round. Con Consider my case rested I guess. Here's a nice story about an adopted family of two lesbian moms so I can say I used a source."],"PremiseEndPos":[1022],"ArgumentID":"00000003","Conclusion":"Traditional Families vs. Contemporary Families","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":178,"nextID":"00000005","PremiseStartPos":[1037],"prevID":"00000003","Premise":["For the sake of this argument I am going to assume that the parents in either situation are kind loving parents who respect and support their child. Are you saying that a child cannot get the same love and respect from two same sex parents? why would the child grow up any differently? Perhaps the child growing up in the \"non traditional\" family will have a different world view. Possibly a much more caring open minded one. I don't see any reason to believe that having two moms or two dads who love and support you would be in any way damaging."],"PremiseEndPos":[1585],"ArgumentID":"00000004","Conclusion":"Traditional Families vs. Contemporary Families","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":178,"nextID":"00000006","PremiseStartPos":[1600],"prevID":"00000004","Premise":["If you agree than perhaps you can save us both some time and concede the debate. Society once held that black people wouldn't be any good at sports (how laughably wrong they were) and that AIDS was created by homosexuals. This may come as a shock but society has this little habit of being wrong. it also has a habit of changing it's way of thinking and coming around to new ways of thinking. As more \"non traditional\" families emerge society will come to understand and respect them. Society has never liked new things. Society is like the only child being told it's getting a new sibling, It will kick and scream for a bit but will eventually come around. Society is not the issue however. The issue is the family dynamic itself and whether or not it will work in a non traditional family. You have yet to give me any evidence to support your claim that a child in a home with gay parents cannot get the love and respect of a child in a home with straight parents. In fact you have agreed with me that there would be no difference at all."],"PremiseEndPos":[2641],"ArgumentID":"00000005","Conclusion":"Traditional Families vs. Contemporary Families","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":178,"nextID":"00000000","PremiseStartPos":[2656],"prevID":"00000005","Premise":["Consider my case rested I guess. Here's a nice story about an adopted family of two lesbian moms so I can say I used a source."],"PremiseEndPos":[2783],"ArgumentID":"00000006","Conclusion":"Traditional Families vs. Contemporary Families","PremiseStance":["Con"]}}]}