{"MetaData":{"Context":"URL: http://www.debate.org/debates/Tennis-is-the-best-sport-in-the-world/1/votes/1/\nCrawl date: 2016/09/29 07:22:54\nDebate Argument: Tennis is the best sport in the world | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: Tennis is the best sport in the world, as it is the best in the group of few sports which equally strengthen your arm and leg muscles. It is better than swimming as it is much more social, and more accesible and less of a bother(getting changed, getting wet, taking a shower etc. needs to be done for swimming)/\n\nEvidence Pro: Jziggy forfeited this round. Con jerkfacemcgee forfeited this round. Pro Hello everyone we are a very fancy comrade who likes to dance with everyone in toll she say she say one\n\nEvidence Con: As someone who spent two hours playing tennis today, and a soon-to-be member of my school's tennis squad, I will concede that tennis is a fun sport. But is tennis the best sport in the world? I strongly disagree. Jziggy claims that tennis is better than swimming because it is more social. However, the only time you will be playing with another member of your \"team\" is if you are playing doubles and even then that's just one other person. More often than not, you will be playing singles and will obviously be alone. Additionally, Jziggy claims that tennis is \"more accessible and less of a bother\" than swimming. If you plan to swim, you can go hop in the city pool or any body of water. Grab a pair of goggles and you're good to go. To play tennis, you have to locate a properly sized court equipped with a net and back fence, find a racket, tennis balls, tennis shoes, and a person to play with. More accessible and less of a bother? I think not. Jziggy classifies tennis as one of the few sports that strengthen your arms and legs. However, many sports fit this qualification such as baseball(our nation's pastime), hockey, American football, basketball, softball, track and field events, rugby, volleyball, and numerous other athletic pursuits. What evidence is there that proves tennis is better than all of these sports? In conclusion, I've rebutted all of Jziggy's limited arguments that allegedly crown tennis as the king of sports, over our nation's pastime and some of the most popular sports in the world, over age old traditions and sports than incite \"March Madness\" throughout America. Clearly, tennis is NOT the best sport in the world and does not deserve this generous title.\n\nEvidence Con: jerkfacemcgee forfeited this round. Pro Hello everyone we are a very fancy comrade who likes to dance with everyone in toll she say she say one\n\nEvidence Con: Okay? Since none of my arguments have been rebutted, or even answered, I think is clear who has won this debate. I understand however that it is up to the voters to decide based on the way the issue was debated. Thank you to all who have followed this round.\n","DiscussionID":"00000012","Title":"Tennis is the best sport in the world","CrawlDate":"2016/09/29 07:22:54","URL":"http://www.debate.org/debates/Tennis-is-the-best-sport-in-the-world/1/votes/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":170,"nextID":"00000002","PremiseStartPos":[222],"prevID":"00000000","Premise":["Tennis is the best sport in the world, as it is the best in the group of few sports which equally strengthen your arm and leg muscles. It is better than swimming as it is much more social, and more accesible and less of a bother(getting changed, getting wet, taking a shower etc. needs to be done for swimming)/"],"PremiseEndPos":[534],"ArgumentID":"00000001","Conclusion":"Tennis is the best sport in the world","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":170,"nextID":"00000003","PremiseStartPos":[549],"prevID":"00000001","Premise":["Jziggy forfeited this round. Con jerkfacemcgee forfeited this round. Pro Hello everyone we are a very fancy comrade who likes to dance with everyone in toll she say she say one"],"PremiseEndPos":[726],"ArgumentID":"00000002","Conclusion":"Tennis is the best sport in the world","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":170,"nextID":"00000004","PremiseStartPos":[741],"prevID":"00000002","Premise":["As someone who spent two hours playing tennis today, and a soon-to-be member of my school's tennis squad, I will concede that tennis is a fun sport. But is tennis the best sport in the world? I strongly disagree. Jziggy claims that tennis is better than swimming because it is more social. However, the only time you will be playing with another member of your \"team\" is if you are playing doubles and even then that's just one other person. More often than not, you will be playing singles and will obviously be alone. Additionally, Jziggy claims that tennis is \"more accessible and less of a bother\" than swimming. If you plan to swim, you can go hop in the city pool or any body of water. Grab a pair of goggles and you're good to go. To play tennis, you have to locate a properly sized court equipped with a net and back fence, find a racket, tennis balls, tennis shoes, and a person to play with. More accessible and less of a bother? I think not. Jziggy classifies tennis as one of the few sports that strengthen your arms and legs. However, many sports fit this qualification such as baseball(our nation's pastime), hockey, American football, basketball, softball, track and field events, rugby, volleyball, and numerous other athletic pursuits. What evidence is there that proves tennis is better than all of these sports? In conclusion, I've rebutted all of Jziggy's limited arguments that allegedly crown tennis as the king of sports, over our nation's pastime and some of the most popular sports in the world, over age old traditions and sports than incite \"March Madness\" throughout America. Clearly, tennis is NOT the best sport in the world and does not deserve this generous title."],"PremiseEndPos":[2438],"ArgumentID":"00000003","Conclusion":"Tennis is the best sport in the world","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":170,"nextID":"00000005","PremiseStartPos":[2453],"prevID":"00000003","Premise":["jerkfacemcgee forfeited this round. Pro Hello everyone we are a very fancy comrade who likes to dance with everyone in toll she say she say one"],"PremiseEndPos":[2597],"ArgumentID":"00000004","Conclusion":"Tennis is the best sport in the world","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":170,"nextID":"00000000","PremiseStartPos":[2612],"prevID":"00000004","Premise":["Okay? Since none of my arguments have been rebutted, or even answered, I think is clear who has won this debate. I understand however that it is up to the voters to decide based on the way the issue was debated. Thank you to all who have followed this round."],"PremiseEndPos":[2871],"ArgumentID":"00000005","Conclusion":"Tennis is the best sport in the world","PremiseStance":["Con"]}}]}