{"MetaData":{"Context":"URL: http://www.debate.org/debates/Christian-rapper-me-vs.-atheist-rapper/1/\nCrawl date: 2016/09/29 03:07:08\nDebate Argument: Christian rapper (me) vs. atheist rapper | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: We will have an hour to battle. First Round Acceptance\n\nEvidence Pro: Alright listen, i know i've screwed up in the GCL drama with my sexist posts I stumbled in arrogance like the Assyrian king who conquers and boasts I know i sparked some controversy among members of the community Attemptin' to disrupt the unity to disunity at every single opportunity I know i was selfish with aggression, but in this rap session i make a confession of all the sins i committed, they're forgiven now lets all make some progression Isn't it ingenious? That before you could slaughter me as you get to prying that i nailed myself with Christ to the cross, the solution is spiritually dying (1) s://encrypted-tbn1.gstatic.com...; alt=\"\" /> Yes i know i believe in God by faith alone even if it means without seeing But you believe in the human being not by thinking but by emotional feeling Why? Why are you always attacking the Bible? your greatest rival? Is it because it has the key to your movement's survival in it's primal? Philosophically, i thought light was stronger than darkness That lies were so light, they were completely harmless But knowing that Christians have something you don't bothers you Is it just because your just jealous that we can die for what's true? That we can stand for something whereas you fall for any and everything? Like a leaf that has beef with the east which is why you are worrying Because you have no culture of your own nor is anyone on your side so you chill with a bunch of misfits refusin' to submit because of pride You don't believe God exists? Well i don't believe in atheists Scientists have just discovered that fact you just will dismiss (2) So stop thinking that you always follow evidence, just admit That your ignorance is as dark as primordial \"mythical\" abyss Whatever it is, lets just be honest, confess you have trust issues Not with God, just with trusting yourself, now here's some tissues As soon as someone puts a gun to your head you cry \"oh my God!\" I should slap you with Moses' rod for being such a hypocritcal fraud What are the odds of you being just a human who is terribly flawed? Claimin' that you don't need morality well here comes the fool The one who greedily stole the golden rule from Sunday school Just because it's golden, biblical morals are upholden n' established You ramble on about your self proclaimed intellect not accomplished So what if i believe that God did miracles from Moses to Jesus I've yet to hear solid reasons from this \"genius\" and his thesis On why we should be fully open minded about his naturalism (3) Anymore than we should be open minded about Bible evangelism Sources: 1. Galatians 2:19 \"For when I tried to keep the law, it condemned me. So I died to the law--I stopped trying to meet all its requirements--so that I might live for God.\" 2. 3.\n\nEvidence Con: it's going to be fun putting you on the spot when it's over and done you better not be distraught because when i'm through with you you're going to realize God was something that was not\n\nEvidence Con: you act like i never gave God a chance the doctrines are flawed at every stance you only think you're right because of your arrogance how can believe so firmly in which has little evidence the belief of the atheist is about seeking further knowledge but you guys think your mind is flawless we know we don't hold all the answers this is something you should acknowledge faith is not completely harmless it makes an attempt to explain the marvelous regardless of how little science we have harnessed the flaws are bottomless how can you be so blind if everyone believed in God we would make no attempt to expand our scientific squad becuase we would've thought that everything was explained that nothing was odd but we atheists know there are still much more to discover our chances aren't based on superstitions and 4 leaf clovers Christians historically have done a lot wrong don't you dare try to put that under the covers if history had no God society would still be able to function morals would be given and we'd still have instructions don't think God is the only moral giver i bet the thought that humans can make morals makes you shiver how does it make you feel that your God was also a killer don't be so naiive, read the bible, and don't be a scripture picker sometimes i say \"oh my god\" not for the literal expression but only for the suppression of said emotional transgression if history had no God we might be more technologically more advanced the human genome might be enhanced its time for you to give this thought a chance now here comes my personal story of how i wished my soul was embraced in his glory born and raised in extreme fundamental illusory glossolalia, eucharist, sabbath day was all obligatory the problem was raised when we rejected other christian doctrines that we believed we were the only ones saved and that even other christians would soon be forgotten christians not only fight the atheists, but fight themselves its completely rotten how you guys are nailing your own coffins\n","DiscussionID":"00000017","Title":"Christian rapper (me) vs. atheist rapper","CrawlDate":"2016/09/29 03:07:08","URL":"http://www.debate.org/debates/Christian-rapper-me-vs.-atheist-rapper/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":126,"ConclusionEndPos":166,"nextID":"00000002","PremiseStartPos":[218],"prevID":"00000000","Premise":["We will have an hour to battle. First Round Acceptance"],"PremiseEndPos":[273],"ArgumentID":"00000001","Conclusion":"Christian rapper (me) vs. atheist rapper","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":126,"ConclusionEndPos":166,"nextID":"00000003","PremiseStartPos":[288],"prevID":"00000001","Premise":["Alright listen, i know i've screwed up in the GCL drama with my sexist posts I stumbled in arrogance like the Assyrian king who conquers and boasts I know i sparked some controversy among members of the community Attemptin' to disrupt the unity to disunity at every single opportunity I know i was selfish with aggression, but in this rap session i make a confession of all the sins i committed, they're forgiven now lets all make some progression Isn't it ingenious? That before you could slaughter me as you get to prying that i nailed myself with Christ to the cross, the solution is spiritually dying (1) s://encrypted-tbn1.gstatic.com...; alt=\"\" /> Yes i know i believe in God by faith alone even if it means without seeing But you believe in the human being not by thinking but by emotional feeling Why? Why are you always attacking the Bible? your greatest rival? Is it because it has the key to your movement's survival in it's primal? Philosophically, i thought light was stronger than darkness That lies were so light, they were completely harmless But knowing that Christians have something you don't bothers you Is it just because your just jealous that we can die for what's true? That we can stand for something whereas you fall for any and everything? Like a leaf that has beef with the east which is why you are worrying Because you have no culture of your own nor is anyone on your side so you chill with a bunch of misfits refusin' to submit because of pride You don't believe God exists? Well i don't believe in atheists Scientists have just discovered that fact you just will dismiss (2) So stop thinking that you always follow evidence, just admit That your ignorance is as dark as primordial \"mythical\" abyss Whatever it is, lets just be honest, confess you have trust issues Not with God, just with trusting yourself, now here's some tissues As soon as someone puts a gun to your head you cry \"oh my God!\" I should slap you with Moses' rod for being such a hypocritcal fraud What are the odds of you being just a human who is terribly flawed? Claimin' that you don't need morality well here comes the fool The one who greedily stole the golden rule from Sunday school Just because it's golden, biblical morals are upholden n' established You ramble on about your self proclaimed intellect not accomplished So what if i believe that God did miracles from Moses to Jesus I've yet to hear solid reasons from this \"genius\" and his thesis On why we should be fully open minded about his naturalism (3) Anymore than we should be open minded about Bible evangelism Sources: 1. Galatians 2:19 \"For when I tried to keep the law, it condemned me. So I died to the law--I stopped trying to meet all its requirements--so that I might live for God.\" 2. 3."],"PremiseEndPos":[3054],"ArgumentID":"00000002","Conclusion":"Christian rapper (me) vs. atheist rapper","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":126,"ConclusionEndPos":166,"nextID":"00000004","PremiseStartPos":[3069],"prevID":"00000002","Premise":["it's going to be fun putting you on the spot when it's over and done you better not be distraught because when i'm through with you you're going to realize God was something that was not"],"PremiseEndPos":[3256],"ArgumentID":"00000003","Conclusion":"Christian rapper (me) vs. atheist rapper","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":126,"ConclusionEndPos":166,"nextID":"00000000","PremiseStartPos":[3271],"prevID":"00000003","Premise":["you act like i never gave God a chance the doctrines are flawed at every stance you only think you're right because of your arrogance how can believe so firmly in which has little evidence the belief of the atheist is about seeking further knowledge but you guys think your mind is flawless we know we don't hold all the answers this is something you should acknowledge faith is not completely harmless it makes an attempt to explain the marvelous regardless of how little science we have harnessed the flaws are bottomless how can you be so blind if everyone believed in God we would make no attempt to expand our scientific squad becuase we would've thought that everything was explained that nothing was odd but we atheists know there are still much more to discover our chances aren't based on superstitions and 4 leaf clovers Christians historically have done a lot wrong don't you dare try to put that under the covers if history had no God society would still be able to function morals would be given and we'd still have instructions don't think God is the only moral giver i bet the thought that humans can make morals makes you shiver how does it make you feel that your God was also a killer don't be so naiive, read the bible, and don't be a scripture picker sometimes i say \"oh my god\" not for the literal expression but only for the suppression of said emotional transgression if history had no God we might be more technologically more advanced the human genome might be enhanced its time for you to give this thought a chance now here comes my personal story of how i wished my soul was embraced in his glory born and raised in extreme fundamental illusory glossolalia, eucharist, sabbath day was all obligatory the problem was raised when we rejected other christian doctrines that we believed we were the only ones saved and that even other christians would soon be forgotten christians not only fight the atheists, but fight themselves its completely rotten how you guys are nailing your own coffins"],"PremiseEndPos":[5290],"ArgumentID":"00000004","Conclusion":"Christian rapper (me) vs. atheist rapper","PremiseStance":["Con"]}}]}