{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-USA-Shouldn-t-have-Bombed-Hiroshima-and-Nagasaki/1/votes/3/\nCrawl date: 2016/09/29 04:26:03\nDebate: The USA Shouldn't have Bombed Hiroshima and Nagasaki | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: I will let my opponent make his points first but the bombing of these cities was unneeded. The USA was to win the war anyway.\n\nEvidence Pro: Alright, good points made by tjzimmer although I will get to them later. First I want to mention that you have justified the killing of many, many innocent people because of the wrongdoings of their nations leaders and military forces. Yes I know that they treated our prisoners terrible and abused them, but just because they were unethical doesn't mean we have to be. The USA is more humane then that. First point you made was Pearl Harbor. The attack on Pearl Harbor is something that cannot be compared to the dropping of the atomic bombs and for these reasons. Pearl Harbor only killed about 2,000 military were killed and 57 civilians were killed. The main purpose of the attack on Pearl Harbor was to cripple our navy, which is the point of war. To cripple the otherside's military to get them to surrender. Therefore, that was a somewhat justified move. The dropping of the bomb in Hiroshima killed between 90,000 and 140,000 civilians. In Hiroshima alone. That was not to cripple the military. That was to kill civilians who had very little or no part of the war. Second point you make is island hopping. How is that a point that the bombs were justified? That is what that theatre of the war called for. To push the Japanese troops out of those Pacific islands. Third point you make is fire bombing. We firebombed 66 different cities beforehand causing 330,000 civilian deaths. They were ready to surrender after this. According to William D. Leahy, Chief of Staff to Truman- \"The use of [the atomic bombs] at Hiroshima and Nagasaki was of no material assistance in our war against Japan. The Japanese were already defeated and ready to surrender.\" Other important people against the bombing were Eisenhower and MacArthur, two people who without we would have lost the war. The invasion of mainland USA is the argument always used to justify the dropping of the bombs, but an invasion was too, unneeded. Again they were about to surrender when we dropped them. Fourth point is the Bataan Death March and again I say, why stoop down to their level? Why be as unethical as they were? Treat as you would want to be treated. Fifth point was the Kamikaze and this is was used out of desperation. They thought that they actually had a chance left in the war and thought this was needed. However in the closing days of the war, they realized all hope was lost. My point is that their was no military reason to drop the bombs on Japan because unlike what you say, they were on the verge of surrender. Watch the Fog of War, a documentary about Robert McNamara. He discusses how the bombs were a mistake. The only reason I think Truman decided to drop them was to show the Soviets and Stalin we had the bomb. Right after WW2, the cold war began, intiated by the dropping of the bombs.\n\nEvidence Pro: Alright I am glad we agree on that the bomb was to boost our military might, but we disagree on if that was the only major reason. And before I hit that point, I want to discuss the horrors we caused. You say to protect 1.5 American military lives, we had to kill Japanese lives. Yes, that is the point of war. However the dropping of the bomb was as unethical as any other type of warfare. How is killing innocent civilians justifiable? And the amount we killed. Thousands and thousands. One account right after the bomb was dropped says- \"He was the only person making his way into the city; he met hundreds and hundreds who were fleeing, and every one of them seemed to be hurt in some way. The eyebrows of some were burned off and skin hung from their faces and hands. Others, because of pain, held their arms up as if carrying something in both hands. Some were vomiting as they walked. Many were naked or in shreds of clothing. On some undressed bodies, the burns had made patterns--of undershirt straps and suspenders and, on the skin of some women (since white repelled the heat from the bomb and dark clothes absorbed it and conducted it to the skin), the shapes of flowers they had had on their kimonos. \" That is not war. Wars cannot be won by slaughtering innocent women and children and if it is God help us. We have become barbarians that belong in the Dark Ages. And not only did we kill these innocent women and children, we made them suffer and suffer. The bombs cannot be called a bomb or an explosive. It is a poison that spread its radioactive toxin across a city. This caused innocent women and children to die of cancer and other terrible things years after. That is not war. And you say that it is justified because we had to protect 1.5 million lives but some things refute that. 1. How do you know that? That is simply a worst case scenario. And the estimate that the invasion of Japan would have cost us a million casualties is ludicrous and not based on anything. The studies done at the time and presented to the president showed that the soldiers killed would have been about 5% of that number. The fact that the Japanese were already trying to surrender when we dropped the bomb--and that we ultimately gave them the terms we first refused--makes the allegation that we would have had to invade Japan particularly ridiculous. 2. If they were to fight to the last man, how come they did not? After we dropped the bomb, they still had plenty of troops. 3. The Japanese had already asked the Russians to intercede for them and had indicated they would surrender if allowed to keep their emperor. We proceeded to drop the bomb while calling for unconditional surrender; immediately afterwards, we made peace on terms allowing them to keep their emperor. Their emporor is something we as Amricans don't understand. He is a deity to them. Not only that, do you know why Hiroshima was selected. It was selected because it had not been firebombed previously in the war. We picked it because we wanted to see the effects of the bomb on a \"virgin city\". With this effects we could show the Russians. This bomb would be used very unlikely on the Germans unless last case scenario because with the Japanese, there was a profound racism. This also helped our decision. Althoush you do disagree with the Nagasaki bombing, here is a little fact. The second bomb was dropped on Nagasaki only days afterward, before the Japanese even had assimilated what had happened at Hiroshima. They certainly would have surrendered without the necessity of a second bomb. There is no justification for this extremely inhumane and unjust massacre of thousands of Japanese civilians. Please look at this as a human and not a very patriotic American.\n\nEvidence Pro: I am very sorry, but you are not answering my points. You contradict in your last statement when you say \" Looking at it from a human point of view I still disagree. War claims such horrible deaths of civilians. Japan brought this horrific event upon itself by pearl harbor, kamikazes, and Bataan. They should have no mercy shown on them. War is to win and destroy your enemy, not be forgiven and kind. A sign of weakness from America would have enabled Japan to maintain fighting and the bomb caused them to shut it down.\" Apparently you are still looking at this in patriotic American terms because you still feel that innocent civilians should pay for what Japanese rulers and military men did. Now I understand where you are coming from where you have to protect your men's lives and I want to thank you for doing that and being part of our army. However, that is not the case. 1.5 million men is a totally false estimate. Also, when you say in your previous argument \"All sides of the war did horrible things. Thats fact.\". Why must we compare with the Nazis, Soviets and Japanese. What you are saying is \"if the Nazis are doing terrible, cruel acts, why don't we try to kill as many innocent lives as they did\". Again, why stoop down to their level. And again with Pearl Harbor. Pearl Harbor, was maybe sneaky and unfair, it is justified. Military men were killed in Pearl Harbor, not innocent women and children. The point was to destroy our navy. The point of the atomic bomb was to kill as many innocent lives as possible. And you don't get anymore immoral and sneaky then dropping an atomic bomb on a city full with innocent civilians. Szilard, a major part of the Manhatten Project, once said \"\"Let me say only this much to the moral issue involved: Suppose Germany had developed two bombs before we had any bombs. And suppose Germany had dropped one bomb, say, on Rochester and the other on Buffalo, and then having run out of bombs she would have lost the war. Can anyone doubt that we would then have defined the dropping of atomic bombs on cities as a war crime, and that we would have sentenced the Germans who were guilty of this crime to death at Nuremberg and hanged them?\" This is a very good question. If we were to lose that war somehow after dropping the bombs, I believe our reputation from then on we have been of immoral monsters. Many would say that these bombings are a genocide. Genocide is the deliberate and systematic destruction of an ethnic, racial, religious or national group. And genocide is indeed a war crime. I ask you, a military man and what seems to be an intelligient man, read the points made in my arguments and answer them. It has been a pleasure debating with you and I hope to soon in the future again.\n\nEvidence Con: First off I would like to say though the bombs were not ethical on the US part, they were definitely justified in dropping. Also, remember that the Japanese were not ethical in their acts during the war. I am pro bombing Hiroshima however I am kind of against the dropping of the second bomb on Nagasaki. Pearl Harbor- The Japanese used terrorist tactics to unknowingly kill innocent American men and women. No official wage of war was made and they hoped to cripple America into a war that could decide the fight of the world. What kind of enemy does such a thing? They were cowards and it was horrible to surprise attack a military installation. This act is against all conventional war tactics and the simple fact that attacks us at home is enough to bomb them. Island Hopping Brutality- We lost millions in the Pacific. Some never even accounted for. The Marines lost 30,000 men at Iwo Jima. Imagine that. The brutality of this island campaign along with battles such as Midway, Guadalcanal, and many more cause America to want revenge. We lost so many good men and resources because the Japanese would never stop. Every Japanese citizen on the Island of Okinawa committed suicide by jumping off a cliff. They would rather die then surrender to America. How could we get them to surrender? Fire Bombing- We fire bombed the Japanese coast line extensively during the war. Many people are unaware of the carnage we made upon Japanese citizens. However we killed easily 100,000 Japanese on their cost and their government refused to surrender as the charred bodies lay on the ground. How else can we get them to surrender? Mainland Japan- They estimated it would cost 1 million American lives to invade mainland Japan. And another 500,000 to hold the island. 1.5 million more dead. That means sending the exhausted vets from Europe over to die in the sand. Imagine US soldiers having to kill women and children armed with whatever they had. The Japanese gave so many signs of not surrendering. They willing to risk their entire nation as long as they took as many Americans with them. Bataan Death March- The Japanese were the most treacherous type of combatants and Prison wardens one could imagine. Later tried as a Japanese war crime the death march lasted 60 miles. They weeded out the Filipino and American captives by shooting them in the head of they stopped. They starved them and stripped them naked. They refused them medical and socialization. They lost 60 percent of the prisoners in the first month, leaving their bodies on the ground as a brutal reminder. The Japanese raped and pilledged the Filipino towns and many accounts of beheading, cut throats, and lighting them on fire were recorded. What kind of enemy does this? Kamikazes- Pilots of Japanese planes started purposely flying them into ships and encampments. The Japanese funding was running low and so were trained pilots. They couldn't train them quick enough and they didn't have enough bombs to destroy the enemy the custom way. So they flew themselves into death which was the greatest honor and service to the proud Japanese culture. Surely this type of mindset would not surrender. Ample Warnings- Prior to the US dropping the first bomb, we and the USSR gave ample warnings through telegrams and parachuting messages of Tokyo. The Japanese never responded to the call for surrender. We dropped the first bomb and they didn't surrender. 5 days or so later still not surrendered, we dropped another crippling them and then they finally surrendered. Their people were decimated and yet the government still wanted to fight? The only reason they surrendered is because they ran out of people to fight with otherwise the Japanese war machine would have kept moving. Japanese Internment in America- A nice liberal point of view that many do not want to support is that by dropping the bombs that essentially ended the war, the internment camps began to close. If you don't know this many Japanese were put into camps to keep them safe from others along with to keep a spy on them. These peoples were stripped of everything and the camps were horrible. By ending the war earlier than an invasion would have been, these people were set free and Congress vowed never to intern individuals based on race and culture. So if not for the bomb we would probably still racially segregated Japanese based on the soreness American people felt after the harsh, long war was won. It is difficult for me to go against Truman's decision to drop the bombs. By doing this he said American lives are more important than Japanese. It is harsh but that is how it should be. They were our enemy and their brutality to our people is well known. For many like myself the bomb saved our grandpa's from going to the Pacific after Europe. For many they may not be here today if we did decide to invade the mainland. Before you criticize your government for something that you don't agree with, think of the repercussions and affects it would have on you and your family if we had not.\n\nEvidence Con: I agree the bomb was a way to boast our military might. But, you are far off in saying that American lives lost isn't worth the amount of Japanese we killed. The fact is the Japanese were on the brink of surrender after huge defeats in Okinawa and Iwo Jima. However, they STILL didn't surrender. You conveniently decided to not comment on the multiple warnings we gave Japan to surrender pre dropping the bomb. They STILL didn't after adequate warning. Whereas we gave them notice of our attack, Pearl Harbor was a sneak attack without warning that killed Americans. Who knows how long the war would have lasted? I feel like you way the cost of American and Japanese lives the same. This is wrong in war our people and their safety are the most important. War claims the innocent no matter wait. The fact is the Philippines and Mainland Japan were still in war mode and would have cost major fatalities. The Japanese as long as they had any hope would fight to the death. The examples I give in my last post support the grit and determination of the Japanese. 1.5 Million more GI's killed or bomb the them? Ask anyone from that time period if the bomb was justified and they all will say they were glad it was done because it brought an end to the carnage. We vowed to never use nukes again and we rebuilt Japans economy after the bombs. The Japanese were evil and they did pay for their war crimes. As a future Army Officer the job I have is to make sure my men come back with me after the mission at all costs. 1.5 Million MORE men not coming home is one of the strongest justifications for dropping the bomb.\n\nEvidence Con: Looking at it from a human point of view I still disagree. War claims such horrible deaths of civilians. Japan brought this horrific event upon itself by pearl harbor, kamikazes, and Bataan. They should have no mercy shown on them. War is to win and destroy your enemy, not be forgiven and kind. A sign of weakness from America would have enabled Japan to maintain fighting and the bomb caused them to shut it down. Furthermore, the Soviets would have been much more powerful in soldier numbers and war craft if we would have invaded mainland Japan. And those numbers are legit when it comes to estimated fatalities. They knew what more we could do so that is why they surrendered. Also, don't forget about the ruthless Japanese men who did all those things you previously mentioned to our troops and the Filipinos. All sides of the war did horrible things. Thats fact. The bomb opened a can of 'nuclear' worms so to speak, but it was a necessary condition to save lives and end a prolonged two front endeavor. I mean we were thrown into the Japanese conflict unfairly. Do realize how inhumane sneak attack bombing Hawaii was? Thats ridiculous you would gladly look away from the fact that they attacked a peaceful nation to gain a few months advantage. How inhumane is treating POW's like dogs and cutting them up with machetes. Mass suicide on Okinawa lead everyone to believe that if Japan was invaded, the Japanese would have lost so many people. Also, we probably would own Japan as our providence. I think what the voters need to look at is the central question, what would have been the American costs of not dropping the bomb? Lives, money, backing from the home front, soviet discontent? Kill them before they kill us. Every part of WWII had inhumane acts so don't be so quick to blame America of wrongdoing when our interest was only to end the war with little loss possible.\n\nEvidence Con: I meant to say if I were looking at it from a humanist view, I still wouldn't agree one because I am not a humanist and two because of the strong feelings I have on this issue. The fact is, yes, the loss of life for both sides would have been exponentially larger had the weapons not been used. The president weighed the risks on using the atomic weapons, the cities that were hit in japan were mostly military based cities and most of the civilians had been evacuated as the Japanese government was expecting bombings in those cities. If the A-Bomb had not been demonstrated, it may have led to it being used sometime during the Cold War years that followed when the bombs had become a hundred times more powerful and could have led to global destruction. What matters in war is OUR casualties, not the enemies. You don't need justification to kill the enemy who is hell bent on killing you. It's said that the loss of Japanese lives would have been tripled or quadrupled (if not more) has the U.S. gone about an invasion similar to what had been done in France on June2 1944. not to mention the American lives lost, if you are an American you may not have been here today had it not been for the atomic bombs dropped on Hiroshima and Nagasaki.The second time wasn't as necessary as previously mentioned. But justified to drop ANY? You'd have to ask two questions. 1) Was there any other way? A ground war against Japan would have resulted in millions of Allied lives, with no guarantee of short term victory. 2) Where would we be now, if America DIDN'T? You must assume that if the allies didn't stop Japan, then most likely all of Asia would be under their control.(If not more) Let's face it. Learning Japanese would be tough lol... There were a number of factors involved and more than anything, the determination of the Japanese military to continue the war after the Potsdam Declaration in 1945 where the allies called for Japan's surrender. The army estimated that it would have cost between 500,000 to 1,000,000 soldiers lives to mount a successful full scale invasion of Japan. Another estimated half a million to hold the island. As much as you want to disagree with this it is FACT from multiple sources. Even if it meant house to house fighting on the Japanese mainland, the Japanese military stood firm that they would continue the bloody conflict that had already extracted extremely heavy US casualties in the Pacific Theater. As far as the US dropping down to the level of the Nazis, Soviets, and Japanese is not what I was implying. US has never had clean hands when it comes to war. Our history is based on our ability to wage war for or country. Like I said before the US did a very unethical thing from many peoples standards. But it was completely justified. What if the Nazis or Japanese had an A-bomb? Would they hesitate to use it? I think not they would kill as many of us as possible. Truman was one of the most decent men ever to lead a country. His statement in his diary about the warning to be given (\"we will have given them a chance\") shows his decency, absent in those who chose the attack on Pearl Harbor without warning. \"Wars do not increase death because death is 100% in every generation.\" Nevertheless it is a rationalization. No such weapon had ever existed, and its power could not be conceived by those not aware of the things learned during its development. Given the military culture in Japan at the time, where surrender was considered a disgrace, and the lust of conquest which has propelled the Japanese war machine, Truman was correct in his assessment that a warning would not work. War is the culprit, not the United States of America.\n","DiscussionID":"00000033","Title":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","CrawlDate":"2016/09/29 04:26:03","URL":"http://www.debate.org/debates/The-USA-Shouldn-t-have-Bombed-Hiroshima-and-Nagasaki/1/votes/3/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":191,"nextID":"00000002","PremiseStartPos":[243],"prevID":"00000000","Premise":["I will let my opponent make his points first but the bombing of these cities was unneeded. The USA was to win the war anyway."],"PremiseEndPos":[369],"ArgumentID":"00000001","Conclusion":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":191,"nextID":"00000003","PremiseStartPos":[384],"prevID":"00000001","Premise":["Alright, good points made by tjzimmer although I will get to them later. First I want to mention that you have justified the killing of many, many innocent people because of the wrongdoings of their nations leaders and military forces. Yes I know that they treated our prisoners terrible and abused them, but just because they were unethical doesn't mean we have to be. The USA is more humane then that. First point you made was Pearl Harbor. The attack on Pearl Harbor is something that cannot be compared to the dropping of the atomic bombs and for these reasons. Pearl Harbor only killed about 2,000 military were killed and 57 civilians were killed. The main purpose of the attack on Pearl Harbor was to cripple our navy, which is the point of war. To cripple the otherside's military to get them to surrender. Therefore, that was a somewhat justified move. The dropping of the bomb in Hiroshima killed between 90,000 and 140,000 civilians. In Hiroshima alone. That was not to cripple the military. That was to kill civilians who had very little or no part of the war. Second point you make is island hopping. How is that a point that the bombs were justified? That is what that theatre of the war called for. To push the Japanese troops out of those Pacific islands. Third point you make is fire bombing. We firebombed 66 different cities beforehand causing 330,000 civilian deaths. They were ready to surrender after this. According to William D. Leahy, Chief of Staff to Truman- \"The use of [the atomic bombs] at Hiroshima and Nagasaki was of no material assistance in our war against Japan. The Japanese were already defeated and ready to surrender.\" Other important people against the bombing were Eisenhower and MacArthur, two people who without we would have lost the war. The invasion of mainland USA is the argument always used to justify the dropping of the bombs, but an invasion was too, unneeded. Again they were about to surrender when we dropped them. Fourth point is the Bataan Death March and again I say, why stoop down to their level? Why be as unethical as they were? Treat as you would want to be treated. Fifth point was the Kamikaze and this is was used out of desperation. They thought that they actually had a chance left in the war and thought this was needed. However in the closing days of the war, they realized all hope was lost. My point is that their was no military reason to drop the bombs on Japan because unlike what you say, they were on the verge of surrender. Watch the Fog of War, a documentary about Robert McNamara. He discusses how the bombs were a mistake. The only reason I think Truman decided to drop them was to show the Soviets and Stalin we had the bomb. Right after WW2, the cold war began, intiated by the dropping of the bombs."],"PremiseEndPos":[3169],"ArgumentID":"00000002","Conclusion":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":191,"nextID":"00000004","PremiseStartPos":[3184],"prevID":"00000002","Premise":["Alright I am glad we agree on that the bomb was to boost our military might, but we disagree on if that was the only major reason. And before I hit that point, I want to discuss the horrors we caused. You say to protect 1.5 American military lives, we had to kill Japanese lives. Yes, that is the point of war. However the dropping of the bomb was as unethical as any other type of warfare. How is killing innocent civilians justifiable? And the amount we killed. Thousands and thousands. One account right after the bomb was dropped says- \"He was the only person making his way into the city; he met hundreds and hundreds who were fleeing, and every one of them seemed to be hurt in some way. The eyebrows of some were burned off and skin hung from their faces and hands. Others, because of pain, held their arms up as if carrying something in both hands. Some were vomiting as they walked. Many were naked or in shreds of clothing. On some undressed bodies, the burns had made patterns--of undershirt straps and suspenders and, on the skin of some women (since white repelled the heat from the bomb and dark clothes absorbed it and conducted it to the skin), the shapes of flowers they had had on their kimonos. \" That is not war. Wars cannot be won by slaughtering innocent women and children and if it is God help us. We have become barbarians that belong in the Dark Ages. And not only did we kill these innocent women and children, we made them suffer and suffer. The bombs cannot be called a bomb or an explosive. It is a poison that spread its radioactive toxin across a city. This caused innocent women and children to die of cancer and other terrible things years after. That is not war. And you say that it is justified because we had to protect 1.5 million lives but some things refute that. 1. How do you know that? That is simply a worst case scenario. And the estimate that the invasion of Japan would have cost us a million casualties is ludicrous and not based on anything. The studies done at the time and presented to the president showed that the soldiers killed would have been about 5% of that number. The fact that the Japanese were already trying to surrender when we dropped the bomb--and that we ultimately gave them the terms we first refused--makes the allegation that we would have had to invade Japan particularly ridiculous. 2. If they were to fight to the last man, how come they did not? After we dropped the bomb, they still had plenty of troops. 3. The Japanese had already asked the Russians to intercede for them and had indicated they would surrender if allowed to keep their emperor. We proceeded to drop the bomb while calling for unconditional surrender; immediately afterwards, we made peace on terms allowing them to keep their emperor. Their emporor is something we as Amricans don't understand. He is a deity to them. Not only that, do you know why Hiroshima was selected. It was selected because it had not been firebombed previously in the war. We picked it because we wanted to see the effects of the bomb on a \"virgin city\". With this effects we could show the Russians. This bomb would be used very unlikely on the Germans unless last case scenario because with the Japanese, there was a profound racism. This also helped our decision. Althoush you do disagree with the Nagasaki bombing, here is a little fact. The second bomb was dropped on Nagasaki only days afterward, before the Japanese even had assimilated what had happened at Hiroshima. They certainly would have surrendered without the necessity of a second bomb. There is no justification for this extremely inhumane and unjust massacre of thousands of Japanese civilians. Please look at this as a human and not a very patriotic American."],"PremiseEndPos":[6933],"ArgumentID":"00000003","Conclusion":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":191,"nextID":"00000005","PremiseStartPos":[6948],"prevID":"00000003","Premise":["I am very sorry, but you are not answering my points. You contradict in your last statement when you say \" Looking at it from a human point of view I still disagree. War claims such horrible deaths of civilians. Japan brought this horrific event upon itself by pearl harbor, kamikazes, and Bataan. They should have no mercy shown on them. War is to win and destroy your enemy, not be forgiven and kind. A sign of weakness from America would have enabled Japan to maintain fighting and the bomb caused them to shut it down.\" Apparently you are still looking at this in patriotic American terms because you still feel that innocent civilians should pay for what Japanese rulers and military men did. Now I understand where you are coming from where you have to protect your men's lives and I want to thank you for doing that and being part of our army. However, that is not the case. 1.5 million men is a totally false estimate. Also, when you say in your previous argument \"All sides of the war did horrible things. Thats fact.\". Why must we compare with the Nazis, Soviets and Japanese. What you are saying is \"if the Nazis are doing terrible, cruel acts, why don't we try to kill as many innocent lives as they did\". Again, why stoop down to their level. And again with Pearl Harbor. Pearl Harbor, was maybe sneaky and unfair, it is justified. Military men were killed in Pearl Harbor, not innocent women and children. The point was to destroy our navy. The point of the atomic bomb was to kill as many innocent lives as possible. And you don't get anymore immoral and sneaky then dropping an atomic bomb on a city full with innocent civilians. Szilard, a major part of the Manhatten Project, once said \"\"Let me say only this much to the moral issue involved: Suppose Germany had developed two bombs before we had any bombs. And suppose Germany had dropped one bomb, say, on Rochester and the other on Buffalo, and then having run out of bombs she would have lost the war. Can anyone doubt that we would then have defined the dropping of atomic bombs on cities as a war crime, and that we would have sentenced the Germans who were guilty of this crime to death at Nuremberg and hanged them?\" This is a very good question. If we were to lose that war somehow after dropping the bombs, I believe our reputation from then on we have been of immoral monsters. Many would say that these bombings are a genocide. Genocide is the deliberate and systematic destruction of an ethnic, racial, religious or national group. And genocide is indeed a war crime. I ask you, a military man and what seems to be an intelligient man, read the points made in my arguments and answer them. It has been a pleasure debating with you and I hope to soon in the future again."],"PremiseEndPos":[9700],"ArgumentID":"00000004","Conclusion":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":191,"nextID":"00000006","PremiseStartPos":[9715],"prevID":"00000004","Premise":["First off I would like to say though the bombs were not ethical on the US part, they were definitely justified in dropping. Also, remember that the Japanese were not ethical in their acts during the war. I am pro bombing Hiroshima however I am kind of against the dropping of the second bomb on Nagasaki. Pearl Harbor- The Japanese used terrorist tactics to unknowingly kill innocent American men and women. No official wage of war was made and they hoped to cripple America into a war that could decide the fight of the world. What kind of enemy does such a thing? They were cowards and it was horrible to surprise attack a military installation. This act is against all conventional war tactics and the simple fact that attacks us at home is enough to bomb them. Island Hopping Brutality- We lost millions in the Pacific. Some never even accounted for. The Marines lost 30,000 men at Iwo Jima. Imagine that. The brutality of this island campaign along with battles such as Midway, Guadalcanal, and many more cause America to want revenge. We lost so many good men and resources because the Japanese would never stop. Every Japanese citizen on the Island of Okinawa committed suicide by jumping off a cliff. They would rather die then surrender to America. How could we get them to surrender? Fire Bombing- We fire bombed the Japanese coast line extensively during the war. Many people are unaware of the carnage we made upon Japanese citizens. However we killed easily 100,000 Japanese on their cost and their government refused to surrender as the charred bodies lay on the ground. How else can we get them to surrender? Mainland Japan- They estimated it would cost 1 million American lives to invade mainland Japan. And another 500,000 to hold the island. 1.5 million more dead. That means sending the exhausted vets from Europe over to die in the sand. Imagine US soldiers having to kill women and children armed with whatever they had. The Japanese gave so many signs of not surrendering. They willing to risk their entire nation as long as they took as many Americans with them. Bataan Death March- The Japanese were the most treacherous type of combatants and Prison wardens one could imagine. Later tried as a Japanese war crime the death march lasted 60 miles. They weeded out the Filipino and American captives by shooting them in the head of they stopped. They starved them and stripped them naked. They refused them medical and socialization. They lost 60 percent of the prisoners in the first month, leaving their bodies on the ground as a brutal reminder. The Japanese raped and pilledged the Filipino towns and many accounts of beheading, cut throats, and lighting them on fire were recorded. What kind of enemy does this? Kamikazes- Pilots of Japanese planes started purposely flying them into ships and encampments. The Japanese funding was running low and so were trained pilots. They couldn't train them quick enough and they didn't have enough bombs to destroy the enemy the custom way. So they flew themselves into death which was the greatest honor and service to the proud Japanese culture. Surely this type of mindset would not surrender. Ample Warnings- Prior to the US dropping the first bomb, we and the USSR gave ample warnings through telegrams and parachuting messages of Tokyo. The Japanese never responded to the call for surrender. We dropped the first bomb and they didn't surrender. 5 days or so later still not surrendered, we dropped another crippling them and then they finally surrendered. Their people were decimated and yet the government still wanted to fight? The only reason they surrendered is because they ran out of people to fight with otherwise the Japanese war machine would have kept moving. Japanese Internment in America- A nice liberal point of view that many do not want to support is that by dropping the bombs that essentially ended the war, the internment camps began to close. If you don't know this many Japanese were put into camps to keep them safe from others along with to keep a spy on them. These peoples were stripped of everything and the camps were horrible. By ending the war earlier than an invasion would have been, these people were set free and Congress vowed never to intern individuals based on race and culture. So if not for the bomb we would probably still racially segregated Japanese based on the soreness American people felt after the harsh, long war was won. It is difficult for me to go against Truman's decision to drop the bombs. By doing this he said American lives are more important than Japanese. It is harsh but that is how it should be. They were our enemy and their brutality to our people is well known. For many like myself the bomb saved our grandpa's from going to the Pacific after Europe. For many they may not be here today if we did decide to invade the mainland. Before you criticize your government for something that you don't agree with, think of the repercussions and affects it would have on you and your family if we had not."],"PremiseEndPos":[14751],"ArgumentID":"00000005","Conclusion":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":191,"nextID":"00000007","PremiseStartPos":[14766],"prevID":"00000005","Premise":["I agree the bomb was a way to boast our military might. But, you are far off in saying that American lives lost isn't worth the amount of Japanese we killed. The fact is the Japanese were on the brink of surrender after huge defeats in Okinawa and Iwo Jima. However, they STILL didn't surrender. You conveniently decided to not comment on the multiple warnings we gave Japan to surrender pre dropping the bomb. They STILL didn't after adequate warning. Whereas we gave them notice of our attack, Pearl Harbor was a sneak attack without warning that killed Americans. Who knows how long the war would have lasted? I feel like you way the cost of American and Japanese lives the same. This is wrong in war our people and their safety are the most important. War claims the innocent no matter wait. The fact is the Philippines and Mainland Japan were still in war mode and would have cost major fatalities. The Japanese as long as they had any hope would fight to the death. The examples I give in my last post support the grit and determination of the Japanese. 1.5 Million more GI's killed or bomb the them? Ask anyone from that time period if the bomb was justified and they all will say they were glad it was done because it brought an end to the carnage. We vowed to never use nukes again and we rebuilt Japans economy after the bombs. The Japanese were evil and they did pay for their war crimes. As a future Army Officer the job I have is to make sure my men come back with me after the mission at all costs. 1.5 Million MORE men not coming home is one of the strongest justifications for dropping the bomb."],"PremiseEndPos":[16378],"ArgumentID":"00000006","Conclusion":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":191,"nextID":"00000008","PremiseStartPos":[16393],"prevID":"00000006","Premise":["Looking at it from a human point of view I still disagree. War claims such horrible deaths of civilians. Japan brought this horrific event upon itself by pearl harbor, kamikazes, and Bataan. They should have no mercy shown on them. War is to win and destroy your enemy, not be forgiven and kind. A sign of weakness from America would have enabled Japan to maintain fighting and the bomb caused them to shut it down. Furthermore, the Soviets would have been much more powerful in soldier numbers and war craft if we would have invaded mainland Japan. And those numbers are legit when it comes to estimated fatalities. They knew what more we could do so that is why they surrendered. Also, don't forget about the ruthless Japanese men who did all those things you previously mentioned to our troops and the Filipinos. All sides of the war did horrible things. Thats fact. The bomb opened a can of 'nuclear' worms so to speak, but it was a necessary condition to save lives and end a prolonged two front endeavor. I mean we were thrown into the Japanese conflict unfairly. Do realize how inhumane sneak attack bombing Hawaii was? Thats ridiculous you would gladly look away from the fact that they attacked a peaceful nation to gain a few months advantage. How inhumane is treating POW's like dogs and cutting them up with machetes. Mass suicide on Okinawa lead everyone to believe that if Japan was invaded, the Japanese would have lost so many people. Also, we probably would own Japan as our providence. I think what the voters need to look at is the central question, what would have been the American costs of not dropping the bomb? Lives, money, backing from the home front, soviet discontent? Kill them before they kill us. Every part of WWII had inhumane acts so don't be so quick to blame America of wrongdoing when our interest was only to end the war with little loss possible."],"PremiseEndPos":[18279],"ArgumentID":"00000007","Conclusion":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":139,"ConclusionEndPos":191,"nextID":"00000000","PremiseStartPos":[18294],"prevID":"00000007","Premise":["I meant to say if I were looking at it from a humanist view, I still wouldn't agree one because I am not a humanist and two because of the strong feelings I have on this issue. The fact is, yes, the loss of life for both sides would have been exponentially larger had the weapons not been used. The president weighed the risks on using the atomic weapons, the cities that were hit in japan were mostly military based cities and most of the civilians had been evacuated as the Japanese government was expecting bombings in those cities. If the A-Bomb had not been demonstrated, it may have led to it being used sometime during the Cold War years that followed when the bombs had become a hundred times more powerful and could have led to global destruction. What matters in war is OUR casualties, not the enemies. You don't need justification to kill the enemy who is hell bent on killing you. It's said that the loss of Japanese lives would have been tripled or quadrupled (if not more) has the U.S. gone about an invasion similar to what had been done in France on June2 1944. not to mention the American lives lost, if you are an American you may not have been here today had it not been for the atomic bombs dropped on Hiroshima and Nagasaki.The second time wasn't as necessary as previously mentioned. But justified to drop ANY? You'd have to ask two questions. 1) Was there any other way? A ground war against Japan would have resulted in millions of Allied lives, with no guarantee of short term victory. 2) Where would we be now, if America DIDN'T? You must assume that if the allies didn't stop Japan, then most likely all of Asia would be under their control.(If not more) Let's face it. Learning Japanese would be tough lol... There were a number of factors involved and more than anything, the determination of the Japanese military to continue the war after the Potsdam Declaration in 1945 where the allies called for Japan's surrender. The army estimated that it would have cost between 500,000 to 1,000,000 soldiers lives to mount a successful full scale invasion of Japan. Another estimated half a million to hold the island. As much as you want to disagree with this it is FACT from multiple sources. Even if it meant house to house fighting on the Japanese mainland, the Japanese military stood firm that they would continue the bloody conflict that had already extracted extremely heavy US casualties in the Pacific Theater. As far as the US dropping down to the level of the Nazis, Soviets, and Japanese is not what I was implying. US has never had clean hands when it comes to war. Our history is based on our ability to wage war for or country. Like I said before the US did a very unethical thing from many peoples standards. But it was completely justified. What if the Nazis or Japanese had an A-bomb? Would they hesitate to use it? I think not they would kill as many of us as possible. Truman was one of the most decent men ever to lead a country. His statement in his diary about the warning to be given (\"we will have given them a chance\") shows his decency, absent in those who chose the attack on Pearl Harbor without warning. \"Wars do not increase death because death is 100% in every generation.\" Nevertheless it is a rationalization. No such weapon had ever existed, and its power could not be conceived by those not aware of the things learned during its development. Given the military culture in Japan at the time, where surrender was considered a disgrace, and the lust of conquest which has propelled the Japanese war machine, Truman was correct in his assessment that a warning would not work. War is the culprit, not the United States of America."],"PremiseEndPos":[21981],"ArgumentID":"00000008","Conclusion":"The USA Shouldn't have Bombed Hiroshima and Nagasaki","PremiseStance":["Con"]}}]}