{"MetaData":{"Context":"URL: http://www.debate.org/debates/Which-team-won-civil-war-pro-team-cap-con-team-iron-man/2/\nCrawl date: 2016/09/29 02:54:33\nDebate Argument: Which team won civil war? (pro-team cap, con- team iron man) | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: Well first, I would like to thank my contender very much for posting this debate. As you know, Captain America is the symbol of freedom and the American race. By the way, Stark Industries makes weapons. Remember in Avengers: Age of Ultron, Scarlet Witch, and Quicksilver almost died from a rocket from Stark Industries, also, countless other people have died because of the rocket explosion. On the other hand, Captain America cares about humanity and will even risk his life to save people from all over the world. I don't think Tony would ever do that. Captain America still believes that there are some good in bad people. Take Bucky a.k.a the Winter Soldier for example. After Red Skull twisted his mind and turned his evil, Steve still knew there was good in Bucky. I mean seriously, we all like people who give us second chances right?\n\nEvidence Pro: Then why would you put this debate up? If you've seen the movie, then you know the ending. If you didn't, watch the whole movie. WHAT IS THE POINT OF THIS DEBATE?\n\nEvidence Pro: Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah\n\nEvidence Con: Team Iron man won civil war as Stark got Captain America's shield, Captain America failed to impact the Sokovia accords, Captain America and his team got declared as fugitives and in the end Bucky was shut down. While it is closer to a draw, I stand with team Iron man.\n\nEvidence Con: Pro, we are talking about who in the end won civil war. Furthermore, it has been proven in civil war that Captain America has a bad side to him, such as protecting Winter Soldier despite him killing Stark's parents, and even beating up Stark. Stark had to fight 2 on 1 in the last fight scene, where did his sense of justice and fairness go? Down the drain, it did. Anyways, Team Iron Man \"won\" civil war due to points mentioned in round 1. Pro must give some points for his side or some rebuttals. No matter how good or bad a person Captain America is, the debate is about whether he lost or not.\n\nEvidence Con: I have seen the movie, and I know the ending, the question that which team won was entirely debatable. Since Pro hasn't refuted my arguments as to why team iron man won, I think you should vote for con. I will repeat my points again- It is concluded that Team Iron man won civil war as Stark got Captain America's shield, Captain America failed to impact the Sokovia accords, Captain America and his team got declared as fugitives and in the end Bucky was shut down.\n","DiscussionID":"00000099","Title":"Which team won civil war? (pro-team cap, con- team iron man)","CrawlDate":"2016/09/29 02:54:33","URL":"http://www.debate.org/debates/Which-team-won-civil-war-pro-team-cap-con-team-iron-man/2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":143,"ConclusionEndPos":203,"nextID":"00000002","PremiseStartPos":[255],"prevID":"00000000","Premise":["Well first, I would like to thank my contender very much for posting this debate. As you know, Captain America is the symbol of freedom and the American race. By the way, Stark Industries makes weapons. Remember in Avengers: Age of Ultron, Scarlet Witch, and Quicksilver almost died from a rocket from Stark Industries, also, countless other people have died because of the rocket explosion. On the other hand, Captain America cares about humanity and will even risk his life to save people from all over the world. I don't think Tony would ever do that. Captain America still believes that there are some good in bad people. Take Bucky a.k.a the Winter Soldier for example. After Red Skull twisted his mind and turned his evil, Steve still knew there was good in Bucky. I mean seriously, we all like people who give us second chances right?"],"PremiseEndPos":[1097],"ArgumentID":"00000001","Conclusion":"Which team won civil war? (pro-team cap, con- team iron man)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":143,"ConclusionEndPos":203,"nextID":"00000003","PremiseStartPos":[1112],"prevID":"00000001","Premise":["Then why would you put this debate up? If you've seen the movie, then you know the ending. If you didn't, watch the whole movie. WHAT IS THE POINT OF THIS DEBATE?"],"PremiseEndPos":[1275],"ArgumentID":"00000002","Conclusion":"Which team won civil war? (pro-team cap, con- team iron man)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":143,"ConclusionEndPos":203,"nextID":"00000004","PremiseStartPos":[1290],"prevID":"00000002","Premise":["Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah Blah blah blah blah blah blah blah blah blah blah blah blah blah blah blah"],"PremiseEndPos":[2640],"ArgumentID":"00000003","Conclusion":"Which team won civil war? (pro-team cap, con- team iron man)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":143,"ConclusionEndPos":203,"nextID":"00000005","PremiseStartPos":[2655],"prevID":"00000003","Premise":["Team Iron man won civil war as Stark got Captain America's shield, Captain America failed to impact the Sokovia accords, Captain America and his team got declared as fugitives and in the end Bucky was shut down. While it is closer to a draw, I stand with team Iron man."],"PremiseEndPos":[2925],"ArgumentID":"00000004","Conclusion":"Which team won civil war? (pro-team cap, con- team iron man)","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":143,"ConclusionEndPos":203,"nextID":"00000006","PremiseStartPos":[2940],"prevID":"00000004","Premise":["Pro, we are talking about who in the end won civil war. Furthermore, it has been proven in civil war that Captain America has a bad side to him, such as protecting Winter Soldier despite him killing Stark's parents, and even beating up Stark. Stark had to fight 2 on 1 in the last fight scene, where did his sense of justice and fairness go? Down the drain, it did. Anyways, Team Iron Man \"won\" civil war due to points mentioned in round 1. Pro must give some points for his side or some rebuttals. No matter how good or bad a person Captain America is, the debate is about whether he lost or not."],"PremiseEndPos":[3538],"ArgumentID":"00000005","Conclusion":"Which team won civil war? (pro-team cap, con- team iron man)","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":143,"ConclusionEndPos":203,"nextID":"00000000","PremiseStartPos":[3553],"prevID":"00000005","Premise":["I have seen the movie, and I know the ending, the question that which team won was entirely debatable. Since Pro hasn't refuted my arguments as to why team iron man won, I think you should vote for con. I will repeat my points again- It is concluded that Team Iron man won civil war as Stark got Captain America's shield, Captain America failed to impact the Sokovia accords, Captain America and his team got declared as fugitives and in the end Bucky was shut down."],"PremiseEndPos":[4020],"ArgumentID":"00000006","Conclusion":"Which team won civil war? (pro-team cap, con- team iron man)","PremiseStance":["Con"]}}]}