{"MetaData":{"Context":"URL: http://www.forandagainst.com/Smokers_Should_Be_Taxed_Extra_For_Killing_People_Around_Them_And_Themselves\nCrawl date: 2016/09/28 03:24:45\nTitle: Smokers Should Be Taxed Extra For Killing People Around Them And Themselve... - For & Against\nNumber of arguments: 9\n\nClaim: Smokers Should Be Taxed Extra For Killing People Around Them And Themselve... - For & Against\nFor: I want to put forward some points related to the topic. Yes, we all know smoking is injurious to health and it does cause many health related problems in near future but a total ban in smoking is somewhat have to considered in a bigger frame which includes the smoker, his surroundings and the government. So first of all in Kazakhsatn people are not allowed to smoke in social places BUT people are still smoking in a places.Also for smokerscreated new places FOR their own threr they can smoke.soooo but as we can see now it's not enough for them.And whta can we do?Of course banned smokers,they should be taxed,if they are tring to somke in a soicial places where may people like me who has an alllergy.If this rule will be realized first of there will be decipline.Secondly, we who are not a smokers may breathe at least a fresh air.\nFor: They ruin the air around children, causing higher chance of lung cancer... How is that fair?\nFor: I've never thought about that, but I agree. It makes sense seeing as the smokers are polluting our lungs as well.\nFor: I think there should more tax on smoking, it affects everyone through passive smoking. If a higher tax was in play maybe less people would smoke if it was unaffordable\nFor: They should pay more that's they less they can do for hurting those with breathing complications like me\nAgainst: Can anyone provide documentation of any kind that \"second hand smoke\" has ever cause a case of lung cancer? It is fun to get excited and buy into hysteria, but lets do our best to stay reality based. Smoker pay extra all over the place for their habit by the way. Life insurance, medical insurance, tobacco tax, ...\nAgainst: In the first place the second hand smoke crud has been blown way out of proportion. Read the studies you’re in more danger from mowing the lawn or walking through a parking garage once a week than living full time with a smoker. In the second place we do pay a lot more taxes in fact tobacco sales revenue generates more than 20 billion dollars in tax revenue a year just in the US, and that does not include profit taxes that retail outlets, shipping services, and tobacco companies pay every year. In third place if you really want to get self righteous about air quality issues stop burning fossil fuel generated electricity by fooling around on your computer.\nAgainst: Another completely flawed argument from a non-smoker. First of all, in the UK at least, cigarettes are already taxed at 65%. The tax has been paid. If you don't know the facts why make the argument? Secondly, cigarettes are no longer the biggest cause of preventable deaths in the USA or Europe, That award goes to obesity. Therefore, by your utterly baffling rationale, fat Americans who feed their kids McDonald's and junk food 3 times a week should be taken extra. Actually, why not tax them per pound of sweaty flab they carry on their ludicrously jiggly frames? In fact, lets tax them extra for costing the UK millions of pounds in stomach stapling operations and liposuction. To cut a long story very, very short.\nAgainst: Smokers Pay a Gross tax of 60% on all tobacco produce and are banned from smoking in any public place with moor than one wall. They have been Taxed and out cast enough.\n","DiscussionID":"00000108","Title":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","CrawlDate":"2016/09/28 03:24:45","URL":"http://www.forandagainst.com/Smokers_Should_Be_Taxed_Extra_For_Killing_People_Around_Them_And_Themselves"},"ArgumentList":[{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000002","PremiseStartPos":[3446],"prevID":"00000000","Premise":["Smokers Pay a Gross tax of 60% on all tobacco produce and are banned from smoking in any public place with moor than one wall. They have been Taxed and out cast enough."],"PremiseEndPos":[3615],"ArgumentID":"00000001","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000003","PremiseStartPos":[2717],"prevID":"00000001","Premise":["Another completely flawed argument from a non-smoker. First of all, in the UK at least, cigarettes are already taxed at 65%. The tax has been paid. If you don't know the facts why make the argument? Secondly, cigarettes are no longer the biggest cause of preventable deaths in the USA or Europe, That award goes to obesity. Therefore, by your utterly baffling rationale, fat Americans who feed their kids McDonald's and junk food 3 times a week should be taken extra. Actually, why not tax them per pound of sweaty flab they carry on their ludicrously jiggly frames? In fact, lets tax them extra for costing the UK millions of pounds in stomach stapling operations and liposuction. To cut a long story very, very short."],"PremiseEndPos":[3437],"ArgumentID":"00000002","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000004","PremiseStartPos":[2044],"prevID":"00000002","Premise":["In the first place the second hand smoke crud has been blown way out of proportion. Read the studies you’re in more danger from mowing the lawn or walking through a parking garage once a week than living full time with a smoker. In the second place we do pay a lot more taxes in fact tobacco sales revenue generates more than 20 billion dollars in tax revenue a year just in the US, and that does not include profit taxes that retail outlets, shipping services, and tobacco companies pay every year. In third place if you really want to get self righteous about air quality issues stop burning fossil fuel generated electricity by fooling around on your computer."],"PremiseEndPos":[2708],"ArgumentID":"00000003","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000005","PremiseStartPos":[1719],"prevID":"00000003","Premise":["Can anyone provide documentation of any kind that \"second hand smoke\" has ever cause a case of lung cancer? It is fun to get excited and buy into hysteria, but lets do our best to stay reality based. Smoker pay extra all over the place for their habit by the way. Life insurance, medical insurance, tobacco tax, ..."],"PremiseEndPos":[2035],"ArgumentID":"00000004","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000006","PremiseStartPos":[1605],"prevID":"00000004","Premise":["They should pay more that's they less they can do for hurting those with breathing complications like me"],"PremiseEndPos":[1710],"ArgumentID":"00000005","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000007","PremiseStartPos":[1432],"prevID":"00000005","Premise":["I think there should more tax on smoking, it affects everyone through passive smoking. If a higher tax was in play maybe less people would smoke if it was unaffordable"],"PremiseEndPos":[1600],"ArgumentID":"00000006","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000008","PremiseStartPos":[1313],"prevID":"00000006","Premise":["I've never thought about that, but I agree. It makes sense seeing as the smokers are polluting our lungs as well."],"PremiseEndPos":[1427],"ArgumentID":"00000007","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000009","PremiseStartPos":[1215],"prevID":"00000007","Premise":["They ruin the air around children, causing higher chance of lung cancer... How is that fair?"],"PremiseEndPos":[1308],"ArgumentID":"00000008","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":226,"nextID":"00000000","PremiseStartPos":[372],"prevID":"00000008","Premise":["I want to put forward some points related to the topic. Yes, we all know smoking is injurious to health and it does cause many health related problems in near future but a total ban in smoking is somewhat have to considered in a bigger frame which includes the smoker, his surroundings and the government. So first of all in Kazakhsatn people are not allowed to smoke in social places BUT people are still smoking in a places.Also for smokerscreated new places FOR their own threr they can smoke.soooo but as we can see now it's not enough for them.And whta can we do?Of course banned smokers,they should be taxed,if they are tring to somke in a soicial places where may people like me who has an alllergy.If this rule will be realized first of there will be decipline.Secondly, we who are not a smokers may breathe at least a fresh air."],"PremiseEndPos":[1210],"ArgumentID":"00000009","Conclusion":"Smokers Should Be Taxed Extra For Killing People Around Them And Themselve...","PremiseStance":["Pro"]}}]}