{"MetaData":{"Context":"URL: http://www.debate.org/debates/Resolved-Todays-music-has-a-negative-effect-on-the-youth-of-America/1/\nCrawl date: 2016/09/29 05:06:53\nDebate Argument: Resolved: Todays music has a negative effect on the youth of America | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: Today I will be affirming the resolution that states that todays music has a negative effect on the youth of America. I will be providing three arguments/ examples to support my case. Contention 1: Nicki Minaj's music is influencing young boys to be mainly attracted towards a womans body as opposed to other important features. Cont. 2: Most songs of todays artists talk about drinking, smoking, and having intercourse. I don't think this is a positive influence on teenagers, or anyone for that matter. Cont. 3 It influences kids to have almost backwards priorities and allows them to show absolutely no respect to people because \"their favorite celebrity does it\". A boy in my school slapped my butt in the hallway. his favorite song is Anaconda.\n\nEvidence Pro: My apologies, I merely pulled out multiple examples and they all seemed to be from Rap/ hip hop. I admit that. But lets talk about another example, say, country? Country music promotes drinking and the degrading of women, which is not something we want our youth hearing. Another example is metal music. Which includes lyrics influencing shooting up schools, raping women, and other violent actions.\n\nEvidence Pro: peyton.olson forfeited this round. Con My opponent had full Burden of Proof, but has failed to uphold their burden. To prove that \"Today's music has a negative on the youth of America\" PRO would have had to make arguments regarding the very effect of music on the populace. Minor counter examples suffice to disprove the resolution. The resolution is a universal claim, yet I have provided examples of music with a positive message for it's young listeners.\n\nEvidence Con: Burden of Proof rests with PRO to affirm the resolution. PRO must offer sufficient warrant to believe that today's music has a negative effect on America's youth. First and foremost, a clarification is in order. There are several different genres of music, yet PRO's contentions seem to primarily reference rap and hip hop. If these are the contentions to be offered, PRO cannot affirm the resolution, as rap and hip hop are only 2 of dozens of genres. To say \"today's music\" is to say \"all music produced in this era\", likely referring to the 2000's. So, PRO must offer reason to believe that music, taken as a collection of all genres, is negative for America's youth. Simply mentioning rap and hip hop is not enough, as these are not all music.\n\nEvidence Con: PRO has made several universal claims, with no support offered. A single counter-example is enough to disprove her claims. \" Country music promotes drinking and the degrading of women\". \" Wine drinkers have a 34 percent lower mortality rate than beer or spirits drinkers.\" [1] Further, the country artist Blake Shelton's songs \"Doing what she likes\" and \"God Gave me you\" disagree with PRO's claim of degradation of women. [2] [3] Regarding metal: \"[At the Left Hand of God] explores ...the ‘Left Hand Path,’ which rejects religious conformity while embracing...magic, sexual liberation and the shattering of societal taboos.\" [4] [1] [2] [3] [4]\n\nEvidence Con: My opponent had full Burden of Proof, but has failed to uphold their burden. To prove that \"Today's music has a negative on the youth of America\" PRO would have had to make arguments regarding the very effect of music on the populace. Minor counter examples suffice to disprove the resolution. The resolution is a universal claim, yet I have provided examples of music with a positive message for it's young listeners.\n","DiscussionID":"00000023","Title":"Resolved: Todays music has a negative effect on the youth of America","CrawlDate":"2016/09/29 05:06:53","URL":"http://www.debate.org/debates/Resolved-Todays-music-has-a-negative-effect-on-the-youth-of-America/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":223,"nextID":"00000002","PremiseStartPos":[275],"prevID":"00000000","Premise":["Today I will be affirming the resolution that states that todays music has a negative effect on the youth of America. I will be providing three arguments/ examples to support my case. Contention 1: Nicki Minaj's music is influencing young boys to be mainly attracted towards a womans body as opposed to other important features. Cont. 2: Most songs of todays artists talk about drinking, smoking, and having intercourse. I don't think this is a positive influence on teenagers, or anyone for that matter. Cont. 3 It influences kids to have almost backwards priorities and allows them to show absolutely no respect to people because \"their favorite celebrity does it\". A boy in my school slapped my butt in the hallway. his favorite song is Anaconda."],"PremiseEndPos":[1025],"ArgumentID":"00000001","Conclusion":"Resolved: Todays music has a negative effect on the youth of America","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":223,"nextID":"00000003","PremiseStartPos":[1040],"prevID":"00000001","Premise":["My apologies, I merely pulled out multiple examples and they all seemed to be from Rap/ hip hop. I admit that. But lets talk about another example, say, country? Country music promotes drinking and the degrading of women, which is not something we want our youth hearing. Another example is metal music. Which includes lyrics influencing shooting up schools, raping women, and other violent actions."],"PremiseEndPos":[1440],"ArgumentID":"00000002","Conclusion":"Resolved: Todays music has a negative effect on the youth of America","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":223,"nextID":"00000004","PremiseStartPos":[1455],"prevID":"00000002","Premise":["peyton.olson forfeited this round. Con My opponent had full Burden of Proof, but has failed to uphold their burden. To prove that \"Today's music has a negative on the youth of America\" PRO would have had to make arguments regarding the very effect of music on the populace. Minor counter examples suffice to disprove the resolution. The resolution is a universal claim, yet I have provided examples of music with a positive message for it's young listeners."],"PremiseEndPos":[1913],"ArgumentID":"00000003","Conclusion":"Resolved: Todays music has a negative effect on the youth of America","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":223,"nextID":"00000005","PremiseStartPos":[1928],"prevID":"00000003","Premise":["Burden of Proof rests with PRO to affirm the resolution. PRO must offer sufficient warrant to believe that today's music has a negative effect on America's youth. First and foremost, a clarification is in order. There are several different genres of music, yet PRO's contentions seem to primarily reference rap and hip hop. If these are the contentions to be offered, PRO cannot affirm the resolution, as rap and hip hop are only 2 of dozens of genres. To say \"today's music\" is to say \"all music produced in this era\", likely referring to the 2000's. So, PRO must offer reason to believe that music, taken as a collection of all genres, is negative for America's youth. Simply mentioning rap and hip hop is not enough, as these are not all music."],"PremiseEndPos":[2676],"ArgumentID":"00000004","Conclusion":"Resolved: Todays music has a negative effect on the youth of America","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":223,"nextID":"00000006","PremiseStartPos":[2691],"prevID":"00000004","Premise":["PRO has made several universal claims, with no support offered. A single counter-example is enough to disprove her claims. \" Country music promotes drinking and the degrading of women\". \" Wine drinkers have a 34 percent lower mortality rate than beer or spirits drinkers.\" [1] Further, the country artist Blake Shelton's songs \"Doing what she likes\" and \"God Gave me you\" disagree with PRO's claim of degradation of women. [2] [3] Regarding metal: \"[At the Left Hand of God] explores ...the ‘Left Hand Path,’ which rejects religious conformity while embracing...magic, sexual liberation and the shattering of societal taboos.\" [4] [1] [2] [3] [4]"],"PremiseEndPos":[3338],"ArgumentID":"00000005","Conclusion":"Resolved: Todays music has a negative effect on the youth of America","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":223,"nextID":"00000000","PremiseStartPos":[3353],"prevID":"00000005","Premise":["My opponent had full Burden of Proof, but has failed to uphold their burden. To prove that \"Today's music has a negative on the youth of America\" PRO would have had to make arguments regarding the very effect of music on the populace. Minor counter examples suffice to disprove the resolution. The resolution is a universal claim, yet I have provided examples of music with a positive message for it's young listeners."],"PremiseEndPos":[3772],"ArgumentID":"00000006","Conclusion":"Resolved: Todays music has a negative effect on the youth of America","PremiseStance":["Con"]}}]}