{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-Genesis-account-is-scientifically-viable./1/\nCrawl date: 2016/09/29 06:53:25\nDebate Argument: The Genesis account is scientifically viable. | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: I will be arguing that the account of creation in the book of Genesis, specifically Genesis 1:1-2:3, is scientifically viable. This is my first debate so don't expect me to be amazing haha.\n\nEvidence Pro: Alright, thanks for accepting Con. In this round, I will display my interpretation of Genesis 1:1-2:3. Con is then welcome to critique it. I may go in to the Hebrew that Genesis was first written in some instances. Day 1 \"1 In the beginning, God created the heavens and the earth.\" The Hebrew written here is \"Bereisheet bara Elohim et hashamayim ve'et ha'aretz\" The Hebrew word for created is \"bara.\" What interesting about this verb is that it is always written with its subject as God, (Elohim). This implies that this type of creation is unique to God. The phrase \"hashamayim ve'et ha'aretz\" was a Hebrew figure of speech meaning everything in the universe. It is similar to a compound word in English. The words \"dragon\" and \"fly\" take on a totally different meaning when put together. I believe that this verse is consistent with Big Bang Cosmology. In fact, I believe that this verse directly refers to the Big Bang. The universe had a beginning; therefore something must have caused it to begin. That something may have been God. This verse also states that the earth had already been created. This means that this verse covers time from the Big Bang all the way until the formation of the solar system and earth. (Its Wikipedia, I know, it is well cited though.) \"2 The earth was without form and void, and darkness was over the face of the deep. And the Spirit of God was hovering over the face of the waters.\" Verse two takes a turn. The frame of reference dramatically shifts from the entire universe, to the surface of the earth, \"the Spirit of God was hovering over the face of the waters.\" This frame of reference remains the same through t the rest of the chapter. This verse also establishes the conditions of the earth. \"[D]arkness is over the face of the deep.\" The earth is wrapped in thick dense clouds that are making the water covered surface completely dark. I do believe there is a general agreement among scientists that the earth was once covered in water. This is very likely since water is the third most abundant molecule in the universe. \"3 And God said, \"Let there be light,\" and there was light. 4 And God saw that the light was good. And God separated the light from the darkness. 5 God called the light Day, and the darkness he called Night. And there was evening and there was morning, the first day.\" I believe that this verse refers the ancient collision of a mars sized object with the young earth. This gigantic collision would have blasted away some of the life-preventing could of darkness and increased the size of the earth to hold a decent atmosphere. Light became visible on the surface of the earth. Night and day could now be distinguished from one another. Day 2 6 And God said, \"Let there be an expanse in the midst of the waters, and let it separate the waters from the waters.\" 7 And God made the expanse and separated the waters that were under the expanse from the waters that were above the expanse. And it was so. 8 And God called the expanse Heaven. And there was evening and there was morning, the second day.\" Water vapor separates from the atmosphere and falls to earth. The ocean and atmosphere are now separate. Many Bible translations, such as the NIV, translate the word \"heaven\" (Hebrew word \"shamayim\") as sky. Keep in mind that the Hebrew language does not have the large vocabulary that English does. Most Hebrew words have multiple meanings. Day 3 \"9 And God said, \"Let the waters under the heavens be gathered together into one place, and let the dry land appear.\" And it was so. 10 God called the dry land Earth, and the waters that were gathered together he called Seas. And God saw that it was good.11 And God said, \"Let the earth sprout vegetation, plants yielding seed, and fruit trees bearing fruit in which is their seed, each according to its kind, on the earth.\" And it was so. 12 The earth brought forth vegetation, plants yielding seed according to their own kinds, and trees bearing fruit in which is their seed, each according to its kind. And God saw that it was good. 13 And there was evening and there was morning, the third day.\" Many skeptics point out that fossils animal life predate fossils of plant life. However, the Hebrew word used here for vegetation, \"deshe,\" can refer to any green photosynthetic life on land. This would include ancient cyanobacteria and other photosynthetic bacteria which appear very early in the fossil record. ( The Hebrew words for seed, trees, and fruit (zera, es, and pri) can also mean \"semen\" or \"the embryos of any plant species, \" \"any large plant containing woody fiber,\" and \"the food and or embryos produced by any living thing.\" Keep in mind that genesis does not say that all plant life was created at this moment. For the sake of the character limit, I will not be showing the direct verses anymore. You can view them here Day 4 Verses 14-19 During the fourth day the sun and moon appear in the sky as the photosynthetic life was consuming water vapor and carbon dioxide while volcanic activity on earth began to slow down and stabilize. Genesis says God \"made\" the stars, sun and moon and the fourth day, (the Hebrew used here is the word \"asa\") however, this verb does appear in an appropriate form for denoting a past action. Verses 17 and 18 say that God set them, past tense, in the sky. The first few verses of Genesis also imply that the sun moon and stars were made prior to the fourth day. Day 5 Verses 20-23 As I am writing this I notice an apparent problem. The birds. The Hebrew word used here for bird is \"op.\" I believe this can also refer to insects as well. Perhaps God created some but not many birds and not many of those first birds were fossilized or have been found as fossils. But the sea creatures created on this day do not cause a problem that I am aware of. The first signs of life found in the fossil record are creatures of the ocean if I recall correctly. Day 6 Verses 24-31 God creates land animals and humans on this day. You must keep in mind that the Genesis account of creation is not to be taken like a scientific text book. It is a religious book about God, not science. However, I do find Genesis to line up extremely well with what we have discovered in our world. Also, God did not necessarily create only the life listed in this chapter. He created life at other times not talked about in Genesis, like the dinosaurs, hominids, various plants, and other life forms. I believe this model fits within the fossil record quite nicely. This model explains why species and even whole phyla seem to characteristically appear abruptly. As you have probably seen, I do not hold that the days of Genesis are literal 24 hour days. Rather, they are long eras of time. The Hebrew word for day that is used here, yom, can mean a full 24 hour day, the 12 hour period of sun light each day, or just a vague period of time. I am getting most of my information from a ministry called Reasons To Believe, and from a book called Navigating Genesis by a man named Hugh Ross, the founder of Reasons To Believe. Here\"s a link to an article. RTB\"s articles can explain what I have said and more. I\"m sure they do it quite a bit better than I do as well. Sorry this was so long haha\n\nEvidence Pro: Yes KalleS, don't worry. I'm not one to get emotional or angry when somebody challenges what I believe. I want this to be a logical talk as much as you do. Also, would you please tell me which translation of the bible you are using. Thanks. 1) This was addressed in my previous post. \"Heavens and earth\" is a Hebrew statement for everything in the universe. The light that you were talking about was also addressed. But to make things clear, that first light was coming from the sun. The sun light was reaching earths surface, but the sun could not be physically seen because of the still dense atmosphere. Much like how there is enough light to be able to see on a cloudy day, but you cannot see the sun. 1:6) Many translations of the Bible use firmament, vault, or even expanse, instead of dome. I believe that this refers to the troposphere of our atmosphere. Separating \"waters from waters\" could be referring to the waters of the ocean and the waters of the atmosphere, clouds. It is not separating earth from space, but rather the clouds and oceans. Many times even I have to remind myself that the book of Genesis was written for the Ancient Jews, and that it was written in a way that they could understand what happened. I think that this is why some parts of Genesis may appear to be confusing to us now. 1:11) This was also addressed in my previous post. If you are wondering where I got the translations for the Hebrew words of this section, it from a book called Navigating Genesis by Hugh Ross. The information that I got about this verse was on page 49 and 50 of the book. Here are the citations used for Ross's translations Harris, Archer, and Waltke, Theological Wordbook, vol. 1, 252-253 R. Laird Harris, Gleason L. Archer Jr., and Waltke, Theological Wordbook of The Old Testament, vol. 2 (Chicago: Moody Press, 1980), 688-89 1:16) Also explained in my previous post. The sun, moon, and stars became visible as the atmosphere became more and more clear, but they were formed prior to the time this verse is referring to. 1:16) I explained the dome above in this comment. 1:20-21) \"21 So God created the great creatures of the sea and every living thing with which the water teems and that moves about in it, according to their kinds, and every winged bird according to its kind. And God saw that it was good.\" This verse could be interpreted not that God created every kind of bird at this moment, but that every kind of bird that he did create, he created according to its kind. I suppose I forgot to mention evolution. Sorry about that. I suppose that my interpretation can work with or without evolution. God may have created some life forms and allowed them to evolve and go extinct, or he might have created some and not allowed them to evolve. As I said before, just because God said he created animals in this certain order in Genesis doesn't mean he created all of life in this order. There are life forms that he created that were not mentioned in Genesis. However, I will acknowledge the fact that you pointed out. The birds of Genesis do not seem to fit within the evolutionary paradigm or the fossil record. But, perhaps God created some of these birds, they might have even been insects because of the ambiguity of the Hebrew language, and allowed them to live for a short time. Afterwards, God may have created other birds during the time after the dinosaurs. Seems unlikely I know, but this is the explanation I put forward. 1:24-25) \"24 Then God said, \"Let the earth bring forth living creatures after their kind: cattle and creeping things and beasts of the earth after their kind\"; and it was so. 25 God made the beasts of the earth after their kind, and the cattle after their kind, and everything that creeps on the ground after its kind; and God saw that it was good\" \"all the land creatures are made and the words of every kind are repeated almost too much you cannot refute that this means every single kind of animal or else you are going against the word of god.\" I was quite surprised to read this from you. This verses above do not state that all animals were formed, but I do think the bulk of animal life was probably made during this verse. You must keep in mind that in my view, each of these verses takes place probably over millions of years, not all at once. God did not make creatures all at once. He might have made them in close proximity, as far as time goes, to one another as seen in the Cambrian explosion. 1:27-30) My view is that God did create humans separate form hominids. (A possible reason God created hominids was to train wild animals to recognize human presence and activities on the earth.) I realize now that this view goes against what I am trying to argue since the vast majority of scientists accept human evolution as true. Oh well :P While writing this, I find that my views on Genesis are extremely complicated and quite vague sometimes. I sincerely apologize for any confusion I have caused you as I am not the best at explaining things. If you still have any questions about what happened on specific days in Genesis feel free to ask.\n\nEvidence Pro: 1) Just to clarify, I will restate what I believe happen. God creates the universe through the Big bang, time goes by, the solar system is in the process of forming as is the earth. The sun is formed and is producing light, but the earth is covered in a thick blanket of clouds which block all sunlight from reaching the surface. God says let there be light. A mars sized object smashes into the young earth blasting away some of the atmosphere and most likely vaporizing any water on the surface. This impact caused the atmosphere to thin just enough so that light would hit on the surface of the earth (the frame of reference for Genesis is the surface of the earth), but the sun was still not visible (like a cloudy day). Since sunlight was now reaching the surface, day and night could now be distinguished from one another. 1:6) i believe your logic is sound and I don't feel like I need to respond to your comments, so I won't :) I do acknowledge what you stated in the last two sentences of that paragraph though. 1:11) I'm sorry, I might have confused you on this one. The Hebrew words for seed, trees, and fruit (zera, es, and pri) can RESPECTIVELY mean \"semen\" or \"the embryos of any plant species, \" \"any large plant containing woody fiber,\" and \"the food and or embryos produced by any living thing.\" \"There is not a single plant that could have survived in the oxygen rich climate that the first bacteria...\" The early atmosphere was not full of oxygen at all. \"Oxygen has not always been as abundant as it is today. Most scientists believe that for half of Earth\"s 4.6-billion-year history, the atmosphere contained almost no oxygen.\" I think this clears up that fact that wood-fibered plants were probably able to survive on the early earth. \"In evolution any complex organism needs other organisms to assist it in its growth\" Who said God only created on type of organism? God probably did create ecosystems and all types of creatures to help assist with the survival of each other. I think saying \"God could have\" and \"God would have\" is not very productive in this debate. We can only look at what he did do, or didn't do in your views. And that is what we are arguing over, if Genesis lines up with what we see in science. And I do understand that the Cambrian explosion did not include modern life forms. That's undeniable. What I was suggesting is that the first life forms of the Cambrian time-period actually did appear out of thin air (haha i know this might sound absurd to you), God might have created them this way and that is why species tend to characteristically appear abruptly in the fossil record. Even Richard Dawkins acknowledges the fact that species appear very abruptly as far as the Cambrian Explosion goes. And for your comments about the rattlesnakes in Texas. Yes they have evolved. They have adapted because of natural selection (maybe not natural selection, I guess it's more human selection haha) Evolution is a topic for another debate though. I don't really have much else to say. If you would like to better understand my position, then explore this website I would like to thank you for being a wonderfully pleasant opponent :)\n\nEvidence Con: I will accept this. good luck.\n\nEvidence Con: Alright, long post. My very first comment will be this; you need not debate this but it is true. the more vague a statement is the more likely it is to be true as long as someone is trying to believe it. Oftentimes people take advantage of this by saying something vague and then playing prophetic as it were. Fortune tellers, psychics, and horoscopes are accurate examples. Alright I will now commence my portion of the debate. Take not that I am mostly disregarding your comments only as to keep the structure of this debate regular. As a first legitimate statement I will say this. The word you used \"account\" refers to someone's verbatim description of an event. an example is if someone was asked to give an account of a robbery they would not say \"The sheep came in waving a stick and said bah bah black sheep and then stole the lettuce\" and then when questioned further proclaims the sheep to be a man in a mask the stick to be a gun and the lettuce to be a woman\"s purse. The latter of course being the actual account of what happened. All of this being said by definition we have to take every word literally. but I will give you some leeway since I'm sure you meant account as hyper metaphorical story. However I will not accept reasoning purely from metaphors it is not a sound way to reason. In fact if I reasoned like you I could say the word god was just a word for unknown force and the following was just an estimation of what happened. 1) Now I will begin debating con. The word beginning irrefutably means the very moment something starts. and in the moment god is said to have created the earth and the heavens which I assume to mean space or perhaps heaven. Either way they were created instantaneously as the universe came into existence. It describes the earth as being still water and space as being lightless and dark. At the time of the big bang the whole universe would have been white hot and glowing with energy so there is no way that it was dark in the beginning. Then he created light from no source. as for the day thing i can see that being \"light is the time that god is awake\" type of thing so i will just go ahead and give it to you that it was not the same as our measurement 1:6) \"Let there be a dome in the midst of the waters, and let it separate the waters from the waters\" this sentence has a couple of flaws and keep in mind that this is supposedly coming from the mouth of god himself. A dome is a half sphere. The earth is a full sphere but the people of the time did not know that so if one were sitting in a room making up stories that would be a likely product of those stories; dated information. It would be like someone in that age telling a story like \"I flew up into the sky and observer the perfect cube that was the earth\" the next thing was that he separated the waters from the waters I feel that is yet another portrayal of the (I mean this in the most literal way) ignorance of the time which if spoken by the mouth of god would not have been true. 1:11) now we get to the real part. god says \"Let the earth put forth vegetation: plants yielding seed, and fruit trees of every kind on earth that bear fruit with the seed in it.\" This part partially goes back to the sky being created in the last verse and i have three distinct points i want to bring up. 1) the very first plant was a type of algae that covered the earth in what was, to plants, a poison that substance was oxygen so even saying that the vegetation bearing seeds was this algae there is no way a tree of all things could have survived 2) ignoring fact one; trees evolved just like humans and it states quite clearly that he created ALL of the fruit bearing trees at this moment before animals existed. 3) fruits purpose is to lure animals in with its taste and sugar in order to spread the often inedible or indigestible seeds so if we are going with days were not really days then all of those trees would have had no way to reproduce in that time he was asleep. 1:16)\"God made the two great lights\"the greater light to rule the day and the lesser light to rule the night\"and the stars.\" This line suggests two things 1) the moon and the sun were just now created. and if he had created the moon just then all life on the planet would have been completely destroyed and I know you know why.2) the writer did not have a clear understanding that the light from the moon is the same light that comes from the sun. Another example of ignorance to science. 1:16) I just don't know what to make of the in the dome of the sky. if the dome is what separates space from the earth than both the sun and the moon are way too close to us and if it is what separates the earth from space than it is WAY too close to us and finally if the dome is space than it separates water from water which is again another ignorance I would assume based on the fact that the sky is blue during the day. and in the next line he gives light a second time. 1:20)\"And God said, \"Let the waters bring forth swarms of living creatures, and let birds fly above the earth across the dome of the sky.\"\" If the dome represents the atmosphere than be go back to the fact that it is way too close if the dome represents space we must then assume birds can fly in space (a task that is altogether impossible). this line by itself does not imply that they were all made at this moment but in conjunction with the next line \"So God created the great sea monsters and every living creature that moves, of every kind, with which the waters swarm, and every winged bird of every kind.\" following it by god saying it was good does imply that he created them all at the same time which directly contradicts the fossil record and the theory of evolution. As further proof there are a lot of signs that point to the idea that birds evolved from dinosaurs so if they were created before the dinosaurs that would not make much sense. 1:24-25) all the land creatures are made and the words of every kind are repeated almost too much you cannot refute that this means every single kind of animal or else you are going against the word of god. 1:27-2:0) god claims man is separate from beast and was created separately again contradiction evolution and fossil records. This ends my debate and please do not come back at me with any emotion or bias and please do not just repeat what you said in your first post. the second round is for rebuttals so i will go directly against your opening statement and you will go against mine. I just want to have a logical debate about this.\n\nEvidence Con: Sorry I meant to write tell you the bible I was using but I was cutting it close to missing my class and forgot. I'm using a website called bible hub just looking through the various versions to get a better understanding of what was meant to be said but my quotes came from the new revised standard Edition. I feel a lot of the issue in debating this really does go back to what I said about vagueness because when you attribute more specific words to vague words you can pull out truths that weren't even intentional. It is similar to writers who use alliterations to allow you replace these variable words with words or images that or more desirable for you. I\"m not saying this necessarily makes it wrong I\"m just saying it makes it very difficult to prove either way if you reason off of it 1)The light/ sun problem I suppose makes sense but it says at first there was no light at all but the earth existed and then light came. Where was the light before that? The sun necessarily existed before the earth because if the sun did not exist nothing would have kept our small water rock in orbit and also the creation of a star is not a safe and calm thing if we were even close to the sun when it happened the planet would have been pulled in. 1:6) I understand that there are two meanings for the word dome or firmament but the issue I have with it is this; a lot of religions and lore believed that the sun was a lot closer than it is because it is big bright and you can feel the heat coming off of it. So it is more easily believed that people of the time held the belief that it was close and thus used the same words for it then knew there was a difference but just did not specify. that being said that does not make for a strong argument for either of us. However if we talk about atmosphere the clouds are within the atmosphere. My final note on this is this; though it may have been \"dumbed down\" for ancient people we are debating the accounts scientific legitimacy. If you tell a group of 1st graders a mathematical theory that does not hold up when they grow up to be adults, what you have told them is not accurate. 1:11) you touched on it to be sure you said that the words trees seeds fruits and semen were all synonymous which is an odd range of words to be lumped together but i will believe you. If this is true however the writer would have essentially said semen, semen and semen or if they did in fact all correspond then he is just saying seeds, tree seeds and fruit which is also tree seeds. There is not a single plant that could have survived in the oxygen rich climate that the first bacteria. in fact they could hardly survive it. it is like an animal being locked inside an airtight room it would die because of a lack of oxygen. In evolution any complex organism needs other organisms to assist it in its growth this is a fundamental part of evolution if you kill off all the pollinators any flowers that used mechanical pollination other than the wind would die. and just taking into assumption that the writer did not say semen three times in a row and also you saying any plant with a woody fiber (which is not something simple organisms have) there had to be at least one complex organism in the mix that he would have to have put down on the earth knowing it would die without the proper pollinators and as you say the days are not 24 hours they would not have survived You are saying that it does not say that they were all created at that moment but I am not seeing how that is not being said. Furthermore since evolution is a very commonly held scientific truth (and i only say that as a buffer simply not to state anything indefinitely); god would not have to create any life after he created the single celled organisms further more if god was so inclined [he] could have just make the air rich with oxygen instead of having small creatures do the work for [him]. This next part does to address the rest of your comments. There is absolutely no proof that anything \"sprung\" into assistance everything has been fine tuning itself from the time life first formed. Now about the Cambrian explosion...( I will preface this with the fact that I am a geo-physics major) It was by no means a period in time where we see human fossil laying with bird fossils laying with cat fossils laying with stegosaurus fossils. it is however a time of rapid evolution where a lot of new species evolved. they did not just appear out of thin air it was most likely the introduction of predatory organisms that killed other organisms because death is evolution's greatest advocate. As an example i will say this; In Texas (I'm not sure what country or state you are from but I'm sure you have heard of Texas) they hunt rattle snakes in a weird barbaric type of sport if you want to call it that. But they always hunt based on sound, Because they are easy to find that way. The sound is normally a deterrent but we have begun to pray on it and just over this last 10 years some rattle snakes in Texas have evolved to not have rattles or to rattle less because the ones that rattle at everything are all dead. that is a very short time to see the effects of increased predator activity on the behavior and attributes of a species. As a result more and more people are being bitten because they are not being warned. Which, if we were really even part of evolution any more (which we are but not in a really directed way) would make use evolve to smell them or something which just won\"t happen. I got a little off topic but it is important that you do not use the Cambrian explosion as proof. sorry again running to class no time to proof read I apologize if this comes out a bit more sloppy than I had intended\n\nEvidence Con: 1:11) yes, I was confused about that thank you for clearifying. and yes the atmosphere was non exsistant untill the first photosynthetic bacteria came along. A byproduct of this plant was oxygen and as this bacteria spread it created the atmosphere we had today but oxygen is poisonous to plants just as carbon___ is poison to us there was no \"room for complex organisms to grow and breath because the bigger the plant the more oxygen it prooduces so is anything more complex than a photosynthetic bacteria was plopped in the middle of an oxygen rich zone it would probably just sufficate. As for your comment of an eco system it is clearly stated that anyting that was not plant life came after he rested which according to you was a long period of time. Well as final words I believe you may be inferring a bit too much about word meanings and symbolism. The account is however more accurate when put into your perspective and I do understand where you are coming from. It may just coem down to a belif in evolution to determine what really happened so i of course still maintain it is not logical. However, this has been a great debate and I wish all of the people i debated with could be as civil and well informed as you.\n","DiscussionID":"00000068","Title":"The Genesis account is scientifically viable.","CrawlDate":"2016/09/29 06:53:25","URL":"http://www.debate.org/debates/The-Genesis-account-is-scientifically-viable./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":178,"nextID":"00000002","PremiseStartPos":[230],"prevID":"00000000","Premise":["I will be arguing that the account of creation in the book of Genesis, specifically Genesis 1:1-2:3, is scientifically viable. This is my first debate so don't expect me to be amazing haha."],"PremiseEndPos":[420],"ArgumentID":"00000001","Conclusion":"The Genesis account is scientifically viable.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":178,"nextID":"00000003","PremiseStartPos":[435],"prevID":"00000001","Premise":["Alright, thanks for accepting Con. In this round, I will display my interpretation of Genesis 1:1-2:3. Con is then welcome to critique it. I may go in to the Hebrew that Genesis was first written in some instances. Day 1 \"1 In the beginning, God created the heavens and the earth.\" The Hebrew written here is \"Bereisheet bara Elohim et hashamayim ve'et ha'aretz\" The Hebrew word for created is \"bara.\" What interesting about this verb is that it is always written with its subject as God, (Elohim). This implies that this type of creation is unique to God. The phrase \"hashamayim ve'et ha'aretz\" was a Hebrew figure of speech meaning everything in the universe. It is similar to a compound word in English. The words \"dragon\" and \"fly\" take on a totally different meaning when put together. I believe that this verse is consistent with Big Bang Cosmology. In fact, I believe that this verse directly refers to the Big Bang. The universe had a beginning; therefore something must have caused it to begin. That something may have been God. This verse also states that the earth had already been created. This means that this verse covers time from the Big Bang all the way until the formation of the solar system and earth. (Its Wikipedia, I know, it is well cited though.) \"2 The earth was without form and void, and darkness was over the face of the deep. And the Spirit of God was hovering over the face of the waters.\" Verse two takes a turn. The frame of reference dramatically shifts from the entire universe, to the surface of the earth, \"the Spirit of God was hovering over the face of the waters.\" This frame of reference remains the same through t the rest of the chapter. This verse also establishes the conditions of the earth. \"[D]arkness is over the face of the deep.\" The earth is wrapped in thick dense clouds that are making the water covered surface completely dark. I do believe there is a general agreement among scientists that the earth was once covered in water. This is very likely since water is the third most abundant molecule in the universe. \"3 And God said, \"Let there be light,\" and there was light. 4 And God saw that the light was good. And God separated the light from the darkness. 5 God called the light Day, and the darkness he called Night. And there was evening and there was morning, the first day.\" I believe that this verse refers the ancient collision of a mars sized object with the young earth. This gigantic collision would have blasted away some of the life-preventing could of darkness and increased the size of the earth to hold a decent atmosphere. Light became visible on the surface of the earth. Night and day could now be distinguished from one another. Day 2 6 And God said, \"Let there be an expanse in the midst of the waters, and let it separate the waters from the waters.\" 7 And God made the expanse and separated the waters that were under the expanse from the waters that were above the expanse. And it was so. 8 And God called the expanse Heaven. And there was evening and there was morning, the second day.\" Water vapor separates from the atmosphere and falls to earth. The ocean and atmosphere are now separate. Many Bible translations, such as the NIV, translate the word \"heaven\" (Hebrew word \"shamayim\") as sky. Keep in mind that the Hebrew language does not have the large vocabulary that English does. Most Hebrew words have multiple meanings. Day 3 \"9 And God said, \"Let the waters under the heavens be gathered together into one place, and let the dry land appear.\" And it was so. 10 God called the dry land Earth, and the waters that were gathered together he called Seas. And God saw that it was good.11 And God said, \"Let the earth sprout vegetation, plants yielding seed, and fruit trees bearing fruit in which is their seed, each according to its kind, on the earth.\" And it was so. 12 The earth brought forth vegetation, plants yielding seed according to their own kinds, and trees bearing fruit in which is their seed, each according to its kind. And God saw that it was good. 13 And there was evening and there was morning, the third day.\" Many skeptics point out that fossils animal life predate fossils of plant life. However, the Hebrew word used here for vegetation, \"deshe,\" can refer to any green photosynthetic life on land. This would include ancient cyanobacteria and other photosynthetic bacteria which appear very early in the fossil record. ( The Hebrew words for seed, trees, and fruit (zera, es, and pri) can also mean \"semen\" or \"the embryos of any plant species, \" \"any large plant containing woody fiber,\" and \"the food and or embryos produced by any living thing.\" Keep in mind that genesis does not say that all plant life was created at this moment. For the sake of the character limit, I will not be showing the direct verses anymore. You can view them here Day 4 Verses 14-19 During the fourth day the sun and moon appear in the sky as the photosynthetic life was consuming water vapor and carbon dioxide while volcanic activity on earth began to slow down and stabilize. Genesis says God \"made\" the stars, sun and moon and the fourth day, (the Hebrew used here is the word \"asa\") however, this verb does appear in an appropriate form for denoting a past action. Verses 17 and 18 say that God set them, past tense, in the sky. The first few verses of Genesis also imply that the sun moon and stars were made prior to the fourth day. Day 5 Verses 20-23 As I am writing this I notice an apparent problem. The birds. The Hebrew word used here for bird is \"op.\" I believe this can also refer to insects as well. Perhaps God created some but not many birds and not many of those first birds were fossilized or have been found as fossils. But the sea creatures created on this day do not cause a problem that I am aware of. The first signs of life found in the fossil record are creatures of the ocean if I recall correctly. Day 6 Verses 24-31 God creates land animals and humans on this day. You must keep in mind that the Genesis account of creation is not to be taken like a scientific text book. It is a religious book about God, not science. However, I do find Genesis to line up extremely well with what we have discovered in our world. Also, God did not necessarily create only the life listed in this chapter. He created life at other times not talked about in Genesis, like the dinosaurs, hominids, various plants, and other life forms. I believe this model fits within the fossil record quite nicely. This model explains why species and even whole phyla seem to characteristically appear abruptly. As you have probably seen, I do not hold that the days of Genesis are literal 24 hour days. Rather, they are long eras of time. The Hebrew word for day that is used here, yom, can mean a full 24 hour day, the 12 hour period of sun light each day, or just a vague period of time. I am getting most of my information from a ministry called Reasons To Believe, and from a book called Navigating Genesis by a man named Hugh Ross, the founder of Reasons To Believe. Here\"s a link to an article. RTB\"s articles can explain what I have said and more. I\"m sure they do it quite a bit better than I do as well. Sorry this was so long haha"],"PremiseEndPos":[7666],"ArgumentID":"00000002","Conclusion":"The Genesis account is scientifically viable.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":178,"nextID":"00000004","PremiseStartPos":[7681],"prevID":"00000002","Premise":["Yes KalleS, don't worry. I'm not one to get emotional or angry when somebody challenges what I believe. I want this to be a logical talk as much as you do. Also, would you please tell me which translation of the bible you are using. Thanks. 1) This was addressed in my previous post. \"Heavens and earth\" is a Hebrew statement for everything in the universe. The light that you were talking about was also addressed. But to make things clear, that first light was coming from the sun. The sun light was reaching earths surface, but the sun could not be physically seen because of the still dense atmosphere. Much like how there is enough light to be able to see on a cloudy day, but you cannot see the sun. 1:6) Many translations of the Bible use firmament, vault, or even expanse, instead of dome. I believe that this refers to the troposphere of our atmosphere. Separating \"waters from waters\" could be referring to the waters of the ocean and the waters of the atmosphere, clouds. It is not separating earth from space, but rather the clouds and oceans. Many times even I have to remind myself that the book of Genesis was written for the Ancient Jews, and that it was written in a way that they could understand what happened. I think that this is why some parts of Genesis may appear to be confusing to us now. 1:11) This was also addressed in my previous post. If you are wondering where I got the translations for the Hebrew words of this section, it from a book called Navigating Genesis by Hugh Ross. The information that I got about this verse was on page 49 and 50 of the book. Here are the citations used for Ross's translations Harris, Archer, and Waltke, Theological Wordbook, vol. 1, 252-253 R. Laird Harris, Gleason L. Archer Jr., and Waltke, Theological Wordbook of The Old Testament, vol. 2 (Chicago: Moody Press, 1980), 688-89 1:16) Also explained in my previous post. The sun, moon, and stars became visible as the atmosphere became more and more clear, but they were formed prior to the time this verse is referring to. 1:16) I explained the dome above in this comment. 1:20-21) \"21 So God created the great creatures of the sea and every living thing with which the water teems and that moves about in it, according to their kinds, and every winged bird according to its kind. And God saw that it was good.\" This verse could be interpreted not that God created every kind of bird at this moment, but that every kind of bird that he did create, he created according to its kind. I suppose I forgot to mention evolution. Sorry about that. I suppose that my interpretation can work with or without evolution. God may have created some life forms and allowed them to evolve and go extinct, or he might have created some and not allowed them to evolve. As I said before, just because God said he created animals in this certain order in Genesis doesn't mean he created all of life in this order. There are life forms that he created that were not mentioned in Genesis. However, I will acknowledge the fact that you pointed out. The birds of Genesis do not seem to fit within the evolutionary paradigm or the fossil record. But, perhaps God created some of these birds, they might have even been insects because of the ambiguity of the Hebrew language, and allowed them to live for a short time. Afterwards, God may have created other birds during the time after the dinosaurs. Seems unlikely I know, but this is the explanation I put forward. 1:24-25) \"24 Then God said, \"Let the earth bring forth living creatures after their kind: cattle and creeping things and beasts of the earth after their kind\"; and it was so. 25 God made the beasts of the earth after their kind, and the cattle after their kind, and everything that creeps on the ground after its kind; and God saw that it was good\" \"all the land creatures are made and the words of every kind are repeated almost too much you cannot refute that this means every single kind of animal or else you are going against the word of god.\" I was quite surprised to read this from you. This verses above do not state that all animals were formed, but I do think the bulk of animal life was probably made during this verse. You must keep in mind that in my view, each of these verses takes place probably over millions of years, not all at once. God did not make creatures all at once. He might have made them in close proximity, as far as time goes, to one another as seen in the Cambrian explosion. 1:27-30) My view is that God did create humans separate form hominids. (A possible reason God created hominids was to train wild animals to recognize human presence and activities on the earth.) I realize now that this view goes against what I am trying to argue since the vast majority of scientists accept human evolution as true. Oh well :P While writing this, I find that my views on Genesis are extremely complicated and quite vague sometimes. I sincerely apologize for any confusion I have caused you as I am not the best at explaining things. If you still have any questions about what happened on specific days in Genesis feel free to ask."],"PremiseEndPos":[12796],"ArgumentID":"00000003","Conclusion":"The Genesis account is scientifically viable.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":178,"nextID":"00000005","PremiseStartPos":[12811],"prevID":"00000003","Premise":["1) Just to clarify, I will restate what I believe happen. God creates the universe through the Big bang, time goes by, the solar system is in the process of forming as is the earth. The sun is formed and is producing light, but the earth is covered in a thick blanket of clouds which block all sunlight from reaching the surface. God says let there be light. A mars sized object smashes into the young earth blasting away some of the atmosphere and most likely vaporizing any water on the surface. This impact caused the atmosphere to thin just enough so that light would hit on the surface of the earth (the frame of reference for Genesis is the surface of the earth), but the sun was still not visible (like a cloudy day). Since sunlight was now reaching the surface, day and night could now be distinguished from one another. 1:6) i believe your logic is sound and I don't feel like I need to respond to your comments, so I won't :) I do acknowledge what you stated in the last two sentences of that paragraph though. 1:11) I'm sorry, I might have confused you on this one. The Hebrew words for seed, trees, and fruit (zera, es, and pri) can RESPECTIVELY mean \"semen\" or \"the embryos of any plant species, \" \"any large plant containing woody fiber,\" and \"the food and or embryos produced by any living thing.\" \"There is not a single plant that could have survived in the oxygen rich climate that the first bacteria...\" The early atmosphere was not full of oxygen at all. \"Oxygen has not always been as abundant as it is today. Most scientists believe that for half of Earth\"s 4.6-billion-year history, the atmosphere contained almost no oxygen.\" I think this clears up that fact that wood-fibered plants were probably able to survive on the early earth. \"In evolution any complex organism needs other organisms to assist it in its growth\" Who said God only created on type of organism? God probably did create ecosystems and all types of creatures to help assist with the survival of each other. I think saying \"God could have\" and \"God would have\" is not very productive in this debate. We can only look at what he did do, or didn't do in your views. And that is what we are arguing over, if Genesis lines up with what we see in science. And I do understand that the Cambrian explosion did not include modern life forms. That's undeniable. What I was suggesting is that the first life forms of the Cambrian time-period actually did appear out of thin air (haha i know this might sound absurd to you), God might have created them this way and that is why species tend to characteristically appear abruptly in the fossil record. Even Richard Dawkins acknowledges the fact that species appear very abruptly as far as the Cambrian Explosion goes. And for your comments about the rattlesnakes in Texas. Yes they have evolved. They have adapted because of natural selection (maybe not natural selection, I guess it's more human selection haha) Evolution is a topic for another debate though. I don't really have much else to say. If you would like to better understand my position, then explore this website I would like to thank you for being a wonderfully pleasant opponent :)"],"PremiseEndPos":[15988],"ArgumentID":"00000004","Conclusion":"The Genesis account is scientifically viable.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":178,"nextID":"00000006","PremiseStartPos":[16003],"prevID":"00000004","Premise":["I will accept this. good luck."],"PremiseEndPos":[16034],"ArgumentID":"00000005","Conclusion":"The Genesis account is scientifically viable.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":178,"nextID":"00000007","PremiseStartPos":[16049],"prevID":"00000005","Premise":["Alright, long post. My very first comment will be this; you need not debate this but it is true. the more vague a statement is the more likely it is to be true as long as someone is trying to believe it. Oftentimes people take advantage of this by saying something vague and then playing prophetic as it were. Fortune tellers, psychics, and horoscopes are accurate examples. Alright I will now commence my portion of the debate. Take not that I am mostly disregarding your comments only as to keep the structure of this debate regular. As a first legitimate statement I will say this. The word you used \"account\" refers to someone's verbatim description of an event. an example is if someone was asked to give an account of a robbery they would not say \"The sheep came in waving a stick and said bah bah black sheep and then stole the lettuce\" and then when questioned further proclaims the sheep to be a man in a mask the stick to be a gun and the lettuce to be a woman\"s purse. The latter of course being the actual account of what happened. All of this being said by definition we have to take every word literally. but I will give you some leeway since I'm sure you meant account as hyper metaphorical story. However I will not accept reasoning purely from metaphors it is not a sound way to reason. In fact if I reasoned like you I could say the word god was just a word for unknown force and the following was just an estimation of what happened. 1) Now I will begin debating con. The word beginning irrefutably means the very moment something starts. and in the moment god is said to have created the earth and the heavens which I assume to mean space or perhaps heaven. Either way they were created instantaneously as the universe came into existence. It describes the earth as being still water and space as being lightless and dark. At the time of the big bang the whole universe would have been white hot and glowing with energy so there is no way that it was dark in the beginning. Then he created light from no source. as for the day thing i can see that being \"light is the time that god is awake\" type of thing so i will just go ahead and give it to you that it was not the same as our measurement 1:6) \"Let there be a dome in the midst of the waters, and let it separate the waters from the waters\" this sentence has a couple of flaws and keep in mind that this is supposedly coming from the mouth of god himself. A dome is a half sphere. The earth is a full sphere but the people of the time did not know that so if one were sitting in a room making up stories that would be a likely product of those stories; dated information. It would be like someone in that age telling a story like \"I flew up into the sky and observer the perfect cube that was the earth\" the next thing was that he separated the waters from the waters I feel that is yet another portrayal of the (I mean this in the most literal way) ignorance of the time which if spoken by the mouth of god would not have been true. 1:11) now we get to the real part. god says \"Let the earth put forth vegetation: plants yielding seed, and fruit trees of every kind on earth that bear fruit with the seed in it.\" This part partially goes back to the sky being created in the last verse and i have three distinct points i want to bring up. 1) the very first plant was a type of algae that covered the earth in what was, to plants, a poison that substance was oxygen so even saying that the vegetation bearing seeds was this algae there is no way a tree of all things could have survived 2) ignoring fact one; trees evolved just like humans and it states quite clearly that he created ALL of the fruit bearing trees at this moment before animals existed. 3) fruits purpose is to lure animals in with its taste and sugar in order to spread the often inedible or indigestible seeds so if we are going with days were not really days then all of those trees would have had no way to reproduce in that time he was asleep. 1:16)\"God made the two great lights\"the greater light to rule the day and the lesser light to rule the night\"and the stars.\" This line suggests two things 1) the moon and the sun were just now created. and if he had created the moon just then all life on the planet would have been completely destroyed and I know you know why.2) the writer did not have a clear understanding that the light from the moon is the same light that comes from the sun. Another example of ignorance to science. 1:16) I just don't know what to make of the in the dome of the sky. if the dome is what separates space from the earth than both the sun and the moon are way too close to us and if it is what separates the earth from space than it is WAY too close to us and finally if the dome is space than it separates water from water which is again another ignorance I would assume based on the fact that the sky is blue during the day. and in the next line he gives light a second time. 1:20)\"And God said, \"Let the waters bring forth swarms of living creatures, and let birds fly above the earth across the dome of the sky.\"\" If the dome represents the atmosphere than be go back to the fact that it is way too close if the dome represents space we must then assume birds can fly in space (a task that is altogether impossible). this line by itself does not imply that they were all made at this moment but in conjunction with the next line \"So God created the great sea monsters and every living creature that moves, of every kind, with which the waters swarm, and every winged bird of every kind.\" following it by god saying it was good does imply that he created them all at the same time which directly contradicts the fossil record and the theory of evolution. As further proof there are a lot of signs that point to the idea that birds evolved from dinosaurs so if they were created before the dinosaurs that would not make much sense. 1:24-25) all the land creatures are made and the words of every kind are repeated almost too much you cannot refute that this means every single kind of animal or else you are going against the word of god. 1:27-2:0) god claims man is separate from beast and was created separately again contradiction evolution and fossil records. This ends my debate and please do not come back at me with any emotion or bias and please do not just repeat what you said in your first post. the second round is for rebuttals so i will go directly against your opening statement and you will go against mine. I just want to have a logical debate about this."],"PremiseEndPos":[22601],"ArgumentID":"00000006","Conclusion":"The Genesis account is scientifically viable.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":178,"nextID":"00000008","PremiseStartPos":[22616],"prevID":"00000006","Premise":["Sorry I meant to write tell you the bible I was using but I was cutting it close to missing my class and forgot. I'm using a website called bible hub just looking through the various versions to get a better understanding of what was meant to be said but my quotes came from the new revised standard Edition. I feel a lot of the issue in debating this really does go back to what I said about vagueness because when you attribute more specific words to vague words you can pull out truths that weren't even intentional. It is similar to writers who use alliterations to allow you replace these variable words with words or images that or more desirable for you. I\"m not saying this necessarily makes it wrong I\"m just saying it makes it very difficult to prove either way if you reason off of it 1)The light/ sun problem I suppose makes sense but it says at first there was no light at all but the earth existed and then light came. Where was the light before that? The sun necessarily existed before the earth because if the sun did not exist nothing would have kept our small water rock in orbit and also the creation of a star is not a safe and calm thing if we were even close to the sun when it happened the planet would have been pulled in. 1:6) I understand that there are two meanings for the word dome or firmament but the issue I have with it is this; a lot of religions and lore believed that the sun was a lot closer than it is because it is big bright and you can feel the heat coming off of it. So it is more easily believed that people of the time held the belief that it was close and thus used the same words for it then knew there was a difference but just did not specify. that being said that does not make for a strong argument for either of us. However if we talk about atmosphere the clouds are within the atmosphere. My final note on this is this; though it may have been \"dumbed down\" for ancient people we are debating the accounts scientific legitimacy. If you tell a group of 1st graders a mathematical theory that does not hold up when they grow up to be adults, what you have told them is not accurate. 1:11) you touched on it to be sure you said that the words trees seeds fruits and semen were all synonymous which is an odd range of words to be lumped together but i will believe you. If this is true however the writer would have essentially said semen, semen and semen or if they did in fact all correspond then he is just saying seeds, tree seeds and fruit which is also tree seeds. There is not a single plant that could have survived in the oxygen rich climate that the first bacteria. in fact they could hardly survive it. it is like an animal being locked inside an airtight room it would die because of a lack of oxygen. In evolution any complex organism needs other organisms to assist it in its growth this is a fundamental part of evolution if you kill off all the pollinators any flowers that used mechanical pollination other than the wind would die. and just taking into assumption that the writer did not say semen three times in a row and also you saying any plant with a woody fiber (which is not something simple organisms have) there had to be at least one complex organism in the mix that he would have to have put down on the earth knowing it would die without the proper pollinators and as you say the days are not 24 hours they would not have survived You are saying that it does not say that they were all created at that moment but I am not seeing how that is not being said. Furthermore since evolution is a very commonly held scientific truth (and i only say that as a buffer simply not to state anything indefinitely); god would not have to create any life after he created the single celled organisms further more if god was so inclined [he] could have just make the air rich with oxygen instead of having small creatures do the work for [him]. This next part does to address the rest of your comments. There is absolutely no proof that anything \"sprung\" into assistance everything has been fine tuning itself from the time life first formed. Now about the Cambrian explosion...( I will preface this with the fact that I am a geo-physics major) It was by no means a period in time where we see human fossil laying with bird fossils laying with cat fossils laying with stegosaurus fossils. it is however a time of rapid evolution where a lot of new species evolved. they did not just appear out of thin air it was most likely the introduction of predatory organisms that killed other organisms because death is evolution's greatest advocate. As an example i will say this; In Texas (I'm not sure what country or state you are from but I'm sure you have heard of Texas) they hunt rattle snakes in a weird barbaric type of sport if you want to call it that. But they always hunt based on sound, Because they are easy to find that way. The sound is normally a deterrent but we have begun to pray on it and just over this last 10 years some rattle snakes in Texas have evolved to not have rattles or to rattle less because the ones that rattle at everything are all dead. that is a very short time to see the effects of increased predator activity on the behavior and attributes of a species. As a result more and more people are being bitten because they are not being warned. Which, if we were really even part of evolution any more (which we are but not in a really directed way) would make use evolve to smell them or something which just won\"t happen. I got a little off topic but it is important that you do not use the Cambrian explosion as proof. sorry again running to class no time to proof read I apologize if this comes out a bit more sloppy than I had intended"],"PremiseEndPos":[28347],"ArgumentID":"00000007","Conclusion":"The Genesis account is scientifically viable.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":133,"ConclusionEndPos":178,"nextID":"00000000","PremiseStartPos":[28362],"prevID":"00000007","Premise":["1:11) yes, I was confused about that thank you for clearifying. and yes the atmosphere was non exsistant untill the first photosynthetic bacteria came along. A byproduct of this plant was oxygen and as this bacteria spread it created the atmosphere we had today but oxygen is poisonous to plants just as carbon___ is poison to us there was no \"room for complex organisms to grow and breath because the bigger the plant the more oxygen it prooduces so is anything more complex than a photosynthetic bacteria was plopped in the middle of an oxygen rich zone it would probably just sufficate. As for your comment of an eco system it is clearly stated that anyting that was not plant life came after he rested which according to you was a long period of time. Well as final words I believe you may be inferring a bit too much about word meanings and symbolism. The account is however more accurate when put into your perspective and I do understand where you are coming from. It may just coem down to a belif in evolution to determine what really happened so i of course still maintain it is not logical. However, this has been a great debate and I wish all of the people i debated with could be as civil and well informed as you."],"PremiseEndPos":[29589],"ArgumentID":"00000008","Conclusion":"The Genesis account is scientifically viable.","PremiseStance":["Con"]}}]}