{"MetaData":{"Context":"URL: http://www.debate.org/debates/Hamlets-tragic-flaw-was-not-his-inability-to-act/1/\nCrawl date: 2016/09/29 05:04:02\nDebate Argument: Hamlet's tragic flaw was not his inability to act | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: For my first debate on this site, I wish to debate that Hamlet's tragic flaw was in fact not his inability to act. I will be the pro side, so I will be arguing that his tragic flaw is something else which I will be stating later. The definition of tragedy and all the terms that come from the tragedy will be the Aristotelian definition. I'll define them simply quickly here: Tragedy: an imitation of an action that is admirable, complete (composed of an introduction, a middle part and an ending), and possesses magnitude; in language made pleasurable, each of its species separated in different parts; performed by actors, not through narration; effecting through pity and fear the purification of such emotions. Tragic Hero: a character who is more virtuous than the typical civilian but has a tragic flaw which causes his downfall. (Example Creon's fatal flaw is hubris) Tragic Mistake: When the tragic flaw comes out and the character makes a poor decision (Creon not listening to Antigone's, Haemon's or Teirisias's advice and attacking them using logical fallacies.) -Aristotle. Poetics. - I intend to make this first round only for acceptance of the Debate. Second round will be opening statements, the third round will be counterarguments and rebuttals, and the 4th and final round will be closing statements.\n\nEvidence Pro: \"Hamlet's inaction is his virtue not his vice\" And with that I have won the debate. My opponent has misunderstood what his position was supposed to be. I don't even need to argue.\n\nEvidence Pro: That's more like it. Despite the fact that we wasted an entire round is okay with me. I will state my opening/counter argument. For tragedy to be successful, according to Aristotle, a person who exhibits greatness must have a reversal of fortune from good to bad. Greatness in terms of Aristotle is human virtue. Hamlet undoubtedly shows great virtue in the beginning of the play; he is smart (he attends Wittenburg University) and can run rings intellectually around numerous court officials such as Polonius and Osric. He shows an incredible amount of reflection, contemplating his actions (as can be seen in the To Be or Not To Be soliloquy). It can be speculated that he understands philosophical perspective and the limits one has concerning his own, as he asks Horatio to confirm Claudius's guilt. Most importantly Hamlet will not commit certain actions in the beginning of the play. He refuses to spy on everybody else, despite the fact that everybody else (except for Horatio) is spying on him. Spying is a moral vice as it breaks the loyalty in relationships. Before stating what Hamlet's tragic flaw is I will refute my opponent's position that Hamlet's tragic flaw is inaction. If we look at his actions throughout the story we see that he has every reason to wait to commit his act upon Claudius. Let's use some common sense here: if a ghost came up to you and told you to kill your uncle if your in the current situation of Hamlet, would you do it? Of course not, as Hamlet says he needs evidence of this in his soliloquy in act 2, scene 2 because \"the spirit I have seen may be a devil, and the devil hath power T'assume a pleasing shape, yea, and perhaps out of me weakness and my melancholy, as he is very potent with such spirits, abuses me to damn me. I'll have ground more relative that this. The play's the thing wherein I'll catch the conscience of the king.\" Right there we see Hamlet stating why he waited between acts to finally act. Nobody as smart as Hamlet is going to make a rash decision to kill his uncle without evidence. Hamlet does eventually decide to kill Claudius after the play within a play, where Claudius's guilt is exposed to Hamlet and Horatio giving him evidence that the Ghost never provides. After that Claudius goes off to to try and repent his sins and pray. Unbeknown to Claudius, Hamlet is hiding and waiting there in the prayer room to kill him. At this moment we see Hamlet's fatal flaw: moral pride or hubris. The inability to put anybody's moral law about your own, therefore you are always right. You become God in a sense. Hamlet does just this in the scene. He decides to play God and send Claudius to hell, he will give the real God no choice but to send Claudius to hell. This continues when Hamlet goes to visit his mother. If you remember the Ghost of Hamlet's dad told him to leave his mother to heaven, to leave her alone. While Gertrude has made mistakes, such as marrying her dead husband's brother, she has not abandoned Hamlet. She has not run off with Claudius or anything of that nature. If she had, it would have been acceptable for him to scold her. She has tried to help Hamlet, urging him to stay in the beginning of the play. Hamlet, having moral pride, ignores this and his father's ghost's advice and punishes his mother. He then kills Polonius, who had been hiding, who he mistook for Claudius. This shows that Hamlet has no problem with acting quickly and rashly. His problem is not that he can't make decisions, it is that he has moral pride. This is what led him to his mother's room. If he hadn't had gone to his mother to scold her, he wouldn't have accidentally killed Polonius. After this point in the play, Hamlet is much different. He lies to Claudius in act 5, he allows Rosencrantz and Guildenstern to be killed so that way he can make his way back to Denmark. This is vastly different from the character in the 1st 3 acts who waited for a lot of evidence before he finally killed his murdering uncle. Hamlet's virtue is destroyed after he kills Claudius. He is not the same after that event. With the definition of an Aristotelian tragedy, Hamlet's tragic flaw is hubris. - - - -William Shakespeare, Hamlet -\n\nEvidence Pro: My opponent has ignored my argument, despite the fact that I have shown that Hamlet had good reason not to act. He had no reasonable evidence that the Ghost's story was true. When he did he decided to kill Claudius; if it hadn't been for his tragic flaw of moral pride he would have succeeded. But alas, this is a tragedy. I ask my opponent if Hamlet's true tragic flaw was indeed his inability to act then how come he kills Polonius so quickly? He did not hesitate to kill him. Hamlet had been looking for evidence to support the Ghost's theory and when he got it from the play within a play, he decided to act. But, as I explained before, Hamlet then decides to become God and send Claudius to hell. Continuing with his new found Godliness, he punishes his mother ignoring the advice of his ghost father. I strongly urge the voters to vote pro. My opponent has not responded to my arguments in any way and I have given good counterarguments to his claims.\n\nEvidence Con: Hamlet's inaction is his virtue not his vice. Her contemporaries also criticized Queen Elizabeth for her \"indecisiveness\" and \"inaction.\" But her \"inaction\" kept England out of several wars and set the stage for future greatness. HAMLET (3,4,169-171) . . . . Forgive me this my virtue; For in the fatness of these pursy times Virtue itself of vice must pardon beg, Yea, curb and woo for leave to do him good. - Part 1 - So Like the King \"Who's there?\" The rest of the play answers that initial question. Hamlet is the \"glass of fashion\" and most of the other characters reflect some aspect of Hamlet. But who is Hamlet? A son of his warrior father, but also one who \"could be bounded in a nut shell and count myself a king of infinite space.\" Hamlet the soldier rants in golden couplets of warlike noise, while Hamlet the scholar unfolds himself through inaction and silence. But to be true to himself, Hamlet has to recognize that he is both soldier and scholar. He is the princely soldier who courageously returns to the fate awaiting him in his native soil (a graveyard). But he is also the gentle scholar who confesses the sins of his warlike nature. - Hamlet in a Nutshell The title says it all: \"The Tragedy of Hamlet, Prince of Denmark.\" Because he is Prince of Denmark he is not free to carve for himself. He is subject to the voice of Denmark - and that voice was sent from Hell to speak of horrors. Hamlet, like all the other major characters, is untrue to himself. When he is himself, he is like Horatio, a student from Wittenberg. But as he said, \"Horatio, or I do forget myself.\" He does forget himself. He erases himself and his humanist education (all saws of books, all forms, all pressures past, that youth and observation copied there) from his own brain and there in the book and volume of his brain he writes his father's commandment (the voice of Denmark, sent from Hell to speak of horrors, to breathe contagion, unfolding the secrets of his prison-house that he was forbid to tell to mortal ears). Hamlet is from himself taken away. When he is not \"from himself taken away,\" Hamlet is a rational humanist scholar from Wittenberg. But Hamlet erases that side of himself from the book and volume of his brain and replaces it with the commandment of his warlike father. Thereafter all of Hamlet's soliloquies are really debates between the warring sides of his divided soul. Hamlet is a valiant soldier of the spirit, fighting a desperate internal battle to defend the sovereignty of his soul. In the \"my thoughts be bloody\" soliloquy: Hamlet the scholar says, Sure, he that made us with such large discourse, Looking before and after, gave us not That capability and god-like reason To fust in us unused. But Prince Hamlet, the soldier-son of a warlike king scoffs at \"thinking too precisely on the event\" and concludes: My thoughts be bloody, or be nothing worth! A gravedigger was hired on the very day that Hamlet emerged from his mother's womb, which was the same day his father put old Fortinbras into the womb of earth (his grave), thus acquiring land \"that was and is the question of these wars\" and which was Hamlet's inheritance, figuratively a graveyard, not big enough to cover the dead from the impending war. BERNARDO (Act 1, Scene 1, lines 121-124) I think it be no other but e'en so: Well may it sort that this portentous figure Comes armed through our watch; so like the king that was and is the question of these wars. That is Hamlet's dilemma - whether \"TO BE OR NOT TO BE,\" like the Ghost, \"so like the king THAT was and IS THE QUESTION of these wars.\" Also please see - God-like Reason Unused - Where Kings Lead, Folly Follows - A Document in Madness - An Honest Ghost? - The Memory Be Green - Hamlet in Historical Context - Terms Compulsatory Source(s): My website: Be All My Sins Remembered Essays on motifs, symbolism, & themes in Hamlet.\n\nEvidence Con: check this out William Shakespeare is the greatest playwright of the English language, wrote a total of 37 plays in his lifetime, all of which can be categorized under tragedy, comedy, or history. The Tragedy of Hamlet, Shakespeare\"s most popular and greatest tragedy, displays his genius as a playwright, as literary critics and academic commentators have found an unusual number of themes and literary techniques present in Hamlet. Hamlet concerns the murder of the king of Denmark and the murdered king\"s son\"s quest for revenge. Its main character, Hamlet, possesses a tragic flaw which obstructs his desire for revenge and ultimately brings about his death. This tragic flaw makes him a tragic hero, a character who is destroyed because of a major weakness, as his death at the end could possibly have been avoided were it not for his tragic flaw. Hamlet\"s flaw of irresolution, the uncertainty on how to act or proceed, is shown when Hamlet sees a play and the passion the actors had, after Hamlet\"s third soliloquy, in Hamlet\"s fourth soliloquy, and in Hamlet\"s indecisive pursuit in avenging his father\"s death. What do you think?\n\nEvidence Con: Well, Though at times Hazlitt delighted in actors' interpretations of Shakespearean characters, and he thought some of Shakespeare's plays eminently suited for the stage, he opens the chapter on Hamlet by proclaiming, \"We do not like to see our author's plays acted, and least of all, Hamlet\". Here, more than anywhere else, he sides with Charles Lamb in believing Shakespeare's plays to suffer in stage presentation. Neither John Kemble nor his favourite actor Edmund Kean played the role of Hamlet to his satisfaction. \"Mr. Kean's Hamlet is as much too splenetic and rash as Mr. Kemble's is too deliberate and formal.\" This, he felt, is a play to be read, and he noted that by his time it had already been so often read as to have become part of the common culture. \"This is that Hamlet the Dane, whom we read of in our youth\". One might say, he observes, that Hamlet is just a character in a play: \"Hamlet is a name; his speeches and sayings but the idle coinage of the poet's brain.\" Yet Shakespeare gives those sayings a reality in the mind of the reader, making them \"as real as our own thoughts.\" Of all Shakespeare's plays, this one is \"the most remarkable for the ingenuity, originality, and unstudied developement of character\", writes Hazlitt. He thought of Hamlet more often than any of Shakespeare's other plays because \"it abounds most in striking reflections on human life, and because the distresses of Hamlet are transferred, by the turn of his mind, to the general account of humanity.\" \"The character of Hamlet [...] is not a character marked by strength of will or even of passion, but by refinement of thought and sentiment\", writes Hazlitt, and he sides with Schlegel and Coleridge in thinking that Hamlet \"seems incapable of deliberate action\". \"His ruling passion is to think, not to act\". Although the focus in this essay is largely on the character of Prince Hamlet, Hazlitt also comments on the movement of the dramatic action. Shakespeare lends all the characters and settings an air of verisimilitude, so that the reader might consider \"the whole play [to be] an exact transcription of what might be supposed to have taken place at the court of Denmark, at the remote period of time fixed upon, before the modern refinements in morals and manners were heard of. [...] the characters think and speak and act just as they might do, if left entirely to themselves. There is no set purpose, no straining at a point.\"\n\nEvidence Con: Hey yo, This is rap battle, we can't do poets and sh***, come on Your opponents are dead, I'll cut your head Oh my god! somebody just got out the bread! How come your wearing a bra or a pantie? that's true, hamlet's reacting by his tragedy This Mother****** can't say Polonius and Osric you can say that same s*** like Notorious Vagina and Dick I'm a greatest poetry of the year even the cashier You steal my baseball base, that's a mother****** error have you write stories before, rap before, smoke before You destroy my relationship with my girl, your a f***** h*** If you don't do that sh**, just say oh well That means priceless 29, goes to hell! Show me your genitals, Show me your genitals Watch out, there's the atheist gay having sex with your a**hole! What you gonna do? What you gonna do? East Side 16 Mile Police Department might arrest you\n","DiscussionID":"00000070","Title":"Hamlet's tragic flaw was not his inability to act","CrawlDate":"2016/09/29 05:04:02","URL":"http://www.debate.org/debates/Hamlets-tragic-flaw-was-not-his-inability-to-act/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":185,"nextID":"00000002","PremiseStartPos":[237],"prevID":"00000000","Premise":["For my first debate on this site, I wish to debate that Hamlet's tragic flaw was in fact not his inability to act. I will be the pro side, so I will be arguing that his tragic flaw is something else which I will be stating later. The definition of tragedy and all the terms that come from the tragedy will be the Aristotelian definition. I'll define them simply quickly here: Tragedy: an imitation of an action that is admirable, complete (composed of an introduction, a middle part and an ending), and possesses magnitude; in language made pleasurable, each of its species separated in different parts; performed by actors, not through narration; effecting through pity and fear the purification of such emotions. Tragic Hero: a character who is more virtuous than the typical civilian but has a tragic flaw which causes his downfall. (Example Creon's fatal flaw is hubris) Tragic Mistake: When the tragic flaw comes out and the character makes a poor decision (Creon not listening to Antigone's, Haemon's or Teirisias's advice and attacking them using logical fallacies.) -Aristotle. Poetics. - I intend to make this first round only for acceptance of the Debate. Second round will be opening statements, the third round will be counterarguments and rebuttals, and the 4th and final round will be closing statements."],"PremiseEndPos":[1556],"ArgumentID":"00000001","Conclusion":"Hamlet's tragic flaw was not his inability to act","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":185,"nextID":"00000003","PremiseStartPos":[1571],"prevID":"00000001","Premise":["\"Hamlet's inaction is his virtue not his vice\" And with that I have won the debate. My opponent has misunderstood what his position was supposed to be. I don't even need to argue."],"PremiseEndPos":[1751],"ArgumentID":"00000002","Conclusion":"Hamlet's tragic flaw was not his inability to act","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":185,"nextID":"00000004","PremiseStartPos":[1766],"prevID":"00000002","Premise":["That's more like it. Despite the fact that we wasted an entire round is okay with me. I will state my opening/counter argument. For tragedy to be successful, according to Aristotle, a person who exhibits greatness must have a reversal of fortune from good to bad. Greatness in terms of Aristotle is human virtue. Hamlet undoubtedly shows great virtue in the beginning of the play; he is smart (he attends Wittenburg University) and can run rings intellectually around numerous court officials such as Polonius and Osric. He shows an incredible amount of reflection, contemplating his actions (as can be seen in the To Be or Not To Be soliloquy). It can be speculated that he understands philosophical perspective and the limits one has concerning his own, as he asks Horatio to confirm Claudius's guilt. Most importantly Hamlet will not commit certain actions in the beginning of the play. He refuses to spy on everybody else, despite the fact that everybody else (except for Horatio) is spying on him. Spying is a moral vice as it breaks the loyalty in relationships. Before stating what Hamlet's tragic flaw is I will refute my opponent's position that Hamlet's tragic flaw is inaction. If we look at his actions throughout the story we see that he has every reason to wait to commit his act upon Claudius. Let's use some common sense here: if a ghost came up to you and told you to kill your uncle if your in the current situation of Hamlet, would you do it? Of course not, as Hamlet says he needs evidence of this in his soliloquy in act 2, scene 2 because \"the spirit I have seen may be a devil, and the devil hath power T'assume a pleasing shape, yea, and perhaps out of me weakness and my melancholy, as he is very potent with such spirits, abuses me to damn me. I'll have ground more relative that this. The play's the thing wherein I'll catch the conscience of the king.\" Right there we see Hamlet stating why he waited between acts to finally act. Nobody as smart as Hamlet is going to make a rash decision to kill his uncle without evidence. Hamlet does eventually decide to kill Claudius after the play within a play, where Claudius's guilt is exposed to Hamlet and Horatio giving him evidence that the Ghost never provides. After that Claudius goes off to to try and repent his sins and pray. Unbeknown to Claudius, Hamlet is hiding and waiting there in the prayer room to kill him. At this moment we see Hamlet's fatal flaw: moral pride or hubris. The inability to put anybody's moral law about your own, therefore you are always right. You become God in a sense. Hamlet does just this in the scene. He decides to play God and send Claudius to hell, he will give the real God no choice but to send Claudius to hell. This continues when Hamlet goes to visit his mother. If you remember the Ghost of Hamlet's dad told him to leave his mother to heaven, to leave her alone. While Gertrude has made mistakes, such as marrying her dead husband's brother, she has not abandoned Hamlet. She has not run off with Claudius or anything of that nature. If she had, it would have been acceptable for him to scold her. She has tried to help Hamlet, urging him to stay in the beginning of the play. Hamlet, having moral pride, ignores this and his father's ghost's advice and punishes his mother. He then kills Polonius, who had been hiding, who he mistook for Claudius. This shows that Hamlet has no problem with acting quickly and rashly. His problem is not that he can't make decisions, it is that he has moral pride. This is what led him to his mother's room. If he hadn't had gone to his mother to scold her, he wouldn't have accidentally killed Polonius. After this point in the play, Hamlet is much different. He lies to Claudius in act 5, he allows Rosencrantz and Guildenstern to be killed so that way he can make his way back to Denmark. This is vastly different from the character in the 1st 3 acts who waited for a lot of evidence before he finally killed his murdering uncle. Hamlet's virtue is destroyed after he kills Claudius. He is not the same after that event. With the definition of an Aristotelian tragedy, Hamlet's tragic flaw is hubris. - - - -William Shakespeare, Hamlet -"],"PremiseEndPos":[5963],"ArgumentID":"00000003","Conclusion":"Hamlet's tragic flaw was not his inability to act","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":185,"nextID":"00000005","PremiseStartPos":[5978],"prevID":"00000003","Premise":["My opponent has ignored my argument, despite the fact that I have shown that Hamlet had good reason not to act. He had no reasonable evidence that the Ghost's story was true. When he did he decided to kill Claudius; if it hadn't been for his tragic flaw of moral pride he would have succeeded. But alas, this is a tragedy. I ask my opponent if Hamlet's true tragic flaw was indeed his inability to act then how come he kills Polonius so quickly? He did not hesitate to kill him. Hamlet had been looking for evidence to support the Ghost's theory and when he got it from the play within a play, he decided to act. But, as I explained before, Hamlet then decides to become God and send Claudius to hell. Continuing with his new found Godliness, he punishes his mother ignoring the advice of his ghost father. I strongly urge the voters to vote pro. My opponent has not responded to my arguments in any way and I have given good counterarguments to his claims."],"PremiseEndPos":[6936],"ArgumentID":"00000004","Conclusion":"Hamlet's tragic flaw was not his inability to act","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":185,"nextID":"00000006","PremiseStartPos":[6951],"prevID":"00000004","Premise":["Hamlet's inaction is his virtue not his vice. Her contemporaries also criticized Queen Elizabeth for her \"indecisiveness\" and \"inaction.\" But her \"inaction\" kept England out of several wars and set the stage for future greatness. HAMLET (3,4,169-171) . . . . Forgive me this my virtue; For in the fatness of these pursy times Virtue itself of vice must pardon beg, Yea, curb and woo for leave to do him good. - Part 1 - So Like the King \"Who's there?\" The rest of the play answers that initial question. Hamlet is the \"glass of fashion\" and most of the other characters reflect some aspect of Hamlet. But who is Hamlet? A son of his warrior father, but also one who \"could be bounded in a nut shell and count myself a king of infinite space.\" Hamlet the soldier rants in golden couplets of warlike noise, while Hamlet the scholar unfolds himself through inaction and silence. But to be true to himself, Hamlet has to recognize that he is both soldier and scholar. He is the princely soldier who courageously returns to the fate awaiting him in his native soil (a graveyard). But he is also the gentle scholar who confesses the sins of his warlike nature. - Hamlet in a Nutshell The title says it all: \"The Tragedy of Hamlet, Prince of Denmark.\" Because he is Prince of Denmark he is not free to carve for himself. He is subject to the voice of Denmark - and that voice was sent from Hell to speak of horrors. Hamlet, like all the other major characters, is untrue to himself. When he is himself, he is like Horatio, a student from Wittenberg. But as he said, \"Horatio, or I do forget myself.\" He does forget himself. He erases himself and his humanist education (all saws of books, all forms, all pressures past, that youth and observation copied there) from his own brain and there in the book and volume of his brain he writes his father's commandment (the voice of Denmark, sent from Hell to speak of horrors, to breathe contagion, unfolding the secrets of his prison-house that he was forbid to tell to mortal ears). Hamlet is from himself taken away. When he is not \"from himself taken away,\" Hamlet is a rational humanist scholar from Wittenberg. But Hamlet erases that side of himself from the book and volume of his brain and replaces it with the commandment of his warlike father. Thereafter all of Hamlet's soliloquies are really debates between the warring sides of his divided soul. Hamlet is a valiant soldier of the spirit, fighting a desperate internal battle to defend the sovereignty of his soul. In the \"my thoughts be bloody\" soliloquy: Hamlet the scholar says, Sure, he that made us with such large discourse, Looking before and after, gave us not That capability and god-like reason To fust in us unused. But Prince Hamlet, the soldier-son of a warlike king scoffs at \"thinking too precisely on the event\" and concludes: My thoughts be bloody, or be nothing worth! A gravedigger was hired on the very day that Hamlet emerged from his mother's womb, which was the same day his father put old Fortinbras into the womb of earth (his grave), thus acquiring land \"that was and is the question of these wars\" and which was Hamlet's inheritance, figuratively a graveyard, not big enough to cover the dead from the impending war. BERNARDO (Act 1, Scene 1, lines 121-124) I think it be no other but e'en so: Well may it sort that this portentous figure Comes armed through our watch; so like the king that was and is the question of these wars. That is Hamlet's dilemma - whether \"TO BE OR NOT TO BE,\" like the Ghost, \"so like the king THAT was and IS THE QUESTION of these wars.\" Also please see - God-like Reason Unused - Where Kings Lead, Folly Follows - A Document in Madness - An Honest Ghost? - The Memory Be Green - Hamlet in Historical Context - Terms Compulsatory Source(s): My website: Be All My Sins Remembered Essays on motifs, symbolism, & themes in Hamlet."],"PremiseEndPos":[10834],"ArgumentID":"00000005","Conclusion":"Hamlet's tragic flaw was not his inability to act","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":185,"nextID":"00000007","PremiseStartPos":[10849],"prevID":"00000005","Premise":["check this out William Shakespeare is the greatest playwright of the English language, wrote a total of 37 plays in his lifetime, all of which can be categorized under tragedy, comedy, or history. The Tragedy of Hamlet, Shakespeare\"s most popular and greatest tragedy, displays his genius as a playwright, as literary critics and academic commentators have found an unusual number of themes and literary techniques present in Hamlet. Hamlet concerns the murder of the king of Denmark and the murdered king\"s son\"s quest for revenge. Its main character, Hamlet, possesses a tragic flaw which obstructs his desire for revenge and ultimately brings about his death. This tragic flaw makes him a tragic hero, a character who is destroyed because of a major weakness, as his death at the end could possibly have been avoided were it not for his tragic flaw. Hamlet\"s flaw of irresolution, the uncertainty on how to act or proceed, is shown when Hamlet sees a play and the passion the actors had, after Hamlet\"s third soliloquy, in Hamlet\"s fourth soliloquy, and in Hamlet\"s indecisive pursuit in avenging his father\"s death. What do you think?"],"PremiseEndPos":[11988],"ArgumentID":"00000006","Conclusion":"Hamlet's tragic flaw was not his inability to act","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":185,"nextID":"00000008","PremiseStartPos":[12003],"prevID":"00000006","Premise":["Well, Though at times Hazlitt delighted in actors' interpretations of Shakespearean characters, and he thought some of Shakespeare's plays eminently suited for the stage, he opens the chapter on Hamlet by proclaiming, \"We do not like to see our author's plays acted, and least of all, Hamlet\". Here, more than anywhere else, he sides with Charles Lamb in believing Shakespeare's plays to suffer in stage presentation. Neither John Kemble nor his favourite actor Edmund Kean played the role of Hamlet to his satisfaction. \"Mr. Kean's Hamlet is as much too splenetic and rash as Mr. Kemble's is too deliberate and formal.\" This, he felt, is a play to be read, and he noted that by his time it had already been so often read as to have become part of the common culture. \"This is that Hamlet the Dane, whom we read of in our youth\". One might say, he observes, that Hamlet is just a character in a play: \"Hamlet is a name; his speeches and sayings but the idle coinage of the poet's brain.\" Yet Shakespeare gives those sayings a reality in the mind of the reader, making them \"as real as our own thoughts.\" Of all Shakespeare's plays, this one is \"the most remarkable for the ingenuity, originality, and unstudied developement of character\", writes Hazlitt. He thought of Hamlet more often than any of Shakespeare's other plays because \"it abounds most in striking reflections on human life, and because the distresses of Hamlet are transferred, by the turn of his mind, to the general account of humanity.\" \"The character of Hamlet [...] is not a character marked by strength of will or even of passion, but by refinement of thought and sentiment\", writes Hazlitt, and he sides with Schlegel and Coleridge in thinking that Hamlet \"seems incapable of deliberate action\". \"His ruling passion is to think, not to act\". Although the focus in this essay is largely on the character of Prince Hamlet, Hazlitt also comments on the movement of the dramatic action. Shakespeare lends all the characters and settings an air of verisimilitude, so that the reader might consider \"the whole play [to be] an exact transcription of what might be supposed to have taken place at the court of Denmark, at the remote period of time fixed upon, before the modern refinements in morals and manners were heard of. [...] the characters think and speak and act just as they might do, if left entirely to themselves. There is no set purpose, no straining at a point.\""],"PremiseEndPos":[14445],"ArgumentID":"00000007","Conclusion":"Hamlet's tragic flaw was not his inability to act","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":185,"nextID":"00000000","PremiseStartPos":[14460],"prevID":"00000007","Premise":["Hey yo, This is rap battle, we can't do poets and sh***, come on Your opponents are dead, I'll cut your head Oh my god! somebody just got out the bread! How come your wearing a bra or a pantie? that's true, hamlet's reacting by his tragedy This Mother****** can't say Polonius and Osric you can say that same s*** like Notorious Vagina and Dick I'm a greatest poetry of the year even the cashier You steal my baseball base, that's a mother****** error have you write stories before, rap before, smoke before You destroy my relationship with my girl, your a f***** h*** If you don't do that sh**, just say oh well That means priceless 29, goes to hell! Show me your genitals, Show me your genitals Watch out, there's the atheist gay having sex with your a**hole! What you gonna do? What you gonna do? East Side 16 Mile Police Department might arrest you"],"PremiseEndPos":[15313],"ArgumentID":"00000008","Conclusion":"Hamlet's tragic flaw was not his inability to act","PremiseStance":["Con"]}}]}