{"MetaData":{"Context":"URL: http://www.debate.org/debates/Something-needs-to-be-done-about-vote-bombs/1/\nCrawl date: 2016/09/29 04:48:36\nDebate Topic: Something needs to be done about vote bombs | Debate.org\nNumber of arguments: 2\n\n\nEvidence Pro: This website can be a lot of fun. Sure things can get heated and that's why there are points that can be lost or awarded based on rudeness. There are people, however (mostly teens) that think they are justified to be vigilantes and administer their own form of point awards with the use of vote bombs. This results in more vote bombs and votes that result trying to counter-act the vote bombs. Ultimately, this results in the entire voting system becoming useless. I would suggest a blocking mechanism to block known vote bombers from voting. Sure, the votes really aren't the reason why people debate. The votes and the reasons for votes, help debaters understand other people's though processes. It's a valuable tool that is being destroyed by vote bombers who think they have the right to act like bigger jerks then the ones they claim to be jerks.\n\nEvidence Con: Pro's position assumes that nothing is currently being done about votebombs. Currently, members are free to counter votebombs as well as to submit complaints to administrators who will strip votebombers of their voting privileges. My opponent's solution already occurs in the status quo, and his position presumes that these measures are not being taken. Vote Con on the basis is that his solution is nonunique.\n","DiscussionID":"00000041","Title":"Something needs to be done about vote bombs","CrawlDate":"2016/09/29 04:48:36","URL":"http://www.debate.org/debates/Something-needs-to-be-done-about-vote-bombs/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":171,"nextID":"00000002","PremiseStartPos":[223],"prevID":"00000000","Premise":["This website can be a lot of fun. Sure things can get heated and that's why there are points that can be lost or awarded based on rudeness. There are people, however (mostly teens) that think they are justified to be vigilantes and administer their own form of point awards with the use of vote bombs. This results in more vote bombs and votes that result trying to counter-act the vote bombs. Ultimately, this results in the entire voting system becoming useless. I would suggest a blocking mechanism to block known vote bombers from voting. Sure, the votes really aren't the reason why people debate. The votes and the reasons for votes, help debaters understand other people's though processes. It's a valuable tool that is being destroyed by vote bombers who think they have the right to act like bigger jerks then the ones they claim to be jerks."],"PremiseEndPos":[1075],"ArgumentID":"00000001","Conclusion":"Something needs to be done about vote bombs","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":171,"nextID":"00000000","PremiseStartPos":[1090],"prevID":"00000001","Premise":["Pro's position assumes that nothing is currently being done about votebombs. Currently, members are free to counter votebombs as well as to submit complaints to administrators who will strip votebombers of their voting privileges. My opponent's solution already occurs in the status quo, and his position presumes that these measures are not being taken. Vote Con on the basis is that his solution is nonunique."],"PremiseEndPos":[1502],"ArgumentID":"00000002","Conclusion":"Something needs to be done about vote bombs","PremiseStance":["Con"]}}]}