{"MetaData":{"Context":"URL: http://www.debate.org/debates/Liam-Neeson-is-better-than-Chuck-Norris./1/\nCrawl date: 2016/09/29 06:29:52\nDebate Topic: Liam Neeson is better than Chuck Norris. | Debate.org\nNumber of arguments: 10\n\n\nEvidence Pro: I believe that Liam Neeson is better than Chuck Norris. By saying better, I will prove that he is: -A better actor than Chuck Norris. -\"Tougher\" than Chuck Norrs. And anything else my opponent has to offer. First round is for acceptance. Debate will begin with my first statement in round 2. Good luck to whoever my opponent may be.\n\nEvidence Pro: 1. The Boogie Man checks under his bed for Chuck Norris. Chuck Norris checks under his bed for Liam Neeson. Liam Neeson is practically the acting king of action. It's a shock that he hasn't been in the Expendables. Let's take a look at some of his roles: -Ra's Al Ghul: The man who trained Batman, and leads a whole league of epicly trained ninjas. (Batman Begins) -Zeus: The god of gods! (Clash of the Titans) -A guy who punches freaking wolves. (The Grey) -The man who trained Obi Wan Kenobi AND Darth Vader (Star Wars series) -This epic lion guy (Narnia series) -Spy guy who causes a whole lotta chaos to save his family. (Taken, Taken 2) -The leader of the A-Team (The A-Team) -Adolf Hitler (Hitler wasn't good, but it's just the \"power thing) (The Great War and the Shaping of the 20th Century) -A scarred vigilante. With an R rating! How exciting! (Darkman) -Jesus Christ. No literally, he played Jesus. (Pilgrim's Progress) -Oskar Schindler (Schindler's List) PLUS MANY MORE! -I await your rebuttal.\n\nEvidence Pro: Chuck Norris did not invent truth. All he invented is his own cowboy-ness. 1. You say that Jesus prays to Chuck Norris. This is obviously untrue. The only being Jesus prays to is God himself, and Norris isn't God, now is he? Also, your profile says that you are an Atheist. So why should you be bringing up Jesus if you don't think he was real/ he was the son of God? 2. Liam Neeson is good enough to not have such scary fans. Liam's fans are obviously more sane, because there are not so many \"Liam Neeson jokes\", or whatever. This proves that Neeson provides a sense of sanity and more directness to his job, enabling the ability that makes him better than Chuck, for he is still popular without all the freakiness Norris fans have. 3. Chuck has proof of fighting skills but Liam doesn't? Are you freaking kidding me? Watch some of his movies. 4. Liam Neeson is close to his 70's. Liam is 61. And about being closer to God, just because your old doesn't mean you are closer to God because you can die at any age. Plus, you're an Atheist. So why do you bring up God if you don't believe in Him? 5. There is obvious evidence that Liam can fight. Again, watch his movies. Who the heck is Sheen. And you brought up that God thing again. And I will bring up again: You're an Atheist. Oh, and you posted a picture, I'll post one, too:\n\nEvidence Pro: 1. Hahhaha. It is obviously untrue that Norris is God. God's beard is white, silly! Plus, there is proof that Chuck was born in Ryan, Oklahoma. We all know that God, the real true one, was born out of thin air. Oh wait you wouldn't know that...you're an Atheist. 2. So, I have just proven that Chuck is not God. And plus, who in the name is Liam Nielsen? It's spelled \"Neeson\". Doy. The case is still wide open, my friend.\n\nEvidence Pro: I. Look, I was just trying to have a serious debate. Then all the sudden, I get attacked by a pack of trolls. I was not wanting this to be some kind of troll/joke debate, but here I go: 1. Yes, Norris can make his beard any color he wants. Neeson can make his hair any color he wants. All you need is hair dye. Hair dye does not prove in anyway that Norris is better. And quit saying that Norris God. I know that you are an Atheist, and therefore saying things like that doesn't offend you or you don't think it offends anyone. Though, I am a Christian, and I know that there are lot of people in my religion that would be offended by this falsehood of which you keep stating. And I don't have the audacity/need to make such outrageous claims as saying that, for example, that Liam Neeson is God. Nor would I say that Neeson is the subject of Jesus's prayer, or that he invented the idea of truth. For I know that none of that is true, and for the sake of an actual debate, I have been providing ACTUAL reasoning as to why Liam is better than Chuck. 2. There are not different versions of Chuck. There is but one Chuck, and Liam Neeson is better than him. Anyway, why would God even want to be Chuck Norris? He has way better things to do. 3. Chuck Norris is not truth. He is an actor, and that is all. Therefore, Norris is not logic either, nor is he God. Simply an actor. 4. Saying \"doy\" was uncalled for? Really? You've been saying that Chuck Norris is God. You think that ISN'T uncalled for? Better watch out, Chuck.\n\nEvidence Con: I accept.\n\nEvidence Con: Chuck Norris invented the idea of \"truth\". Therefore, you can bet you bottom dollar that everything I am saying is true. If you think that is a non-sequitur, just remember, Chuck Norris is logic itself. Divinity Jesus prays to chuck norris Proof Of Fightning Skills Chuck Norris actually has moves (Check Video) Chuck Norris Is Old Chuck is in his 70's, this means he is closer to God than Liam because God is the oldest person there is. This alone would not give him extra powers, but he is Chuck Norris. Conclusion Jesus prays to Chuck Norris, and Chuck Norris is devine. There is evidence that Chuck can actually fight, there is no evidence that sheen can actually fight. Chuck norris is also closer to God, and God gives him powers to overcome Liam because of this? Why? Because he is Chuck Norris. I win. Why? Well, my friend Chuck has something to say...\n\nEvidence Con: \" 1. You say that Jesus prays to Chuck Norris. This is obviously untrue. The only being Jesus prays to is God himself, and Norris isn't God, now is he?\" YES!!! Yes he is! This is why he is better than Liam Nielsen. Case Closed.\n\nEvidence Con: \"1. Hahhaha. It is obviously untrue that Norris is God. God's beard is white, silly!\" Chuck Norris can make his beard any color he likes, as Chuck Norris is God himself, and thus better than liam Neeson. \"Plus, there is proof that Chuck was born in Ryan, Oklahoma.\" Only that version of Chuck was born in Ryan, Oklahoma. Chuck is God and can take many forms. \"We all know that God, the real true one, was born out of thin air. Oh wait you wouldn't know that...you're an Atheist.\" Actually, Chuck Norris as a whole was not born at all. Only a version of himself began to exist in Ryan. \"2. So, I have just proven that Chuck is not God.\" Actually, my opponent has not. I proved Chuck is God. Why? Because Chuck Norris is truth itself, therefore, everything I am saying is true. If you believe that was a non-sequitur, it does not matter; Chuck Norris is logic itself, and has given me the powers to win this debate because he is Chuck Norris......Chuck Norris. \"And plus, who in the name is Liam Nielsen? It's spelled \"Neeson\". Doy.\" Yes, I made an error. However, that \"doy\" was rude and uncalled for. Thus, even if I get spelling and grammar points deducted, you will get conduct points deducted. \"The case is still wide open, my friend.\" My friend Yoda has something to say about that:\n\nEvidence Con: \" I. Look, I was just trying to have a serious debate. Then all the sudden, I get attacked by a pack of trolls. I was not wanting this to be some kind of troll/joke debate, but here I go:\" This is not a troll debate, this is a debate about Liam Neeson and Chuck Norris. When were we ever debating about trolls? \"1. Yes, Norris can make his beard any color he wants. Neeson can make his hair any color he wants. All you need is hair dye. Hair dye does not prove in anyway that Norris is better. \" I never said it did, this is a red herring. I just said that your argument that Chuck Norris cannot be God because Chuck Norris beard is brown is false. I never said this particular statement gave positive support in favor of my position. \"And quit saying that Norris God. I know that you are an Atheist, and therefore saying things like that doesn't offend you or you don't think it offends anyone. Though, I am a Christian, and I know that there are lot of people in my religion that would be offended by this falsehood of which you keep stating. \" Well, I believe that Chuck Norris is God. So, I am offended by the things above that you are saying. \"And I don't have the audacity/need to make such outrageous claims as saying that, for example, that Liam Neeson is God. Nor would I say that Neeson is the subject of Jesus's prayer, or that he invented the idea of truth.\" Well, then you admit that you lose the debate because I am claiming that Chuck is God, the subject of Jesus's prayer, and invented the idea of truth. If you have no argument that Liam is better, then Chuck is better by default because God is better than anyone, and you have not torn down my argument that Chuck Norris is God. I proved it, because Chuck is truth itself, thus everything I am saying is true. If that is a non-sequitur, it does not matter because Chuck is logic itself, and God, so he can bend the rules in my favor to win because he is just that damn awesome. \"For I know that none of that is true, and for the sake of an actual debate, I have been providing ACTUAL reasoning as to why Liam is better than Chuck.\" Where is your reasoning? You just bare-assert that Chuck is not God. That is not sufficient to tear down my argument. \"There are not different versions of Chuck. There is but one Chuck, and Liam Neeson is better than him. Anyway, why would God even want to be Chuck Norris? He has way better things to do.\" Where is your evidence that there are not different versions of chuck? \"3. Chuck Norris is not truth. He is an actor, and that is all. Therefore, Norris is not logic either, nor is he God. Simply an actor.\" Chuck Norris is truth, and a great actor. He is also logic, and God. \"4. Saying \"doy\" was uncalled for? Really? You've been saying that Chuck Norris is God. You think that ISN'T uncalled for?\" Excuse me? The above is offensive to my belief that Chuck is God. I already proved it true. Yoda said it. It cannot be false! Galdof got my back too: I got presidential approval: There is no doubt anymore. Chuck Norris is God, and thus better than Liam Neeson. Oh, and what's this?\n","DiscussionID":"00000009","Title":"Liam Neeson is better than Chuck Norris.","CrawlDate":"2016/09/29 06:29:52","URL":"http://www.debate.org/debates/Liam-Neeson-is-better-than-Chuck-Norris./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000002","PremiseStartPos":[218],"prevID":"00000000","Premise":["I believe that Liam Neeson is better than Chuck Norris. By saying better, I will prove that he is: -A better actor than Chuck Norris. -\"Tougher\" than Chuck Norrs. And anything else my opponent has to offer. First round is for acceptance. Debate will begin with my first statement in round 2. Good luck to whoever my opponent may be."],"PremiseEndPos":[551],"ArgumentID":"00000001","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000003","PremiseStartPos":[566],"prevID":"00000001","Premise":["1. The Boogie Man checks under his bed for Chuck Norris. Chuck Norris checks under his bed for Liam Neeson. Liam Neeson is practically the acting king of action. It's a shock that he hasn't been in the Expendables. Let's take a look at some of his roles: -Ra's Al Ghul: The man who trained Batman, and leads a whole league of epicly trained ninjas. (Batman Begins) -Zeus: The god of gods! (Clash of the Titans) -A guy who punches freaking wolves. (The Grey) -The man who trained Obi Wan Kenobi AND Darth Vader (Star Wars series) -This epic lion guy (Narnia series) -Spy guy who causes a whole lotta chaos to save his family. (Taken, Taken 2) -The leader of the A-Team (The A-Team) -Adolf Hitler (Hitler wasn't good, but it's just the \"power thing) (The Great War and the Shaping of the 20th Century) -A scarred vigilante. With an R rating! How exciting! (Darkman) -Jesus Christ. No literally, he played Jesus. (Pilgrim's Progress) -Oskar Schindler (Schindler's List) PLUS MANY MORE! -I await your rebuttal."],"PremiseEndPos":[1573],"ArgumentID":"00000002","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000004","PremiseStartPos":[1588],"prevID":"00000002","Premise":["Chuck Norris did not invent truth. All he invented is his own cowboy-ness. 1. You say that Jesus prays to Chuck Norris. This is obviously untrue. The only being Jesus prays to is God himself, and Norris isn't God, now is he? Also, your profile says that you are an Atheist. So why should you be bringing up Jesus if you don't think he was real/ he was the son of God? 2. Liam Neeson is good enough to not have such scary fans. Liam's fans are obviously more sane, because there are not so many \"Liam Neeson jokes\", or whatever. This proves that Neeson provides a sense of sanity and more directness to his job, enabling the ability that makes him better than Chuck, for he is still popular without all the freakiness Norris fans have. 3. Chuck has proof of fighting skills but Liam doesn't? Are you freaking kidding me? Watch some of his movies. 4. Liam Neeson is close to his 70's. Liam is 61. And about being closer to God, just because your old doesn't mean you are closer to God because you can die at any age. Plus, you're an Atheist. So why do you bring up God if you don't believe in Him? 5. There is obvious evidence that Liam can fight. Again, watch his movies. Who the heck is Sheen. And you brought up that God thing again. And I will bring up again: You're an Atheist. Oh, and you posted a picture, I'll post one, too:"],"PremiseEndPos":[2919],"ArgumentID":"00000003","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000005","PremiseStartPos":[2934],"prevID":"00000003","Premise":["1. Hahhaha. It is obviously untrue that Norris is God. God's beard is white, silly! Plus, there is proof that Chuck was born in Ryan, Oklahoma. We all know that God, the real true one, was born out of thin air. Oh wait you wouldn't know that...you're an Atheist. 2. So, I have just proven that Chuck is not God. And plus, who in the name is Liam Nielsen? It's spelled \"Neeson\". Doy. The case is still wide open, my friend."],"PremiseEndPos":[3357],"ArgumentID":"00000004","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000006","PremiseStartPos":[3372],"prevID":"00000004","Premise":["I. Look, I was just trying to have a serious debate. Then all the sudden, I get attacked by a pack of trolls. I was not wanting this to be some kind of troll/joke debate, but here I go: 1. Yes, Norris can make his beard any color he wants. Neeson can make his hair any color he wants. All you need is hair dye. Hair dye does not prove in anyway that Norris is better. And quit saying that Norris God. I know that you are an Atheist, and therefore saying things like that doesn't offend you or you don't think it offends anyone. Though, I am a Christian, and I know that there are lot of people in my religion that would be offended by this falsehood of which you keep stating. And I don't have the audacity/need to make such outrageous claims as saying that, for example, that Liam Neeson is God. Nor would I say that Neeson is the subject of Jesus's prayer, or that he invented the idea of truth. For I know that none of that is true, and for the sake of an actual debate, I have been providing ACTUAL reasoning as to why Liam is better than Chuck. 2. There are not different versions of Chuck. There is but one Chuck, and Liam Neeson is better than him. Anyway, why would God even want to be Chuck Norris? He has way better things to do. 3. Chuck Norris is not truth. He is an actor, and that is all. Therefore, Norris is not logic either, nor is he God. Simply an actor. 4. Saying \"doy\" was uncalled for? Really? You've been saying that Chuck Norris is God. You think that ISN'T uncalled for? Better watch out, Chuck."],"PremiseEndPos":[4893],"ArgumentID":"00000005","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000007","PremiseStartPos":[4908],"prevID":"00000005","Premise":["I accept."],"PremiseEndPos":[4918],"ArgumentID":"00000006","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000008","PremiseStartPos":[4933],"prevID":"00000006","Premise":["Chuck Norris invented the idea of \"truth\". Therefore, you can bet you bottom dollar that everything I am saying is true. If you think that is a non-sequitur, just remember, Chuck Norris is logic itself. Divinity Jesus prays to chuck norris Proof Of Fightning Skills Chuck Norris actually has moves (Check Video) Chuck Norris Is Old Chuck is in his 70's, this means he is closer to God than Liam because God is the oldest person there is. This alone would not give him extra powers, but he is Chuck Norris. Conclusion Jesus prays to Chuck Norris, and Chuck Norris is devine. There is evidence that Chuck can actually fight, there is no evidence that sheen can actually fight. Chuck norris is also closer to God, and God gives him powers to overcome Liam because of this? Why? Because he is Chuck Norris. I win. Why? Well, my friend Chuck has something to say..."],"PremiseEndPos":[5794],"ArgumentID":"00000007","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000009","PremiseStartPos":[5809],"prevID":"00000007","Premise":["\" 1. You say that Jesus prays to Chuck Norris. This is obviously untrue. The only being Jesus prays to is God himself, and Norris isn't God, now is he?\" YES!!! Yes he is! This is why he is better than Liam Nielsen. Case Closed."],"PremiseEndPos":[6037],"ArgumentID":"00000008","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000010","PremiseStartPos":[6052],"prevID":"00000008","Premise":["\"1. Hahhaha. It is obviously untrue that Norris is God. God's beard is white, silly!\" Chuck Norris can make his beard any color he likes, as Chuck Norris is God himself, and thus better than liam Neeson. \"Plus, there is proof that Chuck was born in Ryan, Oklahoma.\" Only that version of Chuck was born in Ryan, Oklahoma. Chuck is God and can take many forms. \"We all know that God, the real true one, was born out of thin air. Oh wait you wouldn't know that...you're an Atheist.\" Actually, Chuck Norris as a whole was not born at all. Only a version of himself began to exist in Ryan. \"2. So, I have just proven that Chuck is not God.\" Actually, my opponent has not. I proved Chuck is God. Why? Because Chuck Norris is truth itself, therefore, everything I am saying is true. If you believe that was a non-sequitur, it does not matter; Chuck Norris is logic itself, and has given me the powers to win this debate because he is Chuck Norris......Chuck Norris. \"And plus, who in the name is Liam Nielsen? It's spelled \"Neeson\". Doy.\" Yes, I made an error. However, that \"doy\" was rude and uncalled for. Thus, even if I get spelling and grammar points deducted, you will get conduct points deducted. \"The case is still wide open, my friend.\" My friend Yoda has something to say about that:"],"PremiseEndPos":[7339],"ArgumentID":"00000009","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":165,"nextID":"00000000","PremiseStartPos":[7354],"prevID":"00000009","Premise":["\" I. Look, I was just trying to have a serious debate. Then all the sudden, I get attacked by a pack of trolls. I was not wanting this to be some kind of troll/joke debate, but here I go:\" This is not a troll debate, this is a debate about Liam Neeson and Chuck Norris. When were we ever debating about trolls? \"1. Yes, Norris can make his beard any color he wants. Neeson can make his hair any color he wants. All you need is hair dye. Hair dye does not prove in anyway that Norris is better. \" I never said it did, this is a red herring. I just said that your argument that Chuck Norris cannot be God because Chuck Norris beard is brown is false. I never said this particular statement gave positive support in favor of my position. \"And quit saying that Norris God. I know that you are an Atheist, and therefore saying things like that doesn't offend you or you don't think it offends anyone. Though, I am a Christian, and I know that there are lot of people in my religion that would be offended by this falsehood of which you keep stating. \" Well, I believe that Chuck Norris is God. So, I am offended by the things above that you are saying. \"And I don't have the audacity/need to make such outrageous claims as saying that, for example, that Liam Neeson is God. Nor would I say that Neeson is the subject of Jesus's prayer, or that he invented the idea of truth.\" Well, then you admit that you lose the debate because I am claiming that Chuck is God, the subject of Jesus's prayer, and invented the idea of truth. If you have no argument that Liam is better, then Chuck is better by default because God is better than anyone, and you have not torn down my argument that Chuck Norris is God. I proved it, because Chuck is truth itself, thus everything I am saying is true. If that is a non-sequitur, it does not matter because Chuck is logic itself, and God, so he can bend the rules in my favor to win because he is just that damn awesome. \"For I know that none of that is true, and for the sake of an actual debate, I have been providing ACTUAL reasoning as to why Liam is better than Chuck.\" Where is your reasoning? You just bare-assert that Chuck is not God. That is not sufficient to tear down my argument. \"There are not different versions of Chuck. There is but one Chuck, and Liam Neeson is better than him. Anyway, why would God even want to be Chuck Norris? He has way better things to do.\" Where is your evidence that there are not different versions of chuck? \"3. Chuck Norris is not truth. He is an actor, and that is all. Therefore, Norris is not logic either, nor is he God. Simply an actor.\" Chuck Norris is truth, and a great actor. He is also logic, and God. \"4. Saying \"doy\" was uncalled for? Really? You've been saying that Chuck Norris is God. You think that ISN'T uncalled for?\" Excuse me? The above is offensive to my belief that Chuck is God. I already proved it true. Yoda said it. It cannot be false! Galdof got my back too: I got presidential approval: There is no doubt anymore. Chuck Norris is God, and thus better than Liam Neeson. Oh, and what's this?"],"PremiseEndPos":[10444],"ArgumentID":"00000010","Conclusion":"Liam Neeson is better than Chuck Norris.","PremiseStance":["Con"]}}]}