{"MetaData":{"Context":"URL: http://www.debate.org/debates/Funny-joke-contest./1/\nCrawl date: 2016/09/29 04:57:07\nDebate Topic: Funny joke contest. | Debate.org\nNumber of arguments: 10\n\n\nEvidence Pro: Jokes. Five per round. Structure: Round 1- riddles Round 2- knock knock jokes Round 3- yo mama jokes Round 4- Chuck Norris jokes Round 5- Justin Bieber jokes What's round, bounces around, and laughs a lot? A goofball! What do you call a girl who like gambling? Betty! Why did the kid fall in the mud? Because he was a dirty boy anyway! Why did the Batmobile lose a wheel? The Joker shot it, but he was aiming for Batman. Why did the itsy bitsy spider climb up the water spout? He wanted to know what being Spider-Man was like.\n\nEvidence Pro: Knock knock. Who's there? I said. I said who? I said \"knick knack!\" Knock knock. Who's there? I ASK THE QUESTIONS!!!!! Knock knock. Who's there? Nobody. Knock knock. Who's there? I'm Interrupting. I'm interupti- I'M INTERRUPTING YOU, THAT'S WHO! Knock knock. Who's there? You. You who? I'll be at the door. Your turn.\n\nEvidence Pro: Those jokes were actually funny. Here are my yo mama jokes. Yo mama is so fat that it took Satan five hours to find her ear so he could whisper in it. Yo mama is so ugly that she's so pretty that she's just ugly. Yo mama is so stupid that she tried to put her M&M's in alphabetical order. Yo mama is so dumb she's dumb. Yo mama is so smelly she doesn't have to fart to smell worse that old manure.\n\nEvidence Pro: A bulletproof vest wears Chuck Norris for protection. There are aliens. They are just waiting for Chuck Norris to die before they attack. Chuck Norris eats zombies' brains. Chuck Norris doesn't go hunting because the word \"hunting\" implies the probability of failure. Chuck Norris goes killing. There is no chin behind Chuck Norris' beard. Only another fist.\n\nEvidence Pro: What do you call a Canadian girl who can't sing? Justin Bieber. Puberty will hit Justin Bieber one day. Oh, wait, never mind. It's rude to hit girls. Justin Bieber is so overrated that this joke probably offends any female fanatic of his. Justin Bieber's voice is so high that if he was in crush 40, he would sound so much more manly. Justin Bieber is such an idiot he thinks his songs are good.\n\nEvidence Con: Hmm Riddles, ummm, Dunno M8, I'll Give it a Go?? Q: Wonder Woman went to a party, but why did everybody there think she was insane? A: She was dating the Invisible Man. Q: Why did Batman glide down to arrest the Joker using an umbrella? A: He grabbed the Mary Poppins Utility Belt by mistake. Q: A prisoner is in a concrete walled fortress with only a table in his cell, how did he get \"Out\"? A: He ran around the table until he was puffed \"Out\". Q: Name four days of this week which start with the letter \"t\"? A: Tuesday, Thursday, Today and Tomorrow. Q: Why would Spiderman accidentally getting his web stuck between his buttocks remind him of a form of conferencing? A: Webinars. Hey, that's all I can come up with @ short notice. If you laugh at any of those, you are as twisted as Moi! Over to Pro for a Knockup or two!\n\nEvidence Con: I'm really crap @ Knocker Jokes. 1: Knock Knock Who's There? Anita Anita Who? Anita Bowl Of Sugar. 2: Knock Knock. Use The Flamin Buzzer! 3: Buzz Buzz Who's There? Izzy Izzy Who? Iz ze footy on today? 4: Knock Knock Okay, Who's There? Yoda Yoda Who? Yo Door Buzzer Is Broken. 5: Knock Knock Who's There? Buzz Buzz Who? Buzzer Repair Man Thanks Pro, Over to You!\n\nEvidence Con: Hmm, never been into Yo Mama jokes, they are a bit Misogynistic and often degrading of such folk. Though, Pro's M&M one was pretty funny, Good one Pro. Don't think I can top that one. Though if I must do Yo Mama jokes, then here goes: Yo Mama is so Big that the army mistook her knickers for a ten man tent. Yo mama talks so much that she wore the ears of a garden gnome. Yo mama spends so much time putting makeup on that she wore out her mirror. Yo mama is so smelly that skunks avoid her home. Yo mama is so mean, she makes mosquitoes beg for some blood. I know, pretty lame, but well, at least I tried, over to Pro!\n\nEvidence Con: Chuck Norris went to Hell and reformed Satan. An Asteroid heading for Earth bebounded of Chuck Norris's back hair. Chuck Norris taught Jesus Christ how to walk on water. Creating the Universe Contest: God, Six Days, Chuck Norris 1 hour, including hair salon break. History got the Sinking of the Bismark wrong, it was not a torpedo it just crossed the path of Chuck Norris swimming across the English Channel.\n\nEvidence Con: Since we all know that these jokes are about Justin Bieber, I'll simply use his initials JB. Though I really don't like making jokes about JB, as I actually like the guy. I think it is just a typical reaction of very Jealous guys, wishing they had JB's position. I've got nothing to be jealous of. My life is excellent as it is. Though I've seen most of Pro's jokes b4, they are all on: I prefer as I've done before, to create my own, a bit more original, but probably not as Funny! What about Michael Jackson would JB wish to copy? Testicles removed to avoid puberty. What Zombies would target JB for destroying their living images? John Lennon and James Dean for denigrating their Hair Styles in public. Cinderella lied when she said the glass slippers were hers, Why? She was covering for JB. What is the first sign of puberty for girls? They destroy their JB collection. What is the first sign your son is gay? They want a JB collection. Here's a JB Train Wreck appearance:\n","DiscussionID":"00000048","Title":"Funny joke contest.","CrawlDate":"2016/09/29 04:57:07","URL":"http://www.debate.org/debates/Funny-joke-contest./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000002","PremiseStartPos":[176],"prevID":"00000000","Premise":["Jokes. Five per round. Structure: Round 1- riddles Round 2- knock knock jokes Round 3- yo mama jokes Round 4- Chuck Norris jokes Round 5- Justin Bieber jokes What's round, bounces around, and laughs a lot? A goofball! What do you call a girl who like gambling? Betty! Why did the kid fall in the mud? Because he was a dirty boy anyway! Why did the Batmobile lose a wheel? The Joker shot it, but he was aiming for Batman. Why did the itsy bitsy spider climb up the water spout? He wanted to know what being Spider-Man was like."],"PremiseEndPos":[703],"ArgumentID":"00000001","Conclusion":"Funny joke contest.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000003","PremiseStartPos":[718],"prevID":"00000001","Premise":["Knock knock. Who's there? I said. I said who? I said \"knick knack!\" Knock knock. Who's there? I ASK THE QUESTIONS!!!!! Knock knock. Who's there? Nobody. Knock knock. Who's there? I'm Interrupting. I'm interupti- I'M INTERRUPTING YOU, THAT'S WHO! Knock knock. Who's there? You. You who? I'll be at the door. Your turn."],"PremiseEndPos":[1036],"ArgumentID":"00000002","Conclusion":"Funny joke contest.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000004","PremiseStartPos":[1051],"prevID":"00000002","Premise":["Those jokes were actually funny. Here are my yo mama jokes. Yo mama is so fat that it took Satan five hours to find her ear so he could whisper in it. Yo mama is so ugly that she's so pretty that she's just ugly. Yo mama is so stupid that she tried to put her M&M's in alphabetical order. Yo mama is so dumb she's dumb. Yo mama is so smelly she doesn't have to fart to smell worse that old manure."],"PremiseEndPos":[1449],"ArgumentID":"00000003","Conclusion":"Funny joke contest.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000005","PremiseStartPos":[1464],"prevID":"00000003","Premise":["A bulletproof vest wears Chuck Norris for protection. There are aliens. They are just waiting for Chuck Norris to die before they attack. Chuck Norris eats zombies' brains. Chuck Norris doesn't go hunting because the word \"hunting\" implies the probability of failure. Chuck Norris goes killing. There is no chin behind Chuck Norris' beard. Only another fist."],"PremiseEndPos":[1823],"ArgumentID":"00000004","Conclusion":"Funny joke contest.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000006","PremiseStartPos":[1838],"prevID":"00000004","Premise":["What do you call a Canadian girl who can't sing? Justin Bieber. Puberty will hit Justin Bieber one day. Oh, wait, never mind. It's rude to hit girls. Justin Bieber is so overrated that this joke probably offends any female fanatic of his. Justin Bieber's voice is so high that if he was in crush 40, he would sound so much more manly. Justin Bieber is such an idiot he thinks his songs are good."],"PremiseEndPos":[2234],"ArgumentID":"00000005","Conclusion":"Funny joke contest.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000007","PremiseStartPos":[2249],"prevID":"00000005","Premise":["Hmm Riddles, ummm, Dunno M8, I'll Give it a Go?? Q: Wonder Woman went to a party, but why did everybody there think she was insane? A: She was dating the Invisible Man. Q: Why did Batman glide down to arrest the Joker using an umbrella? A: He grabbed the Mary Poppins Utility Belt by mistake. Q: A prisoner is in a concrete walled fortress with only a table in his cell, how did he get \"Out\"? A: He ran around the table until he was puffed \"Out\". Q: Name four days of this week which start with the letter \"t\"? A: Tuesday, Thursday, Today and Tomorrow. Q: Why would Spiderman accidentally getting his web stuck between his buttocks remind him of a form of conferencing? A: Webinars. Hey, that's all I can come up with @ short notice. If you laugh at any of those, you are as twisted as Moi! Over to Pro for a Knockup or two!"],"PremiseEndPos":[3074],"ArgumentID":"00000006","Conclusion":"Funny joke contest.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000008","PremiseStartPos":[3089],"prevID":"00000006","Premise":["I'm really crap @ Knocker Jokes. 1: Knock Knock Who's There? Anita Anita Who? Anita Bowl Of Sugar. 2: Knock Knock. Use The Flamin Buzzer! 3: Buzz Buzz Who's There? Izzy Izzy Who? Iz ze footy on today? 4: Knock Knock Okay, Who's There? Yoda Yoda Who? Yo Door Buzzer Is Broken. 5: Knock Knock Who's There? Buzz Buzz Who? Buzzer Repair Man Thanks Pro, Over to You!"],"PremiseEndPos":[3451],"ArgumentID":"00000007","Conclusion":"Funny joke contest.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000009","PremiseStartPos":[3466],"prevID":"00000007","Premise":["Hmm, never been into Yo Mama jokes, they are a bit Misogynistic and often degrading of such folk. Though, Pro's M&M one was pretty funny, Good one Pro. Don't think I can top that one. Though if I must do Yo Mama jokes, then here goes: Yo Mama is so Big that the army mistook her knickers for a ten man tent. Yo mama talks so much that she wore the ears of a garden gnome. Yo mama spends so much time putting makeup on that she wore out her mirror. Yo mama is so smelly that skunks avoid her home. Yo mama is so mean, she makes mosquitoes beg for some blood. I know, pretty lame, but well, at least I tried, over to Pro!"],"PremiseEndPos":[4086],"ArgumentID":"00000008","Conclusion":"Funny joke contest.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000010","PremiseStartPos":[4101],"prevID":"00000008","Premise":["Chuck Norris went to Hell and reformed Satan. An Asteroid heading for Earth bebounded of Chuck Norris's back hair. Chuck Norris taught Jesus Christ how to walk on water. Creating the Universe Contest: God, Six Days, Chuck Norris 1 hour, including hair salon break. History got the Sinking of the Bismark wrong, it was not a torpedo it just crossed the path of Chuck Norris swimming across the English Channel."],"PremiseEndPos":[4511],"ArgumentID":"00000009","Conclusion":"Funny joke contest.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":104,"ConclusionEndPos":123,"nextID":"00000000","PremiseStartPos":[4526],"prevID":"00000009","Premise":["Since we all know that these jokes are about Justin Bieber, I'll simply use his initials JB. Though I really don't like making jokes about JB, as I actually like the guy. I think it is just a typical reaction of very Jealous guys, wishing they had JB's position. I've got nothing to be jealous of. My life is excellent as it is. Though I've seen most of Pro's jokes b4, they are all on: I prefer as I've done before, to create my own, a bit more original, but probably not as Funny! What about Michael Jackson would JB wish to copy? Testicles removed to avoid puberty. What Zombies would target JB for destroying their living images? John Lennon and James Dean for denigrating their Hair Styles in public. Cinderella lied when she said the glass slippers were hers, Why? She was covering for JB. What is the first sign of puberty for girls? They destroy their JB collection. What is the first sign your son is gay? They want a JB collection. Here's a JB Train Wreck appearance:"],"PremiseEndPos":[5504],"ArgumentID":"00000010","Conclusion":"Funny joke contest.","PremiseStance":["Con"]}}]}