{"MetaData":{"Context":"URL: http://www.debate.org/debates/hilary-did-not-break-the-law-with-her-email-scandal/1/\nCrawl date: 2016/09/29 02:59:18\nDebate: hilary did not break the law with her email scandal | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: whether she could have her email be on a private server was based on guidelines only, not the law. many of her predeessers used private servers too.\n\nEvidence Pro: i guess i concede the debate\n\nEvidence Pro: kj\n\nEvidence Con: The issue with Hillary Clinton isn't whether she broke the law. It's whether anyone could get through the political forces around her. Let's start with one very significant error in your thesis: \"many of her predeessers used private servers too.\" The spelling of \"predecessor\" aside, there are a couple glaring errors here. I refer you to: First of all, there haven't been \"many\" former Secretaries of State before Hillary Clinton who used email, period. The only one that did so regularly (Colin Powell) did indeed use a private email ADDRESS. However, Mrs. Clinton did not simply use a private address, which would conform more to her claim that what she did was \"a mistake, but not illegal\". She also used a private SERVER. There is a world of difference between the two. A server is a physical item, meaning data was physically stored in it without clearance. I direct you to James Comey's report of the findings into Hillary Clinton's email practices: As well as a summary of his testimony before Congress: Among the issues at hand, the investigation revealed that Mrs. Clinton did not have permission to store State Dept. information on a private server. Referring to the earlier link, she therefore violated Title 18, Section 793(f) since she allowed the State Dept. data to be \"removed from its proper place of custody\". Mrs. Clinton also claims to have turned over all emails from her private server to authorities. Per Mr. Comey's testimony as cited above, it is \"highly likely\" that Clinton's team destroyed work-related emails rather than turning them over. That again puts her in violation of Title 18. Of course, all this is a footnote to that which is irrefutable. Mrs. Clinton testified under oath before Congress regarding this matter and according to Mr. Comey's summary of the investigation (I refer you to the above-referenced links of the official FBI statement and Mr. Comey's own testimony before Congress) Mrs. Clinton did not tell the truth. Mrs. Clinton claimed that \"all of her work-related emails were turned over\" upon request. The FBI investigation proved otherwise. Therefore Mrs. Clinton lied under oath. Her defense is going to be that she didn't know that those other emails had to be turned over (in fact, Mr. Comey's statement could be summed as essentially \"yes she broke the rules but she didn't know any better\"). Luckily, \"gross negligence\" is covered under the aforementioned Title 18, Section 793(f). There you have it. Either she did know her email system wasn't being operated properly and therefore lied to Congress making her guilty of perjury under Section 1621, or she was too incompetent to properly secure her own system, which means she violated Section 793 by allowing State Dept. property to be removed and destroyed through her negligence. Either way, she broke a law. Of course, this debate is a moot point. In all likelihood she'll win the general election in November and simply pardon herself if necessary.\n\nEvidence Con: Thank you. As I debated previously ( the question has never been whether Hillary Clinton actually broke the law. It's a matter of whether politics is allowed to take precedence over the law; whether certain individuals are above the law. Apparently the answer is yes.\n\nEvidence Con: I guess this concludes the debate\n","DiscussionID":"00000026","Title":"hilary did not break the law with her email scandal","CrawlDate":"2016/09/29 02:59:18","URL":"http://www.debate.org/debates/hilary-did-not-break-the-law-with-her-email-scandal/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":130,"ConclusionEndPos":181,"nextID":"00000002","PremiseStartPos":[233],"prevID":"00000000","Premise":["whether she could have her email be on a private server was based on guidelines only, not the law. many of her predeessers used private servers too."],"PremiseEndPos":[382],"ArgumentID":"00000001","Conclusion":"hilary did not break the law with her email scandal","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":130,"ConclusionEndPos":181,"nextID":"00000003","PremiseStartPos":[397],"prevID":"00000001","Premise":["i guess i concede the debate"],"PremiseEndPos":[426],"ArgumentID":"00000002","Conclusion":"hilary did not break the law with her email scandal","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":130,"ConclusionEndPos":181,"nextID":"00000004","PremiseStartPos":[441],"prevID":"00000002","Premise":["kj"],"PremiseEndPos":[444],"ArgumentID":"00000003","Conclusion":"hilary did not break the law with her email scandal","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":130,"ConclusionEndPos":181,"nextID":"00000005","PremiseStartPos":[459],"prevID":"00000003","Premise":["The issue with Hillary Clinton isn't whether she broke the law. It's whether anyone could get through the political forces around her. Let's start with one very significant error in your thesis: \"many of her predeessers used private servers too.\" The spelling of \"predecessor\" aside, there are a couple glaring errors here. I refer you to: First of all, there haven't been \"many\" former Secretaries of State before Hillary Clinton who used email, period. The only one that did so regularly (Colin Powell) did indeed use a private email ADDRESS. However, Mrs. Clinton did not simply use a private address, which would conform more to her claim that what she did was \"a mistake, but not illegal\". She also used a private SERVER. There is a world of difference between the two. A server is a physical item, meaning data was physically stored in it without clearance. I direct you to James Comey's report of the findings into Hillary Clinton's email practices: As well as a summary of his testimony before Congress: Among the issues at hand, the investigation revealed that Mrs. Clinton did not have permission to store State Dept. information on a private server. Referring to the earlier link, she therefore violated Title 18, Section 793(f) since she allowed the State Dept. data to be \"removed from its proper place of custody\". Mrs. Clinton also claims to have turned over all emails from her private server to authorities. Per Mr. Comey's testimony as cited above, it is \"highly likely\" that Clinton's team destroyed work-related emails rather than turning them over. That again puts her in violation of Title 18. Of course, all this is a footnote to that which is irrefutable. Mrs. Clinton testified under oath before Congress regarding this matter and according to Mr. Comey's summary of the investigation (I refer you to the above-referenced links of the official FBI statement and Mr. Comey's own testimony before Congress) Mrs. Clinton did not tell the truth. Mrs. Clinton claimed that \"all of her work-related emails were turned over\" upon request. The FBI investigation proved otherwise. Therefore Mrs. Clinton lied under oath. Her defense is going to be that she didn't know that those other emails had to be turned over (in fact, Mr. Comey's statement could be summed as essentially \"yes she broke the rules but she didn't know any better\"). Luckily, \"gross negligence\" is covered under the aforementioned Title 18, Section 793(f). There you have it. Either she did know her email system wasn't being operated properly and therefore lied to Congress making her guilty of perjury under Section 1621, or she was too incompetent to properly secure her own system, which means she violated Section 793 by allowing State Dept. property to be removed and destroyed through her negligence. Either way, she broke a law. Of course, this debate is a moot point. In all likelihood she'll win the general election in November and simply pardon herself if necessary."],"PremiseEndPos":[3424],"ArgumentID":"00000004","Conclusion":"hilary did not break the law with her email scandal","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":130,"ConclusionEndPos":181,"nextID":"00000006","PremiseStartPos":[3439],"prevID":"00000004","Premise":["Thank you. As I debated previously ( the question has never been whether Hillary Clinton actually broke the law. It's a matter of whether politics is allowed to take precedence over the law; whether certain individuals are above the law. Apparently the answer is yes."],"PremiseEndPos":[3707],"ArgumentID":"00000005","Conclusion":"hilary did not break the law with her email scandal","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":130,"ConclusionEndPos":181,"nextID":"00000000","PremiseStartPos":[3722],"prevID":"00000005","Premise":["I guess this concludes the debate"],"PremiseEndPos":[3756],"ArgumentID":"00000006","Conclusion":"hilary did not break the law with her email scandal","PremiseStance":["Con"]}}]}