{"MetaData":{"Context":"URL: http://www.debate.org/debates/I-think-that-barry-bonds-should-be-stripped-off-his-all-time-homerun-record/1/\nCrawl date: 2016/09/29 07:15:39\nDebate Argument: I think that barry bonds should be stripped off his all time homerun record | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: Barry bonds was skinny in the beggining years of his carrer and yes he was a good rookie he bulked up extremely from a twig to a giant. He used steriods to help him cheat not play but cheat. Anyone can take perfomence enhancers and do good but the ones like babe who did it with meer talent are the players who should get records. For example sammy sosa used a cork in his bat and got suspended from the game and what is the diffrence from bulking up your body or making your bat lighter. Using steriods is a way to cheat and what example is it setting to younger stars who think they cant to good unless they take steriods. Steriods are a plain cheat and anyone who cheats is never a true champion so barry bonds shouldnt get the honor of being the champion of all time homeruns\n\nEvidence Pro: In recent history barry bonds was accused of lieing in court about not taking steriods. Your getting of the subject when you say why he would risk it, no one knows only he does so basically your saying he is stupid for throwing away his carrer\n\nEvidence Con: I don't know how you are so convinced that Barry Bonds intentionally took steroids. He already had a huge contract. Why would he all of the sudden want to do a risky act that could put him in jail and kick him out of the MLB? Barry has a very good work ethic, and, I believe, he worked out for how big he is now. Therefore, there is absolutely no reason that Barry Bonds should lose his legally won record, because he did NOT use steroids.\n\nEvidence Con: I am sating he did not throw away his career. He retired when he wanted to retire. There is no way possible to tell if he lied in court. He was just ACCUSED of it. I won't believe anything till he gets his sentence, but right now he is innocent till proven guilty so BARRY BONDS SHOULD NOT BE STRIPPED OF HIS HOME RUN RECORD\n","DiscussionID":"00000073","Title":"I think that barry bonds should be stripped off his all time homerun record","CrawlDate":"2016/09/29 07:15:39","URL":"http://www.debate.org/debates/I-think-that-barry-bonds-should-be-stripped-off-his-all-time-homerun-record/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":163,"ConclusionEndPos":238,"nextID":"00000002","PremiseStartPos":[290],"prevID":"00000000","Premise":["Barry bonds was skinny in the beggining years of his carrer and yes he was a good rookie he bulked up extremely from a twig to a giant. He used steriods to help him cheat not play but cheat. Anyone can take perfomence enhancers and do good but the ones like babe who did it with meer talent are the players who should get records. For example sammy sosa used a cork in his bat and got suspended from the game and what is the diffrence from bulking up your body or making your bat lighter. Using steriods is a way to cheat and what example is it setting to younger stars who think they cant to good unless they take steriods. Steriods are a plain cheat and anyone who cheats is never a true champion so barry bonds shouldnt get the honor of being the champion of all time homeruns"],"PremiseEndPos":[1070],"ArgumentID":"00000001","Conclusion":"I think that barry bonds should be stripped off his all time homerun record","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":163,"ConclusionEndPos":238,"nextID":"00000003","PremiseStartPos":[1085],"prevID":"00000001","Premise":["In recent history barry bonds was accused of lieing in court about not taking steriods. Your getting of the subject when you say why he would risk it, no one knows only he does so basically your saying he is stupid for throwing away his carrer"],"PremiseEndPos":[1329],"ArgumentID":"00000002","Conclusion":"I think that barry bonds should be stripped off his all time homerun record","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":163,"ConclusionEndPos":238,"nextID":"00000004","PremiseStartPos":[1344],"prevID":"00000002","Premise":["I don't know how you are so convinced that Barry Bonds intentionally took steroids. He already had a huge contract. Why would he all of the sudden want to do a risky act that could put him in jail and kick him out of the MLB? Barry has a very good work ethic, and, I believe, he worked out for how big he is now. Therefore, there is absolutely no reason that Barry Bonds should lose his legally won record, because he did NOT use steroids."],"PremiseEndPos":[1784],"ArgumentID":"00000003","Conclusion":"I think that barry bonds should be stripped off his all time homerun record","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":163,"ConclusionEndPos":238,"nextID":"00000000","PremiseStartPos":[1799],"prevID":"00000003","Premise":["I am sating he did not throw away his career. He retired when he wanted to retire. There is no way possible to tell if he lied in court. He was just ACCUSED of it. I won't believe anything till he gets his sentence, but right now he is innocent till proven guilty so BARRY BONDS SHOULD NOT BE STRIPPED OF HIS HOME RUN RECORD"],"PremiseEndPos":[2124],"ArgumentID":"00000004","Conclusion":"I think that barry bonds should be stripped off his all time homerun record","PremiseStance":["Con"]}}]}