{"MetaData":{"Context":"URL: http://www.debate.org/debates/I-should-Kill-Myself/1/\nCrawl date: 2016/09/29 06:42:51\nDebate Topic: I should Kill Myself | Debate.org\nNumber of arguments: 7\n\n\nEvidence Pro: This won't necessarily decide if I kill myself or not, but I want to know reason for me to be alive. Therefore, I am saying that I should, and my opponent is saying why I shouldn't. Ok, so I know that a lot of you will automatically vote for con, saying \"oh no, you should live!\" and all that without looking at the arguments. Doing so will cause disregard towards your votebombing and I will get other debaters to countervotebomb. ONLY VOTE IF YOU READ ALL OF THE ARGUMENTS. This is still a debate, not an opinion. Vote on which arguments are better, not based on your personal opinions. Only accept if you are: 1. An active member 2. Have at least 500 forum posts 3. You must have known me prior to this debate and for a while before that Rounds: 1. Acceptance 2. Arguments (no rebuttals yet) 3. rebuttals 4. continued rebuttals and additional arguments 5. Final remarks (no more rebuttals at this point) Any breaking of these round rules will result in an immediate disqualification. I think that is all, but if there's anything I don't remember I will say it in my 2nd round or in the comments.\n\nEvidence Pro: My opponent did not read the qualifications and therefore his arguments should be ignored and disqualified. good day.\n\nEvidence Pro: hmm, forfeiting. More disqualification. I guess I win.\n\nEvidence Pro: .... I'm a dude...\n\nEvidence Pro: i win.\n\nEvidence Con: I don't care about those Qualities. You should not kill yourself. But there is a person I know that you should kill.\n\nEvidence Con: obiwanjedi forfeited this round. Pro hmm, forfeiting. More disqualification. I guess I win.\n\nEvidence Con: shut up hater!!!! why would you kill yourself in the first place? and I am not lying about that Girl\n\nEvidence Con: obiwanjedi forfeited this round. Pro i win.\n","DiscussionID":"00000063","Title":"I should Kill Myself","CrawlDate":"2016/09/29 06:42:51","URL":"http://www.debate.org/debates/I-should-Kill-Myself/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000002","PremiseStartPos":[177],"prevID":"00000000","Premise":["This won't necessarily decide if I kill myself or not, but I want to know reason for me to be alive. Therefore, I am saying that I should, and my opponent is saying why I shouldn't. Ok, so I know that a lot of you will automatically vote for con, saying \"oh no, you should live!\" and all that without looking at the arguments. Doing so will cause disregard towards your votebombing and I will get other debaters to countervotebomb. ONLY VOTE IF YOU READ ALL OF THE ARGUMENTS. This is still a debate, not an opinion. Vote on which arguments are better, not based on your personal opinions. Only accept if you are: 1. An active member 2. Have at least 500 forum posts 3. You must have known me prior to this debate and for a while before that Rounds: 1. Acceptance 2. Arguments (no rebuttals yet) 3. rebuttals 4. continued rebuttals and additional arguments 5. Final remarks (no more rebuttals at this point) Any breaking of these round rules will result in an immediate disqualification. I think that is all, but if there's anything I don't remember I will say it in my 2nd round or in the comments."],"PremiseEndPos":[1276],"ArgumentID":"00000001","Conclusion":"I should Kill Myself","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000003","PremiseStartPos":[1291],"prevID":"00000001","Premise":["My opponent did not read the qualifications and therefore his arguments should be ignored and disqualified. good day."],"PremiseEndPos":[1409],"ArgumentID":"00000002","Conclusion":"I should Kill Myself","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000004","PremiseStartPos":[1424],"prevID":"00000002","Premise":["hmm, forfeiting. More disqualification. I guess I win."],"PremiseEndPos":[1479],"ArgumentID":"00000003","Conclusion":"I should Kill Myself","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000005","PremiseStartPos":[1494],"prevID":"00000003","Premise":[".... I'm a dude..."],"PremiseEndPos":[1513],"ArgumentID":"00000004","Conclusion":"I should Kill Myself","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000006","PremiseStartPos":[1528],"prevID":"00000004","Premise":["i win."],"PremiseEndPos":[1535],"ArgumentID":"00000005","Conclusion":"I should Kill Myself","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000007","PremiseStartPos":[1550],"prevID":"00000005","Premise":["I don't care about those Qualities. You should not kill yourself. But there is a person I know that you should kill."],"PremiseEndPos":[1667],"ArgumentID":"00000006","Conclusion":"I should Kill Myself","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000008","PremiseStartPos":[1682],"prevID":"00000006","Premise":["obiwanjedi forfeited this round. Pro hmm, forfeiting. More disqualification. I guess I win."],"PremiseEndPos":[1774],"ArgumentID":"00000007","Conclusion":"I should Kill Myself","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000009","PremiseStartPos":[1789],"prevID":"00000007","Premise":["shut up hater!!!! why would you kill yourself in the first place? and I am not lying about that Girl"],"PremiseEndPos":[1890],"ArgumentID":"00000008","Conclusion":"I should Kill Myself","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":105,"ConclusionEndPos":125,"nextID":"00000000","PremiseStartPos":[1905],"prevID":"00000008","Premise":["obiwanjedi forfeited this round. Pro i win."],"PremiseEndPos":[1949],"ArgumentID":"00000009","Conclusion":"I should Kill Myself","PremiseStance":["Con"]}}]}