{"MetaData":{"Context":"URL: http://www.debate.org/debates/Socialism-and-Fascism-are-ideological-brothers./2/\nCrawl date: 2016/09/29 06:53:01\nDebate Topic: Socialism and Fascism are ideological brothers. | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: Pro Position: The ideologies of Socialism and Fascism are essentially the same. Con Position: The ideologies Socialism and Fascism are essentially different. (1) Essential \"absolutely necessary; indispensable: Discipline is essential in an army.\" To put in another form. That which makes Socialism what it is, is the same for Fascism. Structure 1. Acceptance 2. Arguments 3. Rebuttals, Defending Case 4, Conclusion Rules: Be Rational.\n\nEvidence Pro: My argument today is that Socialism and Fascism are essentially the same. Specifically, that Socialism(or Communism/Marxism) and Fascism are both derived from the same intellectual root, both hold the essential moral belief that the collective is superior to the individual and that self-sacrifice to the collective is the highest moral ideal, both reject individual rights and property rights, both require the concentration of power in the state, and the differences between Socialism and Fascism are of a non-essential nature. In order to make this view I must establish what it means to have essential similarities, and what Socialism and Fascism are essentially are. Definitions & Essential Characteristics: As mentioned above: (1) Essential \"absolutely necessary; indispensable: Discipline is essential in an army.\" A definition must identify the nature of the units, i.e., the essential characteristics without which the units would not be the kind of existents they are. Socalism- Socialist states have included: Soviet Russia, Communist China, socialist Sweden, socialist England, Cuba, North Korea, and a handful of lesser regimes. Some socialist regimes (like Sweden's and England's) were elected democratically. Some(Soviet Russia, Communist China) were the result of violent revolutions. Some were established by military coup (Cuba, Ethiopia, Vietnam) or foreign invasion (the Eastern Bloc). Some were ran by a dictator, others were not. Some were able to implement all of their goals, others were not. Some forcibly suppressed opposition and criticism, others did not. They all however have one thing essentially in common, thus the appropriate definition, (2) \"any of various economic and political theories advocating collective or governmental ownership and administration of the means of production and distribution of goods\" (2) Full Definition of SOCIALISM \"1: any of various economic and political theories advocating collective or governmental ownership and administration of the means of production and distribution of goods 2a : a system of society or group living in which there is no private property The essential characteristic of socialism is the denial of individual property rights; under socialism, the right to property (which is the right of use and disposal) is vested in “society as a whole,” i.e., in the collective, with production and distribution controlled by the state, i.e., by the government. Fascism: While the definitions above are relatively consistent no matter where you look, some of the definitions ascribed to Fascism fail to capture the essence of what it is, for example: (3)\"An authoritarian and nationalistic right-wing system of government and social organization.\" (4) \"A governmental system led by a dictator having complete power, forcibly suppressing opposition and criticism, regimenting all industry, commerce, etc., and emphasizing an aggressive nationalism and often racism.\" The misinformation and misrepresentation of political definitions have been muddied over the last century by various pressure groups. The only non-contestable for the following are \"Essential\" & \"Socialism.\" Unfortunately, no two definitions of Fascism are alike. Those offered do not concretized the principals involved with the nature of Fascism. Therefore, in order to define fascism, we must examine the particulars of the ideology and determine rediscover it's essence. Fascist states have included: Hitler's Germany, Mussolini's Italy, Peron's Argentina, Tojo's Japan, Franco's Spain, Pinochet's Chile. If we were to focus on each of these Fascist countries, we would observe that Mussolini's fascism involved belligerent nationalism. Franco's did not. Hitler's Fascism was racist. Mussolini's was not. Nationalism and racism are non-essential to fascism. Most(not all) socialist systems forcibly suppressed opposition and criticism, and while it is more consistent with fascism, fascism could exist within a country without censorship and thus is not essential to the system. What unites each of these countries into a group can be seen in a shortened definition of: \"A governmental system with strong central powers, regimenting all industry, commerce, etc.\" The main characteristic of socialism (and of communism) is public ownership of the means of production, and, therefore, the abolition of private property. The right to property is the right of use and disposal. Under fascism, men retain the semblance or pretense of private property, but the government holds total power over its use and disposal. This is their Primary difference in theory. However, in practice and principle they are one and the same. \"Both “socialism” and “fascism” involve the issue of property rights. Under socialism, there is collective ownership of property de jure. Under fascism, there is the same collective ownership de facto. The right to property is the right of use and disposal. Ownership without control is a contradiction in terms: it means “property,” without the right to use it or to dispose of it. If a person does not have the right to dispose of his property, he does not have a right to property. In practice both “socialism” and “fascism” take communal ownership of an individual's property. The Intellectual Root & Essential Similarities: Socialism/Communism emerged as a political doctrine following Rousseau, the upheaval of the French Revolution, and later French thinkers with it's major philosophical influences being from Immanuel Kant, and Hegel, both of which heavily influenced Karl Marx & Friedrich Engels. The effect of the philosophical and political beliefs of Rousseau emerged into the slogan \"Liberté, égalité, fraternité\" which culminated Robespierre's reign of terror, and the chaos that lead to Napoléon Bonaparte's bleeding of Europe, while the \"self-abnegation, self-sacrifice, and duty\" that emerged from the German philosophers added the moral backing to the later formulations of socialism/communism, and fascism alike. Sorelianism is considered to be a precursor to fascism. (5) Sorelianism refers to the advocacy or support of the ideology and thinking of French revolutionary syndicalist Georges Sorel. His social and political philosophy owed much to his reading of French Proudhon(\"Property is theft\")& German Karl Marx, and he went on to influence fascism, most notably, Benito Mussolini. The Philosophies of Kant, Hegel, Rousseau, Marx, Engels, and other notable European(primarily German) thinkers infiltrated all of the cultures of Europe and are the intellectual root of both Socialism and Fascism. This culminated into a number of absolutely essential similar concepts without which Socialism and Fascism would not exist: Morally: Collectivism, \"Collectivism is the moral stance, political philosophy, ideology, or social outlook that emphasizes the significance of groups—their identities, goals, rights, outcomes, etc.—and tends to analyze issues in those terms. Collectivism is a basic cultural element that exists as the reverse of individualism \" -wiki. Or... \"Collectivism means the subjugation of the individual to a group—whether to a race, class or state does not matter. Collectivism holds that man must be chained to collective action and collective thought for the sake of what is called “the common good.”- Ayn Rand Altruism/Self Sacrifice,(6) \"the principle or practice of unselfish concern for or devotion to the welfare of others (opposed to egoism ).\" Or more accurately…. \"The basic principle of altruism is that man has no right to exist for his own sake, that service to others is the only justification of his existence, and that self-sacrifice is his highest moral duty, virtue and value.\" In political practice: Statism: \"a political system in which the state has substantial centralized control over social and economic affairs.\" or… \"The political expression of altruism is collectivism or statism, which holds that man’s life and work belong to the state—to society, to the group, the gang, the race, the nation—and that the state may dispose of him in any way it pleases for the sake of whatever it deems to be its own tribal, collective good.\"- Rand And as stated above, The elimination of property rights/private property. A wider view: Socialism and Fascism are diffrence, however they have all of the important, esstatial traits in common. Compare those ideologies to the alturative, Capitalism a social system based on the recognition of individual rights, including property rights, in which all property is privately owned. Capitalism emerged as a political doctrine in the US and England, during the time of the American revolution, and the end of Mercantilism, with it's major philosophical influences being from Adam Smith(economic thought), John Stuart Mill(Utilitarian thought), & John Locke(Natural Rights thought), which were picked up by later British thinkers and the American founding fathers. The effect of the philosophical and political beliefs of the \"Rights of Man\"(individual rights) that emerged from the English philosophers and the right to one's \"Life, Liberty and the pursuit of Happiness\" show a very stark contrast between these worlds. In contrast, the differences between socialism and fascism become trivial, and superficial. Without Collectivism, Altruism/Self Sacrifice, an all powerful state, and the abrigation of property rights-neither Socialism or Fascism could exist, and thus are ideological brothers. \"I have learned a great deal from Marxism, as I do not hesitate to admit. The difference between them and myself is that I have really put into practice what these peddlers and penpushers have timidly begun...I had only to develop logically what Social Democracy repeatedly failed in because of its attempt to realize its evolution within the framework of democracy. National Socialism is what Marxism might have been if it could have broken its absurd and artificial ties with the democratic order.\"-(Hitler to Rauschning, The Voice of Destruction, pg. 186).\n\nEvidence Pro: Well, we were supposed to hold rebuttals till round 3, but it's too late now. Do remember that the argument is 'The ideologies of Socialism and Fascism are essentially the same.', this establishes that they are different superficially, but fundamentally the same. You are right to list my main points being: 1) \"both derived from the same intellectual root\" 2) \"both hold the essential moral belief that the collective is superior to the individual\" 3) \"both reject individual rights and property rights\" 4) \"both require the concentration of power in the state\" You did leave out #5, being \"Both are built on a morality of Altruism/Self Sacrifice.\" I will first address your rebuttals to my 'essentially similar' argument, and the rebut your new point on how they are different. You countered, points 1, 3 & 4., but did not counter 2 and 5. That is, the argument that Socialism and Fascism are built on the moral foundation of collectivism & altruism remain uncontested. #1) You argument against them being of the same intellectual root is based solely on them being established in different countries. This is however irrelevant to my point. American's political philosophy has it's intellectual roots in John Locke and other English philosophers. While Fascism may have gotten political start in Italy, it's intellectual roots are the same birthplace as socialism & communism, the philosophers of France and Germany. You also make the point that Socialists and Fascists were at odds, however this is irrelevant to them being essentially similar or dissimilar. The exact same could be said for socialists and communists being at odds. #3) You argument against them both rejecting individual rights and property rights is that capitalism is at the core of fascist ideology, however nothing could be further from the truth. Capitalism is a social system based on the recognition of individual rights, including property rights, in which all property is privately owned. The recognition of individual rights entails the banishment of physical force from human relationships: basically, rights can be violated only by means of force. In a capitalist society, no man or group may initiate the use of physical force against others. The only function of the government, in such a society, is the task of protecting man’s rights, i.e., the task of protecting him from physical force; the government acts as the agent of man’s right of self-defense, and may use force only in retaliation and only against those who initiate its use. In this sense, Capitalism in relation to the market is the separation of state and economics. Fascism is the exact opposite of this. Fascism is, quoting Mussolini, \"The merger of corporate and government power.\" Without property rights, Capitalism does not exist. The right to property is the right to gain, to keep, to use and to dispose of material values. As I stated in round 1, \"Both “socialism” and “fascism” involve the issue of property rights. The right to property is the right of use and disposal. Observe the difference in those two theories: socialism negates private property rights altogether, and advocates “the vesting of ownership and control” in the community as a whole, i.e., in the state; fascism leaves ownership in the hands of private individuals, but transfers control of the property to the government. Ownership without control is a contradiction in terms: it means “property,” without the right to use it or to dispose of it. It means that the citizens retain the responsibility of holding property, without any of its advantages, while the government acquires all the advantages without any of the responsibility. “[W]e will do what we like with the bourgeoisie. … We give the orders; they do what they are told. Any resistance will be broken ruthlessly.”—Adolf Hitler, interview with Breiting, p. 36. In this respect, socialism is the more honest of the two theories. I say “more honest,” not “better”—because, in practice, there is no difference between them: both come from the same collectivist-statist principle, both negate individual rights and subordinate the individual to the collective, both deliver the livelihood and the lives of the citizens into the power of an omnipotent government. #4) As for \"socialism as an ideology does not necessitate a centralized totalitarian state\", there is no historical evidence you can provide to make this claim. As you yourself admit, historically, all socialist and fascist states ever to have existed required centralized totalitarian authority. Marx's view of a stateless society not only never existed, but I believe is impossible to exist. I will argue the theoretical case though and insist that it is 'in principle' the authoritarian state is a fundamental requirement. This is due to the nature of government itself. A government holds a legal monopoly on the use of physical force. As such, a government to only acts in retaliation to force, as with capitalism, has a very limited scope. However in order to take, command, and regulate the property and lives of others requires and all powerful, all-encompassing state. Now to your main position: \"The most important of which, is that fascism is on the far-right, while socialism is on the hard left to far-right. \" I claim that this is not only a false dichotomy, but that the Left-right spectrum is NEVER defined, the definitions differ depending where you look, and that the ONLY dichotomy that exists is (More Freedom / Less Freedom.) As i mentioned in round one, A definition must identify the nature of the units, i.e., the essential characteristics without which the units would not be the kind of existents they are. The Left-right spectrum fails horribly at this. For example, note that on the left you have Communism, and socialism, while on the right you have Fascism and Capitalism. However, as stated above you could not have two more opposite systems than Fascism and Capitalism. Capitalism is built on the moral premise of natural individual rights. That no entity (another individual, another group, one's own government, another government) has the right to violate the individual's rights. As such the individual is an end in himself and has the right to seek his own happiness as long as he does not violate the life, liberty, or property of another. As such the government's only role is strictly limited to the protection of such rights. Fascism is built on the moral premise that the Collective(nation, race, etc) is sovereign. That the individual only exists to serve the collective and that the group may do whatever it wishes to him, to serve it's interest and the individual is urged or forced to sacrifice himself to the group. As such the government has a blank check on what it can do and grows in power. This is often embodied as a single person steps up to be the 'voice of the people.' the solidifying a strong, central, authoritarian state. Since it is clear that the same above is true for socialism/communism as it is fascism, and that Capitalism is in every way fundamentally different… It becomes clear that the Left-right spectrum is a false dichotomy. “Anti-individualistic, the Fascist conception of life stresses the importance of the State and accepts the individual only insofar as his interests as he coincides with those of the State … . It is opposed to classical liberalism which arose as a reaction to absolutism and exhausted its historical function when the State became the expression of the conscience and will of the people. Liberalism denied the State in the name of the individual; Fascism reasserts the rights of the State as expressing the real essence of the individual … Thus understood, Fascism is totalitarian, and the Fascist State—a synthesis and a unit inclusive of all values—interprets, develops, and potentiates the whole life of a people.” “The Fascist State, as a higher and more powerful expression of personality, is a force, but a spiritual one. It sums up all the manifestations of the moral and intellectual life of man. Its functions cannot therefore be limited to those of enforcing order and keeping the peace, as the liberal doctrine had it.” —Benito Mussolini, “The Doctrine of Fascism: Fundamental Ideas,” in Delzell, ed., 1970, pp. 93-94, 95. ----------------- i) \"I have to ask you, on what planet was Francisco Franco not nationalist?\" I didn't say that. You read past the word 'belligerent'. As in you cannot say all fascist states go around invading their neighbors. ii & iii) This discussion would FAR exceed the 10,000 character limit. That being said, I would love to have it with you. I will just say briefly that the state's only property role in regards to property rights, are their protection. I think we both would agree with that a fascist state like in Germany violated property rights in your Jewish example. iv) Agreed on the quote, I did throw that Hitler quote in quite casually at the last minute.)\n\nEvidence Pro: This is the Conclusion round, therefore I will try and limit any rebuttal and then summarize my case. Rebuttals: >>\" The roots of fascism do not come from French philosophers or German philosophers, it largely comes from the political implications of the First World War as it had affected Italy\" - Con This is absolutely not true. Even the Wikipedia page on Fascism's development plainly spells it out: \"The ideological roots of fascism have been traced to the 1880s, and in particular the fin de siècle theme of that time.[21][22] The theme was based on revolt against materialism, rationalism, positivism, bourgeois society and liberal democracy.\".. \"During the Enlightenment, a number of ideological influences arose that would shape the development of fascism… Another major influence on fascism came from the political theories of Georg Wilhelm Friedrich Hegel.[4] Hegel promoted the absolute authority of the state.[4] Hegel promoted a powerful state and said \"nothing short of the state is the actualization of freedom\" and that the \"state is the march of God on earth\".[14]\" - Sadly, the Wiki leaves out the huge influence of Nietzsche on Nazi Fascism which I think is very important. (The Nazis often cited Nietzsche as one of their philosophical precursors.) Yes, I am aware there are other influences, however if we were to list every minor influence from every single idea then we would be here for years. It is well established that the ESSENTIAL and most important influences on American thought during revolution came from the ideas of Locke. That being said, the Ancient Greek philosophers are an important topic in the discussion, but only as far as to point out that the primary influences were Aristotle and Plato, and that Aristotle had a greater influence on England and America, while Plato had a greater influence on France, Italy, and Germany. >>\"I know of no capitalist system that you describe. In every country where capitalism persists, there is a government that owns property.\" - Con I am speaking of Capitalist Ideology. No, there exists no full laissez-faire capitalism society. The closest to it has been the US and England in the late 19th century. We are a mixed economy, i.e., a mixture of capitalism and statism, of freedom and controls. The west is predominantly Capitalist, but as you yourself point out, not fully so. This does not change the fact that Capitalism is a social system based on the recognition of individual rights, including property rights, in which all property is privately owned. This does not change the fact that it's principles of individual rights and private property are in direct opposition to Fascism's collectivism and state intervention. >>\"Again, private property existed in fascist countries. It was not communally owned. It was not owned by the government. It was however an authoritarian system that did own parts of the economy and could requisition private property as they pleased, but until such time their property was privately owned.\"-con The institution of private property, in the full, legal meaning of the term means the RIGHT to obtain, possess, use, and dispose of property, IE control. Again, for the 3rd time(without rebuttal), Ownership without control is a contradiction in terms: it means “property,” without the right to use it or to dispose of it. If a person does not have the right to dispose of his property, he does not have a right to property. Similarly, one could not say that an American Slave had the right to his life and liberty, and that the southern states and slave owners merely \"requisitioned\" their actions \"as they pleased\". \"It does not mean that all these concerns must necessarily be socialised, merely that they can be socialised if they transgress against the interests of the nation. So long as they do not do that, it would, of course, be criminal to upset the economy. . . . I want everyone to keep what he has earned subject to the principle that the good of the community takes priority over that of the individual. But the State should retain control; every owner should feel himself to be an agent of the State; it is his duty not to misuse his possessions to the detriment of the State or the interests of his fellow-countrymen. That is the overriding point. The [State] will always retain the right to control property owners. . . . \" - Quoted in Edouard Calic in Unmasked. Two Confidential Interviews with Hitler in 1931, translated by R. H. Barry (London: Chatto & Windus, 1971), pp. 31–33, 86 Conclusion: Again, the argument is that Socialism and Fascism are essentially the same. Essential similarities and differences are the absolutely necessary, indispensable characteristics of a concept, or in this case an ideology. Yes, fascism and socialism are different. This is not the debate. The absolutely necessary, indispensable characteristics of both Socialism and Fascism are: Collectivism, Altruism/Self Sacrifice, the abrogation of property rights, and Statism. Between a Socialist and a Fascist there is no argument for these issues, their premises are the same. The principle to both is that the Individual must sacrifice to the group or else. Which group one must sacrifice to is the only question. The Nation? The Race? The proletariat? How will they make this possible? The Fascist demands that you sacrifice to the group and follow it's needs and demands, else they will nationalize your property. The Socialist leaves out the 'or else', and simply nationalizes your property for the good of the group. Thus far, all of my points for the essential similarities of Socialism and Fascism stand, 1) \"both hold the essential moral belief that the collective is superior to the individual\" 2) \"both reject individual rights and property rights\" 3) \"both require the concentration of power in the state\" 4) \"both are built on a morality of Altruism/Self Sacrifice.\" These are the absolutely essential similar concepts without which Socialism and Fascism would not exist. Only one of which(property) was challenged by con. Con could have challenged the other similarities as being untrue, or as unessential, but he did neither. Further, these are also starkly differentiated from Capitalsm which: 1) Holds the individual is sovereign. 2) Protects the rights of the individual, including property rights. 3) Requires the restraint and restriction of government power.(limited government) 4) Declairs that you have the right to the pursuit of your own happiness. Con's only claim that Socialism and Fascism are essentially diffrent is based solely on the Left-right spectrum which traditionally places Fascism on the right and socalism on the left. I believe by arguing the actual essential concepts and principles that are the basis of both systems, I have proven my case. You be the judge.\n\nEvidence Con: I accept. I assert that socialism and fascism are broad terms, which could have some similarities in some cases, and almost no similarities at all in most other cases.\n\nEvidence Con: I would like to thank my opponent for giving me a lot to cover here, which I will try to do in less than 10,000 characters. Firstly, a list of assertions that my opponent makes. 1) \"both derived from the same intellectual root\" 2) \"both hold the essential moral belief that the collective is superior to the individual\" 3) \"both reject individual rights and property rights\" 4) \"both require the concentration of power in the state\" I would now like to define socialism and fascism. Fascism: an authoritarian, hierarchical and nationalistic system of government and social organisation. Socialism: a social and economic system characterised by social ownership of the means of production. From the very start, there are major and clear difference which are all worthy of their own analysis. The most important of which, is that fascism is on the far-right, while socialism is on the hard left to far-right. This means that fascism advocates for a strictly hierarchical system of society, orchestrated by an absolutely strong authoritarian government, which puts this ideology at the far end of the right wing. Socialism on the other hand advocates for a completely unhierarchical system of society, to the point where society is owned by the workers as a whole, without any such hierarchical private property. Because the extents of socialism can differ in being democratic, undemocratic, totalitarian or even anarchist, this places socialism anywhere between the far-left and the hard left, depending on the circumstances of the socialism. Secondly, fascism and socialism have fundamentally different origins. The origins of active fascism were created almost exclusively in early-20th century Italy, drawing from ideas of philosphers in the past century from around Europe. Early Italian fascism has often been described as being formed in direct opposotion to the Italian socialists, particularly due to fascism's interventionism in the First World War, while the socialists were opposed due to their strong sense of internationalism. However, the two sides became even more polarised after the result of the Russian Revolution, where the strong elements of socialism praised the Bolshevik takeover of Russia, while fascism was fundamentally against Lenin's rise. In fact, this lead Mussolini and other fascists to campaign themselves explicitly as anti-Marxists and anti-communists, in the years after the First World War. Thirdly, although socialism can be characterised as a rejection of capitalism and its values, fascism is not simply a rejection. At it's core of ideology, Marxist socialism is strongly opposed to the notion of private property, while fascism strongly supports the concept of private property and market forces. They both had major criticisms of the bourgeois capitalist systems that had developed in Europe, but fascism was very comfortable to keep capitalists owning factories and workers having to work for wages. Socialism on the hand was a direct attempt in reversing this hierarchy, by empowering the workers to rise up and own the factories. Fourthly, socialism as an ideology does not necessitate a centralised totalitarian state. While it's true that all Marxist-Leninist and Maoist regimes in recorded history have been authoritarian and demanded authoritarianism, socialism is not necessarily authoritarian while fascism requires a totalitarian state in every possible way. There are many forms of socialism which not only don't require totalitarianism, they are ideologically opposed to it. These are all fairly similar, with names such as libertarian socialism, anarchist communism, anarchist syndicalism, anarchist mutualism and libertarian communism. For the sake of simplicity, I will be referring to all of these broadly as anarchist socialism. The social ownership of the means of production can be theorised in a purely state-free way, as well as some notion of democratic socialism when applied to a social ideology instead of purely an economic theory. Then in your arguments, you make a few strange claims. i) \" Mussolini's fascism involved belligerent nationalism. Franco's did not.\" I have to ask you, on what planet was Francisco Franco not nationalist? You only have to go as far as the third paragraph of his Wikipedia article [1] to see; \" Franco's ultranationalist faction received military support from several fascist groups, most notably from Nazi Germany and the Kingdom of Italy, while the Republican side was supported by Spanish communists and anarchists.\" As far as Franco goes, we only have to look at what Spanish nationalism includes. Most notably, it is the unity of Spain in contrast to the nationalist movements of Catalonia and Basque in particular, as well as other autonomist movements throughout Spain. ii) \" Under fascism, men retain the semblance or pretense of private property, but the government holds total power over its use and disposal.\" As property rights are a social construct, they have required and continue to require a state to uphold and enforce their principles. Fascism is no exception to this, although it is marked by an interventionist state to maintain a hierarchy. Throughout the Third Reich for example, wealthy industrialists still had all the functions of their ownership over their assets. In fact, it was often even easier to do so because of fascism's removal of trade unions and revolutionary proletariat agitators. The state's control over industry was essentially to enforce that hierarchy, most notably in removing Jewish owners of businesses. Saying that fascism is essentially against property rights is really just an arbitrary statement. You might as well apply it to any other major capitalist country, such as the United States, the United Kingdom or Germany, since the government has the power to intervene in the state and pass laws that controls commerce. You could still own a business in Nazi Germany. You simply couldn't in the Soviet Union with Stalin. iii) \" Socialism/Communism emerged as a political doctrine following Rousseau, the upheaval of the French Revolution [...] Robespierre's reign of terror\" I think there is a fundamental misunderstanding among many people over the basic events of the French Revolution. The works of those now referred to as the Enlightment thinkers such as Voltaire, Rousseau, Montesqieu, Descartes and others were largely written well before the French Revolution. Initially, the French Revolution seemed to be a more simple popular uprising that brought promise of constitutional monarchy, which ended with the radicalisation of the Montagnards political clubs, and the Parisian proletariat, then called the sans-culottes. Contrary to popular misconception, this was not a revolution of arbitrary totalitarianism from the start. Furthermore, the ideas of Marxism are distinct from those of the Enlightenment thinkers. Of course the thinkers of the 18th century were influential to Marx, they were influential to virtually every philosopher of the 19th century. They just weren't particularly influential to Marx and Engels as they were to other thinkers. In fact, earlier forms of socialist ideology that predate Marx's famous works have a greater influence from these French philosophers. iv) \" I have learned a great deal from Marxism, as I do not hesitate to admit. The difference between them and myself is that I have really put into practice what these peddlers and penpushers have timidly begun...I had only to develop logically what Social Democracy repeatedly failed in because of its attempt to realize its evolution within the framework of democracy. National Socialism is what Marxism might have been if it could have broken its absurd and artificial ties with the democratic order.\" This may be my most important paragraph, because I am asking you to withdraw this quote that you have used. You have tried to characterise Hitler as being intrinsically inspired from the works of Marx, despite his very first victims being Marxists and communists. However, you are relying on a quote from Hermann Rauschning, a conservative German politician who was a member of the Nazi Party before emigrating to the United States in 1936. [2] You are quoting from Hitler Speaks (known as Voice of Destruction in US copies), where Rauschning attempts to write down conversations that he had with Hitler. At best the historical accuracy of this work is debateable, and at worst it is downright discarded from any meaningful historical use into research about the Third Reich. It is believed that Rauschning only met Hitler a few times and not in private, leading the consensus of historians to believe that the quotes attributed to Hitler are mostly fabrications. I am certainly not accusing you of being purposefully misleading to the readers of this debate, but this is a very misleading quote that you are using and so I ask you, with great respect, to withdraw it. [Provisional sources for two people featured in this round.] [1] [2]\n\nEvidence Con: Firstly, fascism and socialism are still intellectually different. The roots of fascism do not come from French philosophers or German philosophers, it largely comes from the political implications of the First World War as it had affected Italy. That being said, the philosophical ideas of the American Revolution were not just from English philosophers, but also from Scottish and French philosophers largely, and it can even be said that they were influenced by Ancient Greek philosophers. It's a red herring to say that fascists and socialists have the same philosophers, because it's simply a misunderstanding. The only way in which we can accept they come from the same ideas is saying that every single political ideology came from the same influential philosophers of Europe. It's not as if the line of descendancy for these ideologies is purely vertical, passed on down from every generation where fascism and socialism happen to have the same ancestry, but every political ideology that was developed in the Western world has the same ancestry, even if Rene Descartes or John Stuart Mill would disagree with either fascism or socialism or capitalism. If you want to say there are birthplaces, then the births of socialism and fascism are very much distinct. >> Capitalism is a social system based on the recognition of individual rights, including property rights, in which all property is privately owned. I know of no capitalist system that you describe. In every country where capitalism persists, there is a government that owns property. One thing distinct to capitalism is the idea of free markets, which fascist ideologies kept in place as a means of their economy. That is contrasted with socialism which were centrally planned economies. Fascism has no such central planning, and just because you see fascism as evil, does not mean that it is the exact opposite of capitalism. There are similarities and elements of each ideology pervasive in other ideologies, but \"capitalism\" is simply a word that is too broad, especially when there is so much overlap between capitalism and many socialists. >> The only function of the government, in such a society, is the task of protecting man’s rights Most governments of definitely capitalist countries are ones that actively intervene in the country's economy. Only a free market fundamentalist would think that free markets can only happen without government involvement. >> property rights Again, private property existed in fascist countries. It was not communally owned. It was not owned by the government. It was however an authoritarian system that did own parts of the economy and could requisition private property as they pleased, but until such time their property was privately owned. That is a massive contrast to socialism where by default the property is owned by society. >> Marx's view of a stateless society not only never existed, but I believe is impossible to exist. Of course it is impossible to exist, but the ideology exists. That's only as far as governments though, since socialism doesn't only have to be a government policy. It can be something like Mon dragon, a large manufacturing company in Spain, which is operated by its workers who are also collectively its owners, who elect the board of executives. This is the largest example of a worker's co-operative, and is very much both socialist and capitalist. Socialist in the way that the workers, but not a government, own the means of production. Even when we acknowledge that every socialist state was authoritarian, we must acknowledge that fascism has no room for anarchistic societies in its ideology, contrary to socialism. >> I claim that this is not only a false dichotomy, but that the Left-right spectrum is NEVER defined, the definitions differ depending where you look, and that the ONLY dichotomy that exists is (More Freedom / Less Freedom.) There is a left-right spectrum. It is defined. The only way that the only dichotomy can be between more freedom and less freedom is simply an American-centric view of politics and not even one that is endorsed by mainstream political science in the United States anyway. For anybody unfamiliar with the particulars of the left-right spectrum, I will explain it like this. The left-right spectrum describes heirarchies. On the far left, which we will use communism as an example, we see that everybody is forced to be made equal in the hope that this will create a utopian society. On the far right, which we will use fascism as an example, we see that people are subjugted into different groups to the extreme, with some people being exterminated for being in the wrong group, some people being idolised, others being the rightful property owners, etc. In the centre-right and the centre-left, we see the same. The centre-left in general wants to take from those who are richer and give to those who are poorer. Making a more equal society which they see as beneficial, but by no means confiscating all land and wealth like communists. On the centre-right, we see the opposite, with wanting the rich to keep more of their wealth which they see as more beneficial, but they are certainly not going to fascist extremes where the poor are deemed unworthy of living. The existance of the left-right spectrum is not a matter for debate, as it is something that most definitely exists in political science. Of course politics is more complicated than a line, but the line exists, and it is useful, especially in this case. The line has nothing to do with how involved a government is or how much freedom a person has, the line is a line of hierarchies. It's a complete fallacy to pretend that the only real dichotomy is between freedom, since the political situation of the United States simply cannot be generalised onto the entire world. This completely fabricated dichotomy only favours the right wing of the United States, since it places the left closer to fascism and communism. >> Francisco Franco Franco was ultra-nationalist, and belligerently so. You only have to look at the nationalities of Catalonia, Anadalusia, Valencia, Basque, Galicia and others to see the brutality and belligerency of Franco's nationalism. >> I will just say briefly that the state's only property role in regards to property rights, are their protection. Again, I know of no government in the world that limits their role to laissez faire capitalism. Instead, most governments advocate a form of mixed market capitalism that includes a welfare state of differing strength, labour and consumer protections, and government involvement in an economy where it is deemed suitable. I hate to break it to you, but this also includes not only your country, but the opinion of even those in your country who would identify as right wing, it's only a matter of extent. [I'm in quite a hurry today so I will post my sources and quotes for this round on my next round.]\n\nEvidence Con: While Pro is right to point out that fascism had some basis in philosophy from past decades and centuries, the beginning of fascism was still mostly due to the political nature of Italy during and after World War I, particularly with Mussolini's defiance of the Italian socialists. This is a major contrast to socialism which has a number of different origins, such as the modern trade unionist movement from the latter 19th century United Kingdom, the origins of Marxism unsurprisingly by a German philosopher Karl Marx, and the Bolshevism and Leninism of Russia in the early 20th century. If we were really to say that socialism and fascism were ideologically similar due to their creators being inspired by the same philosophers, which itself is not really true, then we would have to include virtually every other political and economic ideology as a branch growing from the same tree. The main purpose for Pro to categorise socialism and fascism as essentially identical, which he essentially admits, is in promotion of capitalism. However, this is not the capitalism that the people of capitalist countries would recognise, but rather laissez-faire capitalism where the government has an almost non-existent role in the economy and in the economic and social protection of its citizenry. Every single capitalist country includes a government that has some level of significant economic intervention, which is necessary to maintain economic growth and prevent financial collapse. Pro rightly described fascism as also including such state intervention, but omits the fact that socialism does not depend on state intervention either. While many famous cases of socialism are indeed authoritarian, as the Soviet Union comes to mind, socialist ideology is open to the anarchist tradition, where the means of production are owned collectively by the workers without a state or a very limited state. Even the end goal of communism was always to achieve a stateless society, even if this was never actually achieved. This is one of the major differences between fascism and socialism. Although not greatly touched upon by Pro, it is important to mention that another key difference between fascism and socialism is nationalism versus internationalism. Fascism, by definition, stresses nationalism to the detriment against other nationalities. This is quite apparent from the Third Reich in Germany and the rise of Franco in Spain. Both are characterised with violence against other nationalities, and opposition from nationalities. Socialism on the other hand stresses the opposite, internationalism. This is the fundamental belief that all of the proletariat and workers of the world are one entity who are pointlessly divided by ethnicity and nationality. In the words of Marx, \"workers of the world, unite\". Private property existed in all fascist economies, as a fundamental principle of fascism. These countries adopted mixed market policies where governments would own substantial parts of the economy, but that the means of production would be owned by private individuals, usually those who were sympathetic to the political party that dictated the country. Although the fascist governments had a significant role in the economy, it was still the factory owners who decided what their expenses were, what their outputs were, who they would employ, how they would direct labour, and who would ultimately receive the profits. Unlike a socialist economy, which with a state is a centrally planned economy, but is always one where the means of production are owned socially and certainly not for the gain of a bourgeoisie class. Finally, the differences of fascism and socialism are evident in their opposite locations on the political spectrum. Fascism being at the far-right, and socialism being at the far-left to hard left depending on the particular model. The left-right spectrum is one that does not measure government involvement or personal liberties, but the hierarchical nature of an ideology. In socialism, the hierarchies are non-existant, where all workers are made to be equal and entrepreneurs are punished for aspiring to achieve more for themselves. In fascism, hierarchy not only exists but is encouraged by the state, where people are subjugated into different categories of society, from being the idolised group, to being an exterminated group. These are the points which form the main summary for my assertion that fascism and socialism are essentially and fundamentally distinct from each other. I would like to thank my opponent for this debate and for this opportunity.\n","DiscussionID":"00000096","Title":"Socialism and Fascism are ideological brothers.","CrawlDate":"2016/09/29 06:53:01","URL":"http://www.debate.org/debates/Socialism-and-Fascism-are-ideological-brothers./2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":179,"nextID":"00000002","PremiseStartPos":[231],"prevID":"00000000","Premise":["Pro Position: The ideologies of Socialism and Fascism are essentially the same. Con Position: The ideologies Socialism and Fascism are essentially different. (1) Essential \"absolutely necessary; indispensable: Discipline is essential in an army.\" To put in another form. That which makes Socialism what it is, is the same for Fascism. Structure 1. Acceptance 2. Arguments 3. Rebuttals, Defending Case 4, Conclusion Rules: Be Rational."],"PremiseEndPos":[666],"ArgumentID":"00000001","Conclusion":"Socialism and Fascism are ideological brothers.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":179,"nextID":"00000003","PremiseStartPos":[681],"prevID":"00000001","Premise":["My argument today is that Socialism and Fascism are essentially the same. Specifically, that Socialism(or Communism/Marxism) and Fascism are both derived from the same intellectual root, both hold the essential moral belief that the collective is superior to the individual and that self-sacrifice to the collective is the highest moral ideal, both reject individual rights and property rights, both require the concentration of power in the state, and the differences between Socialism and Fascism are of a non-essential nature. In order to make this view I must establish what it means to have essential similarities, and what Socialism and Fascism are essentially are. Definitions & Essential Characteristics: As mentioned above: (1) Essential \"absolutely necessary; indispensable: Discipline is essential in an army.\" A definition must identify the nature of the units, i.e., the essential characteristics without which the units would not be the kind of existents they are. Socalism- Socialist states have included: Soviet Russia, Communist China, socialist Sweden, socialist England, Cuba, North Korea, and a handful of lesser regimes. Some socialist regimes (like Sweden's and England's) were elected democratically. Some(Soviet Russia, Communist China) were the result of violent revolutions. Some were established by military coup (Cuba, Ethiopia, Vietnam) or foreign invasion (the Eastern Bloc). Some were ran by a dictator, others were not. Some were able to implement all of their goals, others were not. Some forcibly suppressed opposition and criticism, others did not. They all however have one thing essentially in common, thus the appropriate definition, (2) \"any of various economic and political theories advocating collective or governmental ownership and administration of the means of production and distribution of goods\" (2) Full Definition of SOCIALISM \"1: any of various economic and political theories advocating collective or governmental ownership and administration of the means of production and distribution of goods 2a : a system of society or group living in which there is no private property The essential characteristic of socialism is the denial of individual property rights; under socialism, the right to property (which is the right of use and disposal) is vested in “society as a whole,” i.e., in the collective, with production and distribution controlled by the state, i.e., by the government. Fascism: While the definitions above are relatively consistent no matter where you look, some of the definitions ascribed to Fascism fail to capture the essence of what it is, for example: (3)\"An authoritarian and nationalistic right-wing system of government and social organization.\" (4) \"A governmental system led by a dictator having complete power, forcibly suppressing opposition and criticism, regimenting all industry, commerce, etc., and emphasizing an aggressive nationalism and often racism.\" The misinformation and misrepresentation of political definitions have been muddied over the last century by various pressure groups. The only non-contestable for the following are \"Essential\" & \"Socialism.\" Unfortunately, no two definitions of Fascism are alike. Those offered do not concretized the principals involved with the nature of Fascism. Therefore, in order to define fascism, we must examine the particulars of the ideology and determine rediscover it's essence. Fascist states have included: Hitler's Germany, Mussolini's Italy, Peron's Argentina, Tojo's Japan, Franco's Spain, Pinochet's Chile. If we were to focus on each of these Fascist countries, we would observe that Mussolini's fascism involved belligerent nationalism. Franco's did not. Hitler's Fascism was racist. Mussolini's was not. Nationalism and racism are non-essential to fascism. Most(not all) socialist systems forcibly suppressed opposition and criticism, and while it is more consistent with fascism, fascism could exist within a country without censorship and thus is not essential to the system. What unites each of these countries into a group can be seen in a shortened definition of: \"A governmental system with strong central powers, regimenting all industry, commerce, etc.\" The main characteristic of socialism (and of communism) is public ownership of the means of production, and, therefore, the abolition of private property. The right to property is the right of use and disposal. Under fascism, men retain the semblance or pretense of private property, but the government holds total power over its use and disposal. This is their Primary difference in theory. However, in practice and principle they are one and the same. \"Both “socialism” and “fascism” involve the issue of property rights. Under socialism, there is collective ownership of property de jure. Under fascism, there is the same collective ownership de facto. The right to property is the right of use and disposal. Ownership without control is a contradiction in terms: it means “property,” without the right to use it or to dispose of it. If a person does not have the right to dispose of his property, he does not have a right to property. In practice both “socialism” and “fascism” take communal ownership of an individual's property. The Intellectual Root & Essential Similarities: Socialism/Communism emerged as a political doctrine following Rousseau, the upheaval of the French Revolution, and later French thinkers with it's major philosophical influences being from Immanuel Kant, and Hegel, both of which heavily influenced Karl Marx & Friedrich Engels. The effect of the philosophical and political beliefs of Rousseau emerged into the slogan \"Liberté, égalité, fraternité\" which culminated Robespierre's reign of terror, and the chaos that lead to Napoléon Bonaparte's bleeding of Europe, while the \"self-abnegation, self-sacrifice, and duty\" that emerged from the German philosophers added the moral backing to the later formulations of socialism/communism, and fascism alike. Sorelianism is considered to be a precursor to fascism. (5) Sorelianism refers to the advocacy or support of the ideology and thinking of French revolutionary syndicalist Georges Sorel. His social and political philosophy owed much to his reading of French Proudhon(\"Property is theft\")& German Karl Marx, and he went on to influence fascism, most notably, Benito Mussolini. The Philosophies of Kant, Hegel, Rousseau, Marx, Engels, and other notable European(primarily German) thinkers infiltrated all of the cultures of Europe and are the intellectual root of both Socialism and Fascism. This culminated into a number of absolutely essential similar concepts without which Socialism and Fascism would not exist: Morally: Collectivism, \"Collectivism is the moral stance, political philosophy, ideology, or social outlook that emphasizes the significance of groups—their identities, goals, rights, outcomes, etc.—and tends to analyze issues in those terms. Collectivism is a basic cultural element that exists as the reverse of individualism \" -wiki. Or... \"Collectivism means the subjugation of the individual to a group—whether to a race, class or state does not matter. Collectivism holds that man must be chained to collective action and collective thought for the sake of what is called “the common good.”- Ayn Rand Altruism/Self Sacrifice,(6) \"the principle or practice of unselfish concern for or devotion to the welfare of others (opposed to egoism ).\" Or more accurately…. \"The basic principle of altruism is that man has no right to exist for his own sake, that service to others is the only justification of his existence, and that self-sacrifice is his highest moral duty, virtue and value.\" In political practice: Statism: \"a political system in which the state has substantial centralized control over social and economic affairs.\" or… \"The political expression of altruism is collectivism or statism, which holds that man’s life and work belong to the state—to society, to the group, the gang, the race, the nation—and that the state may dispose of him in any way it pleases for the sake of whatever it deems to be its own tribal, collective good.\"- Rand And as stated above, The elimination of property rights/private property. A wider view: Socialism and Fascism are diffrence, however they have all of the important, esstatial traits in common. Compare those ideologies to the alturative, Capitalism a social system based on the recognition of individual rights, including property rights, in which all property is privately owned. Capitalism emerged as a political doctrine in the US and England, during the time of the American revolution, and the end of Mercantilism, with it's major philosophical influences being from Adam Smith(economic thought), John Stuart Mill(Utilitarian thought), & John Locke(Natural Rights thought), which were picked up by later British thinkers and the American founding fathers. The effect of the philosophical and political beliefs of the \"Rights of Man\"(individual rights) that emerged from the English philosophers and the right to one's \"Life, Liberty and the pursuit of Happiness\" show a very stark contrast between these worlds. In contrast, the differences between socialism and fascism become trivial, and superficial. Without Collectivism, Altruism/Self Sacrifice, an all powerful state, and the abrigation of property rights-neither Socialism or Fascism could exist, and thus are ideological brothers. \"I have learned a great deal from Marxism, as I do not hesitate to admit. The difference between them and myself is that I have really put into practice what these peddlers and penpushers have timidly begun...I had only to develop logically what Social Democracy repeatedly failed in because of its attempt to realize its evolution within the framework of democracy. National Socialism is what Marxism might have been if it could have broken its absurd and artificial ties with the democratic order.\"-(Hitler to Rauschning, The Voice of Destruction, pg. 186)."],"PremiseEndPos":[10699],"ArgumentID":"00000002","Conclusion":"Socialism and Fascism are ideological brothers.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":179,"nextID":"00000004","PremiseStartPos":[10714],"prevID":"00000002","Premise":["Well, we were supposed to hold rebuttals till round 3, but it's too late now. Do remember that the argument is 'The ideologies of Socialism and Fascism are essentially the same.', this establishes that they are different superficially, but fundamentally the same. You are right to list my main points being: 1) \"both derived from the same intellectual root\" 2) \"both hold the essential moral belief that the collective is superior to the individual\" 3) \"both reject individual rights and property rights\" 4) \"both require the concentration of power in the state\" You did leave out #5, being \"Both are built on a morality of Altruism/Self Sacrifice.\" I will first address your rebuttals to my 'essentially similar' argument, and the rebut your new point on how they are different. You countered, points 1, 3 & 4., but did not counter 2 and 5. That is, the argument that Socialism and Fascism are built on the moral foundation of collectivism & altruism remain uncontested. #1) You argument against them being of the same intellectual root is based solely on them being established in different countries. This is however irrelevant to my point. American's political philosophy has it's intellectual roots in John Locke and other English philosophers. While Fascism may have gotten political start in Italy, it's intellectual roots are the same birthplace as socialism & communism, the philosophers of France and Germany. You also make the point that Socialists and Fascists were at odds, however this is irrelevant to them being essentially similar or dissimilar. The exact same could be said for socialists and communists being at odds. #3) You argument against them both rejecting individual rights and property rights is that capitalism is at the core of fascist ideology, however nothing could be further from the truth. Capitalism is a social system based on the recognition of individual rights, including property rights, in which all property is privately owned. The recognition of individual rights entails the banishment of physical force from human relationships: basically, rights can be violated only by means of force. In a capitalist society, no man or group may initiate the use of physical force against others. The only function of the government, in such a society, is the task of protecting man’s rights, i.e., the task of protecting him from physical force; the government acts as the agent of man’s right of self-defense, and may use force only in retaliation and only against those who initiate its use. In this sense, Capitalism in relation to the market is the separation of state and economics. Fascism is the exact opposite of this. Fascism is, quoting Mussolini, \"The merger of corporate and government power.\" Without property rights, Capitalism does not exist. The right to property is the right to gain, to keep, to use and to dispose of material values. As I stated in round 1, \"Both “socialism” and “fascism” involve the issue of property rights. The right to property is the right of use and disposal. Observe the difference in those two theories: socialism negates private property rights altogether, and advocates “the vesting of ownership and control” in the community as a whole, i.e., in the state; fascism leaves ownership in the hands of private individuals, but transfers control of the property to the government. Ownership without control is a contradiction in terms: it means “property,” without the right to use it or to dispose of it. It means that the citizens retain the responsibility of holding property, without any of its advantages, while the government acquires all the advantages without any of the responsibility. “[W]e will do what we like with the bourgeoisie. … We give the orders; they do what they are told. Any resistance will be broken ruthlessly.”—Adolf Hitler, interview with Breiting, p. 36. In this respect, socialism is the more honest of the two theories. I say “more honest,” not “better”—because, in practice, there is no difference between them: both come from the same collectivist-statist principle, both negate individual rights and subordinate the individual to the collective, both deliver the livelihood and the lives of the citizens into the power of an omnipotent government. #4) As for \"socialism as an ideology does not necessitate a centralized totalitarian state\", there is no historical evidence you can provide to make this claim. As you yourself admit, historically, all socialist and fascist states ever to have existed required centralized totalitarian authority. Marx's view of a stateless society not only never existed, but I believe is impossible to exist. I will argue the theoretical case though and insist that it is 'in principle' the authoritarian state is a fundamental requirement. This is due to the nature of government itself. A government holds a legal monopoly on the use of physical force. As such, a government to only acts in retaliation to force, as with capitalism, has a very limited scope. However in order to take, command, and regulate the property and lives of others requires and all powerful, all-encompassing state. Now to your main position: \"The most important of which, is that fascism is on the far-right, while socialism is on the hard left to far-right. \" I claim that this is not only a false dichotomy, but that the Left-right spectrum is NEVER defined, the definitions differ depending where you look, and that the ONLY dichotomy that exists is (More Freedom / Less Freedom.) As i mentioned in round one, A definition must identify the nature of the units, i.e., the essential characteristics without which the units would not be the kind of existents they are. The Left-right spectrum fails horribly at this. For example, note that on the left you have Communism, and socialism, while on the right you have Fascism and Capitalism. However, as stated above you could not have two more opposite systems than Fascism and Capitalism. Capitalism is built on the moral premise of natural individual rights. That no entity (another individual, another group, one's own government, another government) has the right to violate the individual's rights. As such the individual is an end in himself and has the right to seek his own happiness as long as he does not violate the life, liberty, or property of another. As such the government's only role is strictly limited to the protection of such rights. Fascism is built on the moral premise that the Collective(nation, race, etc) is sovereign. That the individual only exists to serve the collective and that the group may do whatever it wishes to him, to serve it's interest and the individual is urged or forced to sacrifice himself to the group. As such the government has a blank check on what it can do and grows in power. This is often embodied as a single person steps up to be the 'voice of the people.' the solidifying a strong, central, authoritarian state. Since it is clear that the same above is true for socialism/communism as it is fascism, and that Capitalism is in every way fundamentally different… It becomes clear that the Left-right spectrum is a false dichotomy. “Anti-individualistic, the Fascist conception of life stresses the importance of the State and accepts the individual only insofar as his interests as he coincides with those of the State … . It is opposed to classical liberalism which arose as a reaction to absolutism and exhausted its historical function when the State became the expression of the conscience and will of the people. Liberalism denied the State in the name of the individual; Fascism reasserts the rights of the State as expressing the real essence of the individual … Thus understood, Fascism is totalitarian, and the Fascist State—a synthesis and a unit inclusive of all values—interprets, develops, and potentiates the whole life of a people.” “The Fascist State, as a higher and more powerful expression of personality, is a force, but a spiritual one. It sums up all the manifestations of the moral and intellectual life of man. Its functions cannot therefore be limited to those of enforcing order and keeping the peace, as the liberal doctrine had it.” —Benito Mussolini, “The Doctrine of Fascism: Fundamental Ideas,” in Delzell, ed., 1970, pp. 93-94, 95. ----------------- i) \"I have to ask you, on what planet was Francisco Franco not nationalist?\" I didn't say that. You read past the word 'belligerent'. As in you cannot say all fascist states go around invading their neighbors. ii & iii) This discussion would FAR exceed the 10,000 character limit. That being said, I would love to have it with you. I will just say briefly that the state's only property role in regards to property rights, are their protection. I think we both would agree with that a fascist state like in Germany violated property rights in your Jewish example. iv) Agreed on the quote, I did throw that Hitler quote in quite casually at the last minute.)"],"PremiseEndPos":[19678],"ArgumentID":"00000003","Conclusion":"Socialism and Fascism are ideological brothers.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":179,"nextID":"00000005","PremiseStartPos":[19693],"prevID":"00000003","Premise":["This is the Conclusion round, therefore I will try and limit any rebuttal and then summarize my case. Rebuttals: >>\" The roots of fascism do not come from French philosophers or German philosophers, it largely comes from the political implications of the First World War as it had affected Italy\" - Con This is absolutely not true. Even the Wikipedia page on Fascism's development plainly spells it out: \"The ideological roots of fascism have been traced to the 1880s, and in particular the fin de siècle theme of that time.[21][22] The theme was based on revolt against materialism, rationalism, positivism, bourgeois society and liberal democracy.\".. \"During the Enlightenment, a number of ideological influences arose that would shape the development of fascism… Another major influence on fascism came from the political theories of Georg Wilhelm Friedrich Hegel.[4] Hegel promoted the absolute authority of the state.[4] Hegel promoted a powerful state and said \"nothing short of the state is the actualization of freedom\" and that the \"state is the march of God on earth\".[14]\" - Sadly, the Wiki leaves out the huge influence of Nietzsche on Nazi Fascism which I think is very important. (The Nazis often cited Nietzsche as one of their philosophical precursors.) Yes, I am aware there are other influences, however if we were to list every minor influence from every single idea then we would be here for years. It is well established that the ESSENTIAL and most important influences on American thought during revolution came from the ideas of Locke. That being said, the Ancient Greek philosophers are an important topic in the discussion, but only as far as to point out that the primary influences were Aristotle and Plato, and that Aristotle had a greater influence on England and America, while Plato had a greater influence on France, Italy, and Germany. >>\"I know of no capitalist system that you describe. In every country where capitalism persists, there is a government that owns property.\" - Con I am speaking of Capitalist Ideology. No, there exists no full laissez-faire capitalism society. The closest to it has been the US and England in the late 19th century. We are a mixed economy, i.e., a mixture of capitalism and statism, of freedom and controls. The west is predominantly Capitalist, but as you yourself point out, not fully so. This does not change the fact that Capitalism is a social system based on the recognition of individual rights, including property rights, in which all property is privately owned. This does not change the fact that it's principles of individual rights and private property are in direct opposition to Fascism's collectivism and state intervention. >>\"Again, private property existed in fascist countries. It was not communally owned. It was not owned by the government. It was however an authoritarian system that did own parts of the economy and could requisition private property as they pleased, but until such time their property was privately owned.\"-con The institution of private property, in the full, legal meaning of the term means the RIGHT to obtain, possess, use, and dispose of property, IE control. Again, for the 3rd time(without rebuttal), Ownership without control is a contradiction in terms: it means “property,” without the right to use it or to dispose of it. If a person does not have the right to dispose of his property, he does not have a right to property. Similarly, one could not say that an American Slave had the right to his life and liberty, and that the southern states and slave owners merely \"requisitioned\" their actions \"as they pleased\". \"It does not mean that all these concerns must necessarily be socialised, merely that they can be socialised if they transgress against the interests of the nation. So long as they do not do that, it would, of course, be criminal to upset the economy. . . . I want everyone to keep what he has earned subject to the principle that the good of the community takes priority over that of the individual. But the State should retain control; every owner should feel himself to be an agent of the State; it is his duty not to misuse his possessions to the detriment of the State or the interests of his fellow-countrymen. That is the overriding point. The [State] will always retain the right to control property owners. . . . \" - Quoted in Edouard Calic in Unmasked. Two Confidential Interviews with Hitler in 1931, translated by R. H. Barry (London: Chatto & Windus, 1971), pp. 31–33, 86 Conclusion: Again, the argument is that Socialism and Fascism are essentially the same. Essential similarities and differences are the absolutely necessary, indispensable characteristics of a concept, or in this case an ideology. Yes, fascism and socialism are different. This is not the debate. The absolutely necessary, indispensable characteristics of both Socialism and Fascism are: Collectivism, Altruism/Self Sacrifice, the abrogation of property rights, and Statism. Between a Socialist and a Fascist there is no argument for these issues, their premises are the same. The principle to both is that the Individual must sacrifice to the group or else. Which group one must sacrifice to is the only question. The Nation? The Race? The proletariat? How will they make this possible? The Fascist demands that you sacrifice to the group and follow it's needs and demands, else they will nationalize your property. The Socialist leaves out the 'or else', and simply nationalizes your property for the good of the group. Thus far, all of my points for the essential similarities of Socialism and Fascism stand, 1) \"both hold the essential moral belief that the collective is superior to the individual\" 2) \"both reject individual rights and property rights\" 3) \"both require the concentration of power in the state\" 4) \"both are built on a morality of Altruism/Self Sacrifice.\" These are the absolutely essential similar concepts without which Socialism and Fascism would not exist. Only one of which(property) was challenged by con. Con could have challenged the other similarities as being untrue, or as unessential, but he did neither. Further, these are also starkly differentiated from Capitalsm which: 1) Holds the individual is sovereign. 2) Protects the rights of the individual, including property rights. 3) Requires the restraint and restriction of government power.(limited government) 4) Declairs that you have the right to the pursuit of your own happiness. Con's only claim that Socialism and Fascism are essentially diffrent is based solely on the Left-right spectrum which traditionally places Fascism on the right and socalism on the left. I believe by arguing the actual essential concepts and principles that are the basis of both systems, I have proven my case. You be the judge."],"PremiseEndPos":[26516],"ArgumentID":"00000004","Conclusion":"Socialism and Fascism are ideological brothers.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":179,"nextID":"00000006","PremiseStartPos":[26531],"prevID":"00000004","Premise":["I accept. I assert that socialism and fascism are broad terms, which could have some similarities in some cases, and almost no similarities at all in most other cases."],"PremiseEndPos":[26699],"ArgumentID":"00000005","Conclusion":"Socialism and Fascism are ideological brothers.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":179,"nextID":"00000007","PremiseStartPos":[26714],"prevID":"00000005","Premise":["I would like to thank my opponent for giving me a lot to cover here, which I will try to do in less than 10,000 characters. Firstly, a list of assertions that my opponent makes. 1) \"both derived from the same intellectual root\" 2) \"both hold the essential moral belief that the collective is superior to the individual\" 3) \"both reject individual rights and property rights\" 4) \"both require the concentration of power in the state\" I would now like to define socialism and fascism. Fascism: an authoritarian, hierarchical and nationalistic system of government and social organisation. Socialism: a social and economic system characterised by social ownership of the means of production. From the very start, there are major and clear difference which are all worthy of their own analysis. The most important of which, is that fascism is on the far-right, while socialism is on the hard left to far-right. This means that fascism advocates for a strictly hierarchical system of society, orchestrated by an absolutely strong authoritarian government, which puts this ideology at the far end of the right wing. Socialism on the other hand advocates for a completely unhierarchical system of society, to the point where society is owned by the workers as a whole, without any such hierarchical private property. Because the extents of socialism can differ in being democratic, undemocratic, totalitarian or even anarchist, this places socialism anywhere between the far-left and the hard left, depending on the circumstances of the socialism. Secondly, fascism and socialism have fundamentally different origins. The origins of active fascism were created almost exclusively in early-20th century Italy, drawing from ideas of philosphers in the past century from around Europe. Early Italian fascism has often been described as being formed in direct opposotion to the Italian socialists, particularly due to fascism's interventionism in the First World War, while the socialists were opposed due to their strong sense of internationalism. However, the two sides became even more polarised after the result of the Russian Revolution, where the strong elements of socialism praised the Bolshevik takeover of Russia, while fascism was fundamentally against Lenin's rise. In fact, this lead Mussolini and other fascists to campaign themselves explicitly as anti-Marxists and anti-communists, in the years after the First World War. Thirdly, although socialism can be characterised as a rejection of capitalism and its values, fascism is not simply a rejection. At it's core of ideology, Marxist socialism is strongly opposed to the notion of private property, while fascism strongly supports the concept of private property and market forces. They both had major criticisms of the bourgeois capitalist systems that had developed in Europe, but fascism was very comfortable to keep capitalists owning factories and workers having to work for wages. Socialism on the hand was a direct attempt in reversing this hierarchy, by empowering the workers to rise up and own the factories. Fourthly, socialism as an ideology does not necessitate a centralised totalitarian state. While it's true that all Marxist-Leninist and Maoist regimes in recorded history have been authoritarian and demanded authoritarianism, socialism is not necessarily authoritarian while fascism requires a totalitarian state in every possible way. There are many forms of socialism which not only don't require totalitarianism, they are ideologically opposed to it. These are all fairly similar, with names such as libertarian socialism, anarchist communism, anarchist syndicalism, anarchist mutualism and libertarian communism. For the sake of simplicity, I will be referring to all of these broadly as anarchist socialism. The social ownership of the means of production can be theorised in a purely state-free way, as well as some notion of democratic socialism when applied to a social ideology instead of purely an economic theory. Then in your arguments, you make a few strange claims. i) \" Mussolini's fascism involved belligerent nationalism. Franco's did not.\" I have to ask you, on what planet was Francisco Franco not nationalist? You only have to go as far as the third paragraph of his Wikipedia article [1] to see; \" Franco's ultranationalist faction received military support from several fascist groups, most notably from Nazi Germany and the Kingdom of Italy, while the Republican side was supported by Spanish communists and anarchists.\" As far as Franco goes, we only have to look at what Spanish nationalism includes. Most notably, it is the unity of Spain in contrast to the nationalist movements of Catalonia and Basque in particular, as well as other autonomist movements throughout Spain. ii) \" Under fascism, men retain the semblance or pretense of private property, but the government holds total power over its use and disposal.\" As property rights are a social construct, they have required and continue to require a state to uphold and enforce their principles. Fascism is no exception to this, although it is marked by an interventionist state to maintain a hierarchy. Throughout the Third Reich for example, wealthy industrialists still had all the functions of their ownership over their assets. In fact, it was often even easier to do so because of fascism's removal of trade unions and revolutionary proletariat agitators. The state's control over industry was essentially to enforce that hierarchy, most notably in removing Jewish owners of businesses. Saying that fascism is essentially against property rights is really just an arbitrary statement. You might as well apply it to any other major capitalist country, such as the United States, the United Kingdom or Germany, since the government has the power to intervene in the state and pass laws that controls commerce. You could still own a business in Nazi Germany. You simply couldn't in the Soviet Union with Stalin. iii) \" Socialism/Communism emerged as a political doctrine following Rousseau, the upheaval of the French Revolution [...] Robespierre's reign of terror\" I think there is a fundamental misunderstanding among many people over the basic events of the French Revolution. The works of those now referred to as the Enlightment thinkers such as Voltaire, Rousseau, Montesqieu, Descartes and others were largely written well before the French Revolution. Initially, the French Revolution seemed to be a more simple popular uprising that brought promise of constitutional monarchy, which ended with the radicalisation of the Montagnards political clubs, and the Parisian proletariat, then called the sans-culottes. Contrary to popular misconception, this was not a revolution of arbitrary totalitarianism from the start. Furthermore, the ideas of Marxism are distinct from those of the Enlightenment thinkers. Of course the thinkers of the 18th century were influential to Marx, they were influential to virtually every philosopher of the 19th century. They just weren't particularly influential to Marx and Engels as they were to other thinkers. In fact, earlier forms of socialist ideology that predate Marx's famous works have a greater influence from these French philosophers. iv) \" I have learned a great deal from Marxism, as I do not hesitate to admit. The difference between them and myself is that I have really put into practice what these peddlers and penpushers have timidly begun...I had only to develop logically what Social Democracy repeatedly failed in because of its attempt to realize its evolution within the framework of democracy. National Socialism is what Marxism might have been if it could have broken its absurd and artificial ties with the democratic order.\" This may be my most important paragraph, because I am asking you to withdraw this quote that you have used. You have tried to characterise Hitler as being intrinsically inspired from the works of Marx, despite his very first victims being Marxists and communists. However, you are relying on a quote from Hermann Rauschning, a conservative German politician who was a member of the Nazi Party before emigrating to the United States in 1936. [2] You are quoting from Hitler Speaks (known as Voice of Destruction in US copies), where Rauschning attempts to write down conversations that he had with Hitler. At best the historical accuracy of this work is debateable, and at worst it is downright discarded from any meaningful historical use into research about the Third Reich. It is believed that Rauschning only met Hitler a few times and not in private, leading the consensus of historians to believe that the quotes attributed to Hitler are mostly fabrications. I am certainly not accusing you of being purposefully misleading to the readers of this debate, but this is a very misleading quote that you are using and so I ask you, with great respect, to withdraw it. [Provisional sources for two people featured in this round.] [1] [2]"],"PremiseEndPos":[35705],"ArgumentID":"00000006","Conclusion":"Socialism and Fascism are ideological brothers.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":179,"nextID":"00000008","PremiseStartPos":[35720],"prevID":"00000006","Premise":["Firstly, fascism and socialism are still intellectually different. The roots of fascism do not come from French philosophers or German philosophers, it largely comes from the political implications of the First World War as it had affected Italy. That being said, the philosophical ideas of the American Revolution were not just from English philosophers, but also from Scottish and French philosophers largely, and it can even be said that they were influenced by Ancient Greek philosophers. It's a red herring to say that fascists and socialists have the same philosophers, because it's simply a misunderstanding. The only way in which we can accept they come from the same ideas is saying that every single political ideology came from the same influential philosophers of Europe. It's not as if the line of descendancy for these ideologies is purely vertical, passed on down from every generation where fascism and socialism happen to have the same ancestry, but every political ideology that was developed in the Western world has the same ancestry, even if Rene Descartes or John Stuart Mill would disagree with either fascism or socialism or capitalism. If you want to say there are birthplaces, then the births of socialism and fascism are very much distinct. >> Capitalism is a social system based on the recognition of individual rights, including property rights, in which all property is privately owned. I know of no capitalist system that you describe. In every country where capitalism persists, there is a government that owns property. One thing distinct to capitalism is the idea of free markets, which fascist ideologies kept in place as a means of their economy. That is contrasted with socialism which were centrally planned economies. Fascism has no such central planning, and just because you see fascism as evil, does not mean that it is the exact opposite of capitalism. There are similarities and elements of each ideology pervasive in other ideologies, but \"capitalism\" is simply a word that is too broad, especially when there is so much overlap between capitalism and many socialists. >> The only function of the government, in such a society, is the task of protecting man’s rights Most governments of definitely capitalist countries are ones that actively intervene in the country's economy. Only a free market fundamentalist would think that free markets can only happen without government involvement. >> property rights Again, private property existed in fascist countries. It was not communally owned. It was not owned by the government. It was however an authoritarian system that did own parts of the economy and could requisition private property as they pleased, but until such time their property was privately owned. That is a massive contrast to socialism where by default the property is owned by society. >> Marx's view of a stateless society not only never existed, but I believe is impossible to exist. Of course it is impossible to exist, but the ideology exists. That's only as far as governments though, since socialism doesn't only have to be a government policy. It can be something like Mon dragon, a large manufacturing company in Spain, which is operated by its workers who are also collectively its owners, who elect the board of executives. This is the largest example of a worker's co-operative, and is very much both socialist and capitalist. Socialist in the way that the workers, but not a government, own the means of production. Even when we acknowledge that every socialist state was authoritarian, we must acknowledge that fascism has no room for anarchistic societies in its ideology, contrary to socialism. >> I claim that this is not only a false dichotomy, but that the Left-right spectrum is NEVER defined, the definitions differ depending where you look, and that the ONLY dichotomy that exists is (More Freedom / Less Freedom.) There is a left-right spectrum. It is defined. The only way that the only dichotomy can be between more freedom and less freedom is simply an American-centric view of politics and not even one that is endorsed by mainstream political science in the United States anyway. For anybody unfamiliar with the particulars of the left-right spectrum, I will explain it like this. The left-right spectrum describes heirarchies. On the far left, which we will use communism as an example, we see that everybody is forced to be made equal in the hope that this will create a utopian society. On the far right, which we will use fascism as an example, we see that people are subjugted into different groups to the extreme, with some people being exterminated for being in the wrong group, some people being idolised, others being the rightful property owners, etc. In the centre-right and the centre-left, we see the same. The centre-left in general wants to take from those who are richer and give to those who are poorer. Making a more equal society which they see as beneficial, but by no means confiscating all land and wealth like communists. On the centre-right, we see the opposite, with wanting the rich to keep more of their wealth which they see as more beneficial, but they are certainly not going to fascist extremes where the poor are deemed unworthy of living. The existance of the left-right spectrum is not a matter for debate, as it is something that most definitely exists in political science. Of course politics is more complicated than a line, but the line exists, and it is useful, especially in this case. The line has nothing to do with how involved a government is or how much freedom a person has, the line is a line of hierarchies. It's a complete fallacy to pretend that the only real dichotomy is between freedom, since the political situation of the United States simply cannot be generalised onto the entire world. This completely fabricated dichotomy only favours the right wing of the United States, since it places the left closer to fascism and communism. >> Francisco Franco Franco was ultra-nationalist, and belligerently so. You only have to look at the nationalities of Catalonia, Anadalusia, Valencia, Basque, Galicia and others to see the brutality and belligerency of Franco's nationalism. >> I will just say briefly that the state's only property role in regards to property rights, are their protection. Again, I know of no government in the world that limits their role to laissez faire capitalism. Instead, most governments advocate a form of mixed market capitalism that includes a welfare state of differing strength, labour and consumer protections, and government involvement in an economy where it is deemed suitable. I hate to break it to you, but this also includes not only your country, but the opinion of even those in your country who would identify as right wing, it's only a matter of extent. [I'm in quite a hurry today so I will post my sources and quotes for this round on my next round.]"],"PremiseEndPos":[42658],"ArgumentID":"00000007","Conclusion":"Socialism and Fascism are ideological brothers.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":179,"nextID":"00000000","PremiseStartPos":[42673],"prevID":"00000007","Premise":["While Pro is right to point out that fascism had some basis in philosophy from past decades and centuries, the beginning of fascism was still mostly due to the political nature of Italy during and after World War I, particularly with Mussolini's defiance of the Italian socialists. This is a major contrast to socialism which has a number of different origins, such as the modern trade unionist movement from the latter 19th century United Kingdom, the origins of Marxism unsurprisingly by a German philosopher Karl Marx, and the Bolshevism and Leninism of Russia in the early 20th century. If we were really to say that socialism and fascism were ideologically similar due to their creators being inspired by the same philosophers, which itself is not really true, then we would have to include virtually every other political and economic ideology as a branch growing from the same tree. The main purpose for Pro to categorise socialism and fascism as essentially identical, which he essentially admits, is in promotion of capitalism. However, this is not the capitalism that the people of capitalist countries would recognise, but rather laissez-faire capitalism where the government has an almost non-existent role in the economy and in the economic and social protection of its citizenry. Every single capitalist country includes a government that has some level of significant economic intervention, which is necessary to maintain economic growth and prevent financial collapse. Pro rightly described fascism as also including such state intervention, but omits the fact that socialism does not depend on state intervention either. While many famous cases of socialism are indeed authoritarian, as the Soviet Union comes to mind, socialist ideology is open to the anarchist tradition, where the means of production are owned collectively by the workers without a state or a very limited state. Even the end goal of communism was always to achieve a stateless society, even if this was never actually achieved. This is one of the major differences between fascism and socialism. Although not greatly touched upon by Pro, it is important to mention that another key difference between fascism and socialism is nationalism versus internationalism. Fascism, by definition, stresses nationalism to the detriment against other nationalities. This is quite apparent from the Third Reich in Germany and the rise of Franco in Spain. Both are characterised with violence against other nationalities, and opposition from nationalities. Socialism on the other hand stresses the opposite, internationalism. This is the fundamental belief that all of the proletariat and workers of the world are one entity who are pointlessly divided by ethnicity and nationality. In the words of Marx, \"workers of the world, unite\". Private property existed in all fascist economies, as a fundamental principle of fascism. These countries adopted mixed market policies where governments would own substantial parts of the economy, but that the means of production would be owned by private individuals, usually those who were sympathetic to the political party that dictated the country. Although the fascist governments had a significant role in the economy, it was still the factory owners who decided what their expenses were, what their outputs were, who they would employ, how they would direct labour, and who would ultimately receive the profits. Unlike a socialist economy, which with a state is a centrally planned economy, but is always one where the means of production are owned socially and certainly not for the gain of a bourgeoisie class. Finally, the differences of fascism and socialism are evident in their opposite locations on the political spectrum. Fascism being at the far-right, and socialism being at the far-left to hard left depending on the particular model. The left-right spectrum is one that does not measure government involvement or personal liberties, but the hierarchical nature of an ideology. In socialism, the hierarchies are non-existant, where all workers are made to be equal and entrepreneurs are punished for aspiring to achieve more for themselves. In fascism, hierarchy not only exists but is encouraged by the state, where people are subjugated into different categories of society, from being the idolised group, to being an exterminated group. These are the points which form the main summary for my assertion that fascism and socialism are essentially and fundamentally distinct from each other. I would like to thank my opponent for this debate and for this opportunity."],"PremiseEndPos":[47272],"ArgumentID":"00000008","Conclusion":"Socialism and Fascism are ideological brothers.","PremiseStance":["Con"]}}]}