{"MetaData":{"Context":"URL: http://www.debate.org/debates/Students-Should-be-Allowed-to-Have-Their-Cell-Phones-at-School/3/\nCrawl date: 2016/09/29 07:19:34\nOnline Debate: Students Should be Allowed to Have Their Cell Phones at School | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: First round is for acceptance. All definitions will be used in context of the resolution. Standard conduct applies, including no trolling.\n\nEvidence Pro: My opponent decided to post their argument in Round 1, despite my rule that first round was for acceptance. My opponent therefore loses conduct points. I will not be responding to my opponents opening arguments and will pretend that she just accepted the round instead. This is the argument from my former account xXCryptoXx. This argument was not plagiarized; for it is my own work being used on this account that I created. Cell Phones Are Great For the Ease of Students This is obviously going to be the biggest argument and it is quite simple. It is common knowledge that people are busy. Allowing students to have cell phones with them allows them to schedule things and make important contact with extreme ease. For example if your parents thought they needed to pick you up at 3:00 P.M, but didn’t know you had to stay after school to finish a test; that could have been a problem easily solved if the student had had the ability to contact his parents in order to tell them he would have to stay after school a while. Its also not limited to the student, if the parent is running late or cannot pick their child up from school for any reason, or even if there is a family emergency they should be able to contact their child. Cell phones allow a huge burden to be taken off parents and students, by allowing them to schedule things and contact others quickly and efficiently; something that could not be done without cell phones. In the case of an emergency, such as medical problems, a school shooting, ect. students will be able to quickly and efficiently be able to contact authorities which allows some order to the chaos around them and can save lives while increasing the chance that the perpetrator is caught. Gives Students Choice and Responsibility By allowing students to possess phones during school, this gives them the opportunity to mature and learn responsibility. With the ability to possess cell phones, punishment for using cell phones during inappropriate times will be active. This gives students the choice to either use or not use their phones during inappropriate times. If they are caught and reprimanded then it gives them a chance to grow in maturity. Allowing cell phones forces students to be responsible with their phones, and learn from mistakes they make. This allows students to mature and grow in responsibility. All The Benefits Without the Consequences If it is found that students cannot be trusted to use their cell phones appropriately then school rules can be placed in order to deter cell phone use during class. For example, students may be forced to turn off their phones and place it on their desk during class. This takes away the problem of students playing on their phones or being distracted by their phones during class, while still providing the benefits of students being able to use their phones after school or in the case of an emergency.\n\nEvidence Pro: Extend\n\nEvidence Con: Children having the ability to use their cell phones at school is not a good idea. When a child uses their cell phones at school it takes them away from paying attention to school. When children are using their cell phones in school it can cause problems with other students and get them in trouble with the facility. Cell phones can be a very dangerous weapon. They can ruin your reputation. When you are using it at school it just makes school pointless. Research shows one third of children are caught cheating in school. That is not even including college students. Students need to pay attention to school and learn what they are suppose to so, when they go to college the classes they took in high school can help them through those college years. I mean you would not want someone who even though they went to college to be a doctor and you needed surgery and, all they did was cheat or just not pay attention because they was on their cell phones all the time then you would not trust them to do surgery on you because they would not be well educated. Yes, I know there is people who can be distracted and still make good grades and understand everything but, no one is perfect and even though they make good grades does not mean they are capable of performing tasks they may involve stuff they would have learned. But, they would not have fully learned how to do the task due to them messing with their cell phones and not being able to focus properly. So, In conclusion the use of cell phones should not be uses at all unless it is strictly necessary for the learning of your education.\n\nEvidence Con: kpr27 forfeited this round. Pro Extend\n","DiscussionID":"00000019","Title":"Students Should be Allowed to Have Their Cell Phones at School","CrawlDate":"2016/09/29 07:19:34","URL":"http://www.debate.org/debates/Students-Should-be-Allowed-to-Have-Their-Cell-Phones-at-School/3/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":210,"nextID":"00000002","PremiseStartPos":[262],"prevID":"00000000","Premise":["First round is for acceptance. All definitions will be used in context of the resolution. Standard conduct applies, including no trolling."],"PremiseEndPos":[401],"ArgumentID":"00000001","Conclusion":"Students Should be Allowed to Have Their Cell Phones at School","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":210,"nextID":"00000003","PremiseStartPos":[416],"prevID":"00000001","Premise":["My opponent decided to post their argument in Round 1, despite my rule that first round was for acceptance. My opponent therefore loses conduct points. I will not be responding to my opponents opening arguments and will pretend that she just accepted the round instead. This is the argument from my former account xXCryptoXx. This argument was not plagiarized; for it is my own work being used on this account that I created. Cell Phones Are Great For the Ease of Students This is obviously going to be the biggest argument and it is quite simple. It is common knowledge that people are busy. Allowing students to have cell phones with them allows them to schedule things and make important contact with extreme ease. For example if your parents thought they needed to pick you up at 3:00 P.M, but didn’t know you had to stay after school to finish a test; that could have been a problem easily solved if the student had had the ability to contact his parents in order to tell them he would have to stay after school a while. Its also not limited to the student, if the parent is running late or cannot pick their child up from school for any reason, or even if there is a family emergency they should be able to contact their child. Cell phones allow a huge burden to be taken off parents and students, by allowing them to schedule things and contact others quickly and efficiently; something that could not be done without cell phones. In the case of an emergency, such as medical problems, a school shooting, ect. students will be able to quickly and efficiently be able to contact authorities which allows some order to the chaos around them and can save lives while increasing the chance that the perpetrator is caught. Gives Students Choice and Responsibility By allowing students to possess phones during school, this gives them the opportunity to mature and learn responsibility. With the ability to possess cell phones, punishment for using cell phones during inappropriate times will be active. This gives students the choice to either use or not use their phones during inappropriate times. If they are caught and reprimanded then it gives them a chance to grow in maturity. Allowing cell phones forces students to be responsible with their phones, and learn from mistakes they make. This allows students to mature and grow in responsibility. All The Benefits Without the Consequences If it is found that students cannot be trusted to use their cell phones appropriately then school rules can be placed in order to deter cell phone use during class. For example, students may be forced to turn off their phones and place it on their desk during class. This takes away the problem of students playing on their phones or being distracted by their phones during class, while still providing the benefits of students being able to use their phones after school or in the case of an emergency."],"PremiseEndPos":[3316],"ArgumentID":"00000002","Conclusion":"Students Should be Allowed to Have Their Cell Phones at School","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":210,"nextID":"00000004","PremiseStartPos":[3331],"prevID":"00000002","Premise":["Extend"],"PremiseEndPos":[3338],"ArgumentID":"00000003","Conclusion":"Students Should be Allowed to Have Their Cell Phones at School","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":210,"nextID":"00000005","PremiseStartPos":[3353],"prevID":"00000003","Premise":["Children having the ability to use their cell phones at school is not a good idea. When a child uses their cell phones at school it takes them away from paying attention to school. When children are using their cell phones in school it can cause problems with other students and get them in trouble with the facility. Cell phones can be a very dangerous weapon. They can ruin your reputation. When you are using it at school it just makes school pointless. Research shows one third of children are caught cheating in school. That is not even including college students. Students need to pay attention to school and learn what they are suppose to so, when they go to college the classes they took in high school can help them through those college years. I mean you would not want someone who even though they went to college to be a doctor and you needed surgery and, all they did was cheat or just not pay attention because they was on their cell phones all the time then you would not trust them to do surgery on you because they would not be well educated. Yes, I know there is people who can be distracted and still make good grades and understand everything but, no one is perfect and even though they make good grades does not mean they are capable of performing tasks they may involve stuff they would have learned. But, they would not have fully learned how to do the task due to them messing with their cell phones and not being able to focus properly. So, In conclusion the use of cell phones should not be uses at all unless it is strictly necessary for the learning of your education."],"PremiseEndPos":[4950],"ArgumentID":"00000004","Conclusion":"Students Should be Allowed to Have Their Cell Phones at School","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":148,"ConclusionEndPos":210,"nextID":"00000000","PremiseStartPos":[4965],"prevID":"00000004","Premise":["kpr27 forfeited this round. Pro Extend"],"PremiseEndPos":[5004],"ArgumentID":"00000005","Conclusion":"Students Should be Allowed to Have Their Cell Phones at School","PremiseStance":["Con"]}}]}