{"MetaData":{"Context":"URL: http://www.forandagainst.com/Flesh_Eating_Zombies_Are_One_Of_The_Scariest_Monsters_Dreamt_Up\nCrawl date: 2016/09/28 04:26:28\nTitle: Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up - For & Against\nNumber of arguments: 12\n\nClaim: Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up - For & Against\nFor: Human bodies rising from their graves and feasting on live human flesh.... What could be scarier than that....\nFor: Yes I agree on the basis of what you already stated. But the most horrid thought of zombies is the nerve racking condition that deems a doomed destiny of living through death, which brings up all sorts of questions. If I turn into a zombie, what happens to my soul? And imagine the thoughts that would go through your head if you survived a thrashing from a zombie, no matter what you would end up as one of them. And could you ever end the life of a loved one even considering the circumstance.\nAgainst: I have to say aliens or werewolfs\nAgainst: The scariest is them eating flesh slugs, can't remember the movie, but there was one where one slug came out the toilet big giant slugs that made me scared of the toilet for a little while so it did.\nAgainst: I love zombie movies, but they aren't scary. If they were scary I probably wouldn't watch them. I'm like a 10 year old girl when it comes to scary movies.\nAgainst: For me, the scariest monster was one I read about in a book (fiction, of course). The monsters are described as horseshoe crabs that live on land. They hide out in dark places in groups. They move very slowly but never stop. These crab creatures wait until you are asleep in a dark place, attach themselves to some part of your body, insert needle-like tentacles into your skin, muscles, and bone and suck out your blood and guts. Slowly, over several days. You cannot remove them because their needle-like tentacles attach to you on the inside. Your only option is to remove the body part they attach to. At least in the movies, you can shoot at zombies!\nAgainst: I have seen a lot of scary movies and there are a lot scarier things than \"zombies\".\nAgainst: Zombies move way too slow to be scary. A real one would never catch anybody. Oh look, a flesh eating zombie is walking toward me. What a coincidence. You know what? I think I'll stay here and finish typing this before i even think about running away. Its not like I'm in any real danger.\nAgainst: I reckon I could take a zombie in a square go. Shuffling numpties. Human beings, alive and well, now they are scary...\nAgainst: It was a bit unreal As if...but some of the creechers in King Kong were wretched;-(\nAgainst: Boring. Try harder.\nAgainst: I can think of something much more scary than a zombie.\n","DiscussionID":"00000085","Title":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","CrawlDate":"2016/09/28 04:26:28","URL":"http://www.forandagainst.com/Flesh_Eating_Zombies_Are_One_Of_The_Scariest_Monsters_Dreamt_Up"},"ArgumentList":[{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000002","PremiseStartPos":[2676],"prevID":"00000000","Premise":["I can think of something much more scary than a zombie."],"PremiseEndPos":[2732],"ArgumentID":"00000001","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000003","PremiseStartPos":[2647],"prevID":"00000001","Premise":["Boring. Try harder."],"PremiseEndPos":[2667],"ArgumentID":"00000002","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000004","PremiseStartPos":[2554],"prevID":"00000002","Premise":["It was a bit unreal As if...but some of the creechers in King Kong were wretched;-("],"PremiseEndPos":[2638],"ArgumentID":"00000003","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000005","PremiseStartPos":[2426],"prevID":"00000003","Premise":["I reckon I could take a zombie in a square go. Shuffling numpties. Human beings, alive and well, now they are scary..."],"PremiseEndPos":[2545],"ArgumentID":"00000004","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000006","PremiseStartPos":[2129],"prevID":"00000004","Premise":["Zombies move way too slow to be scary. A real one would never catch anybody. Oh look, a flesh eating zombie is walking toward me. What a coincidence. You know what? I think I'll stay here and finish typing this before i even think about running away. Its not like I'm in any real danger."],"PremiseEndPos":[2417],"ArgumentID":"00000005","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000007","PremiseStartPos":[2035],"prevID":"00000005","Premise":["I have seen a lot of scary movies and there are a lot scarier things than \"zombies\"."],"PremiseEndPos":[2120],"ArgumentID":"00000006","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000008","PremiseStartPos":[1370],"prevID":"00000006","Premise":["For me, the scariest monster was one I read about in a book (fiction, of course). The monsters are described as horseshoe crabs that live on land. They hide out in dark places in groups. They move very slowly but never stop. These crab creatures wait until you are asleep in a dark place, attach themselves to some part of your body, insert needle-like tentacles into your skin, muscles, and bone and suck out your blood and guts. Slowly, over several days. You cannot remove them because their needle-like tentacles attach to you on the inside. Your only option is to remove the body part they attach to. At least in the movies, you can shoot at zombies!"],"PremiseEndPos":[2026],"ArgumentID":"00000007","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000009","PremiseStartPos":[1206],"prevID":"00000007","Premise":["I love zombie movies, but they aren't scary. If they were scary I probably wouldn't watch them. I'm like a 10 year old girl when it comes to scary movies."],"PremiseEndPos":[1361],"ArgumentID":"00000008","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000010","PremiseStartPos":[997],"prevID":"00000008","Premise":["The scariest is them eating flesh slugs, can't remember the movie, but there was one where one slug came out the toilet big giant slugs that made me scared of the toilet for a little while so it did."],"PremiseEndPos":[1197],"ArgumentID":"00000009","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000011","PremiseStartPos":[954],"prevID":"00000009","Premise":["I have to say aliens or werewolfs"],"PremiseEndPos":[988],"ArgumentID":"00000010","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000012","PremiseStartPos":[449],"prevID":"00000010","Premise":["Yes I agree on the basis of what you already stated. But the most horrid thought of zombies is the nerve racking condition that deems a doomed destiny of living through death, which brings up all sorts of questions. If I turn into a zombie, what happens to my soul? And imagine the thoughts that would go through your head if you survived a thrashing from a zombie, no matter what you would end up as one of them. And could you ever end the life of a loved one even considering the circumstance."],"PremiseEndPos":[945],"ArgumentID":"00000011","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":136,"ConclusionEndPos":200,"nextID":"00000000","PremiseStartPos":[333],"prevID":"00000011","Premise":["Human bodies rising from their graves and feasting on live human flesh.... What could be scarier than that...."],"PremiseEndPos":[444],"ArgumentID":"00000012","Conclusion":"Flesh Eating Zombies Are One Of The Scariest Monsters Dreamt Up","PremiseStance":["Pro"]}}]}