{"MetaData":{"Context":"URL: http://www.debate.org/debates/Atomic-Bombs-Are-Real/1/\nCrawl date: 2016/09/29 05:17:23\nDebate: Atomic Bombs Are Real | Debate.org\nNumber of arguments: 10\n\n\nEvidence Pro: I accept this debate. I look forward to a lively discussion. Nuclear Fission Nuclear fission is the process by which a nuclei, when bombarded by some particle, disintegrates into two separate nuclei, and an incredible amount of energy is released in the process. Nuclei are stable when there's a balance between the Coulomb replusion and the attractive strong force. Only certain nuclei are stable, as only certain nuclear configurations are stable. \" Stability of isotopes is affected by the ratio of protons to neutrons, and also by presence of certain \"magic numbers\" of neutrons or protons which represent closed and filled quantum shells. These quantum shells correspond to a set of energy levels within the shell model of the nucleus; filled shells, such as the filled shell of 50 protons for tin, confers unusual stability on the nuclide.\" In addition, bomarding the nucleus gives it kinetic energy, which effects the stability of the nucles as well. Often, simply adding kinetic energy will cause the nuclei to separate as well.[1] The nuclear binding energy is the measure of nuclear stability. The greater the nuclear binding energy, the more attractive the force felt by individual nuclei (in other words, the greater the nuclear binding energy, the greater the stability). Now, it's important to know the sign of the energy. The potential energy of a system acting under an attractive force is negative, because it would take work to separate the system. Stable nuclei are necessarily attractive, meaning that the nuclear binding energy is always negative. Thus, \"greater\" refers to the absolute value of the energy (i.e. not considering the negative sign). The curve of the nuclear binding energy for every element is shown below: The peak per nuclei occurs for the element iron. After that, it steadily decreases. In all actuality, the iron has the least binding energy, but the greatest absolute value binding energy. There are many different examples of nuclear fission, but one of them is U-235 fission. U-235 by itself it stable. However, when bomarded with a neutron, it becomes U-236. Now, U-236 is not unstable by itself, but the kinetic energy the neutron deposits makes it unstable, and about 82% of the time, it fuses, most often into barium, krypton, and three neutrons. This process releases energy, because the nuclear binding energy of the fragments decreases (even though the absolute value of it increases). This can be seen through the mass-energy equivalence - mass is energy and energy is mass. The sum of the mass of the reactants is greater than the sum of the mass of the products, and the difference in mass was converted to energy.[2] How much energy is released by U-235 fission? It varies depending on what the fragments of the reaction are, but it's typically around 150-250 MeV.[3] The Process Behind an Atomic Bomb A basic design works like this. An explosive and some U-235 are placed together inside a bomb. Upon detonation, the explosive will explode, and free neutrons will be released. They bombard into the U-235, causing it to undergo fission. The products of those first reactions include more free neutrons, which bombard the neighboring U-235 atoms, and a chain reaction leads to most of the U-235 being affected. Now, one uranium atom, upon fission, will not release a lot of energy. However, when even a small amount of uranium is put together, the combination of all the energy products means that an enormous amount of energy is released upon the explosion of the bomb. Little Boy, the bomb that fell on Hiroshima, released 63 TJ, equivalent to 15 kilotons of TNT.[4] Evidence of the Atomic Bomb This is all well and good. We have the science down, but what is the evidence that an atomic bomb was actually made? Well, for one thing, look at the evidence at Hiroshima and Nagasaki. Some type of bomb was obviously dropped on those cities, what were the effects of the bomb? For one thing, there was a lot of radiation sickness. \"Radiation injury penetrates deeply into human body and injures cells, and thus molecules, resulting in cell death, inhibited cell division, abnormalities of intracellular molecules and membranes.\" These types of injuries were observed at over the place. There's no way these could have come from a conventional bomb - it must have been something nuclear. For another cancer, skyrocketed afterwards. Leukemia rates, which were essentially zero before hand, skyrocketed. \"By 1975 a total of 1,838 cases were diagnosed as leukemia in Hiroshima and Nagasaki. Of these, 512 were exposed within 10 km from ground zero. Incidence peaked in 1951-52 in both cities.\" This can be seen in the graph below: [5] Conclusion The science of nuclear fission is solid, and from there, making an atomic bomb is as simple as a design. In addition, evidence of raidation poisoning and cancer at Hiroshima and Nagasaki is evidence that atomic bombs were dropped there. Sources [1]: .wikipedia.org/wiki/Uranium-236 [4]:\n\nEvidence Pro: My opponent cannot simply negate part of my case because he doesn't like it. Atomic theory is only one part of the argument. I need to provide evidence that an atomic bomb actually exists. If I'm not allowed to do that, all I can do is lay down the theoretical framework for a bomb. There's a big difference between debating the theory of something and debating the actuality of that something. So don't ignore my case. Either refute it or concede. As for my opponent's substantial points, he puts forth an interesting question. It turns out that my explanation was a bit too basic. There exists a critical mass, which is the minimum mass necessary for the nuclear chain reaction. Any mass of uranium below that would not be able to undergo fission. The more detailed description is provided here: \"The design used the gun method to explosively force a hollow sub-critical mass of uranium-235 and a solid target cylinder together into a super-critical mass, initiating a nuclear chain reaction. This was accomplished by shooting one piece of the uranium onto the other by means of four cylindrical silk bags of nitrocellulose powder... When the hollow-front projectile reached the target and slid over the target insert, the assembled super-critical mass of uranium would be completely surrounded by a tamper and neutron reflector of tungsten carbide and steel, both materials having a combined mass of 2,300 kg (5,100 lb). Neutron initiators at the base of the projectile were activated by the impact.\" In other words, there is no worry of a stray neutron hitting the sample. The U-235 would explode when wanted.[1][2] Sources [1]: [2]:\n\nEvidence Pro: You said nothing of the sort. All you said was, \"Keep in mind this a purely theoretical debate.\" This is ambiguous - you don't clarify what you mean by \"theoretical\". Ambiguity in debate conditions on the part of the instigator affects the instigator and the instigator alone. And again, no matter how solid the science is, I still have to show that an atomic bomb actually exists, because otherwise I don't prove existence. Neutrons aren't flying around everywhere. The super-critical mass of U-235 (after the two sub-critical masses have been combined) is protected by a neutron reflector. The neutron initiator produces a source of neutrons for the mass of U-235. However, you don't really need either. Once the two masses collide, they will go through the process of fission. The neutron reflectors and initiators simply make the process a bit more efficient, as they make the explosion a bit more coordinated.[1] The critical mass can be measured using the effective neutron multiplication factor k. This estimates the number of neutrons released through a fission process in a sample that go on to induce more fission reactions (some of the neutrons released do not make it to other sample atoms, but go in other directions). The critical mass occurs when k=1. This means that each fission reaction, on average, produces one neutron that induces another fission reaction. Anything less than this, and the fission process will decay exponentially, as there are not enough free neutrons to sustain the reaction. k depends on the mass of the sample - below the critical mass, k1, and widespread fission reaction occurs.[2] Neutrons are most easily captured by atoms when they move slowly. I'm not sure of the exact numbers, but the free neutrons in the atmosphere move pretty fast. Regardless, I would not walk around with a supercritical mass of uranium in my hand.[3] Sources [1]: [2]: [3]:\n\nEvidence Pro: Ok, well I thank my opponent for the debate anyway.\n\nEvidence Pro: I'm aware that statement rhymes, so for the purposes of the debate, sure.\n\nEvidence Con: My opponent will explain the theoretical basis for atomic bombs in the first round. If I decide he isn't a troll, I will try to prove his theory is false. I will do so by showing it's either internally inconsistent or contradicts an empirical law of physics. Good luck. Keep in mind this a purely theoretical debate.\n\nEvidence Con: The reference to Nagasaki, etc. is prohibited in this debate. This debate is purely theoretical as regards atomic bomb theory; we are not dealing with historical events or actual bombs. So ignore the Evidence of the Atomic Bomb section of my opponent's arguments. Let's see if I understand how my opponent proposes the bomb works. A uranium atom gets hit by a neutron The uranium atom converts to other atoms, releasing energy and neutrons These neutrons strike other uranium atoms (see step 1) My opponent goes on to say that the first neutron strike is initiated intentionally; however, neutrons are flying around everywhere(1), so how does my opponent propose to load uranium into a bomb in the first place without it spontaneously detonating? Back to my opponent. (1)\n\nEvidence Con: Pro, of course I can negate the non-theoretical aspects of your atomic bomb proposal. See the rules in the first round; I clearly prohibited proving the feasibility of atomic bombs by reference to empirical instances of their use. You say that spontaneous detonation of uranium isn't a problem because neutron strikes detonate it only when a minimum amount of uranium is present (the critical mass). Some questions. Since neutrons are already flying around everywhere, isn't it redundant to have a neutron initiator? It's easy to see (per your theory) that the splitting of one uranium atom would lead to the exponentially accelerating detonation of any nearby mass of uranium (provided each uranium atom releases multiple neutrons). However, you suggest this only occurs with a 'critical' mass of uranium. Why? What makes a critical mass, critical? Are you telling me I can't hold a critical (or super-critical) mass of uranium in my hand without a spontaneous, atomic explosion, initiated by the ubiquitous, atmospheric neutrons?\n\nEvidence Con: My opponent's arguments make sense.\n\nEvidence Con: No prob, Bob. Can I call you Bob?\n","DiscussionID":"00000107","Title":"Atomic Bombs Are Real","CrawlDate":"2016/09/29 05:17:23","URL":"http://www.debate.org/debates/Atomic-Bombs-Are-Real/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000002","PremiseStartPos":[174],"prevID":"00000000","Premise":["I accept this debate. I look forward to a lively discussion. Nuclear Fission Nuclear fission is the process by which a nuclei, when bombarded by some particle, disintegrates into two separate nuclei, and an incredible amount of energy is released in the process. Nuclei are stable when there's a balance between the Coulomb replusion and the attractive strong force. Only certain nuclei are stable, as only certain nuclear configurations are stable. \" Stability of isotopes is affected by the ratio of protons to neutrons, and also by presence of certain \"magic numbers\" of neutrons or protons which represent closed and filled quantum shells. These quantum shells correspond to a set of energy levels within the shell model of the nucleus; filled shells, such as the filled shell of 50 protons for tin, confers unusual stability on the nuclide.\" In addition, bomarding the nucleus gives it kinetic energy, which effects the stability of the nucles as well. Often, simply adding kinetic energy will cause the nuclei to separate as well.[1] The nuclear binding energy is the measure of nuclear stability. The greater the nuclear binding energy, the more attractive the force felt by individual nuclei (in other words, the greater the nuclear binding energy, the greater the stability). Now, it's important to know the sign of the energy. The potential energy of a system acting under an attractive force is negative, because it would take work to separate the system. Stable nuclei are necessarily attractive, meaning that the nuclear binding energy is always negative. Thus, \"greater\" refers to the absolute value of the energy (i.e. not considering the negative sign). The curve of the nuclear binding energy for every element is shown below: The peak per nuclei occurs for the element iron. After that, it steadily decreases. In all actuality, the iron has the least binding energy, but the greatest absolute value binding energy. There are many different examples of nuclear fission, but one of them is U-235 fission. U-235 by itself it stable. However, when bomarded with a neutron, it becomes U-236. Now, U-236 is not unstable by itself, but the kinetic energy the neutron deposits makes it unstable, and about 82% of the time, it fuses, most often into barium, krypton, and three neutrons. This process releases energy, because the nuclear binding energy of the fragments decreases (even though the absolute value of it increases). This can be seen through the mass-energy equivalence - mass is energy and energy is mass. The sum of the mass of the reactants is greater than the sum of the mass of the products, and the difference in mass was converted to energy.[2] How much energy is released by U-235 fission? It varies depending on what the fragments of the reaction are, but it's typically around 150-250 MeV.[3] The Process Behind an Atomic Bomb A basic design works like this. An explosive and some U-235 are placed together inside a bomb. Upon detonation, the explosive will explode, and free neutrons will be released. They bombard into the U-235, causing it to undergo fission. The products of those first reactions include more free neutrons, which bombard the neighboring U-235 atoms, and a chain reaction leads to most of the U-235 being affected. Now, one uranium atom, upon fission, will not release a lot of energy. However, when even a small amount of uranium is put together, the combination of all the energy products means that an enormous amount of energy is released upon the explosion of the bomb. Little Boy, the bomb that fell on Hiroshima, released 63 TJ, equivalent to 15 kilotons of TNT.[4] Evidence of the Atomic Bomb This is all well and good. We have the science down, but what is the evidence that an atomic bomb was actually made? Well, for one thing, look at the evidence at Hiroshima and Nagasaki. Some type of bomb was obviously dropped on those cities, what were the effects of the bomb? For one thing, there was a lot of radiation sickness. \"Radiation injury penetrates deeply into human body and injures cells, and thus molecules, resulting in cell death, inhibited cell division, abnormalities of intracellular molecules and membranes.\" These types of injuries were observed at over the place. There's no way these could have come from a conventional bomb - it must have been something nuclear. For another cancer, skyrocketed afterwards. Leukemia rates, which were essentially zero before hand, skyrocketed. \"By 1975 a total of 1,838 cases were diagnosed as leukemia in Hiroshima and Nagasaki. Of these, 512 were exposed within 10 km from ground zero. Incidence peaked in 1951-52 in both cities.\" This can be seen in the graph below: [5] Conclusion The science of nuclear fission is solid, and from there, making an atomic bomb is as simple as a design. In addition, evidence of raidation poisoning and cancer at Hiroshima and Nagasaki is evidence that atomic bombs were dropped there. Sources [1]: .wikipedia.org/wiki/Uranium-236 [4]:"],"PremiseEndPos":[5157],"ArgumentID":"00000001","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000003","PremiseStartPos":[5172],"prevID":"00000001","Premise":["My opponent cannot simply negate part of my case because he doesn't like it. Atomic theory is only one part of the argument. I need to provide evidence that an atomic bomb actually exists. If I'm not allowed to do that, all I can do is lay down the theoretical framework for a bomb. There's a big difference between debating the theory of something and debating the actuality of that something. So don't ignore my case. Either refute it or concede. As for my opponent's substantial points, he puts forth an interesting question. It turns out that my explanation was a bit too basic. There exists a critical mass, which is the minimum mass necessary for the nuclear chain reaction. Any mass of uranium below that would not be able to undergo fission. The more detailed description is provided here: \"The design used the gun method to explosively force a hollow sub-critical mass of uranium-235 and a solid target cylinder together into a super-critical mass, initiating a nuclear chain reaction. This was accomplished by shooting one piece of the uranium onto the other by means of four cylindrical silk bags of nitrocellulose powder... When the hollow-front projectile reached the target and slid over the target insert, the assembled super-critical mass of uranium would be completely surrounded by a tamper and neutron reflector of tungsten carbide and steel, both materials having a combined mass of 2,300 kg (5,100 lb). Neutron initiators at the base of the projectile were activated by the impact.\" In other words, there is no worry of a stray neutron hitting the sample. The U-235 would explode when wanted.[1][2] Sources [1]: [2]:"],"PremiseEndPos":[6810],"ArgumentID":"00000002","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000004","PremiseStartPos":[6825],"prevID":"00000002","Premise":["You said nothing of the sort. All you said was, \"Keep in mind this a purely theoretical debate.\" This is ambiguous - you don't clarify what you mean by \"theoretical\". Ambiguity in debate conditions on the part of the instigator affects the instigator and the instigator alone. And again, no matter how solid the science is, I still have to show that an atomic bomb actually exists, because otherwise I don't prove existence. Neutrons aren't flying around everywhere. The super-critical mass of U-235 (after the two sub-critical masses have been combined) is protected by a neutron reflector. The neutron initiator produces a source of neutrons for the mass of U-235. However, you don't really need either. Once the two masses collide, they will go through the process of fission. The neutron reflectors and initiators simply make the process a bit more efficient, as they make the explosion a bit more coordinated.[1] The critical mass can be measured using the effective neutron multiplication factor k. This estimates the number of neutrons released through a fission process in a sample that go on to induce more fission reactions (some of the neutrons released do not make it to other sample atoms, but go in other directions). The critical mass occurs when k=1. This means that each fission reaction, on average, produces one neutron that induces another fission reaction. Anything less than this, and the fission process will decay exponentially, as there are not enough free neutrons to sustain the reaction. k depends on the mass of the sample - below the critical mass, k1, and widespread fission reaction occurs.[2] Neutrons are most easily captured by atoms when they move slowly. I'm not sure of the exact numbers, but the free neutrons in the atmosphere move pretty fast. Regardless, I would not walk around with a supercritical mass of uranium in my hand.[3] Sources [1]: [2]: [3]:"],"PremiseEndPos":[8721],"ArgumentID":"00000003","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000005","PremiseStartPos":[8736],"prevID":"00000003","Premise":["Ok, well I thank my opponent for the debate anyway."],"PremiseEndPos":[8788],"ArgumentID":"00000004","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000006","PremiseStartPos":[8803],"prevID":"00000004","Premise":["I'm aware that statement rhymes, so for the purposes of the debate, sure."],"PremiseEndPos":[8877],"ArgumentID":"00000005","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000007","PremiseStartPos":[8892],"prevID":"00000005","Premise":["My opponent will explain the theoretical basis for atomic bombs in the first round. If I decide he isn't a troll, I will try to prove his theory is false. I will do so by showing it's either internally inconsistent or contradicts an empirical law of physics. Good luck. Keep in mind this a purely theoretical debate."],"PremiseEndPos":[9209],"ArgumentID":"00000006","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000008","PremiseStartPos":[9224],"prevID":"00000006","Premise":["The reference to Nagasaki, etc. is prohibited in this debate. This debate is purely theoretical as regards atomic bomb theory; we are not dealing with historical events or actual bombs. So ignore the Evidence of the Atomic Bomb section of my opponent's arguments. Let's see if I understand how my opponent proposes the bomb works. A uranium atom gets hit by a neutron The uranium atom converts to other atoms, releasing energy and neutrons These neutrons strike other uranium atoms (see step 1) My opponent goes on to say that the first neutron strike is initiated intentionally; however, neutrons are flying around everywhere(1), so how does my opponent propose to load uranium into a bomb in the first place without it spontaneously detonating? Back to my opponent. (1)"],"PremiseEndPos":[9996],"ArgumentID":"00000007","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000009","PremiseStartPos":[10011],"prevID":"00000007","Premise":["Pro, of course I can negate the non-theoretical aspects of your atomic bomb proposal. See the rules in the first round; I clearly prohibited proving the feasibility of atomic bombs by reference to empirical instances of their use. You say that spontaneous detonation of uranium isn't a problem because neutron strikes detonate it only when a minimum amount of uranium is present (the critical mass). Some questions. Since neutrons are already flying around everywhere, isn't it redundant to have a neutron initiator? It's easy to see (per your theory) that the splitting of one uranium atom would lead to the exponentially accelerating detonation of any nearby mass of uranium (provided each uranium atom releases multiple neutrons). However, you suggest this only occurs with a 'critical' mass of uranium. Why? What makes a critical mass, critical? Are you telling me I can't hold a critical (or super-critical) mass of uranium in my hand without a spontaneous, atomic explosion, initiated by the ubiquitous, atmospheric neutrons?"],"PremiseEndPos":[11043],"ArgumentID":"00000008","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000010","PremiseStartPos":[11058],"prevID":"00000008","Premise":["My opponent's arguments make sense."],"PremiseEndPos":[11094],"ArgumentID":"00000009","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000000","PremiseStartPos":[11109],"prevID":"00000009","Premise":["No prob, Bob. Can I call you Bob?"],"PremiseEndPos":[11143],"ArgumentID":"00000010","Conclusion":"Atomic Bombs Are Real","PremiseStance":["Con"]}}]}