{"MetaData":{"Context":"URL: http://www.debate.org/debates/Lets-talk-about-Feminism/1/\nCrawl date: 2016/09/29 03:58:06\nDebate: Let's talk about Feminism | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: I accept. Feminism: the advocacy of women's rights on the ground of the equality of the sexes. As Pro I will be arguing pro feminism. Therefore I believe that women should have the same rights as men. I will allow con to begin. Source\n\nEvidence Pro: Your argument is not specific. You claim that you are against feminism yet you believe that women should have the rights as men. I do believe that woman do receive the same rights of men in some countries although feminism is not a country specific belief system. Just because you cannot name any rights that men have and women don't it doesn't mean that you are against feminism. The fact is, there is still no law enforcing equal pay for equal work. What's more, the gender wage gap becomes exponentially worse when a woman is also a person of color. According to the American Association of University Women, white women earn 78 cents to men's dollar, but black women only earn 64 cents to men's dollar. Hispanic and Latina women earn even less at 54 cents! This is just one of countless examples of women's rights that should be enforced in the UK and America. If we were to talk about other countries such as: \" \"Afghanistan: The average Afghan girl will live to only 45 \" one year less than an Afghan male. After three decades of war and religion-based repression, an overwhelming number of women are illiterate. More than half of all brides are under 16, and one woman dies in childbirth every half hour. Domestic violence is so common that 87 per cent of women admit to experiencing it. But more than one million widows are on the streets, often forced into prostitution. Afghanistan is the only country in which the female suicide rate is higher than that of males.\" \" \"Iraq: The U.S.-led invasion to \"liberate\" Iraq from Saddam Hussein has imprisoned women in an inferno of sectarian violence that targets women and girls. The literacy rate, once the highest in the Arab world, is now among the lowest as families fear risking kidnapping and rape by sending girls to school. Women who once went out to work stay home. Meanwhile, more than 1 million women have been displaced from their homes, and millions more are unable to earn enough to eat.\" \" \"Nepal: Early marriage and childbirth exhaust the country's malnourished women, and one in 24 will die in pregnancy or childbirth. Daughters who aren't married off may be sold to traffickers before they reach their teens. Widows face extreme abuse and discrimination if they're labelled bokshi, meaning witches. A low-level civil war between government and Maoist rebels has forced rural women into guerrilla groups.\" If we were to talk about these countries then I'm sure that it is obvious, even to people against feminism, that women are not receiving equal rights. If you believe that it should stay this way in these countries then you may continue to debate this with me but judging from your argument in the second round I doubt that you interpreted this debate the way that most people have. Sources\n\nEvidence Pro: As I have said in the previous round women do not receive the same rights as men in many countries including the UK and USA. You claim that you have bumped into feminists yet you also claim that you don't know what more they could want? I'm pretty sure that if you stopped to talk to them they would have told you what they wanted. As I mentioned earlier women are fighting for the same wages as men (for the same jobs). Continuing on from this point women also find it significantly harder to receive the senior positions that men do. \"The overall gender pay gap, which the Office for National Statistics defines as the difference between men\"s and women\"s hourly earnings as a percentage of men\"s earnings, stands at a record low of 19.1pc as of April 2014, after increasing for the first time in five years to 19.8pc last year. For full-time workers, the pay gap narrowed to an all-time low of 9.4pc from 10pc last year. Women working full-time saw their earnings increase more than their male counterparts this year, by 0.6pc compared with 0.3pc, which took the average weekly earnings as of April 2014 to \"462 for women and \"558 for men.\" This is not equality. Men can get custody, but if the judge feels that the kids would be better off with the mother ( and usually at a young age they will) Also they consider the gender of the kids, who takes the kids to school, drs appointments, who cooks for them, picks their clothes, etc. and most of the time it is a mother. If there is a male child and he is older they will likely want to put him with the father. Feminism isn't about whether you have the right to slap a man or not. It is about important issues. Who cares if a woman slaps a man. If it is serious the police and the court will get involved - if not then the man should be a responsible adult and deal with it. Feminism is about equality that will improve a woman's life quality to the same life quality of a man. Wages and job positions are important. The right to slap a man is not. When I wrote about men being paid more than women (in case this is unclear) I was talking about men being paid more than women for doing the same jobs - with the same amount of work. Sources (verified)\n\nEvidence Pro: I extend all my previous arguments.\n\nEvidence Pro: Vote Me!\n\nEvidence Con: Feminism. I do not agree with feminism. Anybody accept this debate?\n\nEvidence Con: I do as well think that women should have the same rights as men. Although, let me ask you what rights do men have that women do not? (Please answer)\n\nEvidence Con: My apologies for not being specific. There is no way that I think men should have more rights than women. I'm more against the feminists. Not everyone, but the ones that I have recently bumped into have made me question feminism. I know that having equal rights is important, but I also think that women have all the same rights as men. I don't understand what more the women could want. If anything, women have more rights than men. For instance, men rarely ever get custody of a their children. A man cannot hit a women, but a women can hit a man, and no one says a thing (I'm not saying that men should be able to hit women). I also can see both sides of the conflict of men getting paid more than women. I see why women think that they don't get paid as much as men is unfair. Although, based on the stereotypes of men and women, a man has the pressure of being obligated to able to provide for his family, and with that stereotype and obligation, I can see why they get paid maybe a little more than women.\n\nEvidence Con: OliviaAllen forfeited this round. Pro I extend all my previous arguments.\n\nEvidence Con: OliviaAllen forfeited this round. Pro Vote Me!\n","DiscussionID":"00000050","Title":"Let's talk about Feminism","CrawlDate":"2016/09/29 03:58:06","URL":"http://www.debate.org/debates/Lets-talk-about-Feminism/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000002","PremiseStartPos":[180],"prevID":"00000000","Premise":["I accept. Feminism: the advocacy of women's rights on the ground of the equality of the sexes. As Pro I will be arguing pro feminism. Therefore I believe that women should have the same rights as men. I will allow con to begin. Source"],"PremiseEndPos":[415],"ArgumentID":"00000001","Conclusion":"Let's talk about Feminism","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000003","PremiseStartPos":[430],"prevID":"00000001","Premise":["Your argument is not specific. You claim that you are against feminism yet you believe that women should have the rights as men. I do believe that woman do receive the same rights of men in some countries although feminism is not a country specific belief system. Just because you cannot name any rights that men have and women don't it doesn't mean that you are against feminism. The fact is, there is still no law enforcing equal pay for equal work. What's more, the gender wage gap becomes exponentially worse when a woman is also a person of color. According to the American Association of University Women, white women earn 78 cents to men's dollar, but black women only earn 64 cents to men's dollar. Hispanic and Latina women earn even less at 54 cents! This is just one of countless examples of women's rights that should be enforced in the UK and America. If we were to talk about other countries such as: \" \"Afghanistan: The average Afghan girl will live to only 45 \" one year less than an Afghan male. After three decades of war and religion-based repression, an overwhelming number of women are illiterate. More than half of all brides are under 16, and one woman dies in childbirth every half hour. Domestic violence is so common that 87 per cent of women admit to experiencing it. But more than one million widows are on the streets, often forced into prostitution. Afghanistan is the only country in which the female suicide rate is higher than that of males.\" \" \"Iraq: The U.S.-led invasion to \"liberate\" Iraq from Saddam Hussein has imprisoned women in an inferno of sectarian violence that targets women and girls. The literacy rate, once the highest in the Arab world, is now among the lowest as families fear risking kidnapping and rape by sending girls to school. Women who once went out to work stay home. Meanwhile, more than 1 million women have been displaced from their homes, and millions more are unable to earn enough to eat.\" \" \"Nepal: Early marriage and childbirth exhaust the country's malnourished women, and one in 24 will die in pregnancy or childbirth. Daughters who aren't married off may be sold to traffickers before they reach their teens. Widows face extreme abuse and discrimination if they're labelled bokshi, meaning witches. A low-level civil war between government and Maoist rebels has forced rural women into guerrilla groups.\" If we were to talk about these countries then I'm sure that it is obvious, even to people against feminism, that women are not receiving equal rights. If you believe that it should stay this way in these countries then you may continue to debate this with me but judging from your argument in the second round I doubt that you interpreted this debate the way that most people have. Sources"],"PremiseEndPos":[3196],"ArgumentID":"00000002","Conclusion":"Let's talk about Feminism","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000004","PremiseStartPos":[3211],"prevID":"00000002","Premise":["As I have said in the previous round women do not receive the same rights as men in many countries including the UK and USA. You claim that you have bumped into feminists yet you also claim that you don't know what more they could want? I'm pretty sure that if you stopped to talk to them they would have told you what they wanted. As I mentioned earlier women are fighting for the same wages as men (for the same jobs). Continuing on from this point women also find it significantly harder to receive the senior positions that men do. \"The overall gender pay gap, which the Office for National Statistics defines as the difference between men\"s and women\"s hourly earnings as a percentage of men\"s earnings, stands at a record low of 19.1pc as of April 2014, after increasing for the first time in five years to 19.8pc last year. For full-time workers, the pay gap narrowed to an all-time low of 9.4pc from 10pc last year. Women working full-time saw their earnings increase more than their male counterparts this year, by 0.6pc compared with 0.3pc, which took the average weekly earnings as of April 2014 to \"462 for women and \"558 for men.\" This is not equality. Men can get custody, but if the judge feels that the kids would be better off with the mother ( and usually at a young age they will) Also they consider the gender of the kids, who takes the kids to school, drs appointments, who cooks for them, picks their clothes, etc. and most of the time it is a mother. If there is a male child and he is older they will likely want to put him with the father. Feminism isn't about whether you have the right to slap a man or not. It is about important issues. Who cares if a woman slaps a man. If it is serious the police and the court will get involved - if not then the man should be a responsible adult and deal with it. Feminism is about equality that will improve a woman's life quality to the same life quality of a man. Wages and job positions are important. The right to slap a man is not. When I wrote about men being paid more than women (in case this is unclear) I was talking about men being paid more than women for doing the same jobs - with the same amount of work. Sources (verified)"],"PremiseEndPos":[5416],"ArgumentID":"00000003","Conclusion":"Let's talk about Feminism","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000005","PremiseStartPos":[5431],"prevID":"00000003","Premise":["I extend all my previous arguments."],"PremiseEndPos":[5467],"ArgumentID":"00000004","Conclusion":"Let's talk about Feminism","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000006","PremiseStartPos":[5482],"prevID":"00000004","Premise":["Vote Me!"],"PremiseEndPos":[5491],"ArgumentID":"00000005","Conclusion":"Let's talk about Feminism","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000007","PremiseStartPos":[5506],"prevID":"00000005","Premise":["Feminism. I do not agree with feminism. Anybody accept this debate?"],"PremiseEndPos":[5574],"ArgumentID":"00000006","Conclusion":"Let's talk about Feminism","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000008","PremiseStartPos":[5589],"prevID":"00000006","Premise":["I do as well think that women should have the same rights as men. Although, let me ask you what rights do men have that women do not? (Please answer)"],"PremiseEndPos":[5739],"ArgumentID":"00000007","Conclusion":"Let's talk about Feminism","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000009","PremiseStartPos":[5754],"prevID":"00000007","Premise":["My apologies for not being specific. There is no way that I think men should have more rights than women. I'm more against the feminists. Not everyone, but the ones that I have recently bumped into have made me question feminism. I know that having equal rights is important, but I also think that women have all the same rights as men. I don't understand what more the women could want. If anything, women have more rights than men. For instance, men rarely ever get custody of a their children. A man cannot hit a women, but a women can hit a man, and no one says a thing (I'm not saying that men should be able to hit women). I also can see both sides of the conflict of men getting paid more than women. I see why women think that they don't get paid as much as men is unfair. Although, based on the stereotypes of men and women, a man has the pressure of being obligated to able to provide for his family, and with that stereotype and obligation, I can see why they get paid maybe a little more than women."],"PremiseEndPos":[6766],"ArgumentID":"00000008","Conclusion":"Let's talk about Feminism","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000010","PremiseStartPos":[6781],"prevID":"00000008","Premise":["OliviaAllen forfeited this round. Pro I extend all my previous arguments."],"PremiseEndPos":[6855],"ArgumentID":"00000009","Conclusion":"Let's talk about Feminism","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":103,"ConclusionEndPos":128,"nextID":"00000000","PremiseStartPos":[6870],"prevID":"00000009","Premise":["OliviaAllen forfeited this round. Pro Vote Me!"],"PremiseEndPos":[6917],"ArgumentID":"00000010","Conclusion":"Let's talk about Feminism","PremiseStance":["Con"]}}]}