{"MetaData":{"Context":"URL: http://www.debate.org/debates/Barack-Obama-should-not-disarm-the-general-American-public-of-their-guns./1/votes/2/\nCrawl date: 2016/09/29 07:29:51\nDebate Argument: Barack Obama should not disarm the general American public of their guns. | Debate.org\nNumber of arguments: 10\n\n\nEvidence Pro: Barack Obama clearly does not like the idea of Americans wielding guns. However, there are three reasons why this should not be done. 1. It is unconstitutional. The second Bill of Rights amendment: \"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\" 2. It hurts the innocent more than the criminals. People go hunting with guns all of the time. People protect themselves with guns all of the time. People also rob others with guns all of the time. The former two groups are innocent. The latter group is criminal. The innocent people would be hurt by any sort of gun control, and would not to wish to have to break a law just to enjoy a hunting trip, or feel more safe. Criminals, on the other hand, are already breaking the law, so they would just obtain and hold guns illegally. 3. Gun freedom lowers crime rates. Robbers are less likely to charge into a building and rob it if he fears that a number of bystanders may be concealing a gun that could shoot him in the head. Take this poor fellow, for example: Thank you for reading, and good luck to whoever accepts this.\n\nEvidence Pro: Thank you for responding so quickly. \"First off, your source is a campaign video, they emphasize the bad things. Second, he wants gun CONTROL not a gun ban. I am asssuming this is what we are to debate.\" I already know that he wants gun control. I'm just fearing that he might step it up to making guns illegal. That is the point that I am trying to make here. Sorry, but you assumed wrong. \"Gun control doesn't violate our second amendment right. It makes it harder to get a gun, but not illegal. Barack Obama wants to make it so you cannot go to K-Mart, buy a gun, and shoot someone.\" Disarming the general public does violate our second amendment right. \"You still can get a gun, it is just harder to.\" Not if you've been disarmed. \"There are other methods one can use to protect themselves.\" But people like their guns, and they are one of the better methods for security during a home invasion. Barack Obama did, as a Senator in Illinois, try to make it so that if you shoot a robber when he robs your house, you can get charged with gun assault. \"It is not breaking the law unless there is a gun ban.\" And I'm talking about a gun ban. Even if it is just gun control, the innocent hunters have to spend much more time becoming registered for a gun, while a robber would just obtain one through illegal means. \"Actually the homcide rate is much lower in countries that have gun control (United Kingdom 2.1, Japan .5, Germany 1, Italy 1.2)\" I'm looking at your sources, and they just say what the homicide rates are. They say nothing about which countries have gun control and which ones don't. The word \"control\" does not appear anywhere on either of your sources. I see no correlation. Thank you for accepting, and sorry about the misunderstanding.\n\nEvidence Pro: Please clarify a absolute resolution.\" Barack Obama should not disarm the general American public of their guns. That's about as clear and absolute as it can get. disarm - to divest of arms ( arms - guns \"The constitution can be changed, this is not an argument for guns, it is just a statement\" First off, that was just a response to your comment about how gun control doesn't violate our second amendment rights. Secondly, to change the constitution, three-fourths of the states have to agree to give up their guns completely. \"Forty-four states have a provision in their state constitutions similar to the Second Amendment of the Bill of Rights (the exceptions are California, Iowa, Maryland, Minnesota, New Jersey, and New York).\" Somehow, I doubt that such an amendment could be passed by states that like the idea of gun rights. \"I am going to need a source that is not extremely bias to tell me this.\" They are all facts; it's just that it shows the facts they want you to hear. Here's another source: You also failed to refute, and thus conceded, the fact that people like their guns, and they are one of the better methods for security during a home invasion. \"These prove that gun control is safe, so it should be instituted.\" Gun control is irrelevant to this debate, because this debate is about disarming people, not regulating them. I am against strict gun control as well as against gun bans, but this debate is about banning, not controlling. Additionally, loose gun control sure seems to be working for Texas. If a Japanese man got his hands on a gun and robbed a store, they would probably be powerless. Not so in Texas. In conclusion, my opponent has not actually said anything about gun bans, only gun control, which is irrelevant, and Barack Obama should not disarm us. Thank you.\n\nEvidence Pro: \"Well obviously HE shouldn't because that would be a gross overuse of excecutive power. I am assuming he shouldn't argue for it. Though this is not what Baraack Obama wants, he wants gun control.\" Barack Obama is slowly moving towards wanting gun bans. Also, I think you just conceded the resolution, which basically means that you conceded the entire debate. \"Gun CONTROL doesn't, however, I didn't understand the resolution. I now understand we ae arguing a gun ban.\" Good. \"Just because it is unlikely does not mean it shouldn't happen.\" Well, I'm just going to come out and say that it CAN'T happen. 38 states are required to undo the second amendment. 13 are necessary to disagree. Forty-four states, however, like their gun rights. I can guarantee that it will take more than eight years for them to want to change their ways to not include gun rights, and by then, Obama will have no presidential power. I know that Texas will not give up its guns in the near future. \"He is for gun CONTROL not a gun ban, and, yes, I do concede the point that people like there guns. So dpo criminals, gangs, and other \"Wrong-doers\". If you want to protect yourself, use another method.\" If you're under eighteen, you are not allowed to have a gun. But that doesn't apply to the \"general American public\". Also, criminals will have guns, whether there is a gun ban or not. If a robber breaks into your house, and you have a gun, and you manage to point your gun at him before he draws his gun, you're safe. If you're unarmed, however, you're either dead or robbed. Guns are THE best protection method to use in a home invasion. They're quick and long range, all you have to do is point and hold a finger on the trigger, and it doesn't take too much skill to use. No other weapon is so efficient. If there is, it would be banned before guns. People lose their gun rights when they abuse them. This does not apply to the general public. Generally, if everyone has a gun, it is safer than if only those who are willing to break the law having a gun. \"Strict gun control works in the same effect as a ban in most cases. Also, if in your hypothetical situation, the criminal didn't have a gun, or the police were doing their job, there would be no problem.\" The criminal will always have a gun. He could import one, he could build one himself, I don't care. The point is, the criminal will get his dirty hands on a gun and use it. Also, the police can't get to every robbery, especially if the robber doesn't let anyone call 911. It is so much more efficient for a civilian to just shoot the robber then and there. \"I am sorry about the misunderstanding of the resolution.\" Yeah, I think that the entire misunderstanding thing killed the debate. Thank you for responding.\n\nEvidence Pro: \"I made a grammatical error. I meant to say ' I am assuming you are saying he shouldn't argue for it'\" Grammar errors are bad, yes. Obama can argue all he wants; he just shouldn't actually disarm us, for the reasons I have listed. \"Just because it cannot happen does not make it wrong. We are debating if a gun ban should happen, not if it is possible.\" And it should not happen, because the states are against Obama on this issue, and this debate is about whether Obama should remove our guns or not. \"I disagree. If you make it extremely hard to get a gun, you will be able to easier track suspicious activity.\" It will be easier, but it will not be easy. The number of attempted crimes may go down, but the number of successful crimes will go up. \"Or use a dog or pepper spray or martial arts.\" One shot kills a dog. Pepper spray is harder to hit long-distance, and needs better aim. Martial arts is close-range. A gun can kill you before you can punch him. \"Crime rates are lower in countries with gun control. The US crtime rate is 80 (Italy is 30, Japan 19, Spain 22)\" Again, this source does not identify which countries support gun control. It would help if the source marked the countries that banned or highly regulated guns. Also, a quote from your source that makes data questionable: \"Comparing international crime statistics must be done with great caution. Statistics compiled by the United Nations are based on surveys that specify that crimes be counted based on each country's legislated definition of what constitute a 'crime'. Some countries may include misdemeanor offences, where a fine is issued while others may only count imprisionable offences. Also, counting the crime takes place at different places in the law-enforcement process. Consequently, some countries may count every reported breach of the law, while others may only count cases that make it to court, and even then only the most serious of several charges laid. Because there is so much inconsistency in these statistics, they might also be a quality measure of the standard and efficiency of law enforcement and the criminal justice system of a country, rather than having anything to do with actual prevalence of crime.\" \"Or deadly, they are extremely dangerous\" Nuclear bombs are more deadly and more dangerous. But they aren't nearly as efficient for defense against a home invasion. \"Oh, no! A robber! I'm going to throw a nuke at him!\" *throws* BOOOOOOOOOOM! Everything within a ten-mile radius explodes. \"The majority of murders in the US were from arguments in 2007. Not robbery. By having the gun, that allowed someone angry to just kill someone else. The majority of murder is not planned out. By taking away the gun, you nearly completely eliminate that.\" What, so instead of shooting, you think that they should have strangled each other? Drowned each other? Guns don't kill people. People kill people. \"Yep, but I hope we will understand eachother now.\" We understand each other. Hopefully, this debate has been fixed. \"Thank you.\" You're welcome. IN CONCLUSION: Obama should not disarm the general American public of their guns. 1. It is unconstitutional, and there is no way that 38 states would suddenly repeal their own amendments within the next eight years. 2. People who hunt for sport, or protect themselves with guns, would be severely hurt by a gun ban. If you outlaw guns, only outlaws will have guns. 3. If random people in a store are carrying guns, a robber is less likely to want to rob that store, and much less likely to succeed. Thank you for this debate. Vote PRO.\n\nEvidence Con: Thank you for putting this debate up. \"Barack Obama clearly does not like the idea of Americans wielding guns. However, there are three reasons why this should not be done.\" First off, your source is a campaign video, they emphasize the bad things. Second, he wants gun CONTROL not a gun ban. I am asssuming this is what we are to debate. \"1. It is unconstitutional.\" The second Bill of Rights amendment: \"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\" Gun control doesn't violate our second ammendment right. It makes it harder to get a gun, but not illegal. Barack Obama wants to make it so you cannot go to K-Mart, buy a gun, and shoot someone. \"2. It hurts the innocent more than the criminals.\" I beg to differ. \"People go hunting with guns all of the time\" You still can get a gun, it is just harder to. \"People protect themselves with guns all of the time\" There are other methods one can use to protect themselves. \"People also rob others with guns all of the time. The former two groups are innocent. The latter group is criminal. The innocent people would be hurt by any sort of gun control, and would not to wish to have to break a law just to enjoy a hunting trip, or feel more safe. Criminals, on the other hand, are already breaking the law, so they would just obtain and hold guns illegally.\" It is not breaking the law unless there is a gun ban. \"3. Gun freedom lowers crime rates. Robbers are less likely to charge into a building and rob it if he fears that a number of bystanders may be concealing a gun that could shoot him in the head. Take this poor fellow, for example: Actually the homcide rate is much lower in countries that have gun control (United Kingdom 2.1, Japan .5, Germany 1, Italy 1.2)( ( Thank you for reading\n\nEvidence Con: \"I already know that he wants gun control. I'm just fearing that he might step it up to making guns illegal. That is the point that I am trying to make here. Sorry, but you assumed wrong.\" Please clarify a absolute resolution. \"Disarming the general public does violate our second amendment right.\" The constitution can be changed, this is not an argument for guns, it is just a statement \"But people like their guns, and they are one of the better methods for security during a home invasion. Barack Obama did, as a Senator in Illinois, try to make it so that if you shoot a robber when he robs your house, you can get charged with gun assault.\" I am going to need a source that is not extremely bias to tell me this. \"I'm looking at your sources, and they just say what the homicide rates are. They say nothing about which countries have gun control and which ones don't. The word \"control\" does not appear anywhere on either of your sources. I see no correlation.\" Forgot to add these These prove that gun control is safe, so it should be instituted.\n\nEvidence Con: Thank you for a quick response. \"Barack Obama should not disarm the general American public of their guns.\" Well obviously HE shouldn't because that would be a gross overuse of excecutive power. I am assuming he shouldn't argue for it. Though this is not what Baraack Obama wants, he wants gun control. \"First off, that was just a response to your comment about how gun control doesn't violate our second amendment rights.\" Gun CONTROL doesn't, however, I didn't understand the resolution. I now understand we ae arguing a gun ban. \"Secondly, to change the constitution, three-fourths of the states have to agree to give up their guns completely. \"Forty-four states have a provision in their state constitutions similar to the Second Amendment of the Bill of Rights (the exceptions are California, Iowa, Maryland, Minnesota, New Jersey, and New York).\" Somehow, I doubt that such an amendment could be passed by states that like the idea of gun rights.\" Just because it is unlikely does not mean it shouldn't happen. \"They are all facts; it's just that it shows the facts they want you to hear. Here's another source: You also failed to refute, and thus conceded, the fact that people like their guns, and they are one of the better methods for security during a home invasion.\" He is for gun CONTROL not a gun ban, and, yes, I do concede the point that people like there guns. So dpo criminals, gangs, and other \"Wrong-doers\". If you want to protect yourself, use another method. \"Gun control is irrelevant to this debate, because this debate is about disarming people, not regulating them. I am against strict gun control as well as against gun bans, but this debate is about banning, not controlling. Additionally, loose gun control sure seems to be working for Texas. If a Japanese man got his hands on a gun and robbed a store, they would probably be powerless. Not so in Texas.\" Strict gun control works in the same effect as a ban in most cases. Also, if in your hypothetical situation, the criminal didn't have a gun, or the police were doing their job, there would be no problem. \"In conclusion, my opponent has not actually said anything about gun bans, only gun control, which is irrelevant, and Barack Obama should not disarm us.\" I am sorry about the misunderstanding of the resolution. Thank you.\n\nEvidence Con: \"Barack Obama is slowly moving towards wanting gun bans. Also, I think you just conceded the resolution, which basically means that you conceded the entire debate.\" I made a grammatical error. I meant to say \" I am assuming you are saying he shouldn't argue for it\" \"Well, I'm just going to come out and say that it CAN'T happen. 38 states are required to undo the second amendment. 13 are necessary to disagree. Forty-four states, however, like their gun rights. I can guarantee that it will take more than eight years for them to want to change their ways to not include gun rights, and by then, Obama will have no presidential power. I know that Texas will not give up its guns in the near future.\" Just because it cannot happen does not make it wrong. We are debating if a gun ban should happen, not if it is possible. \"If you're under eighteen, you are not allowed to have a gun. But that doesn't apply to the \"general American public\". Also, criminals will have guns, whether there is a gun ban or not.\" I disagree. If you make it extremely hard to get a gun, you will be able to easier track suspicious activity. \"If a robber breaks into your house, and you have a gun, and you manage to point your gun at him before he draws his gun, you're safe.\" Or use a dog or pepper spray or martial arts. \"If you're unarmed, however, you're either dead or robbed.\" Crime rates are lower in countries with gun control. The US crtime rate is 80 (Italy is 30, Japan 19, Spain 22) ( \"Guns are THE best protection method to use in a home invasion. They're quick and long range, all you have to do is point and hold a finger on the trigger, and it doesn't take too much skill to use. No other weapon is so efficient.\" Or deadly, they are extremely dangerous \"The criminal will always have a gun. He could import one, he could build one himself, I don't care. The point is, the criminal will get his dirty hands on a gun and use it. Also, the police can't get to every robbery, especially if the robber doesn't let anyone call 911. It is so much more efficient for a civilian to just shoot the robber then and there.\" The majority of murders in the US were from arguments in 2007. Not robbery. By having the gun, that allowed someone angry to just kill someone else. The majority of murder is not planned out. By taking away the gun, you nearly completely eliminate that. \"Yeah, I think that the entire misunderstanding thing killed the debate.\" Yep, but I hope we will understand eachother now. Thank you.\n\nEvidence Con: Thank you for all voters, my opponent, and those who are reading. I will not bring up new arguments, but only refute my opponent's points. \"Obama can argue all he wants; he just shouldn't actually disarm us, for the reasons I have listed.\" I disagree. \"And it should not happen, because the states are against Obama on this issue, and this debate is about whether Obama should remove our guns or not.\" Again, just because it is not popular does not mean it will not be effective and shouldn't be implemented. \"One shot kills a dog. Pepper spray is harder to hit long-distance, and needs better aim. Martial arts is close-range. A gun can kill you before you can punch him.\" Those were just examples, and if you look at the stats, having a gun on you makes it more likely for you to kill someone over a argument rather than in self defense. \"Again, this source does not identify which countries support gun control. It would help if the source marked the countries that banned or highly regulated guns\" \"Comparing international crime statistics must be done with great caution. Statistics compiled by the United Nations are based on surveys that specify that crimes be counted based on each country's legislated definition of what constitute a 'crime'. Some countries may include misdemeanor offences, where a fine is issued while others may only count imprisionable offences. Also, counting the crime takes place at different places in the law-enforcement process. Consequently, some countries may count every reported breach of the law, while others may only count cases that make it to court, and even then only the most serious of several charges laid. Because there is so much inconsistency in these statistics, they might also be a quality measure of the standard and efficiency of law enforcement and the criminal justice system of a country, rather than having anything to do with actual prevalence of crime.\" Comparing specific crimes negates this. RAPE ( US: .3 UK: .15 SPAIN: .14 JAPAN: .01 MURDER ( US: .042 UK: .014 SPAIN: .012 JAPAN: .004 ASSAULTS ( US: 7.56 UK: 7.45 SPAIN: 2.2 JAPAN: .33 NOTE: All stats given were per capita \"Nuclear bombs are more deadly and more dangerous. But they aren't nearly as efficient for defense against a home invasion. \"Oh, no! A robber! I'm going to throw a nuke at him!\" *throws* BOOOOOOOOOOM! Everything within a ten-mile radius explodes\" I don't understand the point he's making here. \"What, so instead of shooting, you think that they should have strangled each other? Drowned each other? Guns don't kill people. People kill people.\" Guns make it easier to kill people. Thank you.\n","DiscussionID":"00000067","Title":"Barack Obama should not disarm the general American public of their guns.","CrawlDate":"2016/09/29 07:29:51","URL":"http://www.debate.org/debates/Barack-Obama-should-not-disarm-the-general-American-public-of-their-guns./1/votes/2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000002","PremiseStartPos":[295],"prevID":"00000000","Premise":["Barack Obama clearly does not like the idea of Americans wielding guns. However, there are three reasons why this should not be done. 1. It is unconstitutional. The second Bill of Rights amendment: \"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\" 2. It hurts the innocent more than the criminals. People go hunting with guns all of the time. People protect themselves with guns all of the time. People also rob others with guns all of the time. The former two groups are innocent. The latter group is criminal. The innocent people would be hurt by any sort of gun control, and would not to wish to have to break a law just to enjoy a hunting trip, or feel more safe. Criminals, on the other hand, are already breaking the law, so they would just obtain and hold guns illegally. 3. Gun freedom lowers crime rates. Robbers are less likely to charge into a building and rob it if he fears that a number of bystanders may be concealing a gun that could shoot him in the head. Take this poor fellow, for example: Thank you for reading, and good luck to whoever accepts this."],"PremiseEndPos":[1464],"ArgumentID":"00000001","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000003","PremiseStartPos":[1479],"prevID":"00000001","Premise":["Thank you for responding so quickly. \"First off, your source is a campaign video, they emphasize the bad things. Second, he wants gun CONTROL not a gun ban. I am asssuming this is what we are to debate.\" I already know that he wants gun control. I'm just fearing that he might step it up to making guns illegal. That is the point that I am trying to make here. Sorry, but you assumed wrong. \"Gun control doesn't violate our second amendment right. It makes it harder to get a gun, but not illegal. Barack Obama wants to make it so you cannot go to K-Mart, buy a gun, and shoot someone.\" Disarming the general public does violate our second amendment right. \"You still can get a gun, it is just harder to.\" Not if you've been disarmed. \"There are other methods one can use to protect themselves.\" But people like their guns, and they are one of the better methods for security during a home invasion. Barack Obama did, as a Senator in Illinois, try to make it so that if you shoot a robber when he robs your house, you can get charged with gun assault. \"It is not breaking the law unless there is a gun ban.\" And I'm talking about a gun ban. Even if it is just gun control, the innocent hunters have to spend much more time becoming registered for a gun, while a robber would just obtain one through illegal means. \"Actually the homcide rate is much lower in countries that have gun control (United Kingdom 2.1, Japan .5, Germany 1, Italy 1.2)\" I'm looking at your sources, and they just say what the homicide rates are. They say nothing about which countries have gun control and which ones don't. The word \"control\" does not appear anywhere on either of your sources. I see no correlation. Thank you for accepting, and sorry about the misunderstanding."],"PremiseEndPos":[3233],"ArgumentID":"00000002","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000004","PremiseStartPos":[3248],"prevID":"00000002","Premise":["Please clarify a absolute resolution.\" Barack Obama should not disarm the general American public of their guns. That's about as clear and absolute as it can get. disarm - to divest of arms ( arms - guns \"The constitution can be changed, this is not an argument for guns, it is just a statement\" First off, that was just a response to your comment about how gun control doesn't violate our second amendment rights. Secondly, to change the constitution, three-fourths of the states have to agree to give up their guns completely. \"Forty-four states have a provision in their state constitutions similar to the Second Amendment of the Bill of Rights (the exceptions are California, Iowa, Maryland, Minnesota, New Jersey, and New York).\" Somehow, I doubt that such an amendment could be passed by states that like the idea of gun rights. \"I am going to need a source that is not extremely bias to tell me this.\" They are all facts; it's just that it shows the facts they want you to hear. Here's another source: You also failed to refute, and thus conceded, the fact that people like their guns, and they are one of the better methods for security during a home invasion. \"These prove that gun control is safe, so it should be instituted.\" Gun control is irrelevant to this debate, because this debate is about disarming people, not regulating them. I am against strict gun control as well as against gun bans, but this debate is about banning, not controlling. Additionally, loose gun control sure seems to be working for Texas. If a Japanese man got his hands on a gun and robbed a store, they would probably be powerless. Not so in Texas. In conclusion, my opponent has not actually said anything about gun bans, only gun control, which is irrelevant, and Barack Obama should not disarm us. Thank you."],"PremiseEndPos":[5050],"ArgumentID":"00000003","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000005","PremiseStartPos":[5065],"prevID":"00000003","Premise":["\"Well obviously HE shouldn't because that would be a gross overuse of excecutive power. I am assuming he shouldn't argue for it. Though this is not what Baraack Obama wants, he wants gun control.\" Barack Obama is slowly moving towards wanting gun bans. Also, I think you just conceded the resolution, which basically means that you conceded the entire debate. \"Gun CONTROL doesn't, however, I didn't understand the resolution. I now understand we ae arguing a gun ban.\" Good. \"Just because it is unlikely does not mean it shouldn't happen.\" Well, I'm just going to come out and say that it CAN'T happen. 38 states are required to undo the second amendment. 13 are necessary to disagree. Forty-four states, however, like their gun rights. I can guarantee that it will take more than eight years for them to want to change their ways to not include gun rights, and by then, Obama will have no presidential power. I know that Texas will not give up its guns in the near future. \"He is for gun CONTROL not a gun ban, and, yes, I do concede the point that people like there guns. So dpo criminals, gangs, and other \"Wrong-doers\". If you want to protect yourself, use another method.\" If you're under eighteen, you are not allowed to have a gun. But that doesn't apply to the \"general American public\". Also, criminals will have guns, whether there is a gun ban or not. If a robber breaks into your house, and you have a gun, and you manage to point your gun at him before he draws his gun, you're safe. If you're unarmed, however, you're either dead or robbed. Guns are THE best protection method to use in a home invasion. They're quick and long range, all you have to do is point and hold a finger on the trigger, and it doesn't take too much skill to use. No other weapon is so efficient. If there is, it would be banned before guns. People lose their gun rights when they abuse them. This does not apply to the general public. Generally, if everyone has a gun, it is safer than if only those who are willing to break the law having a gun. \"Strict gun control works in the same effect as a ban in most cases. Also, if in your hypothetical situation, the criminal didn't have a gun, or the police were doing their job, there would be no problem.\" The criminal will always have a gun. He could import one, he could build one himself, I don't care. The point is, the criminal will get his dirty hands on a gun and use it. Also, the police can't get to every robbery, especially if the robber doesn't let anyone call 911. It is so much more efficient for a civilian to just shoot the robber then and there. \"I am sorry about the misunderstanding of the resolution.\" Yeah, I think that the entire misunderstanding thing killed the debate. Thank you for responding."],"PremiseEndPos":[7823],"ArgumentID":"00000004","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000006","PremiseStartPos":[7838],"prevID":"00000004","Premise":["\"I made a grammatical error. I meant to say ' I am assuming you are saying he shouldn't argue for it'\" Grammar errors are bad, yes. Obama can argue all he wants; he just shouldn't actually disarm us, for the reasons I have listed. \"Just because it cannot happen does not make it wrong. We are debating if a gun ban should happen, not if it is possible.\" And it should not happen, because the states are against Obama on this issue, and this debate is about whether Obama should remove our guns or not. \"I disagree. If you make it extremely hard to get a gun, you will be able to easier track suspicious activity.\" It will be easier, but it will not be easy. The number of attempted crimes may go down, but the number of successful crimes will go up. \"Or use a dog or pepper spray or martial arts.\" One shot kills a dog. Pepper spray is harder to hit long-distance, and needs better aim. Martial arts is close-range. A gun can kill you before you can punch him. \"Crime rates are lower in countries with gun control. The US crtime rate is 80 (Italy is 30, Japan 19, Spain 22)\" Again, this source does not identify which countries support gun control. It would help if the source marked the countries that banned or highly regulated guns. Also, a quote from your source that makes data questionable: \"Comparing international crime statistics must be done with great caution. Statistics compiled by the United Nations are based on surveys that specify that crimes be counted based on each country's legislated definition of what constitute a 'crime'. Some countries may include misdemeanor offences, where a fine is issued while others may only count imprisionable offences. Also, counting the crime takes place at different places in the law-enforcement process. Consequently, some countries may count every reported breach of the law, while others may only count cases that make it to court, and even then only the most serious of several charges laid. Because there is so much inconsistency in these statistics, they might also be a quality measure of the standard and efficiency of law enforcement and the criminal justice system of a country, rather than having anything to do with actual prevalence of crime.\" \"Or deadly, they are extremely dangerous\" Nuclear bombs are more deadly and more dangerous. But they aren't nearly as efficient for defense against a home invasion. \"Oh, no! A robber! I'm going to throw a nuke at him!\" *throws* BOOOOOOOOOOM! Everything within a ten-mile radius explodes. \"The majority of murders in the US were from arguments in 2007. Not robbery. By having the gun, that allowed someone angry to just kill someone else. The majority of murder is not planned out. By taking away the gun, you nearly completely eliminate that.\" What, so instead of shooting, you think that they should have strangled each other? Drowned each other? Guns don't kill people. People kill people. \"Yep, but I hope we will understand eachother now.\" We understand each other. Hopefully, this debate has been fixed. \"Thank you.\" You're welcome. IN CONCLUSION: Obama should not disarm the general American public of their guns. 1. It is unconstitutional, and there is no way that 38 states would suddenly repeal their own amendments within the next eight years. 2. People who hunt for sport, or protect themselves with guns, would be severely hurt by a gun ban. If you outlaw guns, only outlaws will have guns. 3. If random people in a store are carrying guns, a robber is less likely to want to rob that store, and much less likely to succeed. Thank you for this debate. Vote PRO."],"PremiseEndPos":[11424],"ArgumentID":"00000005","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000007","PremiseStartPos":[11439],"prevID":"00000005","Premise":["Thank you for putting this debate up. \"Barack Obama clearly does not like the idea of Americans wielding guns. However, there are three reasons why this should not be done.\" First off, your source is a campaign video, they emphasize the bad things. Second, he wants gun CONTROL not a gun ban. I am asssuming this is what we are to debate. \"1. It is unconstitutional.\" The second Bill of Rights amendment: \"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\" Gun control doesn't violate our second ammendment right. It makes it harder to get a gun, but not illegal. Barack Obama wants to make it so you cannot go to K-Mart, buy a gun, and shoot someone. \"2. It hurts the innocent more than the criminals.\" I beg to differ. \"People go hunting with guns all of the time\" You still can get a gun, it is just harder to. \"People protect themselves with guns all of the time\" There are other methods one can use to protect themselves. \"People also rob others with guns all of the time. The former two groups are innocent. The latter group is criminal. The innocent people would be hurt by any sort of gun control, and would not to wish to have to break a law just to enjoy a hunting trip, or feel more safe. Criminals, on the other hand, are already breaking the law, so they would just obtain and hold guns illegally.\" It is not breaking the law unless there is a gun ban. \"3. Gun freedom lowers crime rates. Robbers are less likely to charge into a building and rob it if he fears that a number of bystanders may be concealing a gun that could shoot him in the head. Take this poor fellow, for example: Actually the homcide rate is much lower in countries that have gun control (United Kingdom 2.1, Japan .5, Germany 1, Italy 1.2)( ( Thank you for reading"],"PremiseEndPos":[13285],"ArgumentID":"00000006","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000008","PremiseStartPos":[13300],"prevID":"00000006","Premise":["\"I already know that he wants gun control. I'm just fearing that he might step it up to making guns illegal. That is the point that I am trying to make here. Sorry, but you assumed wrong.\" Please clarify a absolute resolution. \"Disarming the general public does violate our second amendment right.\" The constitution can be changed, this is not an argument for guns, it is just a statement \"But people like their guns, and they are one of the better methods for security during a home invasion. Barack Obama did, as a Senator in Illinois, try to make it so that if you shoot a robber when he robs your house, you can get charged with gun assault.\" I am going to need a source that is not extremely bias to tell me this. \"I'm looking at your sources, and they just say what the homicide rates are. They say nothing about which countries have gun control and which ones don't. The word \"control\" does not appear anywhere on either of your sources. I see no correlation.\" Forgot to add these These prove that gun control is safe, so it should be instituted."],"PremiseEndPos":[14354],"ArgumentID":"00000007","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000009","PremiseStartPos":[14369],"prevID":"00000007","Premise":["Thank you for a quick response. \"Barack Obama should not disarm the general American public of their guns.\" Well obviously HE shouldn't because that would be a gross overuse of excecutive power. I am assuming he shouldn't argue for it. Though this is not what Baraack Obama wants, he wants gun control. \"First off, that was just a response to your comment about how gun control doesn't violate our second amendment rights.\" Gun CONTROL doesn't, however, I didn't understand the resolution. I now understand we ae arguing a gun ban. \"Secondly, to change the constitution, three-fourths of the states have to agree to give up their guns completely. \"Forty-four states have a provision in their state constitutions similar to the Second Amendment of the Bill of Rights (the exceptions are California, Iowa, Maryland, Minnesota, New Jersey, and New York).\" Somehow, I doubt that such an amendment could be passed by states that like the idea of gun rights.\" Just because it is unlikely does not mean it shouldn't happen. \"They are all facts; it's just that it shows the facts they want you to hear. Here's another source: You also failed to refute, and thus conceded, the fact that people like their guns, and they are one of the better methods for security during a home invasion.\" He is for gun CONTROL not a gun ban, and, yes, I do concede the point that people like there guns. So dpo criminals, gangs, and other \"Wrong-doers\". If you want to protect yourself, use another method. \"Gun control is irrelevant to this debate, because this debate is about disarming people, not regulating them. I am against strict gun control as well as against gun bans, but this debate is about banning, not controlling. Additionally, loose gun control sure seems to be working for Texas. If a Japanese man got his hands on a gun and robbed a store, they would probably be powerless. Not so in Texas.\" Strict gun control works in the same effect as a ban in most cases. Also, if in your hypothetical situation, the criminal didn't have a gun, or the police were doing their job, there would be no problem. \"In conclusion, my opponent has not actually said anything about gun bans, only gun control, which is irrelevant, and Barack Obama should not disarm us.\" I am sorry about the misunderstanding of the resolution. Thank you."],"PremiseEndPos":[16680],"ArgumentID":"00000008","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000010","PremiseStartPos":[16695],"prevID":"00000008","Premise":["\"Barack Obama is slowly moving towards wanting gun bans. Also, I think you just conceded the resolution, which basically means that you conceded the entire debate.\" I made a grammatical error. I meant to say \" I am assuming you are saying he shouldn't argue for it\" \"Well, I'm just going to come out and say that it CAN'T happen. 38 states are required to undo the second amendment. 13 are necessary to disagree. Forty-four states, however, like their gun rights. I can guarantee that it will take more than eight years for them to want to change their ways to not include gun rights, and by then, Obama will have no presidential power. I know that Texas will not give up its guns in the near future.\" Just because it cannot happen does not make it wrong. We are debating if a gun ban should happen, not if it is possible. \"If you're under eighteen, you are not allowed to have a gun. But that doesn't apply to the \"general American public\". Also, criminals will have guns, whether there is a gun ban or not.\" I disagree. If you make it extremely hard to get a gun, you will be able to easier track suspicious activity. \"If a robber breaks into your house, and you have a gun, and you manage to point your gun at him before he draws his gun, you're safe.\" Or use a dog or pepper spray or martial arts. \"If you're unarmed, however, you're either dead or robbed.\" Crime rates are lower in countries with gun control. The US crtime rate is 80 (Italy is 30, Japan 19, Spain 22) ( \"Guns are THE best protection method to use in a home invasion. They're quick and long range, all you have to do is point and hold a finger on the trigger, and it doesn't take too much skill to use. No other weapon is so efficient.\" Or deadly, they are extremely dangerous \"The criminal will always have a gun. He could import one, he could build one himself, I don't care. The point is, the criminal will get his dirty hands on a gun and use it. Also, the police can't get to every robbery, especially if the robber doesn't let anyone call 911. It is so much more efficient for a civilian to just shoot the robber then and there.\" The majority of murders in the US were from arguments in 2007. Not robbery. By having the gun, that allowed someone angry to just kill someone else. The majority of murder is not planned out. By taking away the gun, you nearly completely eliminate that. \"Yeah, I think that the entire misunderstanding thing killed the debate.\" Yep, but I hope we will understand eachother now. Thank you."],"PremiseEndPos":[19192],"ArgumentID":"00000009","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":169,"ConclusionEndPos":242,"nextID":"00000000","PremiseStartPos":[19207],"prevID":"00000009","Premise":["Thank you for all voters, my opponent, and those who are reading. I will not bring up new arguments, but only refute my opponent's points. \"Obama can argue all he wants; he just shouldn't actually disarm us, for the reasons I have listed.\" I disagree. \"And it should not happen, because the states are against Obama on this issue, and this debate is about whether Obama should remove our guns or not.\" Again, just because it is not popular does not mean it will not be effective and shouldn't be implemented. \"One shot kills a dog. Pepper spray is harder to hit long-distance, and needs better aim. Martial arts is close-range. A gun can kill you before you can punch him.\" Those were just examples, and if you look at the stats, having a gun on you makes it more likely for you to kill someone over a argument rather than in self defense. \"Again, this source does not identify which countries support gun control. It would help if the source marked the countries that banned or highly regulated guns\" \"Comparing international crime statistics must be done with great caution. Statistics compiled by the United Nations are based on surveys that specify that crimes be counted based on each country's legislated definition of what constitute a 'crime'. Some countries may include misdemeanor offences, where a fine is issued while others may only count imprisionable offences. Also, counting the crime takes place at different places in the law-enforcement process. Consequently, some countries may count every reported breach of the law, while others may only count cases that make it to court, and even then only the most serious of several charges laid. Because there is so much inconsistency in these statistics, they might also be a quality measure of the standard and efficiency of law enforcement and the criminal justice system of a country, rather than having anything to do with actual prevalence of crime.\" Comparing specific crimes negates this. RAPE ( US: .3 UK: .15 SPAIN: .14 JAPAN: .01 MURDER ( US: .042 UK: .014 SPAIN: .012 JAPAN: .004 ASSAULTS ( US: 7.56 UK: 7.45 SPAIN: 2.2 JAPAN: .33 NOTE: All stats given were per capita \"Nuclear bombs are more deadly and more dangerous. But they aren't nearly as efficient for defense against a home invasion. \"Oh, no! A robber! I'm going to throw a nuke at him!\" *throws* BOOOOOOOOOOM! Everything within a ten-mile radius explodes\" I don't understand the point he's making here. \"What, so instead of shooting, you think that they should have strangled each other? Drowned each other? Guns don't kill people. People kill people.\" Guns make it easier to kill people. Thank you."],"PremiseEndPos":[21839],"ArgumentID":"00000010","Conclusion":"Barack Obama should not disarm the general American public of their guns.","PremiseStance":["Con"]}}]}