{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-Disney-Movie-Enchanted-was-Overrated/1/\nCrawl date: 2016/09/29 03:21:05\nDebate: The Disney Movie \"Enchanted\" was Overrated | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: Enchanted: the disney film. Found here: Overrated: Was worse quality than what it was rated online on review websites. Statistics of this movie: IMDB gave 7.2/10 [adjusted score 78.26% based on the highest scoring movie ever on imdb which was 9.2] Metacritic: 75/100 Rotten tomatoes: 93% fresh, average rating 7.3/100. Audience score 85%, 3.8/5 (76%). I argue that 75, which in school a \"C\"--a mediocre grade--overrates this movie. This movie is worse than \"Average\", or \"mediocre\". It is up to me to prove this resolution. Round one acceptance only.\n\nEvidence Pro: You can view the summary on wikipedia here to refresh your memory or find out what the film is about so you have a better idea of what I'm talking about : Now then, let's start off with what's GOOD about the movie, shall we: 1. It discusses the idea the maybe your true love isn't the very first person you think it is [prince charming VS the other real life dude] 2. It's funny at moments [the very beginning, the chipmunk's \"Charade\", the troll, etc.] 3. It's good for children [PG rating] 4. Songs (Dubious... this is very arguable) I will debunk every single point one by one, but first I will talk about the worst parts of the movie that I oh-so-hated: 1. The beginning. Now, I know I said it was funny, but funny doesn't mean good. Exactly how does the movie begin, you ask? It begins with a song with animated creatures and a girl for Prince Charming to rescue, both of them singing, \"I've been dreaming of a true love's kiss....\". The beginning is very lame, and the troll is just unbelievable. The fact that the dumb girl fell for the \"old hag is nice, will do nothing to you near a wishing well\" trick. I understand that it is lame on purpose to show that fairy tales are lame and stress the \"other world\"'s meanness, but past the 10 minutes doesn't do anything good to the movie either... 2. The \"real world\".... Okay, so after we see the funny-ish very lame beginning, we finally get serious with cars rushing at our heroine, a jam of people forcing her through the subway, and a creepy hobo stealing her crown. I'll admit that part was good. But it gets silly from there on-- -The fact that she takes her clothing from her surroundings is ridiculous -The fact that her song powers still work is ridiculous -The evil villain is unconvincing with her ridiculous \"traps\" that even the stupid girl can see through And of course the part I hate the most--the utterly predictable moment when her true love isn't Prince Charming and it's the real life guy she hung out with. Who didn't see that coming? And the fact that they reused the very beginning \"troll hanging on a branch\" scene is very cheap. The ending is better than the beginning, although still very bad quality, since jumping on a bed with a pillow fight isn't exactly a good way to wrap up everything, especially considering that the beginning had our heroine and Prince Charming riding a horse into the sunset. [Indiana Jones, anyone?] Now to debunk all the good qualities I noted from the movie. True love isn't from first sight: Well, okay, this is a bit unique from other Disney movies, but this was seriously too predictable. One day marriage in a ten minute movie range versus a much more manageable date in a four-times-as-long-movie-time-range-- even if you were as stupid as our heroine, you'd have figured it out by the time the witch uses the poisoned apple. Funny-at-moments: Most of these moments are very cheap. The chipmunk doing charade wasn't too bad, stressing upon the Prince's stupidity, but there really wasn't anything else of note. The slap-stick humor of the troll flying to nowhere was very childish and would only entertain the bottom of the bottom. Good for children means a limited audience range. If adults can't watch it for any good, then logically only half of the audience will be satisfied. As for the songs, I already noted that they were unrealistic and broke the mood of the \"bad real world\". In conclusion: this movie tried to walk the fine line between an action/suspence movie and an adventure/comedy, but it failed. The witch's evilness ruined the comedy quite a bit, and the comedy made the evilness over-exaggerated. At the end, both ends fell off into an abyss of nothingness. Between the beginning and the end of ENCHANTED, the only memorable moments were the main girl turning the curtains into her clothes, and the chipmunk's voicelessness, both which were lame and cheap. Disney Channel could have easily done the same movie with its lower budget.\n\nEvidence Pro: My opponent tries to state that my arguments ate merely opinions, but he fails to show anything. He did not show that the first ten minutes were not lame, talking of true love, the very topic the movie suggests that is not as it seems, or the slapstick being lame and cheap. My opponent needs to show how these moments were mediocre or better. I have clearly shown these techniques subpar for Disney, while my opponent did not even try to prove that the general critis were correct in their rating of the movie. My arguments still stand.\n\nEvidence Pro: 1. Funniness My opponent focuses on the movie being a \"Good\" comedy. Well first of all, he fails to offer more examples than what I have offered (and I am supposed to be pro for enchanted being bad!). The funniness does gain our attention, but is attention always good? Funniness, most times, is gained through sacrifice of plot. However, the plot entirely stands upon comedy and the message of true love. Is the comedy really good? No, it's scattered-minded and doesn't work out. We don't really like the heroine who's dumb and doesn't understand anything in the real world, and we don't like the prince because he's so stupid, even if he is handsome. These unlikable characters added together for my argument that Enchanted was overrated. The only likable character was our main real life \"love interest\", but again, he pretty much hates every other character in the movie with the exception of the princess, but even then it was only at the end that he realized he loved her. True Love: Once again, I say this, this came in from a mile around. The message was so predictable I don't even know why you'd watch the last 10 minutes of the movie after the troll goes flying into outer space. And the fact that the witch's plan was the only thing boosting forth the princess to her true love in the \"other world\", I don't know how she could have lived with dumb prince Charming if the villain didn't try to send her into our real world. Even if some people laugh at slapstick, we must agree it is a lame trick used. Let's give the most infamous example: Home Alone. How much people liked that film, the film where our two villains fall twice every minute? The answer is, only half of the critics liked the two villains falling twice every minute. Not to mention that film actually had some heart at the end with that creepy shovel guy turning out to actually be a very deep family guy, unlike this film, which hardly really justifies the love of the princess and the Prince versus the love of her and the real life Guy. Good for children: My opponent uses the argument \"Disney\", but we've seen plenty of more adult films including the incredibly dark and complex Hunchback of Notre Dame, and the PG-13 Saving Mr. Banks along with the Pirates of the Caribbean series. My argument still stands here. CONCLUSION: Enchanted is not really a comedy. If it was, it's still not very good. The scattered moments don't pull off well together with the poor attempts at creating suspence, as well as the message of \"true love\", which was totally predictable and didn't need two stupid people from the animated universe to tell us that. If you want humor, go watch the Emperor's New Groove. And if you want an actual GOOD display of the message of true love that is NOT predictable, I suggest you go watch Frozen, an actual decent movie. Enchanted still stands at a bottom-feeder ranking on my movie chart.\n\nEvidence Con: I accept your challenge, good sir.\n\nEvidence Con: Logical problem: something cannot be overrated as when something is overrated, it is in the eyes of a single person. Another person will always think that the movie was amazing. Overrated does not exist in the way you state it because opinion is not fact.\n\nEvidence Con: OK, fine. Rebuttal time. 1. Funny is good. Laughter is a nice thing for every person, and not every movie has to be smart. And yes, it is lame- because it is meant to be. It is a satire of a fairy tale. It does do good for the movie. Through the power of comedy and knowledge of character. We A. See something funny, thus gaining our attention, and B. Learn that this is a traditional fairy tale world with traditional fairy tale characters. 2. Yes it is funny. Any human would take clothing from their surroundings. It is natural to do so. Why are song powers ridiculous? It is a trait of her's, so why would it just go away? She is in the real world, not from the real world! And the villain is meant to be cheesy. It is a comedy, not meant to be too critically and logically analyzed because then nothing makes sense. It is called suspension of disbelief. And yes, the ending is predictable. Does it really matter? But I am with you on the troll. That's just cause I don't like slapstick. True love: Well if we couldn't tell the moral, what would be the point of it? Funny-at Moments: Many of them could be seen as funny. And just because you and I do not like slapstick does not mean that random dude over there doesn't. Good for children: *coughDISNEYcough* Oh sorry, what was that? Conclusion: Enchanted was a great movie for all audiences that, well it does not suit my style of humor, is easily understood and can be funny, even to a snob like me.\n\nEvidence Con: Rebuttal: Enchanted WAS a comedy, and you cannot say that it wasn't. It's main focus was making you laugh, and just because you didn't doesn't mean that others didn't. And yes, It is good to have attention. Because no one likes being bored, and bored people are usually bored because they won't pay attention because there is nothing to keep attention, and a lack of interest is created. With Enchanted, I never felt disinterested, because I like the humor (except the troll. He stinks, and I can't deny that). And I personally, I loved the humor. I suppose I should cite some: Belle Note the Italian restaurant Grumpy the dwarf, little mermaid music at the aquarium, poison apple trope, Tremaine, magic mirror TV, the working song, and the soap opera segment. Notice something? All of them are references. I like referential humor, and it is not all slapstick or stupid. This is one big love letter to classic Disney., The characters are not entirely unlikeable just because they're stupid. I like season 1-4 Patrick in Spongebob because he is a well done, endearing stupid. But this is not the case. We like these characters because they're funny, like in Friends. If the cast of friends wasn't funny, we would hate them all because they're horrible people. If the cast of Enchanted wasn't funny, we would hate them because they're stupid without a point. Yes, the moral is obvious. MORALS ARE NOT SUPPOSED TO BE HIDDEN. That is what a theme is for. And the theme is going against all of Disney's overlooked things because it wants to be snarky towards Disney. Because this is a love letter to Disney. Not everything was slapstick. See list of humor that I liked. And yes, we have seen adult films from Disney. My point was that Disney has made amazing children's movies as well. For example, your profile picture, Aladdin. Conclusion: If you love Disney and pay attention to everything, then the referential humor will make you laugh. The characters can make you laugh, and everything is built to make you laugh. The only parts meant to create suspense were the bits near the end, and I believe that it is unfair to say that the suspense was horrible considering it was a team based around comedy making it.\n","DiscussionID":"00000005","Title":"The Disney Movie \"Enchanted\" was Overrated","CrawlDate":"2016/09/29 03:21:05","URL":"http://www.debate.org/debates/The-Disney-Movie-Enchanted-was-Overrated/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":119,"ConclusionEndPos":161,"nextID":"00000002","PremiseStartPos":[213],"prevID":"00000000","Premise":["Enchanted: the disney film. Found here: Overrated: Was worse quality than what it was rated online on review websites. Statistics of this movie: IMDB gave 7.2/10 [adjusted score 78.26% based on the highest scoring movie ever on imdb which was 9.2] Metacritic: 75/100 Rotten tomatoes: 93% fresh, average rating 7.3/100. Audience score 85%, 3.8/5 (76%). I argue that 75, which in school a \"C\"--a mediocre grade--overrates this movie. This movie is worse than \"Average\", or \"mediocre\". It is up to me to prove this resolution. Round one acceptance only."],"PremiseEndPos":[764],"ArgumentID":"00000001","Conclusion":"The Disney Movie \"Enchanted\" was Overrated","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":119,"ConclusionEndPos":161,"nextID":"00000003","PremiseStartPos":[779],"prevID":"00000001","Premise":["You can view the summary on wikipedia here to refresh your memory or find out what the film is about so you have a better idea of what I'm talking about : Now then, let's start off with what's GOOD about the movie, shall we: 1. It discusses the idea the maybe your true love isn't the very first person you think it is [prince charming VS the other real life dude] 2. It's funny at moments [the very beginning, the chipmunk's \"Charade\", the troll, etc.] 3. It's good for children [PG rating] 4. Songs (Dubious... this is very arguable) I will debunk every single point one by one, but first I will talk about the worst parts of the movie that I oh-so-hated: 1. The beginning. Now, I know I said it was funny, but funny doesn't mean good. Exactly how does the movie begin, you ask? It begins with a song with animated creatures and a girl for Prince Charming to rescue, both of them singing, \"I've been dreaming of a true love's kiss....\". The beginning is very lame, and the troll is just unbelievable. The fact that the dumb girl fell for the \"old hag is nice, will do nothing to you near a wishing well\" trick. I understand that it is lame on purpose to show that fairy tales are lame and stress the \"other world\"'s meanness, but past the 10 minutes doesn't do anything good to the movie either... 2. The \"real world\".... Okay, so after we see the funny-ish very lame beginning, we finally get serious with cars rushing at our heroine, a jam of people forcing her through the subway, and a creepy hobo stealing her crown. I'll admit that part was good. But it gets silly from there on-- -The fact that she takes her clothing from her surroundings is ridiculous -The fact that her song powers still work is ridiculous -The evil villain is unconvincing with her ridiculous \"traps\" that even the stupid girl can see through And of course the part I hate the most--the utterly predictable moment when her true love isn't Prince Charming and it's the real life guy she hung out with. Who didn't see that coming? And the fact that they reused the very beginning \"troll hanging on a branch\" scene is very cheap. The ending is better than the beginning, although still very bad quality, since jumping on a bed with a pillow fight isn't exactly a good way to wrap up everything, especially considering that the beginning had our heroine and Prince Charming riding a horse into the sunset. [Indiana Jones, anyone?] Now to debunk all the good qualities I noted from the movie. True love isn't from first sight: Well, okay, this is a bit unique from other Disney movies, but this was seriously too predictable. One day marriage in a ten minute movie range versus a much more manageable date in a four-times-as-long-movie-time-range-- even if you were as stupid as our heroine, you'd have figured it out by the time the witch uses the poisoned apple. Funny-at-moments: Most of these moments are very cheap. The chipmunk doing charade wasn't too bad, stressing upon the Prince's stupidity, but there really wasn't anything else of note. The slap-stick humor of the troll flying to nowhere was very childish and would only entertain the bottom of the bottom. Good for children means a limited audience range. If adults can't watch it for any good, then logically only half of the audience will be satisfied. As for the songs, I already noted that they were unrealistic and broke the mood of the \"bad real world\". In conclusion: this movie tried to walk the fine line between an action/suspence movie and an adventure/comedy, but it failed. The witch's evilness ruined the comedy quite a bit, and the comedy made the evilness over-exaggerated. At the end, both ends fell off into an abyss of nothingness. Between the beginning and the end of ENCHANTED, the only memorable moments were the main girl turning the curtains into her clothes, and the chipmunk's voicelessness, both which were lame and cheap. Disney Channel could have easily done the same movie with its lower budget."],"PremiseEndPos":[4745],"ArgumentID":"00000002","Conclusion":"The Disney Movie \"Enchanted\" was Overrated","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":119,"ConclusionEndPos":161,"nextID":"00000004","PremiseStartPos":[4760],"prevID":"00000002","Premise":["My opponent tries to state that my arguments ate merely opinions, but he fails to show anything. He did not show that the first ten minutes were not lame, talking of true love, the very topic the movie suggests that is not as it seems, or the slapstick being lame and cheap. My opponent needs to show how these moments were mediocre or better. I have clearly shown these techniques subpar for Disney, while my opponent did not even try to prove that the general critis were correct in their rating of the movie. My arguments still stand."],"PremiseEndPos":[5298],"ArgumentID":"00000003","Conclusion":"The Disney Movie \"Enchanted\" was Overrated","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":119,"ConclusionEndPos":161,"nextID":"00000005","PremiseStartPos":[5313],"prevID":"00000003","Premise":["1. Funniness My opponent focuses on the movie being a \"Good\" comedy. Well first of all, he fails to offer more examples than what I have offered (and I am supposed to be pro for enchanted being bad!). The funniness does gain our attention, but is attention always good? Funniness, most times, is gained through sacrifice of plot. However, the plot entirely stands upon comedy and the message of true love. Is the comedy really good? No, it's scattered-minded and doesn't work out. We don't really like the heroine who's dumb and doesn't understand anything in the real world, and we don't like the prince because he's so stupid, even if he is handsome. These unlikable characters added together for my argument that Enchanted was overrated. The only likable character was our main real life \"love interest\", but again, he pretty much hates every other character in the movie with the exception of the princess, but even then it was only at the end that he realized he loved her. True Love: Once again, I say this, this came in from a mile around. The message was so predictable I don't even know why you'd watch the last 10 minutes of the movie after the troll goes flying into outer space. And the fact that the witch's plan was the only thing boosting forth the princess to her true love in the \"other world\", I don't know how she could have lived with dumb prince Charming if the villain didn't try to send her into our real world. Even if some people laugh at slapstick, we must agree it is a lame trick used. Let's give the most infamous example: Home Alone. How much people liked that film, the film where our two villains fall twice every minute? The answer is, only half of the critics liked the two villains falling twice every minute. Not to mention that film actually had some heart at the end with that creepy shovel guy turning out to actually be a very deep family guy, unlike this film, which hardly really justifies the love of the princess and the Prince versus the love of her and the real life Guy. Good for children: My opponent uses the argument \"Disney\", but we've seen plenty of more adult films including the incredibly dark and complex Hunchback of Notre Dame, and the PG-13 Saving Mr. Banks along with the Pirates of the Caribbean series. My argument still stands here. CONCLUSION: Enchanted is not really a comedy. If it was, it's still not very good. The scattered moments don't pull off well together with the poor attempts at creating suspence, as well as the message of \"true love\", which was totally predictable and didn't need two stupid people from the animated universe to tell us that. If you want humor, go watch the Emperor's New Groove. And if you want an actual GOOD display of the message of true love that is NOT predictable, I suggest you go watch Frozen, an actual decent movie. Enchanted still stands at a bottom-feeder ranking on my movie chart."],"PremiseEndPos":[8205],"ArgumentID":"00000004","Conclusion":"The Disney Movie \"Enchanted\" was Overrated","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":119,"ConclusionEndPos":161,"nextID":"00000006","PremiseStartPos":[8220],"prevID":"00000004","Premise":["I accept your challenge, good sir."],"PremiseEndPos":[8255],"ArgumentID":"00000005","Conclusion":"The Disney Movie \"Enchanted\" was Overrated","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":119,"ConclusionEndPos":161,"nextID":"00000007","PremiseStartPos":[8270],"prevID":"00000005","Premise":["Logical problem: something cannot be overrated as when something is overrated, it is in the eyes of a single person. Another person will always think that the movie was amazing. Overrated does not exist in the way you state it because opinion is not fact."],"PremiseEndPos":[8526],"ArgumentID":"00000006","Conclusion":"The Disney Movie \"Enchanted\" was Overrated","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":119,"ConclusionEndPos":161,"nextID":"00000008","PremiseStartPos":[8541],"prevID":"00000006","Premise":["OK, fine. Rebuttal time. 1. Funny is good. Laughter is a nice thing for every person, and not every movie has to be smart. And yes, it is lame- because it is meant to be. It is a satire of a fairy tale. It does do good for the movie. Through the power of comedy and knowledge of character. We A. See something funny, thus gaining our attention, and B. Learn that this is a traditional fairy tale world with traditional fairy tale characters. 2. Yes it is funny. Any human would take clothing from their surroundings. It is natural to do so. Why are song powers ridiculous? It is a trait of her's, so why would it just go away? She is in the real world, not from the real world! And the villain is meant to be cheesy. It is a comedy, not meant to be too critically and logically analyzed because then nothing makes sense. It is called suspension of disbelief. And yes, the ending is predictable. Does it really matter? But I am with you on the troll. That's just cause I don't like slapstick. True love: Well if we couldn't tell the moral, what would be the point of it? Funny-at Moments: Many of them could be seen as funny. And just because you and I do not like slapstick does not mean that random dude over there doesn't. Good for children: *coughDISNEYcough* Oh sorry, what was that? Conclusion: Enchanted was a great movie for all audiences that, well it does not suit my style of humor, is easily understood and can be funny, even to a snob like me."],"PremiseEndPos":[9997],"ArgumentID":"00000007","Conclusion":"The Disney Movie \"Enchanted\" was Overrated","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":119,"ConclusionEndPos":161,"nextID":"00000000","PremiseStartPos":[10012],"prevID":"00000007","Premise":["Rebuttal: Enchanted WAS a comedy, and you cannot say that it wasn't. It's main focus was making you laugh, and just because you didn't doesn't mean that others didn't. And yes, It is good to have attention. Because no one likes being bored, and bored people are usually bored because they won't pay attention because there is nothing to keep attention, and a lack of interest is created. With Enchanted, I never felt disinterested, because I like the humor (except the troll. He stinks, and I can't deny that). And I personally, I loved the humor. I suppose I should cite some: Belle Note the Italian restaurant Grumpy the dwarf, little mermaid music at the aquarium, poison apple trope, Tremaine, magic mirror TV, the working song, and the soap opera segment. Notice something? All of them are references. I like referential humor, and it is not all slapstick or stupid. This is one big love letter to classic Disney., The characters are not entirely unlikeable just because they're stupid. I like season 1-4 Patrick in Spongebob because he is a well done, endearing stupid. But this is not the case. We like these characters because they're funny, like in Friends. If the cast of friends wasn't funny, we would hate them all because they're horrible people. If the cast of Enchanted wasn't funny, we would hate them because they're stupid without a point. Yes, the moral is obvious. MORALS ARE NOT SUPPOSED TO BE HIDDEN. That is what a theme is for. And the theme is going against all of Disney's overlooked things because it wants to be snarky towards Disney. Because this is a love letter to Disney. Not everything was slapstick. See list of humor that I liked. And yes, we have seen adult films from Disney. My point was that Disney has made amazing children's movies as well. For example, your profile picture, Aladdin. Conclusion: If you love Disney and pay attention to everything, then the referential humor will make you laugh. The characters can make you laugh, and everything is built to make you laugh. The only parts meant to create suspense were the bits near the end, and I believe that it is unfair to say that the suspense was horrible considering it was a team based around comedy making it."],"PremiseEndPos":[12223],"ArgumentID":"00000008","Conclusion":"The Disney Movie \"Enchanted\" was Overrated","PremiseStance":["Con"]}}]}