{"MetaData":{"Context":"URL: http://www.debate.org/debates/Vote-bombing-is-an-abuse-of-the-voting-system-on-Debate.org./1/votes/2/\nCrawl date: 2016/09/29 03:48:10\nDebate Issue: Vote bombing is an abuse of the voting system on Debate.org. | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: I affirm the above resolution. This first round will be for definitions and facts only; no conclusions or arguments. Vote bombing - An action taken by members of Debate.org who make their votes on debates based off of information not pertinent to the debate at hand. Also, \"when a user (often times with multiple accounts) maliciously votes down all seven points to all of a rival's open debates.\" Abuse - improper or excessive use or treatment ( Voting system on Debate.org - The system where members read debates, then select who of the two debaters they think deserves the points associated with each of four categories: spelling & grammar, conduct, convincing arguments, and reliable sources.\n\nEvidence Pro: I'm back! Anyways, the intention of the voting system was for the voters to determine who, in the debate, handled the debate the best by the criteria. By ignoring the criteria, and basing their votes on \"information not pertinent to the debate at hand\", vote bombers do not abide by the purpose and criteria of the voting system, which is improper and excessive, as they do it many times, so the resolution is affirmed. Thank you for your patience.\n\nEvidence Pro: \"I think it remains to be shown that the intention of the voting system is, what my opponent claims it to be, or that the intentions of the voting system should play any role is how we vote. I intend my votes to influence the winner. I might just not like one person, think the debate was clever, see somebody make an interesting point and swing all my votes over to them.\" The intention of the voting is shown in the article, \"How to Vote,\" found on this site. \"The next four questions break down a debaters score by looking at the four most important aspects of the debate. These questions are where the points come from. Remember, voting on Debate.org is based on fact and NOT on Opinion.\" \"Remember, the basis for decision should NOT include: Opinions held you, but not mentioned by the debaters. Conversation with any persons during or after the debate round. Comments made by other members of the site. \" Thus, the point of the system is to get the points to the people who deserved them based on FACT, not OPINION, and opinions are one of the aspects of vote bombing. \"In your idealized way of view the world are you really suggesting we vote like automatons? If I had to vote for people for other than wanting to vote for them, I would bore myself to death. While I don't support the idea of registering multiple accounts to cheat the vote, I will vote however I damn well choose. If that involves loading up 40 debates and voting for you in all of them, that's fine.\" I don't really care how you vote; I just want to point out that if you vote based on opinions, you are abusing the system. \"You speak heavily of the purpose of the voting system. Like using it against it's purpose is going to cause the world to crumble. The voting system assigns 7 points to people. Use them however you like. It's much more entertaining. You don't need to go QQ just because some people are going to vote you down for being a tool. You're not abusing the system by voting however you choose to vote.\" You are abusing the system if you don't follow the guidelines laid out for how to vote. \"PS. The voting system is going to end up putting names for who voted what direction eventually. So those of you voting against me, be warned... I'll know who you are. *eyes dart around*\" My opponent is trying to threaten everybody who votes against him... In conclusion, vote bombing is, in fact, an abuse of the voting system here on Debate.org, because the purpose was for debates to be won based on facts, and NOT opinions. Thank you for reading, and I hope you vote, hopefully based on fact.\n\nEvidence Con: Hey, votebombers... Mongeese is talking smack about you. GET HIM!\n\nEvidence Con: I think it remains to be shown that the intention of the voting system is, what my opponent claims it to be, or that the intentions of the voting system should play any role is how we vote. I intend my votes to influence the winner. I might just not like one person, think the debate was clever, see somebody make an interesting point and swing all my votes over to them. In your idealized way of view the world are you really suggesting we vote like automatons? If I had to vote for people for other than wanting to vote for them, I would bore myself to death. While I don't support the idea of registering multiple accounts to cheat the vote, I will vote however I damn well choose. If that involves loading up 40 debates and voting for you in all of them, that's fine. You speak heavily of the purpose of the voting system. Like using it against it's purpose is going to cause the world to crumble. The voting system assigns 7 points to people. Use them however you like. It's much more entertaining. You don't need to go QQ just because some people are going to vote you down for being a tool. You're not abusing the system by voting however you choose to vote. PS. The voting system is going to end up putting names for who voted what direction eventually. So those of you voting against me, be warned... I'll know who you are. *eyes dart around*\n\nEvidence Con: The intention of the site as to how you should vote. That's not anything indicative of my intentions. I give my votes intention by intentionally voting however I choose. And abuse of the voting system would be if it were used in ways it wasn't intended. To use it to vote for people... oh... scandal! It isn't an abuse of the system to vote the way I want. At worst it's a use of the system. There is a fairly useful motto which says \"A difference that makes no difference is no difference.\" . When this debate completes, I'm going to vote down the line for myself. Likewise, let us suppose that somebody having read my arguments and findings that I've made superior arguments and votes down the line for me. Then we have two individuals who are doing the exact same thing. My vote is clearly abusive by your standards and this other individuals' vote will be exactly the same but not abusive. This supposed abuse of the system, boils down to a thought crime.\n","DiscussionID":"00000036","Title":"Vote bombing is an abuse of the voting system on Debate.org.","CrawlDate":"2016/09/29 03:48:10","URL":"http://www.debate.org/debates/Vote-bombing-is-an-abuse-of-the-voting-system-on-Debate.org./1/votes/2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":213,"nextID":"00000002","PremiseStartPos":[265],"prevID":"00000000","Premise":["I affirm the above resolution. This first round will be for definitions and facts only; no conclusions or arguments. Vote bombing - An action taken by members of Debate.org who make their votes on debates based off of information not pertinent to the debate at hand. Also, \"when a user (often times with multiple accounts) maliciously votes down all seven points to all of a rival's open debates.\" Abuse - improper or excessive use or treatment ( Voting system on Debate.org - The system where members read debates, then select who of the two debaters they think deserves the points associated with each of four categories: spelling & grammar, conduct, convincing arguments, and reliable sources."],"PremiseEndPos":[962],"ArgumentID":"00000001","Conclusion":"Vote bombing is an abuse of the voting system on Debate.org.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":213,"nextID":"00000003","PremiseStartPos":[977],"prevID":"00000001","Premise":["I'm back! Anyways, the intention of the voting system was for the voters to determine who, in the debate, handled the debate the best by the criteria. By ignoring the criteria, and basing their votes on \"information not pertinent to the debate at hand\", vote bombers do not abide by the purpose and criteria of the voting system, which is improper and excessive, as they do it many times, so the resolution is affirmed. Thank you for your patience."],"PremiseEndPos":[1426],"ArgumentID":"00000002","Conclusion":"Vote bombing is an abuse of the voting system on Debate.org.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":213,"nextID":"00000004","PremiseStartPos":[1441],"prevID":"00000002","Premise":["\"I think it remains to be shown that the intention of the voting system is, what my opponent claims it to be, or that the intentions of the voting system should play any role is how we vote. I intend my votes to influence the winner. I might just not like one person, think the debate was clever, see somebody make an interesting point and swing all my votes over to them.\" The intention of the voting is shown in the article, \"How to Vote,\" found on this site. \"The next four questions break down a debaters score by looking at the four most important aspects of the debate. These questions are where the points come from. Remember, voting on Debate.org is based on fact and NOT on Opinion.\" \"Remember, the basis for decision should NOT include: Opinions held you, but not mentioned by the debaters. Conversation with any persons during or after the debate round. Comments made by other members of the site. \" Thus, the point of the system is to get the points to the people who deserved them based on FACT, not OPINION, and opinions are one of the aspects of vote bombing. \"In your idealized way of view the world are you really suggesting we vote like automatons? If I had to vote for people for other than wanting to vote for them, I would bore myself to death. While I don't support the idea of registering multiple accounts to cheat the vote, I will vote however I damn well choose. If that involves loading up 40 debates and voting for you in all of them, that's fine.\" I don't really care how you vote; I just want to point out that if you vote based on opinions, you are abusing the system. \"You speak heavily of the purpose of the voting system. Like using it against it's purpose is going to cause the world to crumble. The voting system assigns 7 points to people. Use them however you like. It's much more entertaining. You don't need to go QQ just because some people are going to vote you down for being a tool. You're not abusing the system by voting however you choose to vote.\" You are abusing the system if you don't follow the guidelines laid out for how to vote. \"PS. The voting system is going to end up putting names for who voted what direction eventually. So those of you voting against me, be warned... I'll know who you are. *eyes dart around*\" My opponent is trying to threaten everybody who votes against him... In conclusion, vote bombing is, in fact, an abuse of the voting system here on Debate.org, because the purpose was for debates to be won based on facts, and NOT opinions. Thank you for reading, and I hope you vote, hopefully based on fact."],"PremiseEndPos":[4022],"ArgumentID":"00000003","Conclusion":"Vote bombing is an abuse of the voting system on Debate.org.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":213,"nextID":"00000005","PremiseStartPos":[4037],"prevID":"00000003","Premise":["Hey, votebombers... Mongeese is talking smack about you. GET HIM!"],"PremiseEndPos":[4103],"ArgumentID":"00000004","Conclusion":"Vote bombing is an abuse of the voting system on Debate.org.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":213,"nextID":"00000006","PremiseStartPos":[4118],"prevID":"00000004","Premise":["I think it remains to be shown that the intention of the voting system is, what my opponent claims it to be, or that the intentions of the voting system should play any role is how we vote. I intend my votes to influence the winner. I might just not like one person, think the debate was clever, see somebody make an interesting point and swing all my votes over to them. In your idealized way of view the world are you really suggesting we vote like automatons? If I had to vote for people for other than wanting to vote for them, I would bore myself to death. While I don't support the idea of registering multiple accounts to cheat the vote, I will vote however I damn well choose. If that involves loading up 40 debates and voting for you in all of them, that's fine. You speak heavily of the purpose of the voting system. Like using it against it's purpose is going to cause the world to crumble. The voting system assigns 7 points to people. Use them however you like. It's much more entertaining. You don't need to go QQ just because some people are going to vote you down for being a tool. You're not abusing the system by voting however you choose to vote. PS. The voting system is going to end up putting names for who voted what direction eventually. So those of you voting against me, be warned... I'll know who you are. *eyes dart around*"],"PremiseEndPos":[5470],"ArgumentID":"00000005","Conclusion":"Vote bombing is an abuse of the voting system on Debate.org.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":213,"nextID":"00000000","PremiseStartPos":[5485],"prevID":"00000005","Premise":["The intention of the site as to how you should vote. That's not anything indicative of my intentions. I give my votes intention by intentionally voting however I choose. And abuse of the voting system would be if it were used in ways it wasn't intended. To use it to vote for people... oh... scandal! It isn't an abuse of the system to vote the way I want. At worst it's a use of the system. There is a fairly useful motto which says \"A difference that makes no difference is no difference.\" . When this debate completes, I'm going to vote down the line for myself. Likewise, let us suppose that somebody having read my arguments and findings that I've made superior arguments and votes down the line for me. Then we have two individuals who are doing the exact same thing. My vote is clearly abusive by your standards and this other individuals' vote will be exactly the same but not abusive. This supposed abuse of the system, boils down to a thought crime."],"PremiseEndPos":[6445],"ArgumentID":"00000006","Conclusion":"Vote bombing is an abuse of the voting system on Debate.org.","PremiseStance":["Con"]}}]}