{"MetaData":{"Context":"URL: http://www.debate.org/debates/if-you-drop-an-ant-off-a-ten-story-building-will-it-die-No-way-Jose/1/votes/2/\nCrawl date: 2016/09/29 06:46:28\nOnline Debate: if you drop an ant off a ten story building will it die? No way Jose | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: If drop an ant off a building it will not die because it will not fall fast enogh for it to be fatal.\n\nEvidence Pro: Actually you know what I actually agree with you I think what may happen because of the exoskeleton is that his outside would be ok but his insides would not hold up to the impact so maybe the ant would die..\n\nEvidence Pro: I guess you win this one....I thought for sure it wouldn't die...well maybe it wont i guess well never know. huh?\n\nEvidence Con: Ha, i accept your challenge. I say it'll die maybe not instantly, but slow and painfully. It'll drag it's broken legs screeming for help and because none of its compadres will hear it, it'll die of agony and lose its will to live screeming, \"Porque Dios, Porque!!!\" Poor littl;e bugga, wait, what are we debating on? oh yeah. It will die maybe soon after. Even though it has an exoskeletal system, it won't matter at ten stories. Ten stories is high for us, so ten stories to an ant is like 10000 stories for us. the end\n\nEvidence Con: Ok, i see your argue meant, it probably would live mainly because of it's light body. As it were falling, it would be carried off by the wind and would be placed lightly on the ground with out a scratch and go about it's buisiness. Or its compadres would have its back till the death and carry it out to thier medical facilities where it'll be under critical condition and come out paralized from the abdomin down, but it'll live.\n\nEvidence Con: No, you won this match before it began. Accepting this challenge is clearly suicide in debate. and since i need this to be at least 100 characters or more i'm going to type this. \"Hello Cleveland!\"\n","DiscussionID":"00000098","Title":"if you drop an ant off a ten story building will it die? No way Jose","CrawlDate":"2016/09/29 06:46:28","URL":"http://www.debate.org/debates/if-you-drop-an-ant-off-a-ten-story-building-will-it-die-No-way-Jose/1/votes/2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":161,"ConclusionEndPos":229,"nextID":"00000002","PremiseStartPos":[281],"prevID":"00000000","Premise":["If drop an ant off a building it will not die because it will not fall fast enogh for it to be fatal."],"PremiseEndPos":[383],"ArgumentID":"00000001","Conclusion":"if you drop an ant off a ten story building will it die? No way Jose","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":161,"ConclusionEndPos":229,"nextID":"00000003","PremiseStartPos":[398],"prevID":"00000001","Premise":["Actually you know what I actually agree with you I think what may happen because of the exoskeleton is that his outside would be ok but his insides would not hold up to the impact so maybe the ant would die.."],"PremiseEndPos":[607],"ArgumentID":"00000002","Conclusion":"if you drop an ant off a ten story building will it die? No way Jose","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":161,"ConclusionEndPos":229,"nextID":"00000004","PremiseStartPos":[622],"prevID":"00000002","Premise":["I guess you win this one....I thought for sure it wouldn't die...well maybe it wont i guess well never know. huh?"],"PremiseEndPos":[736],"ArgumentID":"00000003","Conclusion":"if you drop an ant off a ten story building will it die? No way Jose","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":161,"ConclusionEndPos":229,"nextID":"00000005","PremiseStartPos":[751],"prevID":"00000003","Premise":["Ha, i accept your challenge. I say it'll die maybe not instantly, but slow and painfully. It'll drag it's broken legs screeming for help and because none of its compadres will hear it, it'll die of agony and lose its will to live screeming, \"Porque Dios, Porque!!!\" Poor littl;e bugga, wait, what are we debating on? oh yeah. It will die maybe soon after. Even though it has an exoskeletal system, it won't matter at ten stories. Ten stories is high for us, so ten stories to an ant is like 10000 stories for us. the end"],"PremiseEndPos":[1272],"ArgumentID":"00000004","Conclusion":"if you drop an ant off a ten story building will it die? No way Jose","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":161,"ConclusionEndPos":229,"nextID":"00000006","PremiseStartPos":[1287],"prevID":"00000004","Premise":["Ok, i see your argue meant, it probably would live mainly because of it's light body. As it were falling, it would be carried off by the wind and would be placed lightly on the ground with out a scratch and go about it's buisiness. Or its compadres would have its back till the death and carry it out to thier medical facilities where it'll be under critical condition and come out paralized from the abdomin down, but it'll live."],"PremiseEndPos":[1718],"ArgumentID":"00000005","Conclusion":"if you drop an ant off a ten story building will it die? No way Jose","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":161,"ConclusionEndPos":229,"nextID":"00000000","PremiseStartPos":[1733],"prevID":"00000005","Premise":["No, you won this match before it began. Accepting this challenge is clearly suicide in debate. and since i need this to be at least 100 characters or more i'm going to type this. \"Hello Cleveland!\""],"PremiseEndPos":[1931],"ArgumentID":"00000006","Conclusion":"if you drop an ant off a ten story building will it die? No way Jose","PremiseStance":["Con"]}}]}