{"MetaData":{"Context":"URL: http://www.debate.org/debates/It-is-plausible-to-assume-that-a-finite-universe-was-caused-or-created-by-a-creator/1/\nCrawl date: 2016/09/29 06:06:31\nDebate: It is plausible to assume that a finite universe was caused or created by a creator | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: Title: It is plausible to assume that a finite universe was created or caused by a creator Resolution: See *Conclusion D* Round 1: Pro:Argument Con: Rebuttal Round 2: Pro: Rebuttal Con: Rebuttal Round 3: Pro: Rebuttal and conclusion Con: Conclusion/ no rebuttals by Con (failure to do so results in a concession/ 7 point loss) Argument: 1. That which is finite was caused. The Big Bang is so often described as a spontaneous explosion of matter from a single point called the singularity. One other explanation is that the Big Bang is the stretching of space and time at an exponential rate, which theorises that there might have been another universe before the Big Bang. -(1) In other words: Previous universe contracts -> Condensed matter -> Resurgence/expansion -> Our universe. However there is no proof that this occurs and so all anyone can say for certain is that the universe began from a very tiny point and then expanded. Also, for anyone to say the theory above is plausible, that is if there was a previous universe, then one should probably assume the Universe is infinitely large since space has to stretch exponentially in an infinite way for there to be multiple resurgences. If there is only a limited amount of resurgences and there is one original big bang that occurred, then it goes without saying that this cycle of universes is finite and not infinite. One could however suggest that the universe can expand from that point forth in a infinite amount of time and therefore be infinite in space. However that still assumes that right now, there is a clear edge to the universe or the very end point of where space and time expands. And it also still assumes a beginning point in time for the universe to begin, which suggests it is still finite. So if the universe is infinite, then it is plausible to say the Universe was not created. It existed forever, has always existed and will continue to exist. Therefore if one assumes an infinite eternal universe, it is plausible to say the universe (and its resurgences) has always existed and was never created or had an origin. However: If the universe is finite, then it is plausible to assume the Universe was created, that is to say it was willed into existence or crafted with intention. This is because, for such a universe to be finite, the universe will need to have expanded from an origin point which is called the singularity. This singularity then contains all the matter, space and perhaps time of the universe. This singularity will be the minimum size that the entirety of the universe can be squashed into and so cannot go smaller. If it can go smaller, then the universe has an infinite amount of space, but this argument focuses only on the universe having only finite amount of space. And so this singularity would need to have a creator to be caused into existence or otherwise the universe came from nothing. In a syllogism: Premise A) Space, time and matter that has always existed, is infinite and that has no origin needs not to have a cause or to have been created by a creator. Premise B) Space, time and matter that has not always existed, is finite and has an origin needs to have been caused or created by a creator. Premise C) [If] the universe is finite; Conclusion D) Then it is plausible to assume that the Universe had a cause or was created by a creator. There is perhaps nothing controversial about this syllogism. Except the part where it states that a finite universe with an origin was caused or created by a creator. Here, 'caused' may be different to 'created'. 'created' assumes that there was intention in the creation process and 'caused' assumes there was no intention or purpose in the creation process. Premise B assumes both to be plausible. While the next arguments favour 'caused' more than 'created', it does not leave out the possibility that the universe was 'created'. 2. The Universe was caused (or created) by a creator. A 'creator' will be defined as something that is capable of causing the big bang but that is not in any way related to the universe. A being/thing that is outside or beyond space/time/matter. And so the argument is: If the universe is finite, the big bang was caused by a creator. Consider this: the earth was caused by cooling magma in space. Cooling magma was caused by an exploding star sending debris. Stars are caused by helium gasses and hydrogen gasses combining. Helium and hydrogen gasses are caused by quarks. Quarks are caused by the big bang. The big bang is the beginning point of all the causations. What caused the big bang then? If it was caused by a) a collapsed previous universe, then the universe is infinite (the matter/space and time). Or it could have been caused by b) a creator. Though another argument one could put forth is that the big bang could also have been caused by c) nothing at all or pure nothingness, but not empty space as that would still assume the existence of space. We can omit (a) because the argument only suggests a finite universe to have been caused or created by a creator. We can also omit c) since something cannot come forth or be caused by nothing. The very state of nothingness is nothing. It does not have the ability nor the capability to create or become anything since there is nothing to create from anyway. My opponent may argue against this but for now I leave it at that. Therefore we come to the final answer b) a creator. And so we can see that the big bang was caused (or created) by a creator. In a syllogism: Premise A) If the Universe is finite, then it was caused either by a creator or by nothing. Premise B) It is not possible for a finite universe to be caused by nothing since nothing can be caused by nothing. Premise C) It is possible for a finite universe to be caused by a creator. Conclusion D) Therefore, it is plausible to assume a finite universe to be caused by a creator. I hope these two syllogisms and supportive arguments convince you to consider the plausibility that if the universe is finite, then it was caused by a creator. (1) [ Science, Religion, and the Big Bang. Minute Physics, Aug 19 2013. December 19, 2014.\n\nEvidence Pro: Rebuttal: 1. Semantics of \"Universe\" As Pro, I disagree to the definition, \"'Our four dimensional space-time, and all the matter, particles, energy and all the laws of physics that a part of it'\", to be the definition of what our universe is. The definition assumes too much of what the universe encompasses. It is simpler to say that the universe is the entire matter and energy in the cosmos. This is the common definition for the universe as stated in the Oxford dictionary for example; \"(the universe) All existing matter and space considered as a whole; the cosmos.\" - (1) Another similar definition given by Merriam Webster: \"the universe : all of space and everything in it including stars, planets, galaxies, etc.\" - (2) And finally from Dictionary.com: \"the totality of known or supposed objects and phenomena throughout space; the cosmos; macrocosm.\" - (3) I have tried searching for a more 'scientific' and reliable definition of the universe and have come up short. This is why I see the above definitions to be suitable for defining the universe in this debate. 2. Impossible to justify claims regarding the Universe as a whole I would like to point out that Con is correct in saying that there is no justification to predict the future. That we do not know everything and therefore cannot make a correct prediction or deduction. However, that is only true for truth claims. When it comes to plausible scenarios then it is still valid. Whether the argument is sound is not purported in the resolution. The resolution proposes only the plausibility of such. Yes. We cannot justifiably make true claims of reality in the future. We do not have enough instruments and knowledge to come up with evidence just from induction. But we can still justifiably make claims that are plausible. Granted, they might not be wholly true, however, they can still plausibly be true. If Con shows that the arguments supporting the resolution are implausible then the resolution fails. Either this, or Con can make an opposite argument against the resolution that is much more plausible than Pros. And therefore it is important for the readers to determine if Con has succeeded in either. 2.1 Application to the Big Bang Again, if this debate was on the truth claims of the universe then it would be utterly impossible to do so as Con argues we do not have the sufficient understandings of the singularity to properly debate its origins. As pro, I argue however, that the probability of the likely origins of the singularity should not be overlooked and therefore is worth debating. This is why quantum theories exist is to argue a notion that may be absurd but plausible and probable. Just as Con puts forth the theory of quantum gravity, a theory that seeks to explain gravity using quantum principles rather than Einstein's theory of relativity, is making non posteriori claims. Con assumes that I am claiming a 'reality' or a 'truth' where in actuality I am just merely proposing the probability of the origins of the big bang/singularity if the universe is finite. Therefore, as Pro, I am not obliged to make a 'sound' argument, rather I only have to come up with a 'plausible' and valid argument. In other words. True, the origins of the Big Bang cannot be known without priori principles. But that is only if the resolution was 'X comes from Y' rather than 'X plausibly comes from Y'. In order to negate this latter argument, Con has to come up with a counter argument that is more plausible. In so far as round 1, Con has not found any logical fallacies or showed how Pro's arguments are logically invalid and therefore Con can only come up with a better more plausible argument for the origins or lack of origins of the big bang (in a finite universe). 2.2 Application to the Universe as a Whole Causality is separate from the Universe. I argue that the Universe is subject to causality and that causality is not subject to the Universe. Consider the expansion of the universe. How does it do so? it needs to occupy more and more of the dimension of space. And how does the Universe change its state without time? It is logically impossible for the Big Bang to emerge from no time at all if time is directly linked to causality. This is why, it is more plausible to assume that time/causality is a dimension/principle separate from the Universe. 3. The explanation/cause of the universe Con has mistaken me for arguing that the \"the explanation of the universe is X\". The resolution was, again, one that focused on plausibility, not soundness. I did not argue that 'a finite universe was caused or created by a creator'. I argued that it \"is plausible to assume a finite universe to be caused or created by a creator.\" I also outlined that \"'created' assumes that there was intention in the creation process and 'caused' assumes there was no intention or purpose in the creation process.'\" I included both in the resolution so that I do not, \"leave out the possibility that the universe was 'created\". And to argue that the Universe was caused or created by a 'creator', I provided a syllogism: P1) If the Universe is finite, then it was caused either by a creator or by nothing. P2) It is not possible for a finite universe to be caused by nothing since nothing can be caused by nothing. P3) It is possible for a finite universe to be caused by a creator. C) Therefore, it is plausible to assume a finite universe to be caused by a creator. However, Con has not refuted this syllogism directly and therefore I assume that the argument is at least logically valid. And the only other way for Con to negate the resolution was to provide a more plausible and logically valid counter argument against the resolution. Con does not do this however, though he does provide a syllogism: P1) Intentionality requires functioning mental processes P2) All mental processes are temporal P3) The explanation of the universe is necessarily atemporal C) The explanation of the universe is necessarliy not intentional However, this is not the counter argument to the resolution. It is a counter argument to Con's previous assumption of my proposition that the universe was 'created' and not 'caused'. Therefore, Con has yet to provide a counter argument to the resolution that \"It is plausible to assume that a finite universe was caused or created by a creator\" and so the resolution remains unnegated. Sources: (1) (2) (3)\n\nEvidence Pro: i forfeit this round. I have been busy with family get togethers and travelling. Thank you Con for the amazing debate. Wish you luck on future debates!\n\nEvidence Con: Introduction I thank Adam_Godxilla for instigating this debate, and for being rather concise with his arguments. I will first present a negative case, which should directly or indirectly deal with Pro’s opening arguments. Negative Case 1. Semantics of \"Universe\" I need to get this out of the way first, as it is so important to this debate. Pro has not defined what the \"universe\" means, as it can take on several definitions. Because Pro has not defined the universe, he is dangerously close to committing the fallacy of equivocation throughout his opening arguments. For the sake of this round of arguments I will be defining the universe as: \"Our four dimensional space-time, and all the matter, particles, energy and all the laws of physics that a part of it\" This I think it a very reasonable definition, as it is this universe which the Big Bang theory theorises the \"origin\" of the universe of. This is going to become very important later. 2. Impossible to justify claims regarding the Universe as a whole This argument borrows significantly from David Hume’s posited ‘Problem of Induction’. He makes the claim that there are two types of knowledge, a priori and a posterori. A priori claims are ones which we can know to be true by virtue of just thinking about it. These truths are also necessary truths in the sense that regardless of the metaphysical nature of the world we inhabit, what is true a priori for one world will be true a priori for all worlds. Two apples plus three oranges will always give you five pieces of fruit, and there simply is no other way this fact can be.[1] On the other hand, synthetic truths, ones that are known a posterori run into the problem of induction. That is to say we cannot justifiably make claims about how reality will be in the future by virtue on what happened in the past without first assuming the principle of the uniformity of nature, the reason for this, David Hume argues is that we simply have no justification to expect the future will be anythign like the past. We simply do not have a properly basic understanding of reality to make thiis statement. It is conceivable, and metaphysically possible for reality to turn out in two different ways unless there really is a uniformity of anture principle acting, which for now, we take fo rgranted when making inductive inferences and arguments. It is this critical assumption that one must make when making inductive arguments which underpins all of science, and most critically, underpins any hope Adam has of making claims about the universe. 2.1 Application to the Big Bang The problem here is, the principle of the uniformity of nature is exceptionally dubious to assume once we take the conditions to the extreme. Since the uniformity of nature also applies to context. For example throwing a ball through the air is goign to have different dynbamics to throwing it through water. We simply have two different environmental contexts, and the uniformity of nature assumption simply does not hold until we apply the same contexts. The singularity proposed by assuming relativity to hold at infinitely small scales merely represents the breakdown of our laws of physics. We are already confidence that the strong and weak nuclear force, as well as the electromagnetic force are not distinctly separate forces in these conditions. More seriously are that space and time are posited to possess infinite curvature, and that if there is a scientific principle that governs these conditions then it would be a theory of quantum gravity, as it is the realm of quantum mechanics that is known to govern the extremely small scales of the universe. What this means is that space, time, and by extension, our notion of entropy are completely different to what our common ‘classical’ notions of space, time and entropy are. Thus, the context is different to what we can make (possibly) reasonable claims about within inductive reasoning, we simply do not have this uniformity of nature principle that we can reasonably assume, as we know for a fact that the conditions and context of the big bang itself are simply beyond experience. Thus, to make claims about the nature of what the singularity is (assuming it ever existed), what the big bang really is simply impossible to do without a priori principles, and I wish Adam best of luck in finding those. 2.2 Application to the Universe as a Whole Given these insurmountable problems are present for just the Big Bang itself, which arguably is (or was) part of the universe, or was a state of the universe. When we go outside of any point of the universe, or any point the universe existed, then we run into even bigger problems. Because here we know for a fact the uniformity of nature principle doesn’t hold, since you need nature…. to have any uniformity of nature, thus any claims regarding the universe as a whole are patently absurd. This extends to rebut Pro’s arguments since pro is advocating for some sort of ‘cause’ or ‘explanation’ of the universe, however the big bang was part of the universe. The language of causality, and ‘explanations’ that we are familiar with is predicated on our experience within our three dimensional space and one of time environment. Within the universe we have space, time and entropy, which gives us our arrow of time, time gives a frame of \"before and after\" and all events we know about occur within space., the ability to tell ‘before’ from ‘after’, and everything from which we make inductive claims regarding causality. Thus even assuming that the inductive laws of causality, and contingency etc. do apply within the universe, we are in a completely different context when talking about the universe as a whole. 3. The explanation/cause of the universe If we assume trhe universe has a cause/explanation, and that cause explanation has something intimately to do with the big bang, then why should we assume that it was created with intentionality? Making this leap from \"the universe has an explanation\" to \"the explanatgion of the universe is X\" is a massive one, and I simply have not seen Adam attempt to uphold this in his opening round Pro literally asserts by fiat that \"if the universe is finite, then it's plausible to assume the universe was created, that is to say it was willed into existence or crafted with intention\", but Pro literally skips over half of what he has to prove here!!! Why should the cause of the universe, IF it had one, be an intentional one? This presupposes a whole plethora of dubious assumptions, such as the fact that intentions can even exist outside of our universe, or that it's even possible for intentions to exist without a temporal context (time). Moreover, simply arguing that a pre-existing substance (that is not intentional) solves this issue equally as well, and doesn't rely on these additional assumptions, therefore we should reject Pro's speculation outright by virtue of Occam's razor. Moreover, IF Pro believes he has good inductive reasons to accept an intentional first cause, then I have my own argument to respond in kind: P1) Intentionality requires functioning mental processes P2) All mental processes are temporal P3) The explanation of the universe is necessarily atemporal C) The explanation of the universe is necessarliy not intentional P3 is obvious by definition of the universe I have given, which posits the lack of existance of time without the universe. If Pro argues time existed before the universe, then he runs into a plethora of subsequent issues such as there existing non-mental substances without the universe. P1 is also de facto true. Thus the only premise that can be challenges is P2, which is an inductive statement abotu what we know about mental processes. All thoughts we know about require a chain of events, beliefs -> senses -> processing -> action. Thus if Pro want sot challenge this, then he also undermines any right to make inductive arguments. Works Cited 1.\n\nEvidence Con: 1. Semantics of “Universe” Pro makes a clear distinction between space, time, and the laws of physics and nature and what he argues is the universe, to which he only affirms the “universe” is “all of space and everything in it including stars, planets, galaxies, etc.”. I have no problem with this definition, only that he continues to use it consistently. Also by extension, it is seriously damaging to Pro’s case as a result. And I will add several arguments to affirm this. 2. Impossible to justify claims regarding the Universe as a whole Pro’s arguments regress to appeals to epistemic possibility to affirm plausibility, however this seems insufficient, given most definitions of ‘plausible’ appeal to more than just bare possibility. E.g.: \"having an appearance of truth or reason; seemingly worthy of approvalor acceptance; credible; believable:”[1] “Capable of being believed; believable or plausible” [2] And so on. While I would agree it’s a statement about epistemology, rather than metaphysics, Pro needs to do more than just say it’s ‘epistemologically possible’ to affirm plausibility. For most things which we are in ignorance of all the facts are ‘possible’, but no by means probable. It’s possible the moon landings were hoaxed, and there are always ways to explain away any facts presented to dismiss it, however it would remain implausible, even if possible. Pro seems to misunderstand my argument from the problem of induction. The point is we can only make predictions or justifiable claims IF AND ONLY IF we first presuppose the uniformity of nature principle. This principle though we know simply does not apply in the conditions Pro is arguing a creator did something. Pro has not attempted to demonstrate where my analysis of i.) why this presupposition is not necessary or ii.) that this presupposition is sound during the conditions of the big bang/before the big bang. It’s only by these two ways which Pro can hope to affirm his arguments. 2.1 Application to the Big Bang Pro agrees with my analysis here. The whole reason why our laws break down is that we do not have an understanding of nature or context of nature to justifiably make laws. Physicists do propose a theory of quantum gravity if necessary, but these remain steep heaped in speculation. None invoke creation or causation, however. 2.2 Application to the Universe as a Whole “Causality is separate from the Universe. I argue that the Universe is subject to causality and that causality is not subject to the Universe.” I would kindly ask Pro to justify these mindbogglingly massive claims. He assumes that the universe (as I define, includes the mechanisms which bring forth the laws of physics) is subject to the same principles that work within it. This is a classical fallacy of composition. “It is logically impossible for the Big Bang to emerge from no time at all if time is directly linked to causality.” That presupposes the big bang was ever “caused” or has an “explanation”, which I argued is not the case since there is no reason to think the universe is externally explicable, or has an external cause, or any cause whatsoever. This is due to the uniformity of nature principle already discussed. If the universe is uncaused or self-caused, then Pro’s entire case goes out of the window. If the universe is externally caused, then Pro’s cause ONLY applies if it’s caused by an intentional creator. He has much work to do to affirm this specific scenario is even plausible. \"This is why, it is more plausible to assume that time/causality is a dimension/principle separate from the Universe.\" We have simply no empirical experience whatsoever outside of our three dimensional fabric of space and one of time. Thus I have no idea how Pro can even dream of justifiably making plausible claims outside of that context, which is exactly the situation of the universe as a whole. 3. The explanation/cause of the universe I have yet to see Pro affirm any of the premises within his two arguments, thus we should treat them as bare assertions. We have good reason to believe several premises in each of his arguments are false. However, and only one needs to be false in each for the conclusion not to follow. 1st Argument Premise A of Pro’s first argument is irrelevant, and Premise C is presupposed within the context of this debate, thus I only need to refute Premise B: “Premise B) Space, time and matter that has not always existed, is finite and has an origin needs to have been caused or created by a creator.” Again, Pro has given no reasons to believe this is true, and hence has failed his burden of proof. I gave reasons why this is false from creation via. substance, or via. space (zero energy universe), as well as the problem of induction. 2nd Argument P1 is a clear false dichotomy. I already argued last and this round round how the universe can be caused by a non-intentional substance, such as space (such as which is proposed in the zero energy universe hypothesis), or some other putative substance which is not based on space or time or intentionality. P2 I do not see how Pro can hope to affirm as true, since we have no experience of a philosophical “nothing” (absence of anything), and a physical “nothing (empty space) we already know generates virtual particles. P3 Pro has simply taken for granted, and has not attempted to affirm. I gave good reasons to think this is false with my argument from atemporality Pro’s tries a blatanton the resolution here by arguing simply arguing the universe is ‘caused’ is enough to fulfil the resolution, but the resolution makes more sense when read with a fully creator subject, and is also just false, since agent causation is a form of intentional causation. Moreover most arguments for God for example argue that God is an efficient cause of the universe, which would clearly qualify as an example of intentional causation, and shows that ‘caused’ does not “assumes there was no intention or purpose in the creation process\". 4. Argument from Thermodynamics The first law of thermodynamics, or the conservation of energy states that “that the total energy of an isolated system is constant; energy can be transformed from one form to another, but cannot be created or destroyed.”. Moreover the same applies to mass, which is now known to intricately linked due to Einstein’s law of mass-energy equivalence.[3] Thus, if Energy can only be converted to other forms of energy or matter, and vice versa, then the “universe” (as Pro has defined) is a self-contained system where it’s impossible to go from a state of no mass-energy to a state of mass-energy. Thus, I can make the following argument: P1. If the universe is created or caused, then mass & energy creation is possible P2. Mass & Energy creation is impossible C. The universe is not created or caused P2 holds IF we assume a uniformity of nature principle (which Pro must also assume himself if he is going to make any claims whatsoever about the big bang), and P1 is de facto true. Given that P2 is one of our most powerful and well-attested laws suggested from induction within science, then Pro has a MASSIVE mountain to claim to render a creator as even possible, let alone plausible. A very potent universe explanation exists within the zero energy universe hypothesis, which argues that mass & energy were never created, since the net energy content of the universe is actually zero. This leads to the predictions of a spatially flat universe, as well as a mechanism by which empty space can produce particles of impunity, which we have found with virtual particles.[4] 5. Argument from Temporality As a minor twist on my argument from minds: 1 Causation requires temporality 2 A cause of the universe must be atemporal C The universe has no cause Both premises I ahve affirmed in round 1. Time allows us to speak the language of causality, to deparate before & after. Thus these work to negate Pro's case once again. Works Cited 1. class=\"oneclick-link\" style=\"font-size: x-small;\">2. style=\"font-size: x-small;\">3.\n","DiscussionID":"00000051","Title":"It is plausible to assume that a finite universe was caused or created by a creator","CrawlDate":"2016/09/29 06:06:31","URL":"http://www.debate.org/debates/It-is-plausible-to-assume-that-a-finite-universe-was-caused-or-created-by-a-creator/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":162,"ConclusionEndPos":245,"nextID":"00000002","PremiseStartPos":[297],"prevID":"00000000","Premise":["Title: It is plausible to assume that a finite universe was created or caused by a creator Resolution: See *Conclusion D* Round 1: Pro:Argument Con: Rebuttal Round 2: Pro: Rebuttal Con: Rebuttal Round 3: Pro: Rebuttal and conclusion Con: Conclusion/ no rebuttals by Con (failure to do so results in a concession/ 7 point loss) Argument: 1. That which is finite was caused. The Big Bang is so often described as a spontaneous explosion of matter from a single point called the singularity. One other explanation is that the Big Bang is the stretching of space and time at an exponential rate, which theorises that there might have been another universe before the Big Bang. -(1) In other words: Previous universe contracts -> Condensed matter -> Resurgence/expansion -> Our universe. However there is no proof that this occurs and so all anyone can say for certain is that the universe began from a very tiny point and then expanded. Also, for anyone to say the theory above is plausible, that is if there was a previous universe, then one should probably assume the Universe is infinitely large since space has to stretch exponentially in an infinite way for there to be multiple resurgences. If there is only a limited amount of resurgences and there is one original big bang that occurred, then it goes without saying that this cycle of universes is finite and not infinite. One could however suggest that the universe can expand from that point forth in a infinite amount of time and therefore be infinite in space. However that still assumes that right now, there is a clear edge to the universe or the very end point of where space and time expands. And it also still assumes a beginning point in time for the universe to begin, which suggests it is still finite. So if the universe is infinite, then it is plausible to say the Universe was not created. It existed forever, has always existed and will continue to exist. Therefore if one assumes an infinite eternal universe, it is plausible to say the universe (and its resurgences) has always existed and was never created or had an origin. However: If the universe is finite, then it is plausible to assume the Universe was created, that is to say it was willed into existence or crafted with intention. This is because, for such a universe to be finite, the universe will need to have expanded from an origin point which is called the singularity. This singularity then contains all the matter, space and perhaps time of the universe. This singularity will be the minimum size that the entirety of the universe can be squashed into and so cannot go smaller. If it can go smaller, then the universe has an infinite amount of space, but this argument focuses only on the universe having only finite amount of space. And so this singularity would need to have a creator to be caused into existence or otherwise the universe came from nothing. In a syllogism: Premise A) Space, time and matter that has always existed, is infinite and that has no origin needs not to have a cause or to have been created by a creator. Premise B) Space, time and matter that has not always existed, is finite and has an origin needs to have been caused or created by a creator. Premise C) [If] the universe is finite; Conclusion D) Then it is plausible to assume that the Universe had a cause or was created by a creator. There is perhaps nothing controversial about this syllogism. Except the part where it states that a finite universe with an origin was caused or created by a creator. Here, 'caused' may be different to 'created'. 'created' assumes that there was intention in the creation process and 'caused' assumes there was no intention or purpose in the creation process. Premise B assumes both to be plausible. While the next arguments favour 'caused' more than 'created', it does not leave out the possibility that the universe was 'created'. 2. The Universe was caused (or created) by a creator. A 'creator' will be defined as something that is capable of causing the big bang but that is not in any way related to the universe. A being/thing that is outside or beyond space/time/matter. And so the argument is: If the universe is finite, the big bang was caused by a creator. Consider this: the earth was caused by cooling magma in space. Cooling magma was caused by an exploding star sending debris. Stars are caused by helium gasses and hydrogen gasses combining. Helium and hydrogen gasses are caused by quarks. Quarks are caused by the big bang. The big bang is the beginning point of all the causations. What caused the big bang then? If it was caused by a) a collapsed previous universe, then the universe is infinite (the matter/space and time). Or it could have been caused by b) a creator. Though another argument one could put forth is that the big bang could also have been caused by c) nothing at all or pure nothingness, but not empty space as that would still assume the existence of space. We can omit (a) because the argument only suggests a finite universe to have been caused or created by a creator. We can also omit c) since something cannot come forth or be caused by nothing. The very state of nothingness is nothing. It does not have the ability nor the capability to create or become anything since there is nothing to create from anyway. My opponent may argue against this but for now I leave it at that. Therefore we come to the final answer b) a creator. And so we can see that the big bang was caused (or created) by a creator. In a syllogism: Premise A) If the Universe is finite, then it was caused either by a creator or by nothing. Premise B) It is not possible for a finite universe to be caused by nothing since nothing can be caused by nothing. Premise C) It is possible for a finite universe to be caused by a creator. Conclusion D) Therefore, it is plausible to assume a finite universe to be caused by a creator. I hope these two syllogisms and supportive arguments convince you to consider the plausibility that if the universe is finite, then it was caused by a creator. (1) [ Science, Religion, and the Big Bang. Minute Physics, Aug 19 2013. December 19, 2014."],"PremiseEndPos":[6450],"ArgumentID":"00000001","Conclusion":"It is plausible to assume that a finite universe was caused or created by a creator","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":162,"ConclusionEndPos":245,"nextID":"00000003","PremiseStartPos":[6465],"prevID":"00000001","Premise":["Rebuttal: 1. Semantics of \"Universe\" As Pro, I disagree to the definition, \"'Our four dimensional space-time, and all the matter, particles, energy and all the laws of physics that a part of it'\", to be the definition of what our universe is. The definition assumes too much of what the universe encompasses. It is simpler to say that the universe is the entire matter and energy in the cosmos. This is the common definition for the universe as stated in the Oxford dictionary for example; \"(the universe) All existing matter and space considered as a whole; the cosmos.\" - (1) Another similar definition given by Merriam Webster: \"the universe : all of space and everything in it including stars, planets, galaxies, etc.\" - (2) And finally from Dictionary.com: \"the totality of known or supposed objects and phenomena throughout space; the cosmos; macrocosm.\" - (3) I have tried searching for a more 'scientific' and reliable definition of the universe and have come up short. This is why I see the above definitions to be suitable for defining the universe in this debate. 2. Impossible to justify claims regarding the Universe as a whole I would like to point out that Con is correct in saying that there is no justification to predict the future. That we do not know everything and therefore cannot make a correct prediction or deduction. However, that is only true for truth claims. When it comes to plausible scenarios then it is still valid. Whether the argument is sound is not purported in the resolution. The resolution proposes only the plausibility of such. Yes. We cannot justifiably make true claims of reality in the future. We do not have enough instruments and knowledge to come up with evidence just from induction. But we can still justifiably make claims that are plausible. Granted, they might not be wholly true, however, they can still plausibly be true. If Con shows that the arguments supporting the resolution are implausible then the resolution fails. Either this, or Con can make an opposite argument against the resolution that is much more plausible than Pros. And therefore it is important for the readers to determine if Con has succeeded in either. 2.1 Application to the Big Bang Again, if this debate was on the truth claims of the universe then it would be utterly impossible to do so as Con argues we do not have the sufficient understandings of the singularity to properly debate its origins. As pro, I argue however, that the probability of the likely origins of the singularity should not be overlooked and therefore is worth debating. This is why quantum theories exist is to argue a notion that may be absurd but plausible and probable. Just as Con puts forth the theory of quantum gravity, a theory that seeks to explain gravity using quantum principles rather than Einstein's theory of relativity, is making non posteriori claims. Con assumes that I am claiming a 'reality' or a 'truth' where in actuality I am just merely proposing the probability of the origins of the big bang/singularity if the universe is finite. Therefore, as Pro, I am not obliged to make a 'sound' argument, rather I only have to come up with a 'plausible' and valid argument. In other words. True, the origins of the Big Bang cannot be known without priori principles. But that is only if the resolution was 'X comes from Y' rather than 'X plausibly comes from Y'. In order to negate this latter argument, Con has to come up with a counter argument that is more plausible. In so far as round 1, Con has not found any logical fallacies or showed how Pro's arguments are logically invalid and therefore Con can only come up with a better more plausible argument for the origins or lack of origins of the big bang (in a finite universe). 2.2 Application to the Universe as a Whole Causality is separate from the Universe. I argue that the Universe is subject to causality and that causality is not subject to the Universe. Consider the expansion of the universe. How does it do so? it needs to occupy more and more of the dimension of space. And how does the Universe change its state without time? It is logically impossible for the Big Bang to emerge from no time at all if time is directly linked to causality. This is why, it is more plausible to assume that time/causality is a dimension/principle separate from the Universe. 3. The explanation/cause of the universe Con has mistaken me for arguing that the \"the explanation of the universe is X\". The resolution was, again, one that focused on plausibility, not soundness. I did not argue that 'a finite universe was caused or created by a creator'. I argued that it \"is plausible to assume a finite universe to be caused or created by a creator.\" I also outlined that \"'created' assumes that there was intention in the creation process and 'caused' assumes there was no intention or purpose in the creation process.'\" I included both in the resolution so that I do not, \"leave out the possibility that the universe was 'created\". And to argue that the Universe was caused or created by a 'creator', I provided a syllogism: P1) If the Universe is finite, then it was caused either by a creator or by nothing. P2) It is not possible for a finite universe to be caused by nothing since nothing can be caused by nothing. P3) It is possible for a finite universe to be caused by a creator. C) Therefore, it is plausible to assume a finite universe to be caused by a creator. However, Con has not refuted this syllogism directly and therefore I assume that the argument is at least logically valid. And the only other way for Con to negate the resolution was to provide a more plausible and logically valid counter argument against the resolution. Con does not do this however, though he does provide a syllogism: P1) Intentionality requires functioning mental processes P2) All mental processes are temporal P3) The explanation of the universe is necessarily atemporal C) The explanation of the universe is necessarliy not intentional However, this is not the counter argument to the resolution. It is a counter argument to Con's previous assumption of my proposition that the universe was 'created' and not 'caused'. Therefore, Con has yet to provide a counter argument to the resolution that \"It is plausible to assume that a finite universe was caused or created by a creator\" and so the resolution remains unnegated. Sources: (1) (2) (3)"],"PremiseEndPos":[12876],"ArgumentID":"00000002","Conclusion":"It is plausible to assume that a finite universe was caused or created by a creator","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":162,"ConclusionEndPos":245,"nextID":"00000004","PremiseStartPos":[12891],"prevID":"00000002","Premise":["i forfeit this round. I have been busy with family get togethers and travelling. Thank you Con for the amazing debate. Wish you luck on future debates!"],"PremiseEndPos":[13043],"ArgumentID":"00000003","Conclusion":"It is plausible to assume that a finite universe was caused or created by a creator","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":162,"ConclusionEndPos":245,"nextID":"00000005","PremiseStartPos":[13058],"prevID":"00000003","Premise":["Introduction I thank Adam_Godxilla for instigating this debate, and for being rather concise with his arguments. I will first present a negative case, which should directly or indirectly deal with Pro’s opening arguments. Negative Case 1. Semantics of \"Universe\" I need to get this out of the way first, as it is so important to this debate. Pro has not defined what the \"universe\" means, as it can take on several definitions. Because Pro has not defined the universe, he is dangerously close to committing the fallacy of equivocation throughout his opening arguments. For the sake of this round of arguments I will be defining the universe as: \"Our four dimensional space-time, and all the matter, particles, energy and all the laws of physics that a part of it\" This I think it a very reasonable definition, as it is this universe which the Big Bang theory theorises the \"origin\" of the universe of. This is going to become very important later. 2. Impossible to justify claims regarding the Universe as a whole This argument borrows significantly from David Hume’s posited ‘Problem of Induction’. He makes the claim that there are two types of knowledge, a priori and a posterori. A priori claims are ones which we can know to be true by virtue of just thinking about it. These truths are also necessary truths in the sense that regardless of the metaphysical nature of the world we inhabit, what is true a priori for one world will be true a priori for all worlds. Two apples plus three oranges will always give you five pieces of fruit, and there simply is no other way this fact can be.[1] On the other hand, synthetic truths, ones that are known a posterori run into the problem of induction. That is to say we cannot justifiably make claims about how reality will be in the future by virtue on what happened in the past without first assuming the principle of the uniformity of nature, the reason for this, David Hume argues is that we simply have no justification to expect the future will be anythign like the past. We simply do not have a properly basic understanding of reality to make thiis statement. It is conceivable, and metaphysically possible for reality to turn out in two different ways unless there really is a uniformity of anture principle acting, which for now, we take fo rgranted when making inductive inferences and arguments. It is this critical assumption that one must make when making inductive arguments which underpins all of science, and most critically, underpins any hope Adam has of making claims about the universe. 2.1 Application to the Big Bang The problem here is, the principle of the uniformity of nature is exceptionally dubious to assume once we take the conditions to the extreme. Since the uniformity of nature also applies to context. For example throwing a ball through the air is goign to have different dynbamics to throwing it through water. We simply have two different environmental contexts, and the uniformity of nature assumption simply does not hold until we apply the same contexts. The singularity proposed by assuming relativity to hold at infinitely small scales merely represents the breakdown of our laws of physics. We are already confidence that the strong and weak nuclear force, as well as the electromagnetic force are not distinctly separate forces in these conditions. More seriously are that space and time are posited to possess infinite curvature, and that if there is a scientific principle that governs these conditions then it would be a theory of quantum gravity, as it is the realm of quantum mechanics that is known to govern the extremely small scales of the universe. What this means is that space, time, and by extension, our notion of entropy are completely different to what our common ‘classical’ notions of space, time and entropy are. Thus, the context is different to what we can make (possibly) reasonable claims about within inductive reasoning, we simply do not have this uniformity of nature principle that we can reasonably assume, as we know for a fact that the conditions and context of the big bang itself are simply beyond experience. Thus, to make claims about the nature of what the singularity is (assuming it ever existed), what the big bang really is simply impossible to do without a priori principles, and I wish Adam best of luck in finding those. 2.2 Application to the Universe as a Whole Given these insurmountable problems are present for just the Big Bang itself, which arguably is (or was) part of the universe, or was a state of the universe. When we go outside of any point of the universe, or any point the universe existed, then we run into even bigger problems. Because here we know for a fact the uniformity of nature principle doesn’t hold, since you need nature…. to have any uniformity of nature, thus any claims regarding the universe as a whole are patently absurd. This extends to rebut Pro’s arguments since pro is advocating for some sort of ‘cause’ or ‘explanation’ of the universe, however the big bang was part of the universe. The language of causality, and ‘explanations’ that we are familiar with is predicated on our experience within our three dimensional space and one of time environment. Within the universe we have space, time and entropy, which gives us our arrow of time, time gives a frame of \"before and after\" and all events we know about occur within space., the ability to tell ‘before’ from ‘after’, and everything from which we make inductive claims regarding causality. Thus even assuming that the inductive laws of causality, and contingency etc. do apply within the universe, we are in a completely different context when talking about the universe as a whole. 3. The explanation/cause of the universe If we assume trhe universe has a cause/explanation, and that cause explanation has something intimately to do with the big bang, then why should we assume that it was created with intentionality? Making this leap from \"the universe has an explanation\" to \"the explanatgion of the universe is X\" is a massive one, and I simply have not seen Adam attempt to uphold this in his opening round Pro literally asserts by fiat that \"if the universe is finite, then it's plausible to assume the universe was created, that is to say it was willed into existence or crafted with intention\", but Pro literally skips over half of what he has to prove here!!! Why should the cause of the universe, IF it had one, be an intentional one? This presupposes a whole plethora of dubious assumptions, such as the fact that intentions can even exist outside of our universe, or that it's even possible for intentions to exist without a temporal context (time). Moreover, simply arguing that a pre-existing substance (that is not intentional) solves this issue equally as well, and doesn't rely on these additional assumptions, therefore we should reject Pro's speculation outright by virtue of Occam's razor. Moreover, IF Pro believes he has good inductive reasons to accept an intentional first cause, then I have my own argument to respond in kind: P1) Intentionality requires functioning mental processes P2) All mental processes are temporal P3) The explanation of the universe is necessarily atemporal C) The explanation of the universe is necessarliy not intentional P3 is obvious by definition of the universe I have given, which posits the lack of existance of time without the universe. If Pro argues time existed before the universe, then he runs into a plethora of subsequent issues such as there existing non-mental substances without the universe. P1 is also de facto true. Thus the only premise that can be challenges is P2, which is an inductive statement abotu what we know about mental processes. All thoughts we know about require a chain of events, beliefs -> senses -> processing -> action. Thus if Pro want sot challenge this, then he also undermines any right to make inductive arguments. Works Cited 1."],"PremiseEndPos":[21017],"ArgumentID":"00000004","Conclusion":"It is plausible to assume that a finite universe was caused or created by a creator","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":162,"ConclusionEndPos":245,"nextID":"00000000","PremiseStartPos":[21032],"prevID":"00000004","Premise":["1. Semantics of “Universe” Pro makes a clear distinction between space, time, and the laws of physics and nature and what he argues is the universe, to which he only affirms the “universe” is “all of space and everything in it including stars, planets, galaxies, etc.”. I have no problem with this definition, only that he continues to use it consistently. Also by extension, it is seriously damaging to Pro’s case as a result. And I will add several arguments to affirm this. 2. Impossible to justify claims regarding the Universe as a whole Pro’s arguments regress to appeals to epistemic possibility to affirm plausibility, however this seems insufficient, given most definitions of ‘plausible’ appeal to more than just bare possibility. E.g.: \"having an appearance of truth or reason; seemingly worthy of approvalor acceptance; credible; believable:”[1] “Capable of being believed; believable or plausible” [2] And so on. While I would agree it’s a statement about epistemology, rather than metaphysics, Pro needs to do more than just say it’s ‘epistemologically possible’ to affirm plausibility. For most things which we are in ignorance of all the facts are ‘possible’, but no by means probable. It’s possible the moon landings were hoaxed, and there are always ways to explain away any facts presented to dismiss it, however it would remain implausible, even if possible. Pro seems to misunderstand my argument from the problem of induction. The point is we can only make predictions or justifiable claims IF AND ONLY IF we first presuppose the uniformity of nature principle. This principle though we know simply does not apply in the conditions Pro is arguing a creator did something. Pro has not attempted to demonstrate where my analysis of i.) why this presupposition is not necessary or ii.) that this presupposition is sound during the conditions of the big bang/before the big bang. It’s only by these two ways which Pro can hope to affirm his arguments. 2.1 Application to the Big Bang Pro agrees with my analysis here. The whole reason why our laws break down is that we do not have an understanding of nature or context of nature to justifiably make laws. Physicists do propose a theory of quantum gravity if necessary, but these remain steep heaped in speculation. None invoke creation or causation, however. 2.2 Application to the Universe as a Whole “Causality is separate from the Universe. I argue that the Universe is subject to causality and that causality is not subject to the Universe.” I would kindly ask Pro to justify these mindbogglingly massive claims. He assumes that the universe (as I define, includes the mechanisms which bring forth the laws of physics) is subject to the same principles that work within it. This is a classical fallacy of composition. “It is logically impossible for the Big Bang to emerge from no time at all if time is directly linked to causality.” That presupposes the big bang was ever “caused” or has an “explanation”, which I argued is not the case since there is no reason to think the universe is externally explicable, or has an external cause, or any cause whatsoever. This is due to the uniformity of nature principle already discussed. If the universe is uncaused or self-caused, then Pro’s entire case goes out of the window. If the universe is externally caused, then Pro’s cause ONLY applies if it’s caused by an intentional creator. He has much work to do to affirm this specific scenario is even plausible. \"This is why, it is more plausible to assume that time/causality is a dimension/principle separate from the Universe.\" We have simply no empirical experience whatsoever outside of our three dimensional fabric of space and one of time. Thus I have no idea how Pro can even dream of justifiably making plausible claims outside of that context, which is exactly the situation of the universe as a whole. 3. The explanation/cause of the universe I have yet to see Pro affirm any of the premises within his two arguments, thus we should treat them as bare assertions. We have good reason to believe several premises in each of his arguments are false. However, and only one needs to be false in each for the conclusion not to follow. 1st Argument Premise A of Pro’s first argument is irrelevant, and Premise C is presupposed within the context of this debate, thus I only need to refute Premise B: “Premise B) Space, time and matter that has not always existed, is finite and has an origin needs to have been caused or created by a creator.” Again, Pro has given no reasons to believe this is true, and hence has failed his burden of proof. I gave reasons why this is false from creation via. substance, or via. space (zero energy universe), as well as the problem of induction. 2nd Argument P1 is a clear false dichotomy. I already argued last and this round round how the universe can be caused by a non-intentional substance, such as space (such as which is proposed in the zero energy universe hypothesis), or some other putative substance which is not based on space or time or intentionality. P2 I do not see how Pro can hope to affirm as true, since we have no experience of a philosophical “nothing” (absence of anything), and a physical “nothing (empty space) we already know generates virtual particles. P3 Pro has simply taken for granted, and has not attempted to affirm. I gave good reasons to think this is false with my argument from atemporality Pro’s tries a blatanton the resolution here by arguing simply arguing the universe is ‘caused’ is enough to fulfil the resolution, but the resolution makes more sense when read with a fully creator subject, and is also just false, since agent causation is a form of intentional causation. Moreover most arguments for God for example argue that God is an efficient cause of the universe, which would clearly qualify as an example of intentional causation, and shows that ‘caused’ does not “assumes there was no intention or purpose in the creation process\". 4. Argument from Thermodynamics The first law of thermodynamics, or the conservation of energy states that “that the total energy of an isolated system is constant; energy can be transformed from one form to another, but cannot be created or destroyed.”. Moreover the same applies to mass, which is now known to intricately linked due to Einstein’s law of mass-energy equivalence.[3] Thus, if Energy can only be converted to other forms of energy or matter, and vice versa, then the “universe” (as Pro has defined) is a self-contained system where it’s impossible to go from a state of no mass-energy to a state of mass-energy. Thus, I can make the following argument: P1. If the universe is created or caused, then mass & energy creation is possible P2. Mass & Energy creation is impossible C. The universe is not created or caused P2 holds IF we assume a uniformity of nature principle (which Pro must also assume himself if he is going to make any claims whatsoever about the big bang), and P1 is de facto true. Given that P2 is one of our most powerful and well-attested laws suggested from induction within science, then Pro has a MASSIVE mountain to claim to render a creator as even possible, let alone plausible. A very potent universe explanation exists within the zero energy universe hypothesis, which argues that mass & energy were never created, since the net energy content of the universe is actually zero. This leads to the predictions of a spatially flat universe, as well as a mechanism by which empty space can produce particles of impunity, which we have found with virtual particles.[4] 5. Argument from Temporality As a minor twist on my argument from minds: 1 Causation requires temporality 2 A cause of the universe must be atemporal C The universe has no cause Both premises I ahve affirmed in round 1. Time allows us to speak the language of causality, to deparate before & after. Thus these work to negate Pro's case once again. Works Cited 1. class=\"oneclick-link\" style=\"font-size: x-small;\">2. style=\"font-size: x-small;\">3."],"PremiseEndPos":[29082],"ArgumentID":"00000005","Conclusion":"It is plausible to assume that a finite universe was caused or created by a creator","PremiseStance":["Con"]}}]}