{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-Washington-Redskins-Should-be-Allowed-to-Keep-their-Name/1/\nCrawl date: 2016/09/29 03:18:22\nDebate Issue: The Washington Redskins Should be Allowed to Keep their Name | Debate.org\nNumber of arguments: 10\n\n\nEvidence Pro: First Round is just to confirm. I will be arguing the Washington Redskins should keep their name. Best of luck\n\nEvidence Pro: First I will begin this debate I will be arguing through statistics, the rich history of the Redskins organization, and the Rights given in The Constitution, that the Washington Redskins should be allowed to keep their name. Now the removal of the Washington Redskins name and banishment of the term \"Redskins\" simply violate the Right to Free Speech given in the Constitution, which is a large part of the Washington Redskins defense. The Redskins name is not overly offensive to most either. In an AP Poll conducted in 2014 showed that only 14% of those polled found the name offensive and wanted it to be changed. In addition to that poll, 83% of those polled believe the name should not change. In the Democratic society we live in, we should have the majority win out and the Washington Redskins should remain the Washington Redskins. I will add to my argument in future rounds. Best of luck.\n\nEvidence Pro: First blaming the Redskins Mascot for Native American suicides is truly blasphemous. There is, in no way, a correlation between the Redskins mascot and Native American suicides. Secondly, the name was not an original idea of George Preston Marshall's, as the name was a tribute to the coach of the team at the time, William \"Lone Star\" Dietz. Dietz, who was American Sioux, and the name was also considered to match with the Boston Red Sox, in 1932 the team was still in Boston and would not relocate until later in 1930's. Because the name was to coexist with the Red Sox, it was not of racist intent. You argue that Native Americans find the name racist. In a 2013 poll conducted 90% of Native Americans found the name not offensive. Again just because a small percentage find the name offensive does not force the team to change its name. As I close for this round let me ask you a question: The Washington Redskins, Kansas City Chiefs, Cleveland Indians and other teams Native American mascots face constant criticism why are other teams not criticized? The Vancouver Canucks have a name that is considered a derogatory word for Canadians, yet that name goes unnoticed. Why do we have teams honoring both sides in the Civil War, including the Ole Miss Rebels, yet there name does not change? I support keeping those names as well as I do the Washington Redskins, however it is time for consistency in our society. Attack all the names or attack none.\n\nEvidence Pro: The Washington Redskins name is supported by Native Americans. When the Redskins hosted the Navajo Code Talkers at a Game in 2013, one men honored spoke on the name. Mr. Hawthorne said, \"We didn't have that in mind but that is undoubtedly what we did do. My opinion is that's a name that not only the team should keep, but that's a name that's American.\" The Redskins honored the American heroes and they feel that there is nothing wrong with the name. The Redskins name is all throughout the country. In a 2013 article written by ESPN's Rick Reilly, he talks about three high schools who have the name Redskins. Within those schools the Native American populations are: 91.2%, 57.7%, and 99.3%. That name to them is tradition, that name shows pride, and once again the white population is overprotecting a minority. Within the same article, The Annenberg Public Policy Center conducted a poll in which 90% of Native Americans found the name harmless. One man said, \"The whole issue is so silly to me. The name just doesn't bother me much. It's an issue that shouldn't be an issue, not with all the problems we've got in this country.\" And he is absolutely correct. There are more issue the politicians should be concerned about regarding Native Americans than the harmless name of an NFL Football Team.\n\nEvidence Pro: Despite their controversies, these Native American names, including the Redskins, should stay in sports. Die Hard and passionate fans love these franchises more than anything. Sports are considered a release from the World. These teams success leads to a great sense of pride among their fans. Much like the people of New England wear Red Sox or Patriots jerseys, people of other regions take pride in wearing Indians or Redskins attire. Just think for a minute how would the people of the New England region react if the Boston Red Sox or the Boston Bruins were required to change their names? With understanding the difference in circumstances, if and when these franchises and colleges undergo changes that history is sealed with the names and the logos. Much like if the franchises relocate, there is new history that must be made. If the names of any of these teams are changed, in some cases, nearly a century\"s worth or more of history ends simply because the name offends a small percentage of the population. One final question that can be asked, for people of New England : when entering one of those Connecticut casinos, either Foxwoods or Mohegan Sun, look around. Then ask, what is more offensive: the statue of an arrow shooting Native in a casino and the Native American ambiance surrounding these casinos, or those stoic warrior heads that are a tribute to the nation\"s past and the logos of some of America's most beloved sports teams?\n\nEvidence Con: I accept the debate.\n\nEvidence Con: Thanks Pro. The Redskins should change their name for several reasons. C1: It’s Derogatory and Offensive There have been serious protests against the Redskins since 1971. Even if 95% of people said they were fine with the name that would not be representative of the 1-2% of the population that are actually Native American. It’s a derogatory term, highlighting a difference in skin color, sure, but also using an ethnicity as a mascot. That is very offensive. It’s a term that is also deeply associated with the practise of slaughtering Native Americans. A ‘redskin’ was a term that bounty hunters used to refer to the bloodied scalp of a kill. It was mass extermination, the American holocaust, beginning with the Phips Proclamation of 1755: “His Majesty’s subjects to Embrace all opportunities of pursuing, captivating, killing and Destroying all and every of the aforesaid Indians.” At one time, the government paid 50 pounds for scalps of males over 12 years, 25 pounds for scalps of women over 12, and 20 pounds for scalps of boys and girls under 12. Keep in mind, an English teacher earned 60 pounds a year in those days. This was genocide. The man who named the team the “Redskins”, that is, George Preston Marshall, was also the same man who refused to sign black players to the Redskins team until 1962 – when Attorney General Robert Kennedy forced him to sign a black player or else lose his stadium. He said, “We'll start signing Negroes when the Harlem Globetrotters start signing whites.” Ignoring the long history of brutal treatment the Globetrotters had experienced. C2: There have been countless protests over the name The National Congress of American Indians has been protesting the name for almost thirty years now. To say that Native Americans don’t mind would be dishonest and fallacious. While Caucasians might not mind (even though they should) the Native American population is very much offended. Whether it’s boycotting in the 1988 Super Bowl, or it’s the protests at 1992 Super bowl bearing signs like, “We are not Mascots” or it’s the 4000 protesters during a game on Nov. 23, 2014 (it was almost violent). They’ve been at this for years. C3: It’s harmful Dr. Stephanie Fryberg did a study on the effects of American Indian mascots and team names and concluded that the effects were negative on Native American peoples. The self-esteem of Native American youths was harmed, and we need to be enforcing self-esteem, not damaging it. The suicide rate among Native American youths is at 18%, significantly higher than the general suicide rate (8%). Sources\n\nEvidence Con: Thanks Pro. First of all, at no point did I solely blame the Native American suicide rate on the Washington Redskins – that would be crazy. What I did was point out that self-esteem is low enough as it is, and any effort to further lower the self-esteem in any way of a damaged population seems careless and cruel. As for your defence of the naming of the team – it was named after William ‘Lone Star’ Dietz, yes, but it was named by a confirmed racist. Note that he did not name the team the “Washington Lone Stars” or something like that. To draw a further comparison here, if William Dietz was black, we might have a team called the “Washington Ne-gro’s”. Further, William Dietz may not have even been Native American at all – his ancestry was disputed even then. From the article you listed: “Dietz served jail time for charges that he falsely registered for the draft as an Indian in order to avoid service. According to an investigation by the Indian Country Today newspaper, he stole the identity of a missing Oglala Sioux man.” The poll you listed is also disputed, even in the source you gave: “In the only recent poll to ask native people about the subject, 90 percent of respondents did not consider the term offensive, although many question the cultural credentials of the respondents.” The poll that you quoted is from a 2004 survey of only 768 who identified themselves as American Indian. It did not ask them if they wanted a football team named the Redskins, it asked them if they found it offensive – these are very different points. If you asked a black community if they found the word “Nig-er” offensive, they might unanimously say no, because that word has been ‘taken back’ by the black community. A counter study conducted by James Fenelon of California State University found that in reality 67% found the term offensive and racist, 12% were neutral, and 20% were in disagreement. I contend still that if you asked them if they wanted the team name changed they would unanimously say yes. I wholeheartedly support changing all team names that are racist in any way – let’s change them all! As for Canuck – that term isn’t offensive in the slightest. It doesn’t denote race in any way, and comparing to the term ‘Redskin’ isn’t fair at all. At the most, it’s a nationalistic ‘poke in the ribs’, and nothing more. Here’s a question for you then: Are you okay with taking advantage of an entire ethnic community for the sake of a sports team name? Sources\n\nEvidence Con: Thanks Pro. Although I remain respectful of the code talkers, asking one man, Roy Hawthorne, who is 87 years old (and was being honored by the team in question - hardly an unbiased source), is hardly a country-wide poll. From the same article you sourced: “Monday night's brief, on-field ceremony came as some Indians and civil rights leaders wage a \"Change the Mascot\" campaign that targets the term redskins as a racial epithet. Jacqueline Pata, head of the National Congress of American Indians, called the appearance \"a political play rather than a heartfelt recognition of the Code Talkers.\" Pata, a member of the Tlingit Tribe of Alaska, said she reveres the Code Talkers for the work they have done but added that people often fail to recognize that the origins of the term \"redskin\" date to a period when Indians faced efforts to annihilate their culture. \"We were outlawed during that same period the mascot was created from practicing our own religion and our own cultures,\" she said. \"That term is associated with getting rid of the Indians.\" Snyder has called the team name and mascot a \"badge of honor.\" The name dates to the team's first years in Boston in the 1930s and has survived numerous outside efforts to change it. The team has been in the Washington, D.C., area since 1937.” Ironically enough, the source you gave by the The Annenberg Public Policy Center was the exact one I just challenged in the last round. Restating my points: “…a 2004 survey of only 768 who identified themselves as American Indian. It did not ask them if they wanted a football team named the Redskins, it asked them if they found it offensive – these are very different points. If you asked a black community if they found the word “Nig-er” offensive, they might unanimously say no, because that word has been ‘taken back’ by the black community.” The logical tautology that Pro employs by saying we should focus on bigger issues is just silly. I could say that about any topic. “We shouldn’t focus on (x) because (y) is a more important problem”. Hardly a strong defence. The point is for many people it is an issue.\n\nEvidence Con: Thank you Pro. Pro backs up his last round by essentially saying “The Redskins should stay called the Redskins because they are called the Redskins”. He says, “Just think for a minute how would the people of the New England region react if the Boston Red Sox or the Boston Bruins were required to change their names?” as though the Red Sox or the Bruins (and old English word for Brown Bear) are somehow comparable to a team called the Redskins. Here is a comparison. Can you even imagine if a team was called the “Blackskins”? As I pointed out before, if William Dietz had been black, we might have had a team called just that, or worse. For a team without a single Native American, it is especially offensive. “Blackskins” is horribly racist. “Redskins” is fine? You see the double standard here. It is especially offensive to use that logic because it inherently presupposes that Native Americans somehow don’t deserve the rights and respect that African Americans do. Look up the mass genocides of Native Americans and tell me they haven’t earned some respect from the white man. This is a decade’s long scandal and it needs to stop now. It’s not American. It’s racist. Even if we found that 80% of Native Americans supported it, would we want to pursue such names? I bet if we took a poll of African Americans in 1900 they would be fine with any team name we wanted to pick, but would that have been a step forward? “…nearly a century\"s worth or more of history ends simply because the name offends a small percentage of the population.” This is also especially offensive. “If it doesn’t bother me then why should it change?” What an outrageous reason to keep a name like the Redskins. I’ve already shown that it does offend the very people it is supposed to represent. Once more: “A counter study conducted by James Fenelon of California State University found that in reality 67% found the term offensive and racist, 12% were neutral, and 20% were in disagreement. I contend still that if you asked them if they wanted the team name changed they would unanimously say yes.” So again: “Here’s a question for you then: Are you okay with taking advantage of an entire ethnic community for the sake of a sports team name?”\n","DiscussionID":"00000015","Title":"The Washington Redskins Should be Allowed to Keep their Name","CrawlDate":"2016/09/29 03:18:22","URL":"http://www.debate.org/debates/The-Washington-Redskins-Should-be-Allowed-to-Keep-their-Name/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000002","PremiseStartPos":[258],"prevID":"00000000","Premise":["First Round is just to confirm. I will be arguing the Washington Redskins should keep their name. Best of luck"],"PremiseEndPos":[369],"ArgumentID":"00000001","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000003","PremiseStartPos":[384],"prevID":"00000001","Premise":["First I will begin this debate I will be arguing through statistics, the rich history of the Redskins organization, and the Rights given in The Constitution, that the Washington Redskins should be allowed to keep their name. Now the removal of the Washington Redskins name and banishment of the term \"Redskins\" simply violate the Right to Free Speech given in the Constitution, which is a large part of the Washington Redskins defense. The Redskins name is not overly offensive to most either. In an AP Poll conducted in 2014 showed that only 14% of those polled found the name offensive and wanted it to be changed. In addition to that poll, 83% of those polled believe the name should not change. In the Democratic society we live in, we should have the majority win out and the Washington Redskins should remain the Washington Redskins. I will add to my argument in future rounds. Best of luck."],"PremiseEndPos":[1282],"ArgumentID":"00000002","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000004","PremiseStartPos":[1297],"prevID":"00000002","Premise":["First blaming the Redskins Mascot for Native American suicides is truly blasphemous. There is, in no way, a correlation between the Redskins mascot and Native American suicides. Secondly, the name was not an original idea of George Preston Marshall's, as the name was a tribute to the coach of the team at the time, William \"Lone Star\" Dietz. Dietz, who was American Sioux, and the name was also considered to match with the Boston Red Sox, in 1932 the team was still in Boston and would not relocate until later in 1930's. Because the name was to coexist with the Red Sox, it was not of racist intent. You argue that Native Americans find the name racist. In a 2013 poll conducted 90% of Native Americans found the name not offensive. Again just because a small percentage find the name offensive does not force the team to change its name. As I close for this round let me ask you a question: The Washington Redskins, Kansas City Chiefs, Cleveland Indians and other teams Native American mascots face constant criticism why are other teams not criticized? The Vancouver Canucks have a name that is considered a derogatory word for Canadians, yet that name goes unnoticed. Why do we have teams honoring both sides in the Civil War, including the Ole Miss Rebels, yet there name does not change? I support keeping those names as well as I do the Washington Redskins, however it is time for consistency in our society. Attack all the names or attack none."],"PremiseEndPos":[2752],"ArgumentID":"00000003","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000005","PremiseStartPos":[2767],"prevID":"00000003","Premise":["The Washington Redskins name is supported by Native Americans. When the Redskins hosted the Navajo Code Talkers at a Game in 2013, one men honored spoke on the name. Mr. Hawthorne said, \"We didn't have that in mind but that is undoubtedly what we did do. My opinion is that's a name that not only the team should keep, but that's a name that's American.\" The Redskins honored the American heroes and they feel that there is nothing wrong with the name. The Redskins name is all throughout the country. In a 2013 article written by ESPN's Rick Reilly, he talks about three high schools who have the name Redskins. Within those schools the Native American populations are: 91.2%, 57.7%, and 99.3%. That name to them is tradition, that name shows pride, and once again the white population is overprotecting a minority. Within the same article, The Annenberg Public Policy Center conducted a poll in which 90% of Native Americans found the name harmless. One man said, \"The whole issue is so silly to me. The name just doesn't bother me much. It's an issue that shouldn't be an issue, not with all the problems we've got in this country.\" And he is absolutely correct. There are more issue the politicians should be concerned about regarding Native Americans than the harmless name of an NFL Football Team."],"PremiseEndPos":[4071],"ArgumentID":"00000004","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000006","PremiseStartPos":[4086],"prevID":"00000004","Premise":["Despite their controversies, these Native American names, including the Redskins, should stay in sports. Die Hard and passionate fans love these franchises more than anything. Sports are considered a release from the World. These teams success leads to a great sense of pride among their fans. Much like the people of New England wear Red Sox or Patriots jerseys, people of other regions take pride in wearing Indians or Redskins attire. Just think for a minute how would the people of the New England region react if the Boston Red Sox or the Boston Bruins were required to change their names? With understanding the difference in circumstances, if and when these franchises and colleges undergo changes that history is sealed with the names and the logos. Much like if the franchises relocate, there is new history that must be made. If the names of any of these teams are changed, in some cases, nearly a century\"s worth or more of history ends simply because the name offends a small percentage of the population. One final question that can be asked, for people of New England : when entering one of those Connecticut casinos, either Foxwoods or Mohegan Sun, look around. Then ask, what is more offensive: the statue of an arrow shooting Native in a casino and the Native American ambiance surrounding these casinos, or those stoic warrior heads that are a tribute to the nation\"s past and the logos of some of America's most beloved sports teams?"],"PremiseEndPos":[5539],"ArgumentID":"00000005","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000007","PremiseStartPos":[5554],"prevID":"00000005","Premise":["I accept the debate."],"PremiseEndPos":[5575],"ArgumentID":"00000006","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000008","PremiseStartPos":[5590],"prevID":"00000006","Premise":["Thanks Pro. The Redskins should change their name for several reasons. C1: It’s Derogatory and Offensive There have been serious protests against the Redskins since 1971. Even if 95% of people said they were fine with the name that would not be representative of the 1-2% of the population that are actually Native American. It’s a derogatory term, highlighting a difference in skin color, sure, but also using an ethnicity as a mascot. That is very offensive. It’s a term that is also deeply associated with the practise of slaughtering Native Americans. A ‘redskin’ was a term that bounty hunters used to refer to the bloodied scalp of a kill. It was mass extermination, the American holocaust, beginning with the Phips Proclamation of 1755: “His Majesty’s subjects to Embrace all opportunities of pursuing, captivating, killing and Destroying all and every of the aforesaid Indians.” At one time, the government paid 50 pounds for scalps of males over 12 years, 25 pounds for scalps of women over 12, and 20 pounds for scalps of boys and girls under 12. Keep in mind, an English teacher earned 60 pounds a year in those days. This was genocide. The man who named the team the “Redskins”, that is, George Preston Marshall, was also the same man who refused to sign black players to the Redskins team until 1962 – when Attorney General Robert Kennedy forced him to sign a black player or else lose his stadium. He said, “We'll start signing Negroes when the Harlem Globetrotters start signing whites.” Ignoring the long history of brutal treatment the Globetrotters had experienced. C2: There have been countless protests over the name The National Congress of American Indians has been protesting the name for almost thirty years now. To say that Native Americans don’t mind would be dishonest and fallacious. While Caucasians might not mind (even though they should) the Native American population is very much offended. Whether it’s boycotting in the 1988 Super Bowl, or it’s the protests at 1992 Super bowl bearing signs like, “We are not Mascots” or it’s the 4000 protesters during a game on Nov. 23, 2014 (it was almost violent). They’ve been at this for years. C3: It’s harmful Dr. Stephanie Fryberg did a study on the effects of American Indian mascots and team names and concluded that the effects were negative on Native American peoples. The self-esteem of Native American youths was harmed, and we need to be enforcing self-esteem, not damaging it. The suicide rate among Native American youths is at 18%, significantly higher than the general suicide rate (8%). Sources"],"PremiseEndPos":[8174],"ArgumentID":"00000007","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000009","PremiseStartPos":[8189],"prevID":"00000007","Premise":["Thanks Pro. First of all, at no point did I solely blame the Native American suicide rate on the Washington Redskins – that would be crazy. What I did was point out that self-esteem is low enough as it is, and any effort to further lower the self-esteem in any way of a damaged population seems careless and cruel. As for your defence of the naming of the team – it was named after William ‘Lone Star’ Dietz, yes, but it was named by a confirmed racist. Note that he did not name the team the “Washington Lone Stars” or something like that. To draw a further comparison here, if William Dietz was black, we might have a team called the “Washington Ne-gro’s”. Further, William Dietz may not have even been Native American at all – his ancestry was disputed even then. From the article you listed: “Dietz served jail time for charges that he falsely registered for the draft as an Indian in order to avoid service. According to an investigation by the Indian Country Today newspaper, he stole the identity of a missing Oglala Sioux man.” The poll you listed is also disputed, even in the source you gave: “In the only recent poll to ask native people about the subject, 90 percent of respondents did not consider the term offensive, although many question the cultural credentials of the respondents.” The poll that you quoted is from a 2004 survey of only 768 who identified themselves as American Indian. It did not ask them if they wanted a football team named the Redskins, it asked them if they found it offensive – these are very different points. If you asked a black community if they found the word “Nig-er” offensive, they might unanimously say no, because that word has been ‘taken back’ by the black community. A counter study conducted by James Fenelon of California State University found that in reality 67% found the term offensive and racist, 12% were neutral, and 20% were in disagreement. I contend still that if you asked them if they wanted the team name changed they would unanimously say yes. I wholeheartedly support changing all team names that are racist in any way – let’s change them all! As for Canuck – that term isn’t offensive in the slightest. It doesn’t denote race in any way, and comparing to the term ‘Redskin’ isn’t fair at all. At the most, it’s a nationalistic ‘poke in the ribs’, and nothing more. Here’s a question for you then: Are you okay with taking advantage of an entire ethnic community for the sake of a sports team name? Sources"],"PremiseEndPos":[10667],"ArgumentID":"00000008","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000010","PremiseStartPos":[10682],"prevID":"00000008","Premise":["Thanks Pro. Although I remain respectful of the code talkers, asking one man, Roy Hawthorne, who is 87 years old (and was being honored by the team in question - hardly an unbiased source), is hardly a country-wide poll. From the same article you sourced: “Monday night's brief, on-field ceremony came as some Indians and civil rights leaders wage a \"Change the Mascot\" campaign that targets the term redskins as a racial epithet. Jacqueline Pata, head of the National Congress of American Indians, called the appearance \"a political play rather than a heartfelt recognition of the Code Talkers.\" Pata, a member of the Tlingit Tribe of Alaska, said she reveres the Code Talkers for the work they have done but added that people often fail to recognize that the origins of the term \"redskin\" date to a period when Indians faced efforts to annihilate their culture. \"We were outlawed during that same period the mascot was created from practicing our own religion and our own cultures,\" she said. \"That term is associated with getting rid of the Indians.\" Snyder has called the team name and mascot a \"badge of honor.\" The name dates to the team's first years in Boston in the 1930s and has survived numerous outside efforts to change it. The team has been in the Washington, D.C., area since 1937.” Ironically enough, the source you gave by the The Annenberg Public Policy Center was the exact one I just challenged in the last round. Restating my points: “…a 2004 survey of only 768 who identified themselves as American Indian. It did not ask them if they wanted a football team named the Redskins, it asked them if they found it offensive – these are very different points. If you asked a black community if they found the word “Nig-er” offensive, they might unanimously say no, because that word has been ‘taken back’ by the black community.” The logical tautology that Pro employs by saying we should focus on bigger issues is just silly. I could say that about any topic. “We shouldn’t focus on (x) because (y) is a more important problem”. Hardly a strong defence. The point is for many people it is an issue."],"PremiseEndPos":[12798],"ArgumentID":"00000009","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":145,"ConclusionEndPos":205,"nextID":"00000000","PremiseStartPos":[12813],"prevID":"00000009","Premise":["Thank you Pro. Pro backs up his last round by essentially saying “The Redskins should stay called the Redskins because they are called the Redskins”. He says, “Just think for a minute how would the people of the New England region react if the Boston Red Sox or the Boston Bruins were required to change their names?” as though the Red Sox or the Bruins (and old English word for Brown Bear) are somehow comparable to a team called the Redskins. Here is a comparison. Can you even imagine if a team was called the “Blackskins”? As I pointed out before, if William Dietz had been black, we might have had a team called just that, or worse. For a team without a single Native American, it is especially offensive. “Blackskins” is horribly racist. “Redskins” is fine? You see the double standard here. It is especially offensive to use that logic because it inherently presupposes that Native Americans somehow don’t deserve the rights and respect that African Americans do. Look up the mass genocides of Native Americans and tell me they haven’t earned some respect from the white man. This is a decade’s long scandal and it needs to stop now. It’s not American. It’s racist. Even if we found that 80% of Native Americans supported it, would we want to pursue such names? I bet if we took a poll of African Americans in 1900 they would be fine with any team name we wanted to pick, but would that have been a step forward? “…nearly a century\"s worth or more of history ends simply because the name offends a small percentage of the population.” This is also especially offensive. “If it doesn’t bother me then why should it change?” What an outrageous reason to keep a name like the Redskins. I’ve already shown that it does offend the very people it is supposed to represent. Once more: “A counter study conducted by James Fenelon of California State University found that in reality 67% found the term offensive and racist, 12% were neutral, and 20% were in disagreement. I contend still that if you asked them if they wanted the team name changed they would unanimously say yes.” So again: “Here’s a question for you then: Are you okay with taking advantage of an entire ethnic community for the sake of a sports team name?”"],"PremiseEndPos":[15039],"ArgumentID":"00000010","Conclusion":"The Washington Redskins Should be Allowed to Keep their Name","PremiseStance":["Con"]}}]}