{"MetaData":{"Context":"URL: http://www.debate.org/debates/If-rich-countries-eat-less-poor-countries-could-eat-more/1/\nCrawl date: 2016/09/29 07:11:10\nDebate Topic: If rich countries eat less, poor countries could eat more | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: \"4. Reducing food intake in rich countries (might) make their societies less happy and productive, leading to a slowing of growth and innovation.\" The above statement is false. Currently, we Americans eat too much. If we ate less, we'd be less fat, and thus happier and more productive. Furthermore, we'd spend less on food and healthcare. With less spending in those two areas, we can increase spending in other areas, such as foreign aid. Therefore, if Americans ate less, they'd be doing themselves a favor, and would have more money and productive ability with which to improve the standard of living for poor kids in Africa. The resolution is affirmed. Vote PRO.\n\nEvidence Pro: I would like to explain some things here. For one, by \"rich countries eat less,\" this means that as long as the total amount of food that America eats is lowered, the resolution can be affirmed. Obviously, there are many people in America who are obese and should eat less. \"You might be more productive, particularly if your work involves physical labor (which is rare for Americans anyway). But do you really believe that all the teenage girls that starve themselves are happier for their lower weight? More productive?\" They obviously should not eat less. However, there are many more Americans who should. \"It has been proven time and time again the foreign aid cannot alleviate poverty and hunger, though it might hold of a famine for a bit.\" However, this does mean that poor countries would be able to eat more. Whether or not this helps them later is their problem. I'm just trying to affirm the resolution. Personally, I am against foreign aid, but it would allow poor countries to eat more. \"In fact, foreign aid often hurts the recipient more than it helps, since the precious resources of a developing country are diverted from what the locals think is important, to what foreign beaurocrats[sic] think is important.\" That wouldn't be foreign aid. That would be investing. \"In addition, you make the claim that eating 'less' will reduce spending on food, but your argument only works (more happy/productive) if people are more healthy as well.\" Eating less double cheeseburgers makes one more healthy. \"In reality, being healthy has to do with a lot more than eating 'less.'\" Eating is one of the most important health factors. It's listed first. \"One might take protein supplements, food substitutes etc (expensive products) vs buying cheap (and efficient) hamburgers from McD's.\" The issue isn't that they eat hamburgers instead of healthy food. The issue is that they eat too many hamburgers. If all of the obese people in America ate less, they wouldn't be obese. They wouldn't replace the excess hamburgers with supplements. They'd throw out the hamburgers altogether. \"If he wishes to show a correlation between healthier eating and lower expenditure on food, my opponent has all his work ahead of him.\" I'm not arguing for healthier eating. I'm arguing for less eating. Eating one hamburger per day is healthier than eating two hamburgers per day. This extra hamburger is usually unnecessary to one's diet, and only piles on fat. The person could easily only eat one hamburger, paying less for hamburgers. \"As I talked about here, the social ideal for a healthy male is not a 'thin' physique, but a muscular physique, which to acquire generally requires a high calorie diet.\" Does this look muscular to you? \"There are some Americans who could stand to eat less, there are others who might benefit from eating more.\" If the ones who should eat less eat less, then poor countries would eat more, affirming the resolution. \"What they don't need is extra pressure either way that results from this ridiculous notion of American consumption being responsible for all the world's evils.\" Nobody needs pressure. However, it would help them overall. America's consumption is not responsible for world evil. However, eating less could help relieve some of these evils. In conclusion, there are some people who should spend less on fast food. This would decrease the cost of health care. This decrease would allow for more spending in foreign aid. This foreign aid could be used to by food from poor African farmers, which could then be used to feed other Africans. Everybody wins, if America just stopped being fat.\n\nEvidence Pro: \"First, my [o]pponent cited an article by '[A]nne [C]ollins' who[se] website sells a weight loss diet program.. Hardly an unbiased source. The consensus, with which my opponent agrees, says Americans are 'overweight' or 'obese.' This contention is really worth analyzing...\" Alright, so some people are categorized incorrectly. However, most Americans categorized as morbidly obese are morbidly obese. There is no denying that many Americans are too fat for their own good. \"Short term, foreign aid can slow down a famine, but it cannot eliminate persistent hunger.\" However, it would allow for poor countries to eat more, even for a short time. \"I am defining 'foreign aid' as money or other resources given by rich governments to poor governments for the purpose of economic development or disaster relief. I agree that in the second case, foreign aid makes a positive impact, but not in the first.\" That doesn't even matter, because the point is, they would eat more, even if the long-term effects are bad. \"What if all someone eats in double cheesburgers[sic]?\" They'd be dead. \"Apparently studies show that Americans should not be eating 'less' but eating 'better,' which as I've said before is generally more expensive and time consuming.\" However, there are still many Americans who should eat less. \"Is your contention that people are going to save their extra hamburger money to donate to foreign charities?\" The real point is, Americans would be healthier, so less money would be spent by government on healthcare, so the government would put some of this surplus into foreign aid, which would then allow poor countries to eat more. \"I could argue that eating less hamburgers (and fast food in general) will directly affect a significant portion of the US economy, leaving less tax revenue for the government to give as 'foreign aid.'\" I think that the health care is more expensive than any tax on fast food. \"I said the 'social ideal.' Do you know anyone who would choose that person as a mate?...\" Well, this guy would most definitely be able to be more productive if he ate less. \"Note that my Opponent does not say less on 'food', but less on 'fast food'.\" This would still have a direct impact on the cost of healthcare. \"This relies on the population being healthier, not on them eating 'less' food, which is as I have demonstrated are not the same thing.\" However, eating less is part of dieting, so obviously, eating less can lower the cost of healthcare for a good number of Americans, which would allow for more foreign aid. \"There is nothing stopping an increase in foreign aid, even without a decrease in health-care costs....\" If the government spends less on healthcare, they'd spend this surplus on other things, foreign aid among them. \"The people who are anorexic die of starvation trying to compete with all those from the second group who have lost weight.\" They should probably eat more. However, there are more obese people in America than bulimics. \"Of course, all the above paragraph is speculation, which is exactly what my Opponent has been doing throughout his argument, and why any sensible person should vote Con.\" Here's the full chain of cause-and-effect: 0. Rich countries eat less. 1. All people in America who eat too much fast food (there are many of them) eat less fast food. 2. Some people in America are healthier. 3. Government spends less on health care, because it isn't needed as much. 4. Government has extra money. 5. Government puts some of that money in foreign aid. 6. Using foreign aid, government buys food from African farmers for impoverished Africans. 7. Poor countries eat more. So, the chain of events inevitably helps Africa eat more. Therefore, due to the logical chain of events that I have put together to summarize my arguments, vote PRO.\n\nEvidence Con: This is my first debate here, so I'm not sure about the format. I was having an argument with my friend, who argued that excess consumption in rich countries causes starvation in Africa. You could read his original argument here->( My main points are/were as follows: 1. Historical evidence demonstrates the opposite; that as the world population rises (hence increasing total food consumption), PER PERSON food production has also been shown to increase. 2. Therefore, food is not a limited resource, but instead depends on changing technology, a more efficient market etc. 3. Food production would improve more through technological innovation (creating more food) than economic redistribution (sharing whats already there). 4. Reducing food intake in rich countries (might) make their societies less happy and productive, leading to a slowing of growth and innovation. 5. Therefore, the more we eat in the USA, the better we will one day be able to help feed the starving kids in Africa.\n\nEvidence Con: First, notice that I qualified my 4th point with (might). It depends on what kind of reduction, and by whom. \"currently, we Americans eat too much\" Clearly not every American can be eating too much. Some are obese, others are healthy, still others are anorexic. \"If we ate less, we'd be less fat, and thus happier and more productive.\" You might be more productive, particularly if your work involves physical labor (which is rare for Americans anyway). But do you really believe that all the teenage girls that starve themselves are happier for their lower weight? More productive? It has been proven time and time again the foreign aid cannot alleviate poverty and hunger, though it might hold of a famine for a bit. In fact, foreign aid often hurts the recipient more than it helps, since the precious resources of a developing country are diverted from what the locals think is important, to what foreign beaurocrats think is important. In addition, you make the claim that eating \"less\" will reduce spending on food, but your argument only works (more happy/productive) if people are more healthy as well. In reality, being healthy has to do with a lot more than eating \"less.\" One might take protein supplements, food substitutes etc (expensive products) vs buying cheap (and efficient) hamburgers from McD's. If he wishes to show a correlation between healthier eating and lower expenditure on food, my opponent has all his work ahead of him. As I talked about here -> the social ideal for a healthy male is not a \"thin\" physique, but a muscular physique, which to acquire generally requires a high calorie diet. If certain males were to disregard this social norm and go on diets, they would soon find their ability to attract mates greatly reduced, and thus be further saddened and unproductive. There are some Americans who could stand to eat less, there are others who might benefit from eating more. What they don't need is extra pressure either way that results from this ridiculous notion of American consumption being responsible for all the world's evils.\n\nEvidence Con: First, my Opponent cited an article by \"anne collins\" who's website sells a weight loss diet program.. Hardly an unbiased source. The consensus, with which my opponent agrees, says Americans are \"overweight\" or \"obese.\" This contention is really worth analyzing. There are news articles upon news articles with wild statistics about Obesity in America, but what are they basing these figures on? For the most part they are using the BMI, or Body Mass Index, which is an arbitrary measure depending on a person's height. According to this index, lets be clear, Lebron James is overweight. Now, I challenge anyone to call him unhappy, or unproductive. You can read the following about the flaws in this methodology: \"Personally, I am against foreign aid, but it would allow poor countries to eat more.\" Short term, foreign aid can slow down a famine, but it cannot eliminate persistent hunger. That would require an organic change in the local economy. \"That wouldn't be foreign aid. That would be investing.\" I am defining \"foreign aid\" as money or other resources given by rich governments to poor governments for the purpose of economic development or disaster relief. I agree that in the second case, foreign aid makes a positive impact, but not in the first. \"Eating less double cheeseburgers makes one more healthy.\" What if all someone eats in double cheesburgers? \"\"\" Eating is one of the most important health factors. It's listed first. \"\"\" The above site mentions the following -> \"According to government and university studies, at least 95% of all Americans have at least one nutrient deficiency in their diet. We rely heavily on convenience or manufactured foods which do not support good health. We do not eat nearly enough vegetables and fruits, and consume an extremely high amount of fat, animal products, and refined carbohydrates such as flour and sugar.\" Apparently studies show that Americans should not be eating \"less\" but eating \"better,\" which as I've said before is generally more expensive and time consuming. \"The person could easily only eat one hamburger, paying less for hamburgers.\" Is your contention that people are going to save their extra hamburger money to donate to foreign charities? I could argue that eating less hamburgers (and fast food in general) will directly affect a significant portion of the US economy, leaving less tax revenue for the government to give as \"foreign aid.\" \"Does this look muscular to you?\" I said the \"social ideal.\" Do you know anyone who would choose that person as a mate? First, he has a hormonal imbalance.. (other people probably eat the same amount and don't look that different from me or you). \"In conclusion, there are some people who should spend less on fast food.\" Note that my Opponent does not say less on \"food\", but less on \"fast food\". \"This would decrease the cost of health care.\" This relies on the population being healthier, not on them eating \"less\" food, which is as I have demonstrated are not the same thing. \"This decrease would allow for more spending in foreign aid.\" There is nothing stopping an increase in foreign aid, even without a decrease in health-care costs. Foreign aid is a completely separate issue, and will be dealt with separately by the government and the people. Most likely the people will just be happy to have the extra money in their pocket for their own entertainment. \"Everybody wins, if America just stopped being fat.\" I will assume you meant if America just \"ate less\" as that was the original contention. The people who are fat now may win. The people who are healthy, are unaffected, except they no longer are able to gloat over the misery of the first group. The people who are anorexic die of starvation trying to compete with all those from the second group who have lost weight. Of course, all the above paragraph is speculation, which is exactly what my Opponent has been doing throughout his argument, and why any sensible person should vote Con. Anyway, now that the rounds are over, anyone who would like to join this argument could do so at\n","DiscussionID":"00000058","Title":"If rich countries eat less, poor countries could eat more","CrawlDate":"2016/09/29 07:11:10","URL":"http://www.debate.org/debates/If-rich-countries-eat-less-poor-countries-could-eat-more/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":141,"ConclusionEndPos":198,"nextID":"00000002","PremiseStartPos":[250],"prevID":"00000000","Premise":["\"4. Reducing food intake in rich countries (might) make their societies less happy and productive, leading to a slowing of growth and innovation.\" The above statement is false. Currently, we Americans eat too much. If we ate less, we'd be less fat, and thus happier and more productive. Furthermore, we'd spend less on food and healthcare. With less spending in those two areas, we can increase spending in other areas, such as foreign aid. Therefore, if Americans ate less, they'd be doing themselves a favor, and would have more money and productive ability with which to improve the standard of living for poor kids in Africa. The resolution is affirmed. Vote PRO."],"PremiseEndPos":[918],"ArgumentID":"00000001","Conclusion":"If rich countries eat less, poor countries could eat more","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":141,"ConclusionEndPos":198,"nextID":"00000003","PremiseStartPos":[933],"prevID":"00000001","Premise":["I would like to explain some things here. For one, by \"rich countries eat less,\" this means that as long as the total amount of food that America eats is lowered, the resolution can be affirmed. Obviously, there are many people in America who are obese and should eat less. \"You might be more productive, particularly if your work involves physical labor (which is rare for Americans anyway). But do you really believe that all the teenage girls that starve themselves are happier for their lower weight? More productive?\" They obviously should not eat less. However, there are many more Americans who should. \"It has been proven time and time again the foreign aid cannot alleviate poverty and hunger, though it might hold of a famine for a bit.\" However, this does mean that poor countries would be able to eat more. Whether or not this helps them later is their problem. I'm just trying to affirm the resolution. Personally, I am against foreign aid, but it would allow poor countries to eat more. \"In fact, foreign aid often hurts the recipient more than it helps, since the precious resources of a developing country are diverted from what the locals think is important, to what foreign beaurocrats[sic] think is important.\" That wouldn't be foreign aid. That would be investing. \"In addition, you make the claim that eating 'less' will reduce spending on food, but your argument only works (more happy/productive) if people are more healthy as well.\" Eating less double cheeseburgers makes one more healthy. \"In reality, being healthy has to do with a lot more than eating 'less.'\" Eating is one of the most important health factors. It's listed first. \"One might take protein supplements, food substitutes etc (expensive products) vs buying cheap (and efficient) hamburgers from McD's.\" The issue isn't that they eat hamburgers instead of healthy food. The issue is that they eat too many hamburgers. If all of the obese people in America ate less, they wouldn't be obese. They wouldn't replace the excess hamburgers with supplements. They'd throw out the hamburgers altogether. \"If he wishes to show a correlation between healthier eating and lower expenditure on food, my opponent has all his work ahead of him.\" I'm not arguing for healthier eating. I'm arguing for less eating. Eating one hamburger per day is healthier than eating two hamburgers per day. This extra hamburger is usually unnecessary to one's diet, and only piles on fat. The person could easily only eat one hamburger, paying less for hamburgers. \"As I talked about here, the social ideal for a healthy male is not a 'thin' physique, but a muscular physique, which to acquire generally requires a high calorie diet.\" Does this look muscular to you? \"There are some Americans who could stand to eat less, there are others who might benefit from eating more.\" If the ones who should eat less eat less, then poor countries would eat more, affirming the resolution. \"What they don't need is extra pressure either way that results from this ridiculous notion of American consumption being responsible for all the world's evils.\" Nobody needs pressure. However, it would help them overall. America's consumption is not responsible for world evil. However, eating less could help relieve some of these evils. In conclusion, there are some people who should spend less on fast food. This would decrease the cost of health care. This decrease would allow for more spending in foreign aid. This foreign aid could be used to by food from poor African farmers, which could then be used to feed other Africans. Everybody wins, if America just stopped being fat."],"PremiseEndPos":[4560],"ArgumentID":"00000002","Conclusion":"If rich countries eat less, poor countries could eat more","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":141,"ConclusionEndPos":198,"nextID":"00000004","PremiseStartPos":[4575],"prevID":"00000002","Premise":["\"First, my [o]pponent cited an article by '[A]nne [C]ollins' who[se] website sells a weight loss diet program.. Hardly an unbiased source. The consensus, with which my opponent agrees, says Americans are 'overweight' or 'obese.' This contention is really worth analyzing...\" Alright, so some people are categorized incorrectly. However, most Americans categorized as morbidly obese are morbidly obese. There is no denying that many Americans are too fat for their own good. \"Short term, foreign aid can slow down a famine, but it cannot eliminate persistent hunger.\" However, it would allow for poor countries to eat more, even for a short time. \"I am defining 'foreign aid' as money or other resources given by rich governments to poor governments for the purpose of economic development or disaster relief. I agree that in the second case, foreign aid makes a positive impact, but not in the first.\" That doesn't even matter, because the point is, they would eat more, even if the long-term effects are bad. \"What if all someone eats in double cheesburgers[sic]?\" They'd be dead. \"Apparently studies show that Americans should not be eating 'less' but eating 'better,' which as I've said before is generally more expensive and time consuming.\" However, there are still many Americans who should eat less. \"Is your contention that people are going to save their extra hamburger money to donate to foreign charities?\" The real point is, Americans would be healthier, so less money would be spent by government on healthcare, so the government would put some of this surplus into foreign aid, which would then allow poor countries to eat more. \"I could argue that eating less hamburgers (and fast food in general) will directly affect a significant portion of the US economy, leaving less tax revenue for the government to give as 'foreign aid.'\" I think that the health care is more expensive than any tax on fast food. \"I said the 'social ideal.' Do you know anyone who would choose that person as a mate?...\" Well, this guy would most definitely be able to be more productive if he ate less. \"Note that my Opponent does not say less on 'food', but less on 'fast food'.\" This would still have a direct impact on the cost of healthcare. \"This relies on the population being healthier, not on them eating 'less' food, which is as I have demonstrated are not the same thing.\" However, eating less is part of dieting, so obviously, eating less can lower the cost of healthcare for a good number of Americans, which would allow for more foreign aid. \"There is nothing stopping an increase in foreign aid, even without a decrease in health-care costs....\" If the government spends less on healthcare, they'd spend this surplus on other things, foreign aid among them. \"The people who are anorexic die of starvation trying to compete with all those from the second group who have lost weight.\" They should probably eat more. However, there are more obese people in America than bulimics. \"Of course, all the above paragraph is speculation, which is exactly what my Opponent has been doing throughout his argument, and why any sensible person should vote Con.\" Here's the full chain of cause-and-effect: 0. Rich countries eat less. 1. All people in America who eat too much fast food (there are many of them) eat less fast food. 2. Some people in America are healthier. 3. Government spends less on health care, because it isn't needed as much. 4. Government has extra money. 5. Government puts some of that money in foreign aid. 6. Using foreign aid, government buys food from African farmers for impoverished Africans. 7. Poor countries eat more. So, the chain of events inevitably helps Africa eat more. Therefore, due to the logical chain of events that I have put together to summarize my arguments, vote PRO."],"PremiseEndPos":[8383],"ArgumentID":"00000003","Conclusion":"If rich countries eat less, poor countries could eat more","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":141,"ConclusionEndPos":198,"nextID":"00000005","PremiseStartPos":[8398],"prevID":"00000003","Premise":["This is my first debate here, so I'm not sure about the format. I was having an argument with my friend, who argued that excess consumption in rich countries causes starvation in Africa. You could read his original argument here->( My main points are/were as follows: 1. Historical evidence demonstrates the opposite; that as the world population rises (hence increasing total food consumption), PER PERSON food production has also been shown to increase. 2. Therefore, food is not a limited resource, but instead depends on changing technology, a more efficient market etc. 3. Food production would improve more through technological innovation (creating more food) than economic redistribution (sharing whats already there). 4. Reducing food intake in rich countries (might) make their societies less happy and productive, leading to a slowing of growth and innovation. 5. Therefore, the more we eat in the USA, the better we will one day be able to help feed the starving kids in Africa."],"PremiseEndPos":[9389],"ArgumentID":"00000004","Conclusion":"If rich countries eat less, poor countries could eat more","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":141,"ConclusionEndPos":198,"nextID":"00000006","PremiseStartPos":[9404],"prevID":"00000004","Premise":["First, notice that I qualified my 4th point with (might). It depends on what kind of reduction, and by whom. \"currently, we Americans eat too much\" Clearly not every American can be eating too much. Some are obese, others are healthy, still others are anorexic. \"If we ate less, we'd be less fat, and thus happier and more productive.\" You might be more productive, particularly if your work involves physical labor (which is rare for Americans anyway). But do you really believe that all the teenage girls that starve themselves are happier for their lower weight? More productive? It has been proven time and time again the foreign aid cannot alleviate poverty and hunger, though it might hold of a famine for a bit. In fact, foreign aid often hurts the recipient more than it helps, since the precious resources of a developing country are diverted from what the locals think is important, to what foreign beaurocrats think is important. In addition, you make the claim that eating \"less\" will reduce spending on food, but your argument only works (more happy/productive) if people are more healthy as well. In reality, being healthy has to do with a lot more than eating \"less.\" One might take protein supplements, food substitutes etc (expensive products) vs buying cheap (and efficient) hamburgers from McD's. If he wishes to show a correlation between healthier eating and lower expenditure on food, my opponent has all his work ahead of him. As I talked about here -> the social ideal for a healthy male is not a \"thin\" physique, but a muscular physique, which to acquire generally requires a high calorie diet. If certain males were to disregard this social norm and go on diets, they would soon find their ability to attract mates greatly reduced, and thus be further saddened and unproductive. There are some Americans who could stand to eat less, there are others who might benefit from eating more. What they don't need is extra pressure either way that results from this ridiculous notion of American consumption being responsible for all the world's evils."],"PremiseEndPos":[11476],"ArgumentID":"00000005","Conclusion":"If rich countries eat less, poor countries could eat more","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":141,"ConclusionEndPos":198,"nextID":"00000000","PremiseStartPos":[11491],"prevID":"00000005","Premise":["First, my Opponent cited an article by \"anne collins\" who's website sells a weight loss diet program.. Hardly an unbiased source. The consensus, with which my opponent agrees, says Americans are \"overweight\" or \"obese.\" This contention is really worth analyzing. There are news articles upon news articles with wild statistics about Obesity in America, but what are they basing these figures on? For the most part they are using the BMI, or Body Mass Index, which is an arbitrary measure depending on a person's height. According to this index, lets be clear, Lebron James is overweight. Now, I challenge anyone to call him unhappy, or unproductive. You can read the following about the flaws in this methodology: \"Personally, I am against foreign aid, but it would allow poor countries to eat more.\" Short term, foreign aid can slow down a famine, but it cannot eliminate persistent hunger. That would require an organic change in the local economy. \"That wouldn't be foreign aid. That would be investing.\" I am defining \"foreign aid\" as money or other resources given by rich governments to poor governments for the purpose of economic development or disaster relief. I agree that in the second case, foreign aid makes a positive impact, but not in the first. \"Eating less double cheeseburgers makes one more healthy.\" What if all someone eats in double cheesburgers? \"\"\" Eating is one of the most important health factors. It's listed first. \"\"\" The above site mentions the following -> \"According to government and university studies, at least 95% of all Americans have at least one nutrient deficiency in their diet. We rely heavily on convenience or manufactured foods which do not support good health. We do not eat nearly enough vegetables and fruits, and consume an extremely high amount of fat, animal products, and refined carbohydrates such as flour and sugar.\" Apparently studies show that Americans should not be eating \"less\" but eating \"better,\" which as I've said before is generally more expensive and time consuming. \"The person could easily only eat one hamburger, paying less for hamburgers.\" Is your contention that people are going to save their extra hamburger money to donate to foreign charities? I could argue that eating less hamburgers (and fast food in general) will directly affect a significant portion of the US economy, leaving less tax revenue for the government to give as \"foreign aid.\" \"Does this look muscular to you?\" I said the \"social ideal.\" Do you know anyone who would choose that person as a mate? First, he has a hormonal imbalance.. (other people probably eat the same amount and don't look that different from me or you). \"In conclusion, there are some people who should spend less on fast food.\" Note that my Opponent does not say less on \"food\", but less on \"fast food\". \"This would decrease the cost of health care.\" This relies on the population being healthier, not on them eating \"less\" food, which is as I have demonstrated are not the same thing. \"This decrease would allow for more spending in foreign aid.\" There is nothing stopping an increase in foreign aid, even without a decrease in health-care costs. Foreign aid is a completely separate issue, and will be dealt with separately by the government and the people. Most likely the people will just be happy to have the extra money in their pocket for their own entertainment. \"Everybody wins, if America just stopped being fat.\" I will assume you meant if America just \"ate less\" as that was the original contention. The people who are fat now may win. The people who are healthy, are unaffected, except they no longer are able to gloat over the misery of the first group. The people who are anorexic die of starvation trying to compete with all those from the second group who have lost weight. Of course, all the above paragraph is speculation, which is exactly what my Opponent has been doing throughout his argument, and why any sensible person should vote Con. Anyway, now that the rounds are over, anyone who would like to join this argument could do so at"],"PremiseEndPos":[15567],"ArgumentID":"00000006","Conclusion":"If rich countries eat less, poor countries could eat more","PremiseStance":["Con"]}}]}