{"MetaData":{"Context":"URL: http://www.debate.org/debates/Convince-me-that-God-is-pr-isnt-real./1/\nCrawl date: 2016/09/29 07:22:05\nDebate: Convince me that God is pr isn't real. | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: Okay so this will be a different kind of debate. Con will try to ether convince me that God is or isn't real and if I see a flaw in the argument I point it out but if I see no logical flaws in con's whole argument or if he\\she convinces me then he\\she wins. And yes I am a Christian bit I promise I will not be bias because I am currently lacking faith and if you really think that I'm bias then give con the win.\n\nEvidence Pro: There are multiple flaws here but I'm gonna correct them later I want to see where this is going.\n\nEvidence Pro: So why is this connected?\n\nEvidence Pro: Okay so asides from your grammar and the fact that most of your points aren't connected I see two major flaws here 1. You assume that there are only nature and machines in this world but God is what you call supernatural thus is nit created and he did some supernatural things such as turn water into wine and resurrect people. 2. Nature is by definition a machine cause as defined by the Merriam Webster dictionary\"Machines are a constructed thing whether material or immaterial and God made\\constructed the world and nature.\n\nEvidence Con: god is false, imaginary, not matter, not real, because anything that is created or constructed is a machine, so nature is not created, nature is random, Chaos, not order, not intended anything that exist has an opposite for it to exist, nature is the opposite of machine, anything that physically exist is either natural or mechancial, and nature is false by default imagination is false, facts are truth and truth can only be in the past, facts are in the past, past dosnt matter, now is matter, i know my experience of now\n\nEvidence Con: the argument is simple, anything that is created or constructed is a machine, nature is not a machine\n\nEvidence Con: is nature a machine?\n\nEvidence Con: anything that physically exist is either natural or mechanical, if superman was real he would be natural, just like god supernature is an extension of nature, and comes after naure, like machine anything that comes first is nature\n","DiscussionID":"00000056","Title":"Convince me that God is pr isn't real.","CrawlDate":"2016/09/29 07:22:05","URL":"http://www.debate.org/debates/Convince-me-that-God-is-pr-isnt-real./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":154,"nextID":"00000002","PremiseStartPos":[206],"prevID":"00000000","Premise":["Okay so this will be a different kind of debate. Con will try to ether convince me that God is or isn't real and if I see a flaw in the argument I point it out but if I see no logical flaws in con's whole argument or if he\\she convinces me then he\\she wins. And yes I am a Christian bit I promise I will not be bias because I am currently lacking faith and if you really think that I'm bias then give con the win."],"PremiseEndPos":[620],"ArgumentID":"00000001","Conclusion":"Convince me that God is pr isn't real.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":154,"nextID":"00000003","PremiseStartPos":[635],"prevID":"00000001","Premise":["There are multiple flaws here but I'm gonna correct them later I want to see where this is going."],"PremiseEndPos":[733],"ArgumentID":"00000002","Conclusion":"Convince me that God is pr isn't real.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":154,"nextID":"00000004","PremiseStartPos":[748],"prevID":"00000002","Premise":["So why is this connected?"],"PremiseEndPos":[774],"ArgumentID":"00000003","Conclusion":"Convince me that God is pr isn't real.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":154,"nextID":"00000005","PremiseStartPos":[789],"prevID":"00000003","Premise":["Okay so asides from your grammar and the fact that most of your points aren't connected I see two major flaws here 1. You assume that there are only nature and machines in this world but God is what you call supernatural thus is nit created and he did some supernatural things such as turn water into wine and resurrect people. 2. Nature is by definition a machine cause as defined by the Merriam Webster dictionary\"Machines are a constructed thing whether material or immaterial and God made\\constructed the world and nature."],"PremiseEndPos":[1316],"ArgumentID":"00000004","Conclusion":"Convince me that God is pr isn't real.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":154,"nextID":"00000006","PremiseStartPos":[1331],"prevID":"00000004","Premise":["god is false, imaginary, not matter, not real, because anything that is created or constructed is a machine, so nature is not created, nature is random, Chaos, not order, not intended anything that exist has an opposite for it to exist, nature is the opposite of machine, anything that physically exist is either natural or mechancial, and nature is false by default imagination is false, facts are truth and truth can only be in the past, facts are in the past, past dosnt matter, now is matter, i know my experience of now"],"PremiseEndPos":[1856],"ArgumentID":"00000005","Conclusion":"Convince me that God is pr isn't real.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":154,"nextID":"00000007","PremiseStartPos":[1871],"prevID":"00000005","Premise":["the argument is simple, anything that is created or constructed is a machine, nature is not a machine"],"PremiseEndPos":[1973],"ArgumentID":"00000006","Conclusion":"Convince me that God is pr isn't real.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":154,"nextID":"00000008","PremiseStartPos":[1988],"prevID":"00000006","Premise":["is nature a machine?"],"PremiseEndPos":[2009],"ArgumentID":"00000007","Conclusion":"Convince me that God is pr isn't real.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":154,"nextID":"00000000","PremiseStartPos":[2024],"prevID":"00000007","Premise":["anything that physically exist is either natural or mechanical, if superman was real he would be natural, just like god supernature is an extension of nature, and comes after naure, like machine anything that comes first is nature"],"PremiseEndPos":[2255],"ArgumentID":"00000008","Conclusion":"Convince me that God is pr isn't real.","PremiseStance":["Con"]}}]}