{"MetaData":{"Context":"URL: http://www.debate.org/debates/Andrew-Jackson-should-be-removed-from-the-20-bill./1/\nCrawl date: 2016/09/29 05:26:45\nDebate Issue: Andrew Jackson should be removed from the $20 bill. | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: Andrew Jackson hated central banks. He deliberately acted to destroy the Bank of the United States, the central bank at the time. He believed in the value of specie-- gold or silver money, as opposed to the fiat money represented by the twenty dollar Federal Reserve Note. Fiat money represents the force of a tyrant, not an exchange of values between honest men. All putting Andrew Jackson's face on a fiat note distributed by the Federal Reserve Bank accomplishes is cheapening the value of his legacy, and showing off the government's peculiar mix of ignorance or lack of integrity, however that mix may be composed. Eliminate the 20 dollar bill (and therefore Jackson's face from it), move to a new, commodity-backed currency, then have Jackson's face on that if you want, anything else is dishonest. If you seek to keep fiat money, find someone else to idolize on it, perhaps a picture of FDR confiscating the gold of every citizen who kept it.\n\nEvidence Pro: \"But this makes no sense however for you did say that, \"Fiat money represents the force of a tyrant, not an exchange of values between good common men\" since this statement has no source cited to it, it must be an opinion.\" And? What of it? Are you going to dispute that paper which has no value except that derived from the fact that you have to pay taxes in it or go to prison represents the force of a tyrant? And I used the wording \"honest men,\" not \"good common men.\" :). \"t he is also saying that Andrew Jackson's pecuniary ideology was ethical and echoed \"an exchange of values between honest men\" which helps my side in saying that Andrew Jackson was the people's president.\" Well, not quite. It would help your case, if the $20 bill were as ethical, which is not the case. Being \"the people's president\" is largely irrelevant to this of course, as that would be mere ad populum. \"But to entertain my opponent's ridiculous claim, the cost of making a printing machine plus the initial cost of the raw material that would be used in the machine would make no sense.\" A currency can be backed by commodity without being made of it.It's merely a matter of redesigning the paper to distinguish it from the old notes, and keeping enough commodity on hand to exchange for the notes on demand. \"Not only would this cost an obscene amount, but in this economy we cannot afford things as frivolous as this. \" \"This economy\" was caused in significant part by the fiat system and the deficit spending, etc, that comes with it. There is nothing frivolous about preventing recessions like the current one from happening. \"Our currency is fine the way it is\" It is fine to point a gun at someone and tell them they had better pretend a piece of paper has a value it doesn't, and then hand it over after accepting it on such false premises? \"and changing it now would not be logical in our current recession.\" Generally, when one has a problem, I was under the impression the logical response was to stop doing the sorts of things that help that problem to happen. Having a fiat currency is one of them. Note, too, the resolution does not specify time-- if you prefer to do it a few years from now instead, my point remains intact. \"It's better to keep things the way they are and not dishonor any presidents by taking them off currency.\" We are dishonoring him by keeping him on. Putting Andrew Jackson on a Federal Reserve Note to \"honor him\" is roughly comparable to worshipping Jesus by frequenting a prostitute at a Greek temple, or wearing KKK robes with Martin Luther King's initials inscribed over the heart. \" Another point made by my opponent was that Andrew Jackson hated centralized banks, and that he went so far as to DESTROY the Bank of the United States. And I could not agree more with this statement. This bank of the United States was at the time favoring the Northern States over the southern states in the distribution of taxpayer dollars. This was making the south angrier and angrier and then when Congress passed extra Tariffs on imported goods, John C. Calhoun, from North Carolina, wrote a doctrine of Nullification and threatened to secede from the Union! Faced with an extremely hard choice, Andrew Jackson had to get rid of the national bank to preserve the Union of the united states.\" This is absurd revisionism. Andrew Jackson did not cite any \"regional favoritism,\" he cited publicly his concerns of the cost of a monopoly with no corresponding benefits. Tariffs were a largely unrelated issue. \" On a side note to the previous point... The National Bank did not reflect American ideals. It was a government owned corporation and in this sense, The National Bank was a communist business.\" As a matter of fact, Jackson's veto message cited the nature of the bank in question as being owned in large part by the wealthy, including many foreign owners. It was, in short, \"privately owned,\" but created by an act of Congress and controlled accordingly-- more or less the same as our current Federal Reserve. If you wish to denounce the National Bank as communist, you will have to denounce the Federal Reserve on the same grounds, since it had similar ownership structure. \"My final word on this particular point is that Jackson actually did not \"destroy\" the national bank. He simply did not renew the bank's charter so the bank slowly, but surely, closed down, without any harm to the economy, or the employees of the national bank.\" This is also unwarranted revisionism. Jackson arranged, through his Treasury secretary, to remove the deposits of the government from the bank. The suddenness probably did cause short term economic harm, though I would hold such as justified by the gains. He did not merely wait on his heels and refuse to renew the charter, he took proactive action to, in his wording, \"kill\" the bank as quick as he thought he could. \"In the word's of Bert Lance \"If it ain't broke, don't fix it\". Why should we fix the $20 bill, if it \"ain't\" broke.\" It is broke, because the dollar currency itself is broke, indeed, it was created that way. It is losing it's position in the market, even among other tyrant currencies, and will be losing out even more as our deficit continues to grow.\n\nEvidence Pro: \"That point was \"Andrew Jackson did not approve of fiat money\", to quote my opponent, \"this is unwarranted revisionism\". Andrew Jackson may have favored commodity backed currency during his presidency, but that is only because he feared for the country's economic welfare. He thought, by passing the Specie Circular in 1836 he would prevent a future economic downturn when people started buying large amounts of land in the west with \"soft money\".\" This would be a valid argument if you could show where in his speeches or writings there is a \"fiat is okay in the future, just not right now\" statement. You can't, because there is no such place. \"He did not express any ill feelings towards \"fiat money\"\" Check his farewell address. Or, translated out of politicese, he's attributed by Remini's Andrew Jackson and the Bank War as having called paper (fiat) \"The instrument of the swindler and the cheat.\" \"and popular belief between many historians, Michael Baradat to name one, is that he would not mind his face being on American currency.\" \"Popular belief\" with no verifiable referents is useless, even if it's professionals choosing to believe it without evidence. \"He would be honored for his face to be portrayed on the most used bill in America and no amount of past ideals can change that. \" No amount of the bill being against what he stood for can change whether he would feel honored about it? By that reasoning, John Locke should be quite honored to have his face on a Cuban ration. \" My opponent's next point was much like his whole speech. It lacked evidence. Just because the teenager fighting for the proposition believes that \"The $20 bill is unethical\". This has no relevance for what we are talking about!\" It does indeed have relevance. If the removal of a face from a bill is a necessary condition of the removal of a bill (which it is), and the removal of a bill is good, it follows that the removal of a face from a bill is good. \" The next 4 points my opponent brought to the table were all largely irrelevant because they related not to Andrew Jackson but the $20 dollar bill it's self.\" Excuse me, but the \"$20 bill\" itself is part of the resolution as written. This means information about the 20 dollar bill is relevant. It does not ask \"Should Andrew Jackson's face appear on whatever currency there should be?\" but \"should it appear on the 20 dollar bill?\" \"And since you have obviously failed to bring up a good argument for taking Andrew Jackson off the $20 bill that I have not brought substantial historical evidence to refute\" Namedropping a random historian to whom I can find no references other than a facebook page, who cites no evidence, is not \"substantial historical evidence.\" The ultimate authority on Andrew Jackson's opinion is Andrew Jackson, and his statements support my interpretation, not yours. \" No president, no matter his monetary belief would object to being honored on a piece of American currency.\" My opponent has never even been 1 president, let alone all presidents. Therefore he has no possible knwledge of what \"no president\" would object to, unless he can find a statement from each and every one of them detailing their lack of objection. \"In fact, the original case of Andrew Jackson being put on the $20 bill is proof showing that it was not offensive.\" Performing an act proves it is not offensive? This renders the concept \"offense\" without any possible referent in reality, in any situation. By your reasoning here, nothing on earth is offensive to anyone in any way. \"For why would we purposely dishonor a true American Hero?\" First, this is a misleading question. Dishonoring someone does not have to be purposive. It can result from stupidity as well as malice, something the sort of people making these decisions have never lacked for. Second, any reasonable person seeking to establish a policy will note that in most cases dishonoring in one way or another one's most important opponents is often helpful. Third, there is no \"We.\" No unanimous action is being proposed. There is you, there is I, there are the bureaucrats, and there are a number of other parties, all with separate interests in this matter. \"I am positive that when he was put on there was the object of controversy that he should not because of \"...\" reason. But obviously it was not a good enough reason to keep him from being accepted as the next candidate for the $20 bill.\" Again, appealing to the fact as justification for the prescription. This is not valid. Otherwise I could claim, by the same reasoning, that because Hitler was given power, obviously preventing genocide wasn't a good enough reason to prevent his attaining of power. \"o taking Jackson off the $20 would in fact be dishonoring him because of this. But it wouldn't only dishonor Jackson, but America as a whole. For what is a country that takes someone off a piece of currency for objecting to something.\" For objecting to the currency? I dunno, a country with half a brain and a smidgen of integrity, for once? I object to the gallows, which is why you should not leave me on them, unless you wish to dishonor me. :). \"But we're Americans! And we honor our presidents, so vote con, and respect not only Andrew Jackson, but AMERICA!\" \"Respect\" does not consist of saying \"Yes, continue doing wrong, your majesty, we love you for it.\" Respect consists of making recommendations that make sense. If you wish to respect either Jackson or the currency, let alone both, separate the two, they don't mix well. If you wish to respect America, give it a currency suitable for a free country. It is only if you disrespect all three that you can continue encouraging such a symbolic contradiction. \" My opponent's next point was that Andrew Jackson didn't cite any regional favoritism while distributing taxpayer money. Did you even RESEARCH how money was distributed back then!?!?!??! Distributing taxpayer money was the job of congress, not the executive branch\" You are twisting my words to mean something completely different than they do. This is not unique among your arguments here, merely a particularly egregious example. My point was that he didn't cite any regional favoritism IN the bank's actions (Obviously Congress delegated some distribution of money to the bank, or it wouldn't be a BANK), as the reason for his objections. He cited it's favor of those who become rich by government favor, and it's lack of redeeming qualities. Region was not mentioned. \"Andrew Jackson had to close down the bank because it was the only thing that he COULD do to make sure each state was equally represented.\" Equal representation of the states WAS NOT MENTIONED as a reason when he closed down the bank. Pay attention to the reasons he actually gave, not the ones you imagine for him. \" My opponent's next point was as drastically un-cited as the last point,\" You have yet to make a single citation of a specific work, the closest thing to it was a citation of a random historian, without even providing the historian's probably nonexistent reasoning. \"Jackson did not \"Remove\" the deposits in the bank at all.\" \"ackson then used his second presidential election victory later that year as a mandate to order the withdrawal of all federal funds from the bank in 1833\" Sure seems like he did. Last I checked, he even rewarded Taney with a Supreme Court seat for carrying out his orders. \" And finally, my opponent's last point had to do with the economic stature of the $20 dollar bill, which, yet again, has nothing to do with why Andrew Jackson should be removed from it.\" I wouldn't want my face on a symbol soon to be tarnished. Would you?\n\nEvidence Con: Hello. My name is Keenan Harris. It's a pleasure to be e-debating here today and my opinion here is that Andrew Jackson should not be removed from the $20 bill assuming of course that the proposition is that he should indeed be removed from the $20 bill, and now without further introduction I would like to start on my construct. Andrew Jackson, the mere mention of the name brings images of our victory of the War of 1812 at the battle of New Orleans. It brings visions of the great peninsula of Florida and Oxcarts moving west to settle in new lands, where no man had gone before. But most of all, the name brings to mind the idea of a Democracy, where all men, no matter how rich, or how poor, are equal. The first point I will make in my debate, is that Andrew Jackson was a pioneer. I say this in the sense that he was the first to do many things. For example, as a boy Andrew Jackson was literally dirt poor. At the age of 13 he had already lost most of his family, either to disease or the gun of a redcoat, and as the budding young patriot he was he enlisted in the Colonial Army to fight the British in the Revolutionary War. From that point forth he painstakingly worked his way up in ranks until one day he retained the honorable title of General. He was then able to buy a Mansion in Nashville, TN where he supported his wife and children. As you can see, he worked his way up from the Slums to his eventual title of President of the United States. He was also the first President to be elected by the common man, because before he was elected, only rich aristocrats were allowed to vote, and our country ran on a very corrupt system of bribes. But all that changed during Andrew Jackson's presidency, and the Jacksonian Democracy was built. This new kind of government we still use today, and without it, President's like Ulysses S. Grant , John F. Kennedy, or even our current president may not have been elected. This \"special\" kind of democracy involves full representation of all people in the United States poor or wealthy, and during his Administration he did all he could to represent everyone equally. By any means, be it having extra political meetings with not only his cabinet. But others to make sure that everyone was getting a fair voice in government. Andrew Jackson would sometimes tour the country, giving speeches everywhere so that whenever his administration did something, the people knew about it. It was a veritable utopia compared to even our current system, and it would be blasphemy to take him off the most used currency in America. Vote Con, and keep a true American hero, on true American currency.\n\nEvidence Con: Hello, and again, It is I, Keenan Harris. Before I start, I would first like to thank my opponent for accepting my challenge and posting his first construct so punctually. You have my gratitude. I would like to start my argument by simply stating. We have no more commonly used commodity based currency. Even our current coinage is still, what my opponent would call, fiat money. So, like my opponent said, we would have to create a totally new, \"commodity-backed\" currency as opposed to the fiat currency we have today. But this makes no sense however for you did say that, \"Fiat money represents the force of a tyrant, not an exchange of values between good common men\" since this statement has no source cited to it, it must be an opinion. So not only is my opponent calling our current system of money tyrannical, but he is also saying that Andrew Jackson's pecuniary ideology was ethical and echoed \"an exchange of values between honest men\" which helps my side in saying that Andrew Jackson was the people's president. But to entertain my opponent's ridiculous claim, the cost of making a printing machine plus the initial cost of the raw material that would be used in the machine would make no sense. Not only would this cost an obscene amount, but in this economy we cannot afford things as frivolous as this. Our currency is fine the way it is and changing it now would not be logical in our current recession. We would have to hire new artists to make a new design, hire economists to find a commodity that is not only easy to acquire, but that has a high material value, after all this the cost of changing even the face on the $20 bill would be just insane! It's better to keep things the way they are and not dishonor any presidents by taking them off currency. Another point made by my opponent was that Andrew Jackson hated centralized banks, and that he went so far as to DESTROY the Bank of the United States. And I could not agree more with this statement. This bank of the United States was at the time favoring the Northern States over the southern states in the distribution of taxpayer dollars. This was making the south angrier and angrier and then when Congress passed extra Tariffs on imported goods, John C. Calhoun, from North Carolina, wrote a doctrine of Nullification and threatened to secede from the Union! Faced with an extremely hard choice, Andrew Jackson had to get rid of the national bank to preserve the Union of the united states. So not only was Jackson able to deal with a corrupt bank, but he faced the obstacle of preserving the Union even before Lincoln! After all this evidence is put forth it is obvious that getting rid of the national bank was the right thing to do. It was either get rid of a corrupt bank, or loose the foremost agrarian state at the time, and who knows how many would have followed after that. So, as you can see, Jackson really had no choice but to get rid of the National Bank. On a side note to the previous point... The National Bank did not reflect American ideals. It was a government owned corporation and in this sense, The National Bank was a communist business. Americans rely on the economic ideology of capitalism over anything else and the National bank was getting in the way of progress. Jackson seeing this, had another reason for getting rid of it because he knew that in our future America needs to be more capitalist, and getting rid of the national bank was a stepping stone in our history as one of the best things that has ever happened to capitalism. My final word on this particular point is that Jackson actually did not \"destroy\" the national bank. He simply did not renew the bank's charter so the bank slowly, but surely, closed down, without any harm to the economy, or the employees of the national bank. So do we want to dishonor the most loved president in American history by stripping him from America's most used currency? Or do we want to leave things the way they are. In the word's of Bert Lance \"If it ain't broke, don't fix it\". Why should we fix the $20 bill, if it \"ain't\" broke.\n\nEvidence Con: Before I start my construct, I would like to point out that my opponent has brought up only one real point for why Andrew Jackson should not be on the $20 bill. That point was \"Andrew Jackson did not approve of fiat money\", to quote my opponent, \"this is unwarranted revisionism\". Andrew Jackson may have favored commodity backed currency during his presidency, but that is only because he feared for the country's economic welfare. He thought, by passing the Specie Circular in 1836 he would prevent a future economic downturn when people started buying large amounts of land in the west with \"soft money\". The only reason that he favored this commodity based currency is that he believed it would be the best thing for keeping our economy in a sound state. He did not express any ill feelings towards \"fiat money\" and popular belief between many historians, Michael Baradat to name one, is that he would not mind his face being on American currency. He would be honored for his face to be portrayed on the most used bill in America and no amount of past ideals can change that. My opponent's next point was much like his whole speech. It lacked evidence. Just because the teenager fighting for the proposition believes that \"The $20 bill is unethical\". This has no relevance for what we are talking about! The question brought before the house is \"Should Andrew Jackson be removed from the $20 bill?\" not, \"Is the 20 ethical\" or \"Should we switch to a tyrannical form of currency?\" it seems my opponent has only been touching on the last two other than the first of which I have stuck to my entire speech, save some minor lapses where I was forced to entertain a ridiculous claim brought up by the pro side. So any point not relating to Andrew Jackson's worthiness to be portrayed on the $20 dollar bill must be thrown out. The next 4 points my opponent brought to the table were all largely irrelevant because they related not to Andrew Jackson but the $20 dollar bill it's self. I will say it again. This debate isn't about changing the $20 dollar bill, it's about changing the face on it. And since you have obviously failed to bring up a good argument for taking Andrew Jackson off the $20 bill that I have not brought substantial historical evidence to refute, we must assume that the opposition has won in saying that Andrew Jackson must retain his rightful seat on the $20 dollar bill. My opponent's next point was that Andrew Jackson portrayed on a piece of American currency is equivalent to a picture of Martin Luther King in KKK robes. If anything is absurd, this point is! No president, no matter his monetary belief would object to being honored on a piece of American currency. In fact, the original case of Andrew Jackson being put on the $20 bill is proof showing that it was not offensive. For why would we purposely dishonor a true American Hero? I am positive that when he was put on there was the object of controversy that he should not because of \"...\" reason. But obviously it was not a good enough reason to keep him from being accepted as the next candidate for the $20 bill. So taking Jackson off the $20 would in fact be dishonoring him because of this. But it wouldn't only dishonor Jackson, but America as a whole. For what is a country that takes someone off a piece of currency for objecting to something. But we're Americans! And we honor our presidents, so vote con, and respect not only Andrew Jackson, but AMERICA! My opponent's next point was that Andrew Jackson didn't cite any regional favoritism while distributing taxpayer money. Did you even RESEARCH how money was distributed back then!?!?!??! Distributing taxpayer money was the job of congress, not the executive branch. Andrew Jackson had to close down the bank because it was the only thing that he COULD do to make sure each state was equally represented. So next time, look up a point before you so randomly throw it out there. We try to have historical evidence in debates... My opponent's next point was as drastically un-cited as the last point, and the little historical evidence brought up was wrong. Jackson did not \"Remove\" the deposits in the bank at all. He merely let the charter run itself out. My opponent's next point was that the suddenness, which didn't happen, caused economic harm. The little economic harm that came about during his presidency was caused by malfunctioning railroads and canals that were slowing down trade, none at all was caused by the government, so that point should be thrown out. My opponent's last point requires little refuting at all, the first point was Andrew Jackson didn't just sit on his heels and refuse to renew the charter, you're right he actively told congress that he would veto renewing the charter so, correct. My opponent's point after that was Jackson said he would \"kill\" the bank. Presidents use exaggerated wording all the time to stir up their audiences the mere fact he said \"kill\" only proves that he was a stirring speaker. And finally, my opponent's last point had to do with the economic stature of the $20 dollar bill, which, yet again, has nothing to do with why Andrew Jackson should be removed from it. So over all 6/9 points my opponent made in his last speech were irrelevant. Such an unregulated amount of relevance shows a lack of preparation and sound points. So vote for the Con side, and keep an American hero on the most used bill in circulation. Don't vote pro and dishonor our very basic American ideals.\n","DiscussionID":"00000102","Title":"Andrew Jackson should be removed from the $20 bill.","CrawlDate":"2016/09/29 05:26:45","URL":"http://www.debate.org/debates/Andrew-Jackson-should-be-removed-from-the-20-bill./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":186,"nextID":"00000002","PremiseStartPos":[238],"prevID":"00000000","Premise":["Andrew Jackson hated central banks. He deliberately acted to destroy the Bank of the United States, the central bank at the time. He believed in the value of specie-- gold or silver money, as opposed to the fiat money represented by the twenty dollar Federal Reserve Note. Fiat money represents the force of a tyrant, not an exchange of values between honest men. All putting Andrew Jackson's face on a fiat note distributed by the Federal Reserve Bank accomplishes is cheapening the value of his legacy, and showing off the government's peculiar mix of ignorance or lack of integrity, however that mix may be composed. Eliminate the 20 dollar bill (and therefore Jackson's face from it), move to a new, commodity-backed currency, then have Jackson's face on that if you want, anything else is dishonest. If you seek to keep fiat money, find someone else to idolize on it, perhaps a picture of FDR confiscating the gold of every citizen who kept it."],"PremiseEndPos":[1188],"ArgumentID":"00000001","Conclusion":"Andrew Jackson should be removed from the $20 bill.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":186,"nextID":"00000003","PremiseStartPos":[1203],"prevID":"00000001","Premise":["\"But this makes no sense however for you did say that, \"Fiat money represents the force of a tyrant, not an exchange of values between good common men\" since this statement has no source cited to it, it must be an opinion.\" And? What of it? Are you going to dispute that paper which has no value except that derived from the fact that you have to pay taxes in it or go to prison represents the force of a tyrant? And I used the wording \"honest men,\" not \"good common men.\" :). \"t he is also saying that Andrew Jackson's pecuniary ideology was ethical and echoed \"an exchange of values between honest men\" which helps my side in saying that Andrew Jackson was the people's president.\" Well, not quite. It would help your case, if the $20 bill were as ethical, which is not the case. Being \"the people's president\" is largely irrelevant to this of course, as that would be mere ad populum. \"But to entertain my opponent's ridiculous claim, the cost of making a printing machine plus the initial cost of the raw material that would be used in the machine would make no sense.\" A currency can be backed by commodity without being made of it.It's merely a matter of redesigning the paper to distinguish it from the old notes, and keeping enough commodity on hand to exchange for the notes on demand. \"Not only would this cost an obscene amount, but in this economy we cannot afford things as frivolous as this. \" \"This economy\" was caused in significant part by the fiat system and the deficit spending, etc, that comes with it. There is nothing frivolous about preventing recessions like the current one from happening. \"Our currency is fine the way it is\" It is fine to point a gun at someone and tell them they had better pretend a piece of paper has a value it doesn't, and then hand it over after accepting it on such false premises? \"and changing it now would not be logical in our current recession.\" Generally, when one has a problem, I was under the impression the logical response was to stop doing the sorts of things that help that problem to happen. Having a fiat currency is one of them. Note, too, the resolution does not specify time-- if you prefer to do it a few years from now instead, my point remains intact. \"It's better to keep things the way they are and not dishonor any presidents by taking them off currency.\" We are dishonoring him by keeping him on. Putting Andrew Jackson on a Federal Reserve Note to \"honor him\" is roughly comparable to worshipping Jesus by frequenting a prostitute at a Greek temple, or wearing KKK robes with Martin Luther King's initials inscribed over the heart. \" Another point made by my opponent was that Andrew Jackson hated centralized banks, and that he went so far as to DESTROY the Bank of the United States. And I could not agree more with this statement. This bank of the United States was at the time favoring the Northern States over the southern states in the distribution of taxpayer dollars. This was making the south angrier and angrier and then when Congress passed extra Tariffs on imported goods, John C. Calhoun, from North Carolina, wrote a doctrine of Nullification and threatened to secede from the Union! Faced with an extremely hard choice, Andrew Jackson had to get rid of the national bank to preserve the Union of the united states.\" This is absurd revisionism. Andrew Jackson did not cite any \"regional favoritism,\" he cited publicly his concerns of the cost of a monopoly with no corresponding benefits. Tariffs were a largely unrelated issue. \" On a side note to the previous point... The National Bank did not reflect American ideals. It was a government owned corporation and in this sense, The National Bank was a communist business.\" As a matter of fact, Jackson's veto message cited the nature of the bank in question as being owned in large part by the wealthy, including many foreign owners. It was, in short, \"privately owned,\" but created by an act of Congress and controlled accordingly-- more or less the same as our current Federal Reserve. If you wish to denounce the National Bank as communist, you will have to denounce the Federal Reserve on the same grounds, since it had similar ownership structure. \"My final word on this particular point is that Jackson actually did not \"destroy\" the national bank. He simply did not renew the bank's charter so the bank slowly, but surely, closed down, without any harm to the economy, or the employees of the national bank.\" This is also unwarranted revisionism. Jackson arranged, through his Treasury secretary, to remove the deposits of the government from the bank. The suddenness probably did cause short term economic harm, though I would hold such as justified by the gains. He did not merely wait on his heels and refuse to renew the charter, he took proactive action to, in his wording, \"kill\" the bank as quick as he thought he could. \"In the word's of Bert Lance \"If it ain't broke, don't fix it\". Why should we fix the $20 bill, if it \"ain't\" broke.\" It is broke, because the dollar currency itself is broke, indeed, it was created that way. It is losing it's position in the market, even among other tyrant currencies, and will be losing out even more as our deficit continues to grow."],"PremiseEndPos":[6435],"ArgumentID":"00000002","Conclusion":"Andrew Jackson should be removed from the $20 bill.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":186,"nextID":"00000004","PremiseStartPos":[6450],"prevID":"00000002","Premise":["\"That point was \"Andrew Jackson did not approve of fiat money\", to quote my opponent, \"this is unwarranted revisionism\". Andrew Jackson may have favored commodity backed currency during his presidency, but that is only because he feared for the country's economic welfare. He thought, by passing the Specie Circular in 1836 he would prevent a future economic downturn when people started buying large amounts of land in the west with \"soft money\".\" This would be a valid argument if you could show where in his speeches or writings there is a \"fiat is okay in the future, just not right now\" statement. You can't, because there is no such place. \"He did not express any ill feelings towards \"fiat money\"\" Check his farewell address. Or, translated out of politicese, he's attributed by Remini's Andrew Jackson and the Bank War as having called paper (fiat) \"The instrument of the swindler and the cheat.\" \"and popular belief between many historians, Michael Baradat to name one, is that he would not mind his face being on American currency.\" \"Popular belief\" with no verifiable referents is useless, even if it's professionals choosing to believe it without evidence. \"He would be honored for his face to be portrayed on the most used bill in America and no amount of past ideals can change that. \" No amount of the bill being against what he stood for can change whether he would feel honored about it? By that reasoning, John Locke should be quite honored to have his face on a Cuban ration. \" My opponent's next point was much like his whole speech. It lacked evidence. Just because the teenager fighting for the proposition believes that \"The $20 bill is unethical\". This has no relevance for what we are talking about!\" It does indeed have relevance. If the removal of a face from a bill is a necessary condition of the removal of a bill (which it is), and the removal of a bill is good, it follows that the removal of a face from a bill is good. \" The next 4 points my opponent brought to the table were all largely irrelevant because they related not to Andrew Jackson but the $20 dollar bill it's self.\" Excuse me, but the \"$20 bill\" itself is part of the resolution as written. This means information about the 20 dollar bill is relevant. It does not ask \"Should Andrew Jackson's face appear on whatever currency there should be?\" but \"should it appear on the 20 dollar bill?\" \"And since you have obviously failed to bring up a good argument for taking Andrew Jackson off the $20 bill that I have not brought substantial historical evidence to refute\" Namedropping a random historian to whom I can find no references other than a facebook page, who cites no evidence, is not \"substantial historical evidence.\" The ultimate authority on Andrew Jackson's opinion is Andrew Jackson, and his statements support my interpretation, not yours. \" No president, no matter his monetary belief would object to being honored on a piece of American currency.\" My opponent has never even been 1 president, let alone all presidents. Therefore he has no possible knwledge of what \"no president\" would object to, unless he can find a statement from each and every one of them detailing their lack of objection. \"In fact, the original case of Andrew Jackson being put on the $20 bill is proof showing that it was not offensive.\" Performing an act proves it is not offensive? This renders the concept \"offense\" without any possible referent in reality, in any situation. By your reasoning here, nothing on earth is offensive to anyone in any way. \"For why would we purposely dishonor a true American Hero?\" First, this is a misleading question. Dishonoring someone does not have to be purposive. It can result from stupidity as well as malice, something the sort of people making these decisions have never lacked for. Second, any reasonable person seeking to establish a policy will note that in most cases dishonoring in one way or another one's most important opponents is often helpful. Third, there is no \"We.\" No unanimous action is being proposed. There is you, there is I, there are the bureaucrats, and there are a number of other parties, all with separate interests in this matter. \"I am positive that when he was put on there was the object of controversy that he should not because of \"...\" reason. But obviously it was not a good enough reason to keep him from being accepted as the next candidate for the $20 bill.\" Again, appealing to the fact as justification for the prescription. This is not valid. Otherwise I could claim, by the same reasoning, that because Hitler was given power, obviously preventing genocide wasn't a good enough reason to prevent his attaining of power. \"o taking Jackson off the $20 would in fact be dishonoring him because of this. But it wouldn't only dishonor Jackson, but America as a whole. For what is a country that takes someone off a piece of currency for objecting to something.\" For objecting to the currency? I dunno, a country with half a brain and a smidgen of integrity, for once? I object to the gallows, which is why you should not leave me on them, unless you wish to dishonor me. :). \"But we're Americans! And we honor our presidents, so vote con, and respect not only Andrew Jackson, but AMERICA!\" \"Respect\" does not consist of saying \"Yes, continue doing wrong, your majesty, we love you for it.\" Respect consists of making recommendations that make sense. If you wish to respect either Jackson or the currency, let alone both, separate the two, they don't mix well. If you wish to respect America, give it a currency suitable for a free country. It is only if you disrespect all three that you can continue encouraging such a symbolic contradiction. \" My opponent's next point was that Andrew Jackson didn't cite any regional favoritism while distributing taxpayer money. Did you even RESEARCH how money was distributed back then!?!?!??! Distributing taxpayer money was the job of congress, not the executive branch\" You are twisting my words to mean something completely different than they do. This is not unique among your arguments here, merely a particularly egregious example. My point was that he didn't cite any regional favoritism IN the bank's actions (Obviously Congress delegated some distribution of money to the bank, or it wouldn't be a BANK), as the reason for his objections. He cited it's favor of those who become rich by government favor, and it's lack of redeeming qualities. Region was not mentioned. \"Andrew Jackson had to close down the bank because it was the only thing that he COULD do to make sure each state was equally represented.\" Equal representation of the states WAS NOT MENTIONED as a reason when he closed down the bank. Pay attention to the reasons he actually gave, not the ones you imagine for him. \" My opponent's next point was as drastically un-cited as the last point,\" You have yet to make a single citation of a specific work, the closest thing to it was a citation of a random historian, without even providing the historian's probably nonexistent reasoning. \"Jackson did not \"Remove\" the deposits in the bank at all.\" \"ackson then used his second presidential election victory later that year as a mandate to order the withdrawal of all federal funds from the bank in 1833\" Sure seems like he did. Last I checked, he even rewarded Taney with a Supreme Court seat for carrying out his orders. \" And finally, my opponent's last point had to do with the economic stature of the $20 dollar bill, which, yet again, has nothing to do with why Andrew Jackson should be removed from it.\" I wouldn't want my face on a symbol soon to be tarnished. Would you?"],"PremiseEndPos":[14103],"ArgumentID":"00000003","Conclusion":"Andrew Jackson should be removed from the $20 bill.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":186,"nextID":"00000005","PremiseStartPos":[14118],"prevID":"00000003","Premise":["Hello. My name is Keenan Harris. It's a pleasure to be e-debating here today and my opinion here is that Andrew Jackson should not be removed from the $20 bill assuming of course that the proposition is that he should indeed be removed from the $20 bill, and now without further introduction I would like to start on my construct. Andrew Jackson, the mere mention of the name brings images of our victory of the War of 1812 at the battle of New Orleans. It brings visions of the great peninsula of Florida and Oxcarts moving west to settle in new lands, where no man had gone before. But most of all, the name brings to mind the idea of a Democracy, where all men, no matter how rich, or how poor, are equal. The first point I will make in my debate, is that Andrew Jackson was a pioneer. I say this in the sense that he was the first to do many things. For example, as a boy Andrew Jackson was literally dirt poor. At the age of 13 he had already lost most of his family, either to disease or the gun of a redcoat, and as the budding young patriot he was he enlisted in the Colonial Army to fight the British in the Revolutionary War. From that point forth he painstakingly worked his way up in ranks until one day he retained the honorable title of General. He was then able to buy a Mansion in Nashville, TN where he supported his wife and children. As you can see, he worked his way up from the Slums to his eventual title of President of the United States. He was also the first President to be elected by the common man, because before he was elected, only rich aristocrats were allowed to vote, and our country ran on a very corrupt system of bribes. But all that changed during Andrew Jackson's presidency, and the Jacksonian Democracy was built. This new kind of government we still use today, and without it, President's like Ulysses S. Grant , John F. Kennedy, or even our current president may not have been elected. This \"special\" kind of democracy involves full representation of all people in the United States poor or wealthy, and during his Administration he did all he could to represent everyone equally. By any means, be it having extra political meetings with not only his cabinet. But others to make sure that everyone was getting a fair voice in government. Andrew Jackson would sometimes tour the country, giving speeches everywhere so that whenever his administration did something, the people knew about it. It was a veritable utopia compared to even our current system, and it would be blasphemy to take him off the most used currency in America. Vote Con, and keep a true American hero, on true American currency."],"PremiseEndPos":[16760],"ArgumentID":"00000004","Conclusion":"Andrew Jackson should be removed from the $20 bill.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":186,"nextID":"00000006","PremiseStartPos":[16775],"prevID":"00000004","Premise":["Hello, and again, It is I, Keenan Harris. Before I start, I would first like to thank my opponent for accepting my challenge and posting his first construct so punctually. You have my gratitude. I would like to start my argument by simply stating. We have no more commonly used commodity based currency. Even our current coinage is still, what my opponent would call, fiat money. So, like my opponent said, we would have to create a totally new, \"commodity-backed\" currency as opposed to the fiat currency we have today. But this makes no sense however for you did say that, \"Fiat money represents the force of a tyrant, not an exchange of values between good common men\" since this statement has no source cited to it, it must be an opinion. So not only is my opponent calling our current system of money tyrannical, but he is also saying that Andrew Jackson's pecuniary ideology was ethical and echoed \"an exchange of values between honest men\" which helps my side in saying that Andrew Jackson was the people's president. But to entertain my opponent's ridiculous claim, the cost of making a printing machine plus the initial cost of the raw material that would be used in the machine would make no sense. Not only would this cost an obscene amount, but in this economy we cannot afford things as frivolous as this. Our currency is fine the way it is and changing it now would not be logical in our current recession. We would have to hire new artists to make a new design, hire economists to find a commodity that is not only easy to acquire, but that has a high material value, after all this the cost of changing even the face on the $20 bill would be just insane! It's better to keep things the way they are and not dishonor any presidents by taking them off currency. Another point made by my opponent was that Andrew Jackson hated centralized banks, and that he went so far as to DESTROY the Bank of the United States. And I could not agree more with this statement. This bank of the United States was at the time favoring the Northern States over the southern states in the distribution of taxpayer dollars. This was making the south angrier and angrier and then when Congress passed extra Tariffs on imported goods, John C. Calhoun, from North Carolina, wrote a doctrine of Nullification and threatened to secede from the Union! Faced with an extremely hard choice, Andrew Jackson had to get rid of the national bank to preserve the Union of the united states. So not only was Jackson able to deal with a corrupt bank, but he faced the obstacle of preserving the Union even before Lincoln! After all this evidence is put forth it is obvious that getting rid of the national bank was the right thing to do. It was either get rid of a corrupt bank, or loose the foremost agrarian state at the time, and who knows how many would have followed after that. So, as you can see, Jackson really had no choice but to get rid of the National Bank. On a side note to the previous point... The National Bank did not reflect American ideals. It was a government owned corporation and in this sense, The National Bank was a communist business. Americans rely on the economic ideology of capitalism over anything else and the National bank was getting in the way of progress. Jackson seeing this, had another reason for getting rid of it because he knew that in our future America needs to be more capitalist, and getting rid of the national bank was a stepping stone in our history as one of the best things that has ever happened to capitalism. My final word on this particular point is that Jackson actually did not \"destroy\" the national bank. He simply did not renew the bank's charter so the bank slowly, but surely, closed down, without any harm to the economy, or the employees of the national bank. So do we want to dishonor the most loved president in American history by stripping him from America's most used currency? Or do we want to leave things the way they are. In the word's of Bert Lance \"If it ain't broke, don't fix it\". Why should we fix the $20 bill, if it \"ain't\" broke."],"PremiseEndPos":[20866],"ArgumentID":"00000005","Conclusion":"Andrew Jackson should be removed from the $20 bill.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":186,"nextID":"00000000","PremiseStartPos":[20881],"prevID":"00000005","Premise":["Before I start my construct, I would like to point out that my opponent has brought up only one real point for why Andrew Jackson should not be on the $20 bill. That point was \"Andrew Jackson did not approve of fiat money\", to quote my opponent, \"this is unwarranted revisionism\". Andrew Jackson may have favored commodity backed currency during his presidency, but that is only because he feared for the country's economic welfare. He thought, by passing the Specie Circular in 1836 he would prevent a future economic downturn when people started buying large amounts of land in the west with \"soft money\". The only reason that he favored this commodity based currency is that he believed it would be the best thing for keeping our economy in a sound state. He did not express any ill feelings towards \"fiat money\" and popular belief between many historians, Michael Baradat to name one, is that he would not mind his face being on American currency. He would be honored for his face to be portrayed on the most used bill in America and no amount of past ideals can change that. My opponent's next point was much like his whole speech. It lacked evidence. Just because the teenager fighting for the proposition believes that \"The $20 bill is unethical\". This has no relevance for what we are talking about! The question brought before the house is \"Should Andrew Jackson be removed from the $20 bill?\" not, \"Is the 20 ethical\" or \"Should we switch to a tyrannical form of currency?\" it seems my opponent has only been touching on the last two other than the first of which I have stuck to my entire speech, save some minor lapses where I was forced to entertain a ridiculous claim brought up by the pro side. So any point not relating to Andrew Jackson's worthiness to be portrayed on the $20 dollar bill must be thrown out. The next 4 points my opponent brought to the table were all largely irrelevant because they related not to Andrew Jackson but the $20 dollar bill it's self. I will say it again. This debate isn't about changing the $20 dollar bill, it's about changing the face on it. And since you have obviously failed to bring up a good argument for taking Andrew Jackson off the $20 bill that I have not brought substantial historical evidence to refute, we must assume that the opposition has won in saying that Andrew Jackson must retain his rightful seat on the $20 dollar bill. My opponent's next point was that Andrew Jackson portrayed on a piece of American currency is equivalent to a picture of Martin Luther King in KKK robes. If anything is absurd, this point is! No president, no matter his monetary belief would object to being honored on a piece of American currency. In fact, the original case of Andrew Jackson being put on the $20 bill is proof showing that it was not offensive. For why would we purposely dishonor a true American Hero? I am positive that when he was put on there was the object of controversy that he should not because of \"...\" reason. But obviously it was not a good enough reason to keep him from being accepted as the next candidate for the $20 bill. So taking Jackson off the $20 would in fact be dishonoring him because of this. But it wouldn't only dishonor Jackson, but America as a whole. For what is a country that takes someone off a piece of currency for objecting to something. But we're Americans! And we honor our presidents, so vote con, and respect not only Andrew Jackson, but AMERICA! My opponent's next point was that Andrew Jackson didn't cite any regional favoritism while distributing taxpayer money. Did you even RESEARCH how money was distributed back then!?!?!??! Distributing taxpayer money was the job of congress, not the executive branch. Andrew Jackson had to close down the bank because it was the only thing that he COULD do to make sure each state was equally represented. So next time, look up a point before you so randomly throw it out there. We try to have historical evidence in debates... My opponent's next point was as drastically un-cited as the last point, and the little historical evidence brought up was wrong. Jackson did not \"Remove\" the deposits in the bank at all. He merely let the charter run itself out. My opponent's next point was that the suddenness, which didn't happen, caused economic harm. The little economic harm that came about during his presidency was caused by malfunctioning railroads and canals that were slowing down trade, none at all was caused by the government, so that point should be thrown out. My opponent's last point requires little refuting at all, the first point was Andrew Jackson didn't just sit on his heels and refuse to renew the charter, you're right he actively told congress that he would veto renewing the charter so, correct. My opponent's point after that was Jackson said he would \"kill\" the bank. Presidents use exaggerated wording all the time to stir up their audiences the mere fact he said \"kill\" only proves that he was a stirring speaker. And finally, my opponent's last point had to do with the economic stature of the $20 dollar bill, which, yet again, has nothing to do with why Andrew Jackson should be removed from it. So over all 6/9 points my opponent made in his last speech were irrelevant. Such an unregulated amount of relevance shows a lack of preparation and sound points. So vote for the Con side, and keep an American hero on the most used bill in circulation. Don't vote pro and dishonor our very basic American ideals."],"PremiseEndPos":[26367],"ArgumentID":"00000006","Conclusion":"Andrew Jackson should be removed from the $20 bill.","PremiseStance":["Con"]}}]}