{"MetaData":{"Context":"URL: http://www.debate.org/debates/Santa-is-a-bad-person-creature-being-Merry-Christmas/1/\nCrawl date: 2016/09/29 03:01:03\nOnline Debate: Santa is a bad person/creature/being Merry Christmas | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: My position is that Santa Claus, the jolly old man who drops presents under the tree is actually a bad man. I am using the word man loosely he could be a creature, being etc, that is not important in this debate and is a \"loop hole\" I plan to exploit. But my position is as a being he is not good, but bad. Possibly even evil at times... well maybe not evil, but not \"Saintly\" Nick. Anyway this is a funny debate, have fun with it. Tell me how wonderful and great Santa is while I destroy your clean image of this Jolly 'ol cookie eating philanthropist. No rules. Simple judge who wins. Round 1: accept Round 2: main argument Round 3: Rebuttal and closing Good luck ho ho ho Merry Christmas.\n\nEvidence Pro: Santa is commonly thought of as a friendly, jolly fellow. He brings children presents, allows them to sit on his lap for pictures. This is the picture my debate partner will try to show you. He might point out that Santa even at times may be seen outside stores such as Walmart collecting money for the needy. All of these are very nice but it is a charade as Santa compensates for all his bad behaviors. And if you agree with the idea of good and bad, then one must understand it does not matter how many good things people do to make up for the bad. For starters, Santa is nothing more than a modern day slave owner. He is nightmare to work for. He exploits labor. Elfs are not paid, they work all hours. And as seen in the movie Elf, they have quotas that must be met. These elfs are not permitted to even leave the north pole. I have no direct evidence of the elfs not being allowed to leave other than the fact that in 500 plus years of Santa, no elf has ever come forward with claims of being an elf. In short these elves are held against their will \" kidnapped for lack of a better word, and forced to work with no monetary compensation \" many would call slavery. Second, Santa engages in animal abuse. The schedule is 24- 33 hours depending on speed he moves, time he leaves, and assume an east to west travel with accomidating time zones. In the US alone there are over 1 Million miles of roads, which is how houses are connected, means this tight schedule to travel the equivelant of 1 million miles and if the same distance was covered in Asia, Africa, Europe, the Pacific islands, and Austraila, that means he must travel 6 million miles in 33 hours. Such supersonic speeds creates large amounts of heat like when the space shuttle re-enters the atmosphere. There is no evidence the reindeer have any ceramic outercoating to protect them from this intense heat. Also they are forced to pull thousands of tons of toys around the world without regards for their health. Third, santa breaks the law. Every Christmass eve Santa routinely breaks into houses. The legal statute is \"breaking and entering\", were one has entered a home without authorization. Perhaps you think Santa has privileges to enter your home. This is true. But out of the 1.7 Billion homes in the world, it is illogical to imagine every single one welcomes Santa into their home without a single mistake. Fourth,, at best he is a creepy voyer who enjoys watching children At worst santa is a petaphile who enjoys having children sit on his lap. Santa spends the better part of his life obsessed with children. He watches them, day and night. He knows when they are sleeping, and probably means he is watching them in their sleep. What else is going on? Lastly, Santa is unfairly judgmental and bad semaritan . Santa keeps lists of naughty and good boys and girls. There is no real consensus of what makes one good or naughty. What is clear is depending on what Santa thinks is a good or naughty person, that boy or girl will or will not get a gift. Santa does not warn the children. Santa does not set the rules. Santa does not even intervene if he witnesses a problem. He is a spectator on the road of life. Santa and turns a blind eye to the naughtiness he witnesses. There is no evidence Santa has ever stepped in when a child was doing naughty things to protect person or property. In summary, Santa is a modern day slave owner who treats his animals poorly. Santa obsesses over children, while he breaks into houses. Lastly, Santa is a judgmental being that would not even help a child he saw being abused by another. These are not hallmarks of a good person. Are these honestly the qualities of a \"good person.\" No they are not. And no amount of gift giving will compensate for his actions - or lack of.\n\nEvidence Pro: I applaud my opponent for taking up this challenge of proving Santa is a good guy. It is a common assertion that he is a good guy, but as my opponent has shown through his own struggles, it is really difficult to support this claim of goodness. My opponent had to research the annals of time back 500 years to find a case where Santa was a kind person helping out another. That one event is hardly enough to counter all the bad. This past Christmas alone it is estimated 15 people in the US and another 20 people in Europe died from injuries such as accidents. Where was Santa? He was flying overhead and did not stop. He never stops. In 500 years since, Santa has never made a stop to help change a tire, or stop a robbery, or anything. He is the oldest superhero, faster than a speeding bullet, fly through the air, never ages, knows everything\" With all this power, he is a voyeur caught up in his own world of watching. It is interesting that I make the argument Santa may be a pedophile, and my opponent injects Santa is a recognized \"saint\". He values Santa in the \"holy\" manner in the likeness of \"God\". This type of logic does not remove the possibility of pedophilia \" in fact as the Catholic Church has taught us, it makes a child more prone to abuse by such people of trust. His argument borders on admission. Thirdly, my opponent claims Santa does not enter a house without permission, he does not break and enter. I challenge anyone reading this to have their younger sibling tell mom and dad at 3Am that he just saw Santa is in the kitchen eating some cookies and is going towards the Christmas tree. Close your eyes and Imagine the response. Mom will be dialing 911 while Dad is grabbing his shotgun or baseball bat. If you can\"t imagine that going any other way, how is that honestly a welcomed guest? Furthermore, to answer your question about how Santa gets into a house if he is not welcomed, shimming down a chimney, tossing things or entering through open windows, or picking a door lock is not the action of a welcomed guest. Most guests knock on a door, and not at 2AM. Why can\"t Santa come in the day light? Fourth, saving a reindeer only to put him into a work camp/abuse situation is not something \"good\" people do. I applaud anyone willing to help out a sick animal, but saving them only for your own personal use and to exploit their disease \" on foggy nights, and not take him to the vet\". Again this is not something good people do. Santa is not altruistic. He is the opposite, a megalomaniac. He picks and chooses who gets what gift. He uses his power to persuade children how to behave. Children are fearful of being seen doing something wrong, and probably would also be fearful to reporting sexual abuse from their annual gift giver. He spys on children \" while they are sleeping. He does not stop and help those in need. He is judgmental, and is not a welcomed guest in any home. Santa is at best a sweat shop owner or at worst a slave owner who keeps elfs against their will. Some may say the way he keeps the elves is a form of kidnapping. He engages in animal abuse. Santa breaks the law by entering homes that are unwelcoming to him. Santa is judgmental, as he spys on little sleeping children. And even when witnesses the \"bad\" things being done, he does not intervene to save life or property. These are not hallmarks of a good person. The above things are actually hallmarks of bad people. Therefore Santa is bad and my opponent has done little to counter my specific points. Vote Pro.\n\nEvidence Con: Accepted\n\nEvidence Con: Thanks for allowing me to participate in this debate. My position is that 'Santa Claus' is an inherently good person. It seems that Santa Claus is being exclusively portrayed in his pop culture form, as a fat man with a long beard in a red suit who rides reindeer. But let's not forget that first and foremost, Nikolaos of Myra, commonly dubbed Santa Claus, is a saint. This means that he is recognised as exceptionally holy and embodies the goodness of god himself. He was known for his selfless deeds during life, and also after death. My opponent describes St Nicholas as a \"creepy voyeur\" who is \"obsessed with children\". However, St Nicholas was sanctified for his acts of protection to children who were enslaved or needy, and this is why he is commonly associated with them today, not because he has some perverted obsession. One of the oldest stories of St Nicholas, describes a young boy called Basilios who was enslaved as the king's cupbearer. The king claimed the child as his property and Basilios' family was dismayed at having lost their child. On the next feast of St. Nicholas, Basilios was freed by the saint and returned to his family immediately. Nothing was asked in return, St Nicholas simply helps children in need because it's the right thing to do. I must also deny the argument that St Nicholas practises \"breaking and entering\". The gifts delivered by 'Santa Claus' are only left in households where the family invites his involvement. No one has ever unwillingly received a gift from Santa Claus. Furthermore, St Nicholas is traditionally portrayed as throwing bags of gold through the window, not clumsily falling down a chimney, dropping gifts and struggling back up. How do you think Christmas gifts are delivered to houses without chimneys? Lastly, the character of Santa Claus does not treat his animals poorly, but actually rescues them from oppressive social circumstances. This is easily demonstrated by referring to the song \"Rudolf the rednosed reindeer\". According to the lyrics, Rudolf was always bullied in his reindeer social circle, being verbally harassed and excluded from reindeer games. He could have suffered a solitary and miserable life. Instead, Santa Claus gave him purpose by requesting him, not forcing him, to pull his sleigh and help him deliver gifts. After Rudolf accepted, he was celebrated and respected in his community. St Nicholas selflessly helps children in need, does not ask to be rewarded or thanked and rescues reindeer from oppressive social circumstances. He has been sanctified for his acts of good-will. This, of course, makes him a good and holy person. Thank you, vote con. Sources:\n","DiscussionID":"00000007","Title":"Santa is a bad person/creature/being Merry Christmas","CrawlDate":"2016/09/29 03:01:03","URL":"http://www.debate.org/debates/Santa-is-a-bad-person-creature-being-Merry-Christmas/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":190,"nextID":"00000002","PremiseStartPos":[242],"prevID":"00000000","Premise":["My position is that Santa Claus, the jolly old man who drops presents under the tree is actually a bad man. I am using the word man loosely he could be a creature, being etc, that is not important in this debate and is a \"loop hole\" I plan to exploit. But my position is as a being he is not good, but bad. Possibly even evil at times... well maybe not evil, but not \"Saintly\" Nick. Anyway this is a funny debate, have fun with it. Tell me how wonderful and great Santa is while I destroy your clean image of this Jolly 'ol cookie eating philanthropist. No rules. Simple judge who wins. Round 1: accept Round 2: main argument Round 3: Rebuttal and closing Good luck ho ho ho Merry Christmas."],"PremiseEndPos":[934],"ArgumentID":"00000001","Conclusion":"Santa is a bad person/creature/being Merry Christmas","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":190,"nextID":"00000003","PremiseStartPos":[949],"prevID":"00000001","Premise":["Santa is commonly thought of as a friendly, jolly fellow. He brings children presents, allows them to sit on his lap for pictures. This is the picture my debate partner will try to show you. He might point out that Santa even at times may be seen outside stores such as Walmart collecting money for the needy. All of these are very nice but it is a charade as Santa compensates for all his bad behaviors. And if you agree with the idea of good and bad, then one must understand it does not matter how many good things people do to make up for the bad. For starters, Santa is nothing more than a modern day slave owner. He is nightmare to work for. He exploits labor. Elfs are not paid, they work all hours. And as seen in the movie Elf, they have quotas that must be met. These elfs are not permitted to even leave the north pole. I have no direct evidence of the elfs not being allowed to leave other than the fact that in 500 plus years of Santa, no elf has ever come forward with claims of being an elf. In short these elves are held against their will \" kidnapped for lack of a better word, and forced to work with no monetary compensation \" many would call slavery. Second, Santa engages in animal abuse. The schedule is 24- 33 hours depending on speed he moves, time he leaves, and assume an east to west travel with accomidating time zones. In the US alone there are over 1 Million miles of roads, which is how houses are connected, means this tight schedule to travel the equivelant of 1 million miles and if the same distance was covered in Asia, Africa, Europe, the Pacific islands, and Austraila, that means he must travel 6 million miles in 33 hours. Such supersonic speeds creates large amounts of heat like when the space shuttle re-enters the atmosphere. There is no evidence the reindeer have any ceramic outercoating to protect them from this intense heat. Also they are forced to pull thousands of tons of toys around the world without regards for their health. Third, santa breaks the law. Every Christmass eve Santa routinely breaks into houses. The legal statute is \"breaking and entering\", were one has entered a home without authorization. Perhaps you think Santa has privileges to enter your home. This is true. But out of the 1.7 Billion homes in the world, it is illogical to imagine every single one welcomes Santa into their home without a single mistake. Fourth,, at best he is a creepy voyer who enjoys watching children At worst santa is a petaphile who enjoys having children sit on his lap. Santa spends the better part of his life obsessed with children. He watches them, day and night. He knows when they are sleeping, and probably means he is watching them in their sleep. What else is going on? Lastly, Santa is unfairly judgmental and bad semaritan . Santa keeps lists of naughty and good boys and girls. There is no real consensus of what makes one good or naughty. What is clear is depending on what Santa thinks is a good or naughty person, that boy or girl will or will not get a gift. Santa does not warn the children. Santa does not set the rules. Santa does not even intervene if he witnesses a problem. He is a spectator on the road of life. Santa and turns a blind eye to the naughtiness he witnesses. There is no evidence Santa has ever stepped in when a child was doing naughty things to protect person or property. In summary, Santa is a modern day slave owner who treats his animals poorly. Santa obsesses over children, while he breaks into houses. Lastly, Santa is a judgmental being that would not even help a child he saw being abused by another. These are not hallmarks of a good person. Are these honestly the qualities of a \"good person.\" No they are not. And no amount of gift giving will compensate for his actions - or lack of."],"PremiseEndPos":[4738],"ArgumentID":"00000002","Conclusion":"Santa is a bad person/creature/being Merry Christmas","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":190,"nextID":"00000004","PremiseStartPos":[4753],"prevID":"00000002","Premise":["I applaud my opponent for taking up this challenge of proving Santa is a good guy. It is a common assertion that he is a good guy, but as my opponent has shown through his own struggles, it is really difficult to support this claim of goodness. My opponent had to research the annals of time back 500 years to find a case where Santa was a kind person helping out another. That one event is hardly enough to counter all the bad. This past Christmas alone it is estimated 15 people in the US and another 20 people in Europe died from injuries such as accidents. Where was Santa? He was flying overhead and did not stop. He never stops. In 500 years since, Santa has never made a stop to help change a tire, or stop a robbery, or anything. He is the oldest superhero, faster than a speeding bullet, fly through the air, never ages, knows everything\" With all this power, he is a voyeur caught up in his own world of watching. It is interesting that I make the argument Santa may be a pedophile, and my opponent injects Santa is a recognized \"saint\". He values Santa in the \"holy\" manner in the likeness of \"God\". This type of logic does not remove the possibility of pedophilia \" in fact as the Catholic Church has taught us, it makes a child more prone to abuse by such people of trust. His argument borders on admission. Thirdly, my opponent claims Santa does not enter a house without permission, he does not break and enter. I challenge anyone reading this to have their younger sibling tell mom and dad at 3Am that he just saw Santa is in the kitchen eating some cookies and is going towards the Christmas tree. Close your eyes and Imagine the response. Mom will be dialing 911 while Dad is grabbing his shotgun or baseball bat. If you can\"t imagine that going any other way, how is that honestly a welcomed guest? Furthermore, to answer your question about how Santa gets into a house if he is not welcomed, shimming down a chimney, tossing things or entering through open windows, or picking a door lock is not the action of a welcomed guest. Most guests knock on a door, and not at 2AM. Why can\"t Santa come in the day light? Fourth, saving a reindeer only to put him into a work camp/abuse situation is not something \"good\" people do. I applaud anyone willing to help out a sick animal, but saving them only for your own personal use and to exploit their disease \" on foggy nights, and not take him to the vet\". Again this is not something good people do. Santa is not altruistic. He is the opposite, a megalomaniac. He picks and chooses who gets what gift. He uses his power to persuade children how to behave. Children are fearful of being seen doing something wrong, and probably would also be fearful to reporting sexual abuse from their annual gift giver. He spys on children \" while they are sleeping. He does not stop and help those in need. He is judgmental, and is not a welcomed guest in any home. Santa is at best a sweat shop owner or at worst a slave owner who keeps elfs against their will. Some may say the way he keeps the elves is a form of kidnapping. He engages in animal abuse. Santa breaks the law by entering homes that are unwelcoming to him. Santa is judgmental, as he spys on little sleeping children. And even when witnesses the \"bad\" things being done, he does not intervene to save life or property. These are not hallmarks of a good person. The above things are actually hallmarks of bad people. Therefore Santa is bad and my opponent has done little to counter my specific points. Vote Pro."],"PremiseEndPos":[8281],"ArgumentID":"00000003","Conclusion":"Santa is a bad person/creature/being Merry Christmas","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":190,"nextID":"00000005","PremiseStartPos":[8296],"prevID":"00000003","Premise":["Accepted"],"PremiseEndPos":[8305],"ArgumentID":"00000004","Conclusion":"Santa is a bad person/creature/being Merry Christmas","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":138,"ConclusionEndPos":190,"nextID":"00000000","PremiseStartPos":[8320],"prevID":"00000004","Premise":["Thanks for allowing me to participate in this debate. My position is that 'Santa Claus' is an inherently good person. It seems that Santa Claus is being exclusively portrayed in his pop culture form, as a fat man with a long beard in a red suit who rides reindeer. But let's not forget that first and foremost, Nikolaos of Myra, commonly dubbed Santa Claus, is a saint. This means that he is recognised as exceptionally holy and embodies the goodness of god himself. He was known for his selfless deeds during life, and also after death. My opponent describes St Nicholas as a \"creepy voyeur\" who is \"obsessed with children\". However, St Nicholas was sanctified for his acts of protection to children who were enslaved or needy, and this is why he is commonly associated with them today, not because he has some perverted obsession. One of the oldest stories of St Nicholas, describes a young boy called Basilios who was enslaved as the king's cupbearer. The king claimed the child as his property and Basilios' family was dismayed at having lost their child. On the next feast of St. Nicholas, Basilios was freed by the saint and returned to his family immediately. Nothing was asked in return, St Nicholas simply helps children in need because it's the right thing to do. I must also deny the argument that St Nicholas practises \"breaking and entering\". The gifts delivered by 'Santa Claus' are only left in households where the family invites his involvement. No one has ever unwillingly received a gift from Santa Claus. Furthermore, St Nicholas is traditionally portrayed as throwing bags of gold through the window, not clumsily falling down a chimney, dropping gifts and struggling back up. How do you think Christmas gifts are delivered to houses without chimneys? Lastly, the character of Santa Claus does not treat his animals poorly, but actually rescues them from oppressive social circumstances. This is easily demonstrated by referring to the song \"Rudolf the rednosed reindeer\". According to the lyrics, Rudolf was always bullied in his reindeer social circle, being verbally harassed and excluded from reindeer games. He could have suffered a solitary and miserable life. Instead, Santa Claus gave him purpose by requesting him, not forcing him, to pull his sleigh and help him deliver gifts. After Rudolf accepted, he was celebrated and respected in his community. St Nicholas selflessly helps children in need, does not ask to be rewarded or thanked and rescues reindeer from oppressive social circumstances. He has been sanctified for his acts of good-will. This, of course, makes him a good and holy person. Thank you, vote con. Sources:"],"PremiseEndPos":[10978],"ArgumentID":"00000005","Conclusion":"Santa is a bad person/creature/being Merry Christmas","PremiseStance":["Con"]}}]}