{"MetaData":{"Context":"URL: http://www.debate.org/debates/the-christian-trinity-is-an-illogical-idea/4/\nCrawl date: 2016/09/29 06:45:30\nDebate Topic: the christian trinity is an illogical idea | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: consider: the son is God, the father is GOd, but the son is not the father and they are not separate Gods. that's like saying five plus one equals six. two plus four equals six. but five plus one does NOT equal two plus four.\n\nEvidence Pro: \" So here are two person who have the same nature, which is not illogical or contradictory, for two humans can also have the same nature without the first person being the second person. \" by this reasoning the son and the father should be considered two separate beings period. which would mean we have three gods as the godhead, when christian theology says we have only one God. the flour analogy doesn't work. i see how both the components and the whole can be called flour. but that doesn't work with the trinity. to be analogous the son would be God but also part of God, part of the whole thing. this might be true linguistically but in practice has problems. the son would be a component if the flour anaology were true.... but theology says he is wholly God in himself. i know you said you are just using an inexact anaology, but you haven't shown how they can be three and one at the same time. (to be sure, to say something is three and one at the same time is on its face contradictory) \"The Trinity is a Being which has three minds (persons) within its make up.\" if this were true we could simply say the son is part of God, he's a component. this is against christian theology. again it gets contradictory cause you are trying to say he's a component yet he's also the whole thing. like saying it's three and one at the same time. your quantum idea is interesting. but that only works at the quantum level and we are talking about someone who is a human. there might be more to the idea and what con is saying is only anaologous. but he hasn't proven it to be true that someone can be one and three outside of quanta. it's like he's proving a shadow might indicate the thing he is arguing to exist but it might indicate something else too.\n\nEvidence Pro: \" Pro misses the point here. A scoop of flour is not part of flour, its %100 flour.\" actually con misses the point. it may be true that the scoop and the bag are both flour. but the scoop is still part of the bag. it would be incorrect to say the Son is part of the whole, at least id suppose that is inaccurate. con argues the quantum points indicate that three and one in principle can be a logical statement at least at the quantum level os itmight be true at our level. i dont contest that it might be true, i just contest that you havent shown it to be true, and with the info we have it at least sounds like the trinity is contradictory.\n\nEvidence Con: There is nothing illogical about the Trinity as I will prove. My opponent thinks its illogical because he misunderstands what the doctrine of the Trinity means, thus, he illustrates it in a way that does not properly represent the concept. Gal 4:8 \"Formerly, when you did not know God, you were slaves to those who by nature are not gods.\" This suggests that unlike the idol gods of the nations, the God of Christians is God BY NATURE. Thus, the word \"God,\" when applied to individual members of the Trinity, at times carries the meaning of the specific NATURE which makes God, God. The word God in this sense does not imply a position or action role such as Creator or Judge, for before God created anything or judged anyone, he was already God according to Psalm 90:2. This does not mean that the word \"God\" does not carry other meanings when applied to God, the context must determine the meaning, just as it is with many other words which have more than one meaning, for example the word \"soul\" at Matt 10:28 cannot mean the physical body because Jesus separates it from the body when he says that they can kill the body but not the soul, and mentions \"BOTH soul and body;\" but the word \"soul\" does mean the body in Joshua 11:11 when the souls were slaughtered with the sword, and we know this must be the body because a spirit cannot be killed with a sword. Similarly, the word God has more than one meaning when applied to the True God. I have already established one of those meanings to be a reference to the divine nature which makes Him who He is, namely, omniscience, omnipresence, omnipotence, being all-loving, immutability, eternality, etc. These are some of the aspects of God's nature that make him God. Secondly, the word \"God,\" when applied to Him, can mean the Being (that is, the Trinune Being = all three persons of the Trinity) which possesses this nature of being eternal, all-knowing, omnipotent, etc. Similarly, we would say that \"human\" refers to being a mammal with flesh and blood, which is \"characterized by erect posture and bipedal locomotion, manual dexterity and increased tool use, and a general trend toward larger, more complex brains and societies.\" So \"human\" is a reference to our nature, as when one says \"I am human,\" he means that he is flesh and blood with a complex brain, he eats to live, has sex to procreate and has innate abilities to express love, hate, and other qualities. Yet, the word \"human\" also means a being that has this particular nature. To say \"he is a human\" means he is a being which has this nature. We trinitarians use the word \"God\" in a similar way, so that in one case the word \"God\" means the divine nature, in another case it means the Being which has this nature. With that understanding, we can get back to Pro's argument and say \"the Father is God\" means the Father is omnipresent, omniscient, all-loving, eternal, and all other attributes of the unique divine NATURE. To say \"the Son is God\" means the Son also has this nature. So here are two person who have the same nature, which is not illogical or contradictory, for two humans can also have the same nature without the first person being the second person. So to say that the Son is God, that is, has the same nature as the Father, would in no way imply that the Son actually is the same person as the Father. Now, to say that they are both the same God would not be to say they are the same person. Rather, it simply means they are included in the same Being which possesses this nature. To illustrate, take two scopes from a bag of flour. Now the first scoop is not the second scoop but both scoops can equally be said to be \"flour,\" just like the entire bag of flour. If you mix both scoops back into the bag of flour, they are still in there, but they are both part of the same being, the entire mass of flour. This is just an illustration and not an exact correspondence to God. But I hope you get the point. There is a difference between a being and a person. A being is the TOTAL thing, ALL OF THE CHARACTERISTICS of a thing. So the being of a chair would range from its legs and back, to the fact that its made of wood, to the every minerals and elements out of which the wood is made. The Trinity is a Being which has three minds (persons) within its make up. But a person is just one aspect of a being. So our personhood is the fact that we are conscious, intelligent and rational; but there are other aspects of our being such as the fact that we have fingers and toes, language, hair, etc...Take away any one of these and our personhood would still remain. So in short, the Father is a person with divine nature, the Son is another person with divine nature, the Holy Spirit is another person with divine nature, but these are not one person. These are one Being when taken together, Being being different from person. So when \"God\" refers to all three as one, it refers to a Being, not a single person. So 1 person the Father = 1 person the Son = 1 person the Holy Spirit = 1 Being (the Triune God = 3/3) I guess the problem Pro also has with the idea of person is the image of a person just being a flesh and blood human. But one need not have flesh to be a person. Angels are spirit beings, they don't have flesh but they are persons. And artificial intelligence would be a person if we could create one. In so much as it had consciousness, intelligence and rationality, we could imbue it with all the rights of persons. When we look at a spirit, the bodies of three spirits could literally be ONE, EXISTING in the same place at the same time without increasing mass, just as in Luke 8 a man was possessed with a legion of demons inside his body. All these spirits in one body. Science has now proven that one particle can be in three, indeed, thousands of places at the same time, while remaining one particle. So there is no reason why God cannot be in three places simultaneously as Father, Son and Holy Spirit which keeping His unity. Interestingly, in the double-slit experiment, the first particle is in another location from the second particle in order to interact with it, and yet both are one particle. This is very similar to how the Father is not the Son who interacted with Him, and yet both are the same God. So the fact that we have things in nature which reflect the possibility of how 3 can be 1 shows that the Trinity is not illogical at all.\n\nEvidence Con: Pro says \"by this reasoning the son and the father should be considered two separate beings period. which would mean we have three gods as the godhead,\" but my reference to two humans would not imply separate beings in the case of God, only separate persons, for there is a difference between \"being\" and \"person.\" We cannot assume that God's nature must be exactly like ours so that he cannot be tri-personal, that is, having more than one person in his being. He says \"the flour analogy doesn't work. i see how both the components and the whole can be called flour. but that doesn't work with the trinity. to be analogous the son would be God but also part of God, part of the whole thing. this might be true linguistically but in practice has problems. the son would be a component if the flour anaology were true.... but theology says he is wholly God in himself. i know you said you are just using an inexact anaology, but you haven't shown how they can be three and one at the same time. (to be sure, to say something is three and one at the same time is on its face contradictory).' Pro misses the point here. A scoop of flour is not part of flour, its %100 flour. A scoop of flour is BY NATURE %100 flour. Its not partially flour just because its not the whole bag of flour. It being part of a larger mass doesn't mean its nature is different from the whole thing in any way. So the Son is part of the triune God, but is BY NATURE %100 God, that is %100 divine, wholly omniscient, omnipresent, eternal, etc. So just as a scoop of flour is part of the whole bag of flour and at the same time is fully BY NATURE \"flour,\" having all the attributes of flour, Jesus is part of God (the triune being) while being fully God in the sense of having all the attributes (or the nature) of God. Pro says \"if this were true we could simply say the son is part of God, he's a component. this is against christian theology. again it gets contradictory cause you are trying to say he's a component yet he's also the whole thing. like saying it's three and one at the same time.\" But Christians don't believe Jesus is the entire Trinity. Pro doesn't seem to get that we are using the word \"God\" in two different ways. Jesus is not God in the sense that He is the entire Trinity, but he is God in the sense that he is omniscient, all-knowing, all-loving, eternal, immutable, etc. In other words, He is God BY NATURE. He is FULLY God means that He has all of these attributes I have listed that makes God such a unique and awesome being. So Jesus is God in one sense, and a part of God in another sense. No contradiction here. Pro argues that \"your quantum idea is interesting. but that only works at the quantum level and we are talking about someone who is a human.\" How does Pro know that it can only work at the quantum level? A quantum mircrophone, big enough for the eye to see, can vibrate an not vibrate at the same time. Our knowledge, science and technology is improving. A God whose knowledge is literally infinite would be able to do much more beyond what our Science can do, and its not illogical to think that He could. Just because we don't know scientifically how to do it, doesn't imply God would not. An ant cannot comprehend how its possible for us to build a car, and the difference between us and God is much wider than the difference between us and an ant! The idea that someone with the amount of knowledge and power God has (limitless) would be able to get quantum effects on a large scale is not illogical. We didn't always know about gravity and radiation, but that didn't mean they didn't exist. Similarly, it would be illogical to think that because we don't know how God can get something done means that its unreasonable to think that He can. Pro is imagining that if the word God means the Trinity, that to say Jesus is God would mean that Jesus is the entire Trinity. Why, Pro, can't you accept that there is more than one meaning to the word God? The word \"god\" also means, simply, an object of worship, for example. And why did you not reply to the difference I gave between person and being? Also, if a man can have split personalities, and twins can be born joined together (two heads, two arms, but only three feet), why can't there be a God with three minds?\n\nEvidence Con: Pro, the scoop of flour is only part of the bag of flour, just as the Son is only part of the Triune God (Trinity), however, the scoop of flour is BY NATURE %100 flour just as the Son is BY NATURE %100 God. My point is that once you understand Christian language about God you'll see there is nothing illogical in the Trinity concept. By saying the Son is fully God we DON'T MEAN that he is the ENTIRE BEING which we know as the triune God, or Trinity. We only mean that he has all the characteristic in his nature that make him worthy to be called God, such as being omnipotent, omniscient, immutable, eternal, etc. Just as if I were to call you %100 human, I would not be claiming you are ever single human on the planet, only that you share their nature. The fact that the Son and Father and Holy Spirit are each part of a being called God, does not mean that each one of them cannot be FULLY God when the word God is used a a different sense other than a reference to the entire Trinity, namely, DIVINE NATURE. As for the quantum world, I don't have to prove its true that this can apply on our scale, only that it won't be illogical. If its not illogical for one thing to be in more than one place on the quantum scale, why should it be illogical on our scale? And why would it be illogical that a God with infinite wisdom and power would be able to even defy our limited understanding of the laws of physics?\n","DiscussionID":"00000042","Title":"the christian trinity is an illogical idea","CrawlDate":"2016/09/29 06:45:30","URL":"http://www.debate.org/debates/the-christian-trinity-is-an-illogical-idea/4/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":127,"ConclusionEndPos":169,"nextID":"00000002","PremiseStartPos":[221],"prevID":"00000000","Premise":["consider: the son is God, the father is GOd, but the son is not the father and they are not separate Gods. that's like saying five plus one equals six. two plus four equals six. but five plus one does NOT equal two plus four."],"PremiseEndPos":[447],"ArgumentID":"00000001","Conclusion":"the christian trinity is an illogical idea","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":127,"ConclusionEndPos":169,"nextID":"00000003","PremiseStartPos":[462],"prevID":"00000001","Premise":["\" So here are two person who have the same nature, which is not illogical or contradictory, for two humans can also have the same nature without the first person being the second person. \" by this reasoning the son and the father should be considered two separate beings period. which would mean we have three gods as the godhead, when christian theology says we have only one God. the flour analogy doesn't work. i see how both the components and the whole can be called flour. but that doesn't work with the trinity. to be analogous the son would be God but also part of God, part of the whole thing. this might be true linguistically but in practice has problems. the son would be a component if the flour anaology were true.... but theology says he is wholly God in himself. i know you said you are just using an inexact anaology, but you haven't shown how they can be three and one at the same time. (to be sure, to say something is three and one at the same time is on its face contradictory) \"The Trinity is a Being which has three minds (persons) within its make up.\" if this were true we could simply say the son is part of God, he's a component. this is against christian theology. again it gets contradictory cause you are trying to say he's a component yet he's also the whole thing. like saying it's three and one at the same time. your quantum idea is interesting. but that only works at the quantum level and we are talking about someone who is a human. there might be more to the idea and what con is saying is only anaologous. but he hasn't proven it to be true that someone can be one and three outside of quanta. it's like he's proving a shadow might indicate the thing he is arguing to exist but it might indicate something else too."],"PremiseEndPos":[2216],"ArgumentID":"00000002","Conclusion":"the christian trinity is an illogical idea","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":127,"ConclusionEndPos":169,"nextID":"00000004","PremiseStartPos":[2231],"prevID":"00000002","Premise":["\" Pro misses the point here. A scoop of flour is not part of flour, its %100 flour.\" actually con misses the point. it may be true that the scoop and the bag are both flour. but the scoop is still part of the bag. it would be incorrect to say the Son is part of the whole, at least id suppose that is inaccurate. con argues the quantum points indicate that three and one in principle can be a logical statement at least at the quantum level os itmight be true at our level. i dont contest that it might be true, i just contest that you havent shown it to be true, and with the info we have it at least sounds like the trinity is contradictory."],"PremiseEndPos":[2875],"ArgumentID":"00000003","Conclusion":"the christian trinity is an illogical idea","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":127,"ConclusionEndPos":169,"nextID":"00000005","PremiseStartPos":[2890],"prevID":"00000003","Premise":["There is nothing illogical about the Trinity as I will prove. My opponent thinks its illogical because he misunderstands what the doctrine of the Trinity means, thus, he illustrates it in a way that does not properly represent the concept. Gal 4:8 \"Formerly, when you did not know God, you were slaves to those who by nature are not gods.\" This suggests that unlike the idol gods of the nations, the God of Christians is God BY NATURE. Thus, the word \"God,\" when applied to individual members of the Trinity, at times carries the meaning of the specific NATURE which makes God, God. The word God in this sense does not imply a position or action role such as Creator or Judge, for before God created anything or judged anyone, he was already God according to Psalm 90:2. This does not mean that the word \"God\" does not carry other meanings when applied to God, the context must determine the meaning, just as it is with many other words which have more than one meaning, for example the word \"soul\" at Matt 10:28 cannot mean the physical body because Jesus separates it from the body when he says that they can kill the body but not the soul, and mentions \"BOTH soul and body;\" but the word \"soul\" does mean the body in Joshua 11:11 when the souls were slaughtered with the sword, and we know this must be the body because a spirit cannot be killed with a sword. Similarly, the word God has more than one meaning when applied to the True God. I have already established one of those meanings to be a reference to the divine nature which makes Him who He is, namely, omniscience, omnipresence, omnipotence, being all-loving, immutability, eternality, etc. These are some of the aspects of God's nature that make him God. Secondly, the word \"God,\" when applied to Him, can mean the Being (that is, the Trinune Being = all three persons of the Trinity) which possesses this nature of being eternal, all-knowing, omnipotent, etc. Similarly, we would say that \"human\" refers to being a mammal with flesh and blood, which is \"characterized by erect posture and bipedal locomotion, manual dexterity and increased tool use, and a general trend toward larger, more complex brains and societies.\" So \"human\" is a reference to our nature, as when one says \"I am human,\" he means that he is flesh and blood with a complex brain, he eats to live, has sex to procreate and has innate abilities to express love, hate, and other qualities. Yet, the word \"human\" also means a being that has this particular nature. To say \"he is a human\" means he is a being which has this nature. We trinitarians use the word \"God\" in a similar way, so that in one case the word \"God\" means the divine nature, in another case it means the Being which has this nature. With that understanding, we can get back to Pro's argument and say \"the Father is God\" means the Father is omnipresent, omniscient, all-loving, eternal, and all other attributes of the unique divine NATURE. To say \"the Son is God\" means the Son also has this nature. So here are two person who have the same nature, which is not illogical or contradictory, for two humans can also have the same nature without the first person being the second person. So to say that the Son is God, that is, has the same nature as the Father, would in no way imply that the Son actually is the same person as the Father. Now, to say that they are both the same God would not be to say they are the same person. Rather, it simply means they are included in the same Being which possesses this nature. To illustrate, take two scopes from a bag of flour. Now the first scoop is not the second scoop but both scoops can equally be said to be \"flour,\" just like the entire bag of flour. If you mix both scoops back into the bag of flour, they are still in there, but they are both part of the same being, the entire mass of flour. This is just an illustration and not an exact correspondence to God. But I hope you get the point. There is a difference between a being and a person. A being is the TOTAL thing, ALL OF THE CHARACTERISTICS of a thing. So the being of a chair would range from its legs and back, to the fact that its made of wood, to the every minerals and elements out of which the wood is made. The Trinity is a Being which has three minds (persons) within its make up. But a person is just one aspect of a being. So our personhood is the fact that we are conscious, intelligent and rational; but there are other aspects of our being such as the fact that we have fingers and toes, language, hair, etc...Take away any one of these and our personhood would still remain. So in short, the Father is a person with divine nature, the Son is another person with divine nature, the Holy Spirit is another person with divine nature, but these are not one person. These are one Being when taken together, Being being different from person. So when \"God\" refers to all three as one, it refers to a Being, not a single person. So 1 person the Father = 1 person the Son = 1 person the Holy Spirit = 1 Being (the Triune God = 3/3) I guess the problem Pro also has with the idea of person is the image of a person just being a flesh and blood human. But one need not have flesh to be a person. Angels are spirit beings, they don't have flesh but they are persons. And artificial intelligence would be a person if we could create one. In so much as it had consciousness, intelligence and rationality, we could imbue it with all the rights of persons. When we look at a spirit, the bodies of three spirits could literally be ONE, EXISTING in the same place at the same time without increasing mass, just as in Luke 8 a man was possessed with a legion of demons inside his body. All these spirits in one body. Science has now proven that one particle can be in three, indeed, thousands of places at the same time, while remaining one particle. So there is no reason why God cannot be in three places simultaneously as Father, Son and Holy Spirit which keeping His unity. Interestingly, in the double-slit experiment, the first particle is in another location from the second particle in order to interact with it, and yet both are one particle. This is very similar to how the Father is not the Son who interacted with Him, and yet both are the same God. So the fact that we have things in nature which reflect the possibility of how 3 can be 1 shows that the Trinity is not illogical at all."],"PremiseEndPos":[9296],"ArgumentID":"00000004","Conclusion":"the christian trinity is an illogical idea","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":127,"ConclusionEndPos":169,"nextID":"00000006","PremiseStartPos":[9311],"prevID":"00000004","Premise":["Pro says \"by this reasoning the son and the father should be considered two separate beings period. which would mean we have three gods as the godhead,\" but my reference to two humans would not imply separate beings in the case of God, only separate persons, for there is a difference between \"being\" and \"person.\" We cannot assume that God's nature must be exactly like ours so that he cannot be tri-personal, that is, having more than one person in his being. He says \"the flour analogy doesn't work. i see how both the components and the whole can be called flour. but that doesn't work with the trinity. to be analogous the son would be God but also part of God, part of the whole thing. this might be true linguistically but in practice has problems. the son would be a component if the flour anaology were true.... but theology says he is wholly God in himself. i know you said you are just using an inexact anaology, but you haven't shown how they can be three and one at the same time. (to be sure, to say something is three and one at the same time is on its face contradictory).' Pro misses the point here. A scoop of flour is not part of flour, its %100 flour. A scoop of flour is BY NATURE %100 flour. Its not partially flour just because its not the whole bag of flour. It being part of a larger mass doesn't mean its nature is different from the whole thing in any way. So the Son is part of the triune God, but is BY NATURE %100 God, that is %100 divine, wholly omniscient, omnipresent, eternal, etc. So just as a scoop of flour is part of the whole bag of flour and at the same time is fully BY NATURE \"flour,\" having all the attributes of flour, Jesus is part of God (the triune being) while being fully God in the sense of having all the attributes (or the nature) of God. Pro says \"if this were true we could simply say the son is part of God, he's a component. this is against christian theology. again it gets contradictory cause you are trying to say he's a component yet he's also the whole thing. like saying it's three and one at the same time.\" But Christians don't believe Jesus is the entire Trinity. Pro doesn't seem to get that we are using the word \"God\" in two different ways. Jesus is not God in the sense that He is the entire Trinity, but he is God in the sense that he is omniscient, all-knowing, all-loving, eternal, immutable, etc. In other words, He is God BY NATURE. He is FULLY God means that He has all of these attributes I have listed that makes God such a unique and awesome being. So Jesus is God in one sense, and a part of God in another sense. No contradiction here. Pro argues that \"your quantum idea is interesting. but that only works at the quantum level and we are talking about someone who is a human.\" How does Pro know that it can only work at the quantum level? A quantum mircrophone, big enough for the eye to see, can vibrate an not vibrate at the same time. Our knowledge, science and technology is improving. A God whose knowledge is literally infinite would be able to do much more beyond what our Science can do, and its not illogical to think that He could. Just because we don't know scientifically how to do it, doesn't imply God would not. An ant cannot comprehend how its possible for us to build a car, and the difference between us and God is much wider than the difference between us and an ant! The idea that someone with the amount of knowledge and power God has (limitless) would be able to get quantum effects on a large scale is not illogical. We didn't always know about gravity and radiation, but that didn't mean they didn't exist. Similarly, it would be illogical to think that because we don't know how God can get something done means that its unreasonable to think that He can. Pro is imagining that if the word God means the Trinity, that to say Jesus is God would mean that Jesus is the entire Trinity. Why, Pro, can't you accept that there is more than one meaning to the word God? The word \"god\" also means, simply, an object of worship, for example. And why did you not reply to the difference I gave between person and being? Also, if a man can have split personalities, and twins can be born joined together (two heads, two arms, but only three feet), why can't there be a God with three minds?"],"PremiseEndPos":[13597],"ArgumentID":"00000005","Conclusion":"the christian trinity is an illogical idea","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":127,"ConclusionEndPos":169,"nextID":"00000000","PremiseStartPos":[13612],"prevID":"00000005","Premise":["Pro, the scoop of flour is only part of the bag of flour, just as the Son is only part of the Triune God (Trinity), however, the scoop of flour is BY NATURE %100 flour just as the Son is BY NATURE %100 God. My point is that once you understand Christian language about God you'll see there is nothing illogical in the Trinity concept. By saying the Son is fully God we DON'T MEAN that he is the ENTIRE BEING which we know as the triune God, or Trinity. We only mean that he has all the characteristic in his nature that make him worthy to be called God, such as being omnipotent, omniscient, immutable, eternal, etc. Just as if I were to call you %100 human, I would not be claiming you are ever single human on the planet, only that you share their nature. The fact that the Son and Father and Holy Spirit are each part of a being called God, does not mean that each one of them cannot be FULLY God when the word God is used a a different sense other than a reference to the entire Trinity, namely, DIVINE NATURE. As for the quantum world, I don't have to prove its true that this can apply on our scale, only that it won't be illogical. If its not illogical for one thing to be in more than one place on the quantum scale, why should it be illogical on our scale? And why would it be illogical that a God with infinite wisdom and power would be able to even defy our limited understanding of the laws of physics?"],"PremiseEndPos":[15027],"ArgumentID":"00000006","Conclusion":"the christian trinity is an illogical idea","PremiseStance":["Con"]}}]}