{"MetaData":{"Context":"URL: http://www.debate.org/debates/Intellectual-Property/2/\nCrawl date: 2016/09/29 05:52:55\nDebate Topic: Intellectual Property | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: According to Con, economic scarcity is what constitutes whether or not something can rightfully be considered property. The dictionary defines property as being that which a person owns, so the question essentially becomes whether or not one can claim ownership of their ideas. I'll begin by addressing what we can rightfully own. My opponent has agreed to discuss IP within a capitalist framework, which of course embraces private property (that is - what an individual can claim as belonging to them, or what they have authority over pertaining to that of which they own). Legitimate ownership is either granted or inherent. For instance, if I decide to give Con the book that I own, he would become the new owner. Without granting Con ownership of my property, assuming it as his own would simply be stealing. On the contrary, inherent ownership isn't necessarily granted but recognized by acknowledging one's right to the fruits of their own labor. Ergo, if I bake a cake, it is understood that the cake is my property. One cannot be forced to labor for another, nor can one expect that another be compensated for the labor of someone else. In a capitalist society, compensating labor is agreed upon by accepting labor. For instance someone else must get my permission before expecting to benefit from my labor without paying me; they are not simply entitled to it without my consent (that's slavery). Keeping that in mind, it seems one can indeed own their labor as property. After all this was the very logic behind property to begin with; the idea that property (land) would become yours just because you worked on it. In other words, labor --> property. As such, what one can inherently own (like labor and ideas) is really the purest form of ownership that there is. I am completely responsible for my labor - it was produced by me, and only exists because of me - which is not the case with land. Thus all the capital going into making scarce goods comes from resources never legitimately owned anyway, unless you accept the concept that laboring for something grants ownership which capitalists do. In that case, it seems that things like labor and ideas are the best examples of rightful ownership; these things would not exist without actual productivity of a particular agent who could grant ownership of them authentically. So far Con has made it seem that IP is simply referring to the concept of protecting the monopolized rights to one's idea, instead of acknowledging that IP seeks to protect the rights to one's labor. Indeed the kind of ideas we are discussing are not just frivolous thoughts, but often the result of tireless hard work and dedication (not to mention money spent on education to help shape these ideas). For instance, a computer programmer might work relentlessly to figure out an algorithm that would make an awesome feature on a particular website. A fellow programmer with more opportunities and/or resources (capital) might be able to apply that algorithm to use this application on a bigger scale at a faster rate and receive a lot more money on its behalf. As a result, the second programmer profits immensely and perhaps unfairly based on the first programmer's labor. Without Programmer 1's permission to profit from his work, this is equivalent to theft. Con's advocation rewards not the person whose labor is most significant, but the person who already has the capital to implement an idea most effectively. In this example, it would greatly devalue the labor that the first programmer should have some compensation for. Consider this scenario: Suppose I worked retail and spent 30 minutes with a customer convincing her to buy more items, thus earning me more commission. However at the last minute, my co-worker decides to ring up the customer I worked with because their register is working faster than mine. As a result they are compensated for my work without my permission. Even if they didn't technically violate any rules, we can see how this is problematic and unfair. The \"first mover\" theory is not always applicable; one is not always appropriately compensated for their original work. If they are, they will likely be exploited. Con says people should only have rights to their idea since that's all they've created. With the algorithm example, a formula might just be a bunch of numbers and letters, but applied in a certain context it could mean huge amounts of compensation. Should the algorithm's designer not receive anything because the letters and numbers themselves are inherently worthless? Or do we acknowledge labor as worthy of pay even if technically something has no inherent worth? For instance massage therapy is \"worthless\" unless we give it value. IP laws protect the idea that one's labor is of value even if it can't be represented physically with a material item. Labor doesn't only refer to the actual production of a product, but also work on an idea that becomes integral toward a product's production. Regarding the the economy, Con notes that IP creates monopolies that are bad for competition and increase costs. However it's easy to combat this argument by using capitalist principles themselves. The market determines a product's value, therefore an item that is priced too high would not be embraced. The laws of supply and demand would be effective at decreasing the product's cost. Lowering prices for the masses is not a sufficient argument for abandoning IP, just as it's not a sufficient argument for setting a price ceiling. Con also says that patents hinder innovation when in fact they encourage it. They promote the publication of useful ideas at the price of giving the one who publishes an idea a temporary monopoly over it. This encourages innovation among competitors to come up with alternatives or improvements thereby fostering and enhancing innovation and competition, while still ensuring the creator is appropriately compensated for their intellectual contribution. Because patents are temporary, I reject Con's assertion that they make it impossible for others to build or improve upon existing ideas. Economists estimate that two-thirds of the value of large businesses in the U.S. can be traced to intangible assets, and note that \"IP intensive\" industries are estimated to generate 72 percent more value than non-IP industries indicating these laws do not hinder but help the economy [1]. Additionally, evidence shows that there is a positive and strengthened impact of the IP system on areas such as research and development, foreign direct investment and technology transfer [2]. We should consider the relevance of IP laws today instead of relying on a flawed example like Watts, who operated during a time when IP laws were much more stringent. It's possible to reform IP laws to suit the needs of today's economy. One option are IP pools which \"may provide pro-competitive benefits by integrating complementary technologies, reducing transaction costs, clearing blocking positions and avoiding costly infringement litigation\" [3]. The high cost of research and development in such competitive global markets has increased the need to minimize these costs, while reducing the risk of failing to create marketable products. To combat this we've figured out that product standardization and joint product development is helpful, which is sustained and encouraged via the concept of IP [4]. Con has said that his burden is to show that IP rights are not legitimate property rights (which I feel I have negated), and that society is better off without them. Of course this is irrelevant; a capitalist system does not care about what's good for society, but rather protecting the rights of the individual - which makes IP even more appropriate. [1] [2] [3] U.S. Department of Justice and Federal Trade Commission [4]\n\nEvidence Pro: -- Labor as Property -- Con has given several examples of entities benefiting from another's labor, though none of them profit from another's labor meaning these analogies do not apply to my argument. The overall economy might benefit from my labor, but that is an abstract contribution without a clear benefactor. Moreover choosing to enter the workforce is a voluntary action, meaning a worker agrees to this exchange. My neighbors might benefit from my kept lawn, but they are not profiting. There are only two entities I can think of that directly profit off another's labor: employers and the government. With employers, the worker understands this notion and agrees to it making it another voluntary exchange. With government, the worker does not agree to others profiting from their labor which is why capitalists consider it theft. Indeed the government profits from said labor even if there is no scarce item produced, such as income taxes for child care. -- Ownership -- Con writes, \"Building a farm on un-owned land grants me the right to continue growing crops on that land.\" Of course this begs the question of what makes something owned. In the last round I explained that ownership is either inherent or granted. If land is un-owned, there is no rightful owner to grant it to another nor does it inherently belong to someone. My opponent suggests that because one's labor on it produces something useful, it therefore becomes property. In that case, my labor to write a song makes the final product useful (assuming others want to listen to it) meaning my labor should constitute as property by Con's own standards. Remember that property is merely defined as something which you own. This debate is about whether or not you can claim ownership of something you produce even if it's not scarce (though Con concedes the scarcity of good ideas). So far I've explained why labor rightfully \"belongs\" to the agent; it is something another cannot rightfully take or force from you without your consent. It also \"belongs\" to someone because a particular agent is responsible for its existence. This means it can be more legitimately owned than any piece of land in which any original grant of ownership was completely arbitrary. Con has not responded to this argument. So far Con's response has been that only useful labor constitutes property. If another wants to implement my idea, then clearly it's useful and Con has defeated his own argument. -- Scarcity -- Con clarifies \"Ownership merely means the right to use something as you see fit.\" In that case I see no reason why labor would not apply, and again I maintain that if there's anything we should have complete control over it's our labor. Con's point is that you can only own something that is scarce. He writes, \"My use of an idea does not stop you from using it, so it is not theft.\" First, I never claimed that using an idea is theft -- I claimed that using the fruits of another's labor without their permission and without compensation is theft. Second, this does not fit within the parameters Con has distinguished for ownership. Con clarifies, \"If you take my car and are using it, then I can no longer use it -- that's what makes it theft.\" However I could easily take Con's car and utilize it how he sees fit, meaning he would still own it by his standards. Nevertheless an inventor or creator expects their work to be utilized the way they see fit just as a business owner expects their workplace to be run the way they see fit. Owning a business (not the structure itself -- in fact some don't operate within a specific structure) is just as abstract as owning an idea, yet Con does not seem to have a problem with owning one of those despite it not referencing a scarce material. In other words, you can own labor. -- Programmer Example -- In the last round I gave a programmer example and Con responded predictably with his first mover theory -- the one I already noted as unreliable. He claims that theft can only exist if one programmer took the literal piece of paper the algorithm was written on. This seems backwards: if property exists to protect that which is scarce, then clearly the knowledge behind the algorithm is A LOT more scarce than a piece of paper. By this logic the knowledge (or labor put into it) should again be rightfully considered property by Con's standards. Con cannot guarantee that one will be rightfully compensated for their contribution either. -- Value of Labor -- Suppose I spend a year writing a book and then sell 10 copies for $10 a piece. One buyer makes copies of my book and sells 10 more copies of it for $9 a piece. The second person profits immensely from significantly less labor which seems blatantly unfair. However Con writes \"But what seems 'fair' or 'unfair' is not how property rights are determined.\" Oh? Then why is it determined that only scarce goods constitute as property? I'm assuming it has something to do with FAIR exchange and protection of that which is owned to protect from UNFAIR exploitation. The fairness of something seems absolutely relevant in a philosophical debate that is ultimately about a concept (property). I'm saying it's fair to protect one's labor just as it is fair to protect one's goods. If fairness isn't an issue, then let's scrap the concept of property all together and live in a commune. -- The Economy -- First, Con says that IP creates a monopoly which makes the laws of supply and demand ineffective. This is narrow-minded considering competition is not the only way to drive down prices. If Starbucks charged $10 for a coffee, then even without their competitors (Dunkin Donuts, Gloria Jeans, etc.) I wouldn't buy it. The price must be appropriate for the market to accept it. Second, Con first acknowledges that IP increases innovation and then says it doesn't. I've explained that (a) IP increases profits for inventors which provides incentive, and (b) innovation is not only likely but necessary if you cannot rely on replicating the idea of another to become successful. I also completely reject the idea that having to build on another's patented idea decreases profits and therefore incentives. People always come up with new ways to profit. For instance the Industrial Revolution was about factories; the Dot.com era was about the internet and now we're headed into an economy zeroing on in Green industries. This means the economy would evolve even with IP in place, because entire new industries are established. Con's also ignored my argument that patents are temporary, let alone the fact that they could become a lot more flexible. Finally Con says we cannot attribute the success of IP intensive industries to IP unless we demonstrate that IP itself was responsible for some of the growth. Considering this is a 4 round debate, I've utilized this round to discuss IP in a philosophical way -- in other words to explain why there is absolutely a justification for it's existence in a capitalist system. In the next round I will focus more specifically on the economic arguments and pharmaceutical example, as well as mention some other possible reforms. -- Conclusion -- The concept of property exists solely to protect one's assets and ensure that they can profit from their labor. Businesses sell either goods or services. Because people profit from their labor all the time without producing scarce goods (i.e. musicians, teachers, doctors, physicists, astronauts, etc.) then it makes no sense to suggest ONLY material items can be protected as property. Suppose Con agreed to pay me $20 for cleaning his room, and afterward refused to pay me because I did not provide him with a scarce material. You might say he is still liable for payment because of his agreement to pay me for my labor. Intellectual Property simply seeks to establish an agreement to pay an inventor for their labor. It is completely justified.\n\nEvidence Pro: -- Property -- A) Con begins to explain that \"benefit\" and \"profit\" are synonymous. A benefit is something that is advantageous or good; profit is pecuniary gain resulting from the employment of capital in any transaction. Clearly the two are not the same thing. I've argued that you can benefit from another's labor, but you cannot profit from it without their voluntary consent or it is theft (such as what the government does). Con didn't explain why it's not theft, and he never gave an example of an entity that rightfully profits from another's labor without their consent. The argument that benefiting = profiting is clearly untrue; a simple glance at the dictionary will reiterate that. Even abstractly speaking, I benefit from having a clean apartment but I do not profit from it. I'm quite confident the audience will understand this distinction. B) Con asserts, \"What I did say is that property rights are determined by *use,* not usefulness\". Of course the audience should keep in mind that this is nothing more than his opinion of what should constitute as property, and in fact we're debating what property should be so merely repeating the argument is not a contention in his favor. Nevertheless income from one's product is a form of use, so it is not the case that sharing IP is loss-free to the sharer. While sharing IP may not involve loss of possession or loss of personal use, the loss of income incident to such sharing is a true and significant loss not to be dismissed [1]. C) Con conveniently tries to make a distinction between ideas and labor which I've already demonstrated as indistinguishable. The 'idea' to be protected in this context is not just a frivolous thought, such as having the idea to put a jacket on when it's cold. Instead it's the RESULT of labor - labor that deserves to be paid to the fullest extent of its value. I'm arguing that the intellectual know-how into say producing a computer algorithm is far more valuable than the piece of paper it's written on. Ergo, it's absurd to compensate someone simply for the price of the paper and labeling it a fair trade as Con suggests. D) Ayn Rand writes, \"Patents and copyrights are the legal implementation of the base of all property rights: a man's right to the product of his mind\" [2]. She's also clarified, \"What [IP] laws acknowledge is the paramount role of mental effort in the production of material values... By forbidding an unauthorized reproduction of the object, the law declares that the physical labor of copying is not the source of the object's value; that the value is created by the originator of the idea\" [3]. This combats Con's repeated assertion that labor alone determines value, and supports my position that the labor going into an idea is just as if not more valuable than the labor itself. What Con advocates is essentially likened to plagiarism: benefiting (in the form of profit) by reproducing another's ideas. E) Property is about ownership. Con repeats, \"When you build a farm on un-owned land, you own the land in the same sense that you own your body -- you have the exclusive right to use that particular thing.\" In this way Con makes it seem as if it's a first-come first-serve basis; the first to \"un-owned\" land gets it. I still see no distinction between this and an idea. First to the idea gets to \"own\" it. So far every one of Con's explanations for justifying tangible property is equally applicable to intangible property. I've already thoroughly combated and explained how IP pertains to economic scarcity. Additionally, Con never addressed my analogy regarding owning a business (a word representing an abstract idea simply referring to the labor your provide). -- Economics -- A) Obviously IP increases an item's value because of lack of competition for selling that product. However in Round 1 I pointed out that this was not a sufficient reason to abandon IP, just as implementing price ceilings to keep costs down are not a sufficient reason to implement those. In other words, this is true but not at all relevant in a capitalist system. B) Con says IP increases costs for inventors (because they have to compensate others if they use something patented), and therefore, \"it's not clear\" that IP increases profits for inventors. This could not be further from the truth. If one didn't profit from their endeavors, they wouldn't invent anything. The fact that they do shows why this reasoning is blatantly false. They're obviously profiting regardless of any existing IP law or they would stop. C) Con notes higher development costs necessarily means higher costs for the people. Absolutely, but that's entirely irrelevant considering capitalism doesn't seek primarily to implement policies that keep prices down, but rather protect the rights of the individual as I explained. In fact high development costs is an argument in favor of IP. Going back to Con's pharmaceutical example, he forgets to mention that this more than any other technology-based industry has come to rely on patents as the primary mechanism to promote innovation [4]. D) While pharmaceutical products rely on substantial amounts of upfront investment and technical knowledge, it is easy to copy once they are widely distributed. As such, there is less incentive to put so much investment into something with a small pay-out. Providing market exclusivity to an inventor through patent protection can encourage the initial outlay of resources needed to develop the product [5]. It costs about 400 million dollars and 10-12 years of labor to do this kind of work [6]. Con thinks it's not fair yet \"reasonable\" for another to profit immensely from another's investment of this magnitude without *significantly* less time, money and work put into it. E) There are also moral concerns. Ambassador Tarso reveals, \"A new generation of antibiotics - not available in Brazil because of lack of an adequate patent law - saved me\" [7]. Lack of protection is inhibiting inventors from making their products available in parts of the world that do not favor IP, which can have detrimental effects including the loss of human life. IP including pharmaceutical patents enhance the conditions for investment, improve the quality of goods and stimulate indigenous innovation, creating better jobs and opportunities for local inventors [8]. F) Con said that historically the pharmaceutical industry grew much faster in countries were patents were fewer and weaker citing Germany and Italy as examples. What time period is Con referring to and can Con prove IP was relevant? A 1988 study of 12 industries indicated that 65% of pharmaceutical products would not have been introduced into the marketplace, and 60% would not have been developed in the absence of adequate patent protection [9]. Moreover in the 10 years after Italy instituted its pharmaceutical patents, retail and wholesale prices rose much less than did prices in general and less than the price index for health-related goods and services [10]. This shows how the institution of pharmaceutical patents does not necessarily lead to price increases. Because the U.S. has such strong IP combined with a lack of price control, this stimulates fierce competition among products competing in the same therapeutic class. This helped us achieve the smallest Producer Price Index increase in pharmaceuticals in the past 20 years [8]. G) The strength of a country's IP regime was clearly identified in a study by the International Finance Corporation, an arm of the World Bank: \"We find that the strength or weakness of a country's system of IP protection seems to have a substantial effect, particularly in high-technology industries, on the kinds of technology transferred by U.S. firms to that country. Also, this factor seems to influence the composition and extent of U.S. direct investment there\" [11]. SOURCES:\n\nEvidence Pro: -- Property -- Con begins, \"Pro argues that my claim... is wrong, but conveniently fails to respond to my argument that some of those 'benefits' really are monetary profits.\" The thing is - I don't have to. In fact, I specifically *agreed* with this notion in the last round. I'll repeat, \"What Con advocates is essentially likened to plagiarism: benefiting (in the form of profit) by reproducing another's ideas.\" I specifically pointed out that benefits can be and often ARE monetary profits, so what exactly is Con's point? I have no incentive to argue this notion and have even explained why it works in my favor. I could just as easily point out that Con has failed to respond to the quandary regarding this very issue: plagiarism. Moreover likening the alleged value of one's kept lawn to the behemoth worth of say finding the cure for cancer is an unreasonable analogy. Next Con writes, \"Pro also argues that my claim... is only my opinion -- but so is her claim... The difference is that my claim makes sense...\" A bare assertion indeed. However, I explained that while sharing IP may not involve loss of personal use, the loss of income incident to such sharing is true and significant. Con responded by saying this was analogous to a store owner with a monopoly on stores. Once again, I contend that this is a manipulative analogy. As I explained, this debate is essentially a philosophical debate about what should constitute as property. I could just as easily turn Con's logic against him regarding physical property. By claiming the land where one chooses to build his store is his \"property,\" he's simply relaying a metaphorical idea - specifically one that exists to allow him to utilize his \"property\" as he sees fit, and possibly to generate profit. The same concept applies with IP. Yes land exists as a physical entity, but so often so do the fruits of one's labor. Nevertheless the concept of land being \"property\" is completely abstract and has meaning only because we say it does. We say it's reasonable for someone to be able to own (determine use) of it, and/or be compensated for work on it accordingly. Similarly, Con cannot suggest the absurdity of claiming the validity of IP, because the same logic used to justify it is the same logic applied to material property. Think of it this way -- Con says if he farms certain land, it becomes his property. Why then can I not farm the same land and have it also be my property? It's completely contradictory for him to say this abstract idea of property can only apply to that which is tangible because it is useful. Ideas are exceptionally useful. As Ayn Rand explained, copyrights can be seen as a debt to the inventor by those that profit from copying it. Con concerns himself with the labor of the copier, but the copier is compensated for their labor with IP existing as well. They are simply offering some earnings to the one partly responsible for their profit, just as some of a worker's earnings go to the company they work for. To insist on ignoring property and rewarding only labor is to be a communist. Additionally, keep in mind that debts cannot be perpetual, and similarly, the terms of IP are and can be further limited - for instance to one's lifespan. In this way IP is *better* than real property. While that can be passed on to undeserving heirs, IP seeks not to create feudalistic generations of perpetuated wealth but rather justly compensate the most useful and thus deserving agent. Such is a prime tenant of the capitalist philosophy. Con continues, \"I obviously don't mean the price of the original paper that idea is written on... I said is the creator has the right to whatever someone will pay for the right to use the idea first.\" Actually, Con specifically said in Round 3, \"The original copy of the idea, whether it is on paper or in the programmer's head, is what the programmer owns.\" This validates my contention: that if someone compensates an inventor for the price of paper whatever information was written on, that Con would consider it a fair trade. He also notes that the original copy of the idea - even in someone's head - has the right to be owned. This is the concept behind IP, so it seems my opponent has conceded :) Con concludes by saying I have not justified monopoly rights on ideas. That is ludicrous considering this is what the entire debate has been about. -- Economy -- A) Moot point - we're in agreement. B) Con writes, \"Because the effects [of incentives for inventors] go both ways, we must look at empirical evidence to see whether or not IP increases innovation.\" The empirical evidence I presented defends my point. Additionally studies show the merit of IP may not only be regarding raising the number of innovations, but changing the direction of innovative activity [1]. C) Con writes, \"Current pharmaceutical companies exist in a world with patents, so obviously they use them.\" My point was that they have thrived specifically from using them -- a contention Con never refuted but merely denied contrary to all evidence. Con also insists pharm industries were fine without patent protection in the past, but I've proven they've boomed since and explained the direct correlation to IP. D) Con suggests that it's because of patents that R&D costs for pharm companies are so high. On the contrary, \"This rapid rise in R&D costs has been driven largely by steep increases in the costs of clinical testing, which have grown 5x as fast as preclinical testing costs\" [2]. Moreover he says it's completely wasteful for companies to compete by improving drugs. I guess what some call wasteful others call innovative. E) Con says, \"If patents were abolished, pharmaceutical companies wouldn't be less likely to sell their product in Brazil than they are to sell it anywhere else.\" If patents were abolished, perhaps the necessary investment into said drugs would never have existed. F) Con concedes that patents increase pharm innovation, but says some ask for excessive royalties inhibiting certain R&D. First, the pharm royalty rate for pre-clinical testing is only 2% [3]. Second, the high payoff also attracts many companies to compete, increasing the pace of drug development thereby negating this assessment. He also says it *must* be true that patents lead to dramatic price increases, despite my sources (specifically #10) and explanation in the last round stating otherwise. However he's given no actual rebuttal - just a false statement in response. G) People want to invest where they're protected. Makes sense. -- Conclusion -- My esteemed opponent has failed to give reason we ought to recognize property and not IP. The scarcity argument was not justified. He'd said that air is not property because we can breathe as much as we want without interfering with anyone else's ability to use the air, and similarly, IP should not be property for the same reason. This is another inapplicable analogy. Air is not property because it isn't scarce, but because nobody owns it, nobody's produced it with the fruits of their own labor, it was not granted from one rightful owner to another, and nobody can realistically protect that asset (though you can with both property and IP). So again I repeat -- the same logic applicable to property rights is also applicable to IP, and my opponent hasn't proven otherwise. If you think someone who has done virtually no work in comparison, but is significantly inhibits your gains on something you've put massive amounts of investment into without your consent is wrong - and that you should have at least temporary ownership of your original idea for at least a short amount of time (maximum being the span of your life) - then you support IP and should vote PRO. Furthermore I've explained and proven the merits and responsibility of IP within a functioning capitalist economy. SOURCES:\n\nEvidence Con: My position is that Intellectual Property should be abolished. My burden of proof is to show that IP rights are not legitimate property rights, and that society is better off without them. Definitions: Intellectual Property- Copyrights and patents. Abolished- IP should no longer be granted legal recognition. Intellectual Property (IP) is not real property. To see why, look at what exactly property is. Actual property includes things like land, food, cars, etc. These things have one thing in common: they are scarce. (That is, the economic definition of scarce, meaning that there aren't enough of them for every person to have as much as they want) That's why air, for example, is not property, and cannot be bought and sold. Everyone can have as much air as they want without taking away anyone else's air. What does this have to do with IP? IP, since it is an idea rather than a physical good, also is not scarce. Everyone can posses an idea without taking it from its creator. That's the difference between internet \"piracy\" and real theft: with theft, someone gains something by taking from someone else, but with \"piracy,\" someone gains something without taking anything from anyone. But aren't good ideas scarce? Sure, once someone has a good idea, copies of that idea aren't scarce, but isn't the supply of the original good ideas scarce? Yes, they are. But all that this means is that inventors and artists have property rights in the original copy of their idea, since that is all they've created. IP laws are not necessary for this—it's obviously already theft to steal an author's unpublished manuscript from his house, or an inventor's initial blueprints. Creator's have property rights in the original copy of their ideas, and can sell these original copies like the creator of any other good could do. As I will explain below, this is how creators could be compensated for their work without an intellectual monopoly on it—for example, inventors can sell the results of their ideas first, before anyone else. This \"first-mover\" advantage is extremely valuable, and can adequately compensate innovators, as I will show. But then what is IP? It is property in name only. It's nothing but a coercive government-granted monopoly on the right to sell a certain good. The government could grant GM the exclusive right to sell cars and label it a form of property if it wanted to. In fact, that was the origin of IP laws. In England, IP rights were originally considered the same form of monopoly as the East Indian Trading Company's monopoly on selling tea. The Economics of Intellectual Monopoly Of course, at a basic level, the economic consequences of intellectual monopolies are clear. As with any monopoly, it creates higher costs and lower quality and variety of goods for the consumer. But, supposedly, intellectual monopolies are special. They are supposed to be necessary for innovation. In this next section, I will briefly explain why this belief is false, and, in fact, the opposite is true. Books- Many people believe that IP rights are necessary to give authors incentives to write. After all, if anyone could just copy a book and then sell it themselves, authors wouldn't make any money, would they? They would. Books make 80% of their profits in the first 3 months [1], so someone taking the time to copy and re-sell the book wouldn't have time to distribute it before most of the profit is already earned. Authors could sell the initial manuscript of their book to a publisher, rather than selling the rights to the book. They wouldn't make as much money of course, but they would certainly be able to make a living. Well, that's all fine in theory, but what about in practice? How do I know that it would actually work the way I say? For most of history, IP laws did not exist. Authors managed to produce great works just fine. Take Shakespeare for example. Most of his plays are basically plagiarized from other stories. If those stories had been copyrighted, he wouldn't have had time to write all of the great plays he wrote with all the court battles he'd have to deal with. He also managed to have enough incentives to produce what are widely considered the greatest written works in the English language without requiring an intellectual monopoly. Not only that, but if he was given an intellectual monopoly, he would have spent a considerable amount of his time suing copyright infringers rather than producing plays. Another example is British authors during the 19th century. They enjoyed an intellectual monopoly on their works in Britain and did not in the U.S. But they still earned more profits from the U.S. market than from the British market. For a more modern example, look at the 9-11 Commission Report. It had no copyright restrictions on it; anyone could download it for free off of the internet or publish a copy themselves. But despite this lack of monopoly protection, Norton's edition (the first publisher to sell it) became a bestseller and made more than $1 million in profit. [2] A different publisher, St. Martin, released its own edition with additional analysis which also became a bestseller. [2] Innovation- Contrary to popular belief, IP hinders innovation rather than encourages it. Patents can increase the amount of revenue an inventor would receive for a given idea, but this greater incentive does not necessarily translate into more ideas. Patents also discourage innovation by causing patent-holders to waste much of their time suing people who violate their monopoly rather than inventing. Patents also discourage innovation by restricting the ability of people to improve on existing ideas. Look at the invention of the steam engine. James Watt thought of the idea in 1768, but production didn't really start until 1775, when his monopoly was secured until 1800. Production was slow during those 25 years, and exploded afterwards, and when a superior steam engine was developed, Watt spent most of the 1790s suing its inventor. [3] Because of Watt's monopoly, innovation stalled during those years, with fuel efficiency, for example, stagnating during Watt's patent, but increasing by a factor of five by 1835. [4] This delay of innovation had serious consequences, as the industrial revolution only took off in England after Watt's patent expired and the industry could thrive. But would Watt have had the incentive to invent the steam engine if patents didn't exist? Yes. He actually made most of his money after his patent expired. He was forced to constantly innovate to keep up with the competition, and, as a result, his steam engines were recognized as the best ones and thus the best-selling. What about pharmaceuticals? Don't we need patents for those? No. Historically, the pharmaceutical industry grew much faster in countries were patents were fewer and weaker. The unprotected German industry, for example, grew much faster than the protected British industry, which is the opposite of what you'd expect if IP laws actually encouraged innovation. [5] And when countries did introduce patents, they saw no significant increase in innovation. Switzerland and Italy both had thriving pharmaceutical industries without IP laws, until they were introduced in the late 1970s. [6] Contrary to what one would expect if IP laws actually worked, neither country saw an improvement in pharmaceutical innovation. [6] Sources: [1] Flint, E. (2002), \"Prime Palavar #6,\" April 15. [2] Michele Boldrin and David K. Levine, Against Intellectual Monopoly (New York: Cambridge University Press, 2008), 25. [3] Carnegie, A. (1905), James Watt. Doubleday, Page & Co. [4] Lord, J. (1923), Capital and Steam Power. London: P.S. King & Son. [5] Michele Boldrin and David K. Levine, Against Intellectual Monopoly (New York: Cambridge University Press, 2008), 215. [6] Scherer, F. M (2003), \"Global Welfare in Pharmaceutical Patenting,\" mimeo Haverford College, December.\n\nEvidence Con: Property: Pro writes, \"For instance someone else must get my permission before expecting to benefit from my labor without paying me; they are not simply entitled to it without my consent (that's slavery).\" While her conception of what constitutes property and theft seems right at first glance, it becomes absurd when closely examined. Simply benefiting from your labor without your permission does not constitute slavery, unless I forced you to do that labor. Take, for example, positive externalities. If I work hard to get an education, the economy as a whole benefits, even though I never gave anyone my permission to benefit from my labor. Is this slavery? If I keep a nicely-kept lawn and house, my neighbors have higher property values than if I had been lazy and had a messy lawn and crappy looking house. They benefit from my labor without my permission, and give me nothing in exchange for their benefits. Are my neighbors enslaving me? Obviously, using the benefits from labor as the criterion for what property is and isn't leads to ridiculous conclusions. In addition, labor itself isn't the basis for property. If I throw a can of paint into an un-owned ocean, and the paint dissipates through the water, do I then own that body of water? Do I get to decide who may or may not use it? If not, then why does mixing my labor with farmland grant me ownership of that land? Is it because farms are useful—but, then, how does one define \"useful\"? The correct way to determine how one acquires property is through use. Building a farm on un-owned land grants me the right to continue growing crops on that land. Throwing paint in an un-owned body of water grants me the right to throw more paint in that water. So what is ownership? Ownership merely means the right to use something as you see fit. If I own a car, then I have the right to use it however I like, as long as I don't infringe on anyone else's rights. If you take my car and are using it, then I can no longer use it—that's what makes it theft, and an infringement of my rights. That's what makes scarcity important—your use of the air doesn't stop me from using air, so the idea of \"ownership\" of air is absurd. Ideas are the same as air—my use of an idea does not stop you from using it, so it is not theft. Programmers example: This scenario does sound rather unfair. But what seems \"fair\" or \"unfair\" is not how property rights are determined. Regardless, that is not exactly what would happen in the absence of IP laws. The first programmer does have property rights in the original copy of the algorithm—the 2nd programmer isn't allowed to hack into his computer to get it. The 1st programmer can use it himself—it wouldn't matter that the 2nd guy had more resources; the 1st guy could get his operation up and running before the 2nd programmer knew the algorithm existed. Sure, the 2nd programmer could copy the 1st—just as the 2nd person to learn how to plant crops copied the 1st. The copier is benefitting from the innovator's labor, but the original creator isn't losing anything he actually owns. The 1st programmer and farmer would probably have higher future profits if their copiers couldn't compete with them, but people do not have property rights in potential profits; they can only have property rights in things they actually have. Or, he could sell it to the 2nd programmer, and make a profit that way. Neither situation involves theft. Economy: My opponent states that, \"The market determines a product's value, therefore an item that is priced too high would not be embraced. The laws of supply and demand would be effective at decreasing the product's cost.\" That is what would happen—in a free market. In the case of IP, the market cannot decrease the product's cost, because the granting of a monopoly artificially restricts the supply. Pro correctly points out that granting a temporary monopoly for the sale of an idea increases the profits and therefore the incentives of innovators, which results in more innovation. But that's only half of the equation—intellectual monopolies also increase the costs of innovation, because the vast majority of innovations are built on the innovations of others, and those innovations would also be patented. This increase in costs decreases profits, decreasing incentives to innovate. But which effect is greater—the increase in revenue for innovators or the increase in costs? Let's look at the empirical evidence. The examples I used before stand. Pro claims that the Watt anecdote does not, because IP laws were more stringent back then, but this is blatantly false. IP laws have only gotten more and more stringent since Watt's time. In addition, she failed to address my points about the pharmaceutical industry. Even if an example from a long time ago doesn't count, the evidence that pharmaceutical patents did nothing to increase innovation is fairly recent, and clearly still applies. If patents really did increase innovation, then surely the evidence from the pharmaceutical industry, of all industries, would reflect this. Pro's arguments—that innovation requires a large investment of money, labor, and time—fit perfectly with the pharmaceutical industry, where drugs cost hundreds of millions of dollars and years, or even decades, to develop. But the empirical evidence shows that IP laws did not increase innovation in this industry. Studies of IP's effect on other industries have the same results. IP laws do not increase software innovation, for example. [1] [2] Pro also claims that \"IP-intensive\" industries generate 72 percent more value than other industries, but so what? This proves nothing, unless Pro can show that IP laws were responsible for that success, rather than something inherent about those industries. She can't do this because it isn't true. Studies comparing these industries before and after IP laws, such as the evidence from pharmaceutical industries mentioned earlier, show that IP does not increase innovation. Pro suggests IP pools as a potential reform of IP law. These already exist—and the result is cartels rather than monopolies. Large firms often pool their patents with each other, but not with new firms, to keep competitors out of the market. Is this situation better than if they didn't pool at all? Yes—but that doesn't contradict my argument that having no IP law would be even better. [1] Bessen, J. and R. M. Hunt (2003), \"An Empirical Look at Software Patents,\" mimeo, Massachusetts Institute of Technology, May. [2] Levine, L. And K. M. Saunders (2004), \"Software Patents: Innovation or Litigation?\" paper presented at the IFIP 8.6 Working Conference: IT Innovation for Adaptiveness and Competitive Advantage, Leixlip, Ireland.\n\nEvidence Con: --Property-- Pro claims that my examples are of people \"benefiting\" from another's labor, but not *profiting*, so they don't count. There's actually no real difference between benefiting and profiting. What exactly is profit? It's not just gaining paper—that alone would be worthless. The reason people want that paper not because of the money itself, but because of what they can get for it. Paper isn't wealth—the value people gain from the things they buy is wealth. This subjective value people gain isn't inherent to things that are bought with money—there's no real difference between the value gained from the \"benefits\" Pro mentions and the value gained from buying things with monetary profits. Of course, even if there were some sort of moral difference between the subjective value gained from \"benefits\" and the subjective value gained from spending monetary profits—my examples are examples of people gaining monetary profits from another's labor. If I keep a nicely kept lawn, it doesn't only make my neighbors feel good in some vague way, there are also clear monetary gains. The value of their home is higher than it would be if I did nothing—this is a clear monetary profit. As for my examples being \"voluntary\"—they are exactly as voluntary as the benefits from copying someone else's creation. The initial action, inventing or fixing your lawn or whatever, is completely voluntary, and the benefits that others gain are involuntary. \"My opponent suggests that because one's labor on it produces something useful, it therefore becomes property.\" \"So far Con's response has been that only useful labor constitutes property.\" That is not what I suggest; in fact, I explicitly stated in my previous round that this is not how something becomes property. Saying something is \"useful\" or \"useless\" is completely subjective and arbitrary. What I did say is that property rights are determined by *use*, not \"usefulness\". That is, when you build a farm on un-owned land, you \"own\" the land in the same sense that you \"own\" your body—you have the exclusive right to use that particular thing. If someone steals your car, it is aggression because they have forcefully interfered with your ability to use that car. If someone copies your idea, they have not forcefully interfered with your ability to use your idea. Pro then claims that because labor belongs to the laborer, ideas rightfully belong to their creators. But she fails to show that the creators of ideas also have the right to every copy of their ideas. If I, using myself and my property, labor to copy another's idea, then that copy of the idea is my property. --Programmer Example-- Pro claims that the knowledge behind the original idea is scarce. This is blatantly false. I can use the idea of another without interfering with that person's ability to use their idea—thus ideas, by the definition of economic scarcity, are not scarce. It's the same reason air is not property—I can breathe as much as I want without interfering with anyone else's ability to use the air, because air isn't scarce. The original copy of the idea, whether it is on paper or in the programmer's head, is what the programmer owns. --Value of Labor I did not say that fairness is irrelevant—I said that what *seems* fair or unfair is irrelevant. Simply saying that something doesn't \"feel\" or \"seem\" right isn't enough to show that it is wrong. Property rights are grounded in reason, not feelings. --Economics— I didn't say that the laws of supply and demand would be completely ineffective; I said that because there is a monopoly, the supply will not increase to lower the price as it would in a free market. Obviously, there are still limits on how high a price can go—my point is that the intellectual monopoly raises the price much higher than it would be in a free market. \"Second, Con first acknowledges that IP increases innovation and then says it doesn't.\" Again, Pro misstates my position. What I actually said was that IP increases revenues for innovators, but also increases costs, and so it is not clear that IP increases profits and therefore incentives for innovators. Thus, we should look at the empirical evidence to see which is stronger—the effects that decrease incentives for innovation and the effects that increase them. Pro says that she \"completely reject[s] the idea that having to build on another's patented idea decreases profits and therefore incentives\"—but this is absurd. If IP increases the revenues of innovators, it must, necessarily, increase the costs to the people that use those innovations. Since innovators (not always, of course, but often) build on the ideas of others, rather than coming up with something 100% new, IP must increase the cost of innovation. For example, look at Henry Ford. He's credited for inventing the assembly line and car. But he didn't invent those things from scratch—he built on the inventions of others for both of those things. [1] He was successful because he utilized those ideas better than others, not because he created brilliant ideas from nothing. If those earlier innovators had been able to patent those inventions, as they could have under today's laws, his success, which provided jobs for millions and cars for millions that never would have been able to afford them before, might never have happened. In my previous rounds, I have provided evidence showing that IP hurts innovation in practice, showing that the effects that reduce innovation must be greater than the ones that increase it. Finally, Pro notes that I didn't respond to her arguments that patents are temporary, and could be made more flexible. That was because these arguments don't really contradict anything I'm saying. Just because patents aren't as bad as they could be, or could be made less bad, doesn't contradict my claim that having no patents would be best of all. --re: Pro's Conclusion-- Pro claims that people that provide services, such as doctors and teachers, do deserve compensation for their work, even though there are no scarce goods involved. This is false—human beings are scarce goods, and self-ownership of these scarce goods is the foundation of property rights. When you pay a doctor for his or her services, you are paying for the use of that person's scarce resources and private property—that person's body. Just as one would pay rent to live in an apartment owned by another person, you have to pay people that provide services for the use of their bodies. This is also how musicians are compensated without IP. The copies of the songs are not scarce goods and are not private property, but the musicians themselves are. Fans pay for concert tickets, because the use of the musicians' bodies to perform shows live is the employment of scarce resources. --Conclusion-- I have shown that Pro's conception of property rights leads to absurdities and cannot be valid, and have offered an alternative justification. I claim that property is defined by first use—that is, if you farm on un-owned land, you gain the right to continue your use of that land, and if someone interferes with your use-rights without your permission, then that is a crime. Pro responded by misstating my justification for property rights, and then refuting that, rather than what I actually said. I have also shown that IP laws do not increase innovation, and Pro has not yet offered any evidence contradicting this, although she supposedly will in the next round. [1] Ford, Henry; with Crowther, Samuel (1922), My Life and Work, Garden City, New York, USA: Garden City Publishing Company, Inc. 25.\n\nEvidence Con: --Property-- Pro argues that my claim that there is no real difference between \"benefits\" and \"profits\" is wrong, but conveniently fails to respond to my argument that some of those \"benefits\" really are monetary profits. One example I gave was with home prices—if I keep a well-kept house and lawn, the property values of my neighbor's homes goes up. This is a clear monetary profit. If Pro's claim that profiting off of another's labor without their permission is theft were true, then my neighbors would be stealing from me. I mentioned this in round 2, and round 3, and Pro failed to respond during either of those rounds. Pro also argues that my claim that property is determined by use, not usefulness is only my opinion—but so is her claim that property is determined by labor. The difference is that my claim makes sense, while her claim, if logically followed, would mean that my neighbors are stealing from me if I keep a nicely kept lawn (see previous paragraph). Next, Pro claims that income from one's product is a form of use, and people can have property rights in this income. While this sounds right at first glance, it can't be true. If this were the case, then someone who has property rights in a store also has property rights in the future income of that store, and if someone competes with him, lowering his profits, they are stealing from him. Obviously, this is not how capitalism works. Next, Pro completely misstates my position, again. \"Ergo, it's absurd to compensate someone simply for the price of the paper and labeling it a fair trade as Con suggests.\" This, of course, is not at all what I suggest. I agree that an inventor has property rights in the first copy of the idea. I obviously don't mean the price of the original paper that idea is written on. What I said is that the creator has the right to whatever someone will pay for the right to use the idea first. Pro also claims that labor \"deserves to be paid to the fullest extent of its value\"—and how exactly is that determined? Pro believes that the \"full extent\" is determined by the amount one would get from having a monopoly over the use of an idea—but doesn't justify this claim. There's no objective reason to believe that the \"fullest extent of [an idea's] value\" is the payment for a monopoly on that idea rather than the payment for the rights to the first copy of that idea. Next, Pro claims that creators are appropriating ideas in the same way that a farmer building a farm on un-owned land appropriates it. I agree—these things do confer the same rights. Just as the farmer doesn't gain the rights to every farm, the inventor doesn't gain the rights to every copy of his idea. Property Conclusion: Pro's definition of what theft and property are is incoherent. If followed logically, it leads to the conclusion that my neighbors are stealing from me if I keep a well-kept lawn, as I explained in this round, round 3, and round 2. Pro never responded to this point—choosing instead to misstate my position, or only respond to half of my argument. In addition, Pro never justifies monopoly rights on ideas. She shows that creators have the right to profit from their ideas—but not that they have the right to control every potential copy of their ideas. --Economics-- A) I never claimed that the increase in price was a *sufficient* reason to abandon IP. My argument is that this, in addition to the fact that IP fails to increase innovation, is why IP should be abandoned. B) Pro states that, \"If one didn't profit from their endeavors, they wouldn't invent anything.\" Yes, obviously. But I never claimed that IP results in inventors getting *zero* profits, so this doesn't really rebut my argument. I claimed that IP has effects that increase incentives for inventors to innovate, as well as effects that decrease incentives for inventors to innovate. Because the effects go both ways, we must look at empirical evidence to see whether or not IP increases innovation. C) Yes, the current pharmaceutical industry relies on patents—of course they do! Current pharmaceutical companies exist in a world with patents, so obviously they use them. As I explained earlier, past pharmaceutical industries thrived without patent protection. D) The reported costs of developing new drugs are largely exaggerated, and would be lower without IP law. Without patents, firms could draw on the research of other companies, which would reduce development costs. In addition, about 75% of current R&D spending is on copycats of existing drugs. [1] How many different drugs have you seen that help you get an erection? Why do different companies waste their time and resources making a bunch of different drugs that do the exact same thing? It's because of IP laws. Pharm companies can get a lot of money developing a new erectile dysfunction drug as long as it's somewhat different, chemically, than the current drugs on the market. If there were no IP laws, companies wouldn't waste their money on this nonsense. They wouldn't need their version to be slightly different from their competitors--they could just use the same formula. Since 75% of R&D is spent on this, not having this copy-cat \"research\" would free up a lot of money that could be used to create new, useful drugs. E) This is actually a point in my favor. The lack of patents in Brazil is not because of lack of patents there, but because of patents in the West. If patents were abolished, as I suggest, pharmaceutical companies wouldn't be less likely to sell their product in Brazil than they are to sell it anywhere else. The current system does sometimes hurt people that live in countries without patent protection, but I am not defending the current system. F) Germany was a long time ago, so it isn't as relevant, but Switzerland and Italy were more recent examples. They had thriving pharmaceutical industries when they introduced pharmaceutical patents in 1978 and 1979, respectively. As I explained earlier, if patents really did promote innovation, pharmaceutical innovation would have increased following the introduction of patents in those countries—but it didn't. As for Pro's study, I agree that many of the drugs today wouldn't be produced without patents. But there are also drugs that aren't produced *because* of patents, which is why overall innovation didn't increase after the introduction of patents in the examples mentioned earlier. For an example of this, Peter Ringrose, the chief scientific officer of Bristol-Myers Squibb told the New York Times that, \"There were more than 50 proteins possibly involved in cancer that the company was not working on because the patent holders either would not allow it or were demanding unreasonable royalties.\" [2] There are countless examples of this sort of behavior—all hurting medical innovation. As for Pro's claim that \"the institution of pharmaceutical patents does not necessarily lead to price increases\": this couldn't possibly be true. The entire *point* of patents is to increase prices—if they didn't, the patentee wouldn't get more money for their production, and wouldn't bother patenting anything. G) This, like E, does not demonstrate the costs of not having patents; it merely demonstrates the cost of a country not having patents while other countries do have them. Obviously, businesses will prefer countries where they enjoy monopoly protection over ones where they don't—but they wouldn't have that choice if IP were abolished. Finally, I'd like to thank theLwerd for a great debate—I had a lot of fun, and hope she did too. [1] Michele Boldrin and David K. Levine, Against Intellectual Monopoly (New York: Cambridge University Press, 2008), 226. [2] Pollack, A. (2001), \"Bristol-Myers and Athersys Make Deal on Gene Patents,\" New York Times, January 8.\n","DiscussionID":"00000077","Title":"Intellectual Property","CrawlDate":"2016/09/29 05:52:55","URL":"http://www.debate.org/debates/Intellectual-Property/2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":127,"nextID":"00000002","PremiseStartPos":[179],"prevID":"00000000","Premise":["According to Con, economic scarcity is what constitutes whether or not something can rightfully be considered property. The dictionary defines property as being that which a person owns, so the question essentially becomes whether or not one can claim ownership of their ideas. I'll begin by addressing what we can rightfully own. My opponent has agreed to discuss IP within a capitalist framework, which of course embraces private property (that is - what an individual can claim as belonging to them, or what they have authority over pertaining to that of which they own). Legitimate ownership is either granted or inherent. For instance, if I decide to give Con the book that I own, he would become the new owner. Without granting Con ownership of my property, assuming it as his own would simply be stealing. On the contrary, inherent ownership isn't necessarily granted but recognized by acknowledging one's right to the fruits of their own labor. Ergo, if I bake a cake, it is understood that the cake is my property. One cannot be forced to labor for another, nor can one expect that another be compensated for the labor of someone else. In a capitalist society, compensating labor is agreed upon by accepting labor. For instance someone else must get my permission before expecting to benefit from my labor without paying me; they are not simply entitled to it without my consent (that's slavery). Keeping that in mind, it seems one can indeed own their labor as property. After all this was the very logic behind property to begin with; the idea that property (land) would become yours just because you worked on it. In other words, labor --> property. As such, what one can inherently own (like labor and ideas) is really the purest form of ownership that there is. I am completely responsible for my labor - it was produced by me, and only exists because of me - which is not the case with land. Thus all the capital going into making scarce goods comes from resources never legitimately owned anyway, unless you accept the concept that laboring for something grants ownership which capitalists do. In that case, it seems that things like labor and ideas are the best examples of rightful ownership; these things would not exist without actual productivity of a particular agent who could grant ownership of them authentically. So far Con has made it seem that IP is simply referring to the concept of protecting the monopolized rights to one's idea, instead of acknowledging that IP seeks to protect the rights to one's labor. Indeed the kind of ideas we are discussing are not just frivolous thoughts, but often the result of tireless hard work and dedication (not to mention money spent on education to help shape these ideas). For instance, a computer programmer might work relentlessly to figure out an algorithm that would make an awesome feature on a particular website. A fellow programmer with more opportunities and/or resources (capital) might be able to apply that algorithm to use this application on a bigger scale at a faster rate and receive a lot more money on its behalf. As a result, the second programmer profits immensely and perhaps unfairly based on the first programmer's labor. Without Programmer 1's permission to profit from his work, this is equivalent to theft. Con's advocation rewards not the person whose labor is most significant, but the person who already has the capital to implement an idea most effectively. In this example, it would greatly devalue the labor that the first programmer should have some compensation for. Consider this scenario: Suppose I worked retail and spent 30 minutes with a customer convincing her to buy more items, thus earning me more commission. However at the last minute, my co-worker decides to ring up the customer I worked with because their register is working faster than mine. As a result they are compensated for my work without my permission. Even if they didn't technically violate any rules, we can see how this is problematic and unfair. The \"first mover\" theory is not always applicable; one is not always appropriately compensated for their original work. If they are, they will likely be exploited. Con says people should only have rights to their idea since that's all they've created. With the algorithm example, a formula might just be a bunch of numbers and letters, but applied in a certain context it could mean huge amounts of compensation. Should the algorithm's designer not receive anything because the letters and numbers themselves are inherently worthless? Or do we acknowledge labor as worthy of pay even if technically something has no inherent worth? For instance massage therapy is \"worthless\" unless we give it value. IP laws protect the idea that one's labor is of value even if it can't be represented physically with a material item. Labor doesn't only refer to the actual production of a product, but also work on an idea that becomes integral toward a product's production. Regarding the the economy, Con notes that IP creates monopolies that are bad for competition and increase costs. However it's easy to combat this argument by using capitalist principles themselves. The market determines a product's value, therefore an item that is priced too high would not be embraced. The laws of supply and demand would be effective at decreasing the product's cost. Lowering prices for the masses is not a sufficient argument for abandoning IP, just as it's not a sufficient argument for setting a price ceiling. Con also says that patents hinder innovation when in fact they encourage it. They promote the publication of useful ideas at the price of giving the one who publishes an idea a temporary monopoly over it. This encourages innovation among competitors to come up with alternatives or improvements thereby fostering and enhancing innovation and competition, while still ensuring the creator is appropriately compensated for their intellectual contribution. Because patents are temporary, I reject Con's assertion that they make it impossible for others to build or improve upon existing ideas. Economists estimate that two-thirds of the value of large businesses in the U.S. can be traced to intangible assets, and note that \"IP intensive\" industries are estimated to generate 72 percent more value than non-IP industries indicating these laws do not hinder but help the economy [1]. Additionally, evidence shows that there is a positive and strengthened impact of the IP system on areas such as research and development, foreign direct investment and technology transfer [2]. We should consider the relevance of IP laws today instead of relying on a flawed example like Watts, who operated during a time when IP laws were much more stringent. It's possible to reform IP laws to suit the needs of today's economy. One option are IP pools which \"may provide pro-competitive benefits by integrating complementary technologies, reducing transaction costs, clearing blocking positions and avoiding costly infringement litigation\" [3]. The high cost of research and development in such competitive global markets has increased the need to minimize these costs, while reducing the risk of failing to create marketable products. To combat this we've figured out that product standardization and joint product development is helpful, which is sustained and encouraged via the concept of IP [4]. Con has said that his burden is to show that IP rights are not legitimate property rights (which I feel I have negated), and that society is better off without them. Of course this is irrelevant; a capitalist system does not care about what's good for society, but rather protecting the rights of the individual - which makes IP even more appropriate. [1] [2] [3] U.S. Department of Justice and Federal Trade Commission [4]"],"PremiseEndPos":[8010],"ArgumentID":"00000001","Conclusion":"Intellectual Property","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":127,"nextID":"00000003","PremiseStartPos":[8025],"prevID":"00000001","Premise":["-- Labor as Property -- Con has given several examples of entities benefiting from another's labor, though none of them profit from another's labor meaning these analogies do not apply to my argument. The overall economy might benefit from my labor, but that is an abstract contribution without a clear benefactor. Moreover choosing to enter the workforce is a voluntary action, meaning a worker agrees to this exchange. My neighbors might benefit from my kept lawn, but they are not profiting. There are only two entities I can think of that directly profit off another's labor: employers and the government. With employers, the worker understands this notion and agrees to it making it another voluntary exchange. With government, the worker does not agree to others profiting from their labor which is why capitalists consider it theft. Indeed the government profits from said labor even if there is no scarce item produced, such as income taxes for child care. -- Ownership -- Con writes, \"Building a farm on un-owned land grants me the right to continue growing crops on that land.\" Of course this begs the question of what makes something owned. In the last round I explained that ownership is either inherent or granted. If land is un-owned, there is no rightful owner to grant it to another nor does it inherently belong to someone. My opponent suggests that because one's labor on it produces something useful, it therefore becomes property. In that case, my labor to write a song makes the final product useful (assuming others want to listen to it) meaning my labor should constitute as property by Con's own standards. Remember that property is merely defined as something which you own. This debate is about whether or not you can claim ownership of something you produce even if it's not scarce (though Con concedes the scarcity of good ideas). So far I've explained why labor rightfully \"belongs\" to the agent; it is something another cannot rightfully take or force from you without your consent. It also \"belongs\" to someone because a particular agent is responsible for its existence. This means it can be more legitimately owned than any piece of land in which any original grant of ownership was completely arbitrary. Con has not responded to this argument. So far Con's response has been that only useful labor constitutes property. If another wants to implement my idea, then clearly it's useful and Con has defeated his own argument. -- Scarcity -- Con clarifies \"Ownership merely means the right to use something as you see fit.\" In that case I see no reason why labor would not apply, and again I maintain that if there's anything we should have complete control over it's our labor. Con's point is that you can only own something that is scarce. He writes, \"My use of an idea does not stop you from using it, so it is not theft.\" First, I never claimed that using an idea is theft -- I claimed that using the fruits of another's labor without their permission and without compensation is theft. Second, this does not fit within the parameters Con has distinguished for ownership. Con clarifies, \"If you take my car and are using it, then I can no longer use it -- that's what makes it theft.\" However I could easily take Con's car and utilize it how he sees fit, meaning he would still own it by his standards. Nevertheless an inventor or creator expects their work to be utilized the way they see fit just as a business owner expects their workplace to be run the way they see fit. Owning a business (not the structure itself -- in fact some don't operate within a specific structure) is just as abstract as owning an idea, yet Con does not seem to have a problem with owning one of those despite it not referencing a scarce material. In other words, you can own labor. -- Programmer Example -- In the last round I gave a programmer example and Con responded predictably with his first mover theory -- the one I already noted as unreliable. He claims that theft can only exist if one programmer took the literal piece of paper the algorithm was written on. This seems backwards: if property exists to protect that which is scarce, then clearly the knowledge behind the algorithm is A LOT more scarce than a piece of paper. By this logic the knowledge (or labor put into it) should again be rightfully considered property by Con's standards. Con cannot guarantee that one will be rightfully compensated for their contribution either. -- Value of Labor -- Suppose I spend a year writing a book and then sell 10 copies for $10 a piece. One buyer makes copies of my book and sells 10 more copies of it for $9 a piece. The second person profits immensely from significantly less labor which seems blatantly unfair. However Con writes \"But what seems 'fair' or 'unfair' is not how property rights are determined.\" Oh? Then why is it determined that only scarce goods constitute as property? I'm assuming it has something to do with FAIR exchange and protection of that which is owned to protect from UNFAIR exploitation. The fairness of something seems absolutely relevant in a philosophical debate that is ultimately about a concept (property). I'm saying it's fair to protect one's labor just as it is fair to protect one's goods. If fairness isn't an issue, then let's scrap the concept of property all together and live in a commune. -- The Economy -- First, Con says that IP creates a monopoly which makes the laws of supply and demand ineffective. This is narrow-minded considering competition is not the only way to drive down prices. If Starbucks charged $10 for a coffee, then even without their competitors (Dunkin Donuts, Gloria Jeans, etc.) I wouldn't buy it. The price must be appropriate for the market to accept it. Second, Con first acknowledges that IP increases innovation and then says it doesn't. I've explained that (a) IP increases profits for inventors which provides incentive, and (b) innovation is not only likely but necessary if you cannot rely on replicating the idea of another to become successful. I also completely reject the idea that having to build on another's patented idea decreases profits and therefore incentives. People always come up with new ways to profit. For instance the Industrial Revolution was about factories; the Dot.com era was about the internet and now we're headed into an economy zeroing on in Green industries. This means the economy would evolve even with IP in place, because entire new industries are established. Con's also ignored my argument that patents are temporary, let alone the fact that they could become a lot more flexible. Finally Con says we cannot attribute the success of IP intensive industries to IP unless we demonstrate that IP itself was responsible for some of the growth. Considering this is a 4 round debate, I've utilized this round to discuss IP in a philosophical way -- in other words to explain why there is absolutely a justification for it's existence in a capitalist system. In the next round I will focus more specifically on the economic arguments and pharmaceutical example, as well as mention some other possible reforms. -- Conclusion -- The concept of property exists solely to protect one's assets and ensure that they can profit from their labor. Businesses sell either goods or services. Because people profit from their labor all the time without producing scarce goods (i.e. musicians, teachers, doctors, physicists, astronauts, etc.) then it makes no sense to suggest ONLY material items can be protected as property. Suppose Con agreed to pay me $20 for cleaning his room, and afterward refused to pay me because I did not provide him with a scarce material. You might say he is still liable for payment because of his agreement to pay me for my labor. Intellectual Property simply seeks to establish an agreement to pay an inventor for their labor. It is completely justified."],"PremiseEndPos":[15932],"ArgumentID":"00000002","Conclusion":"Intellectual Property","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":127,"nextID":"00000004","PremiseStartPos":[15947],"prevID":"00000002","Premise":["-- Property -- A) Con begins to explain that \"benefit\" and \"profit\" are synonymous. A benefit is something that is advantageous or good; profit is pecuniary gain resulting from the employment of capital in any transaction. Clearly the two are not the same thing. I've argued that you can benefit from another's labor, but you cannot profit from it without their voluntary consent or it is theft (such as what the government does). Con didn't explain why it's not theft, and he never gave an example of an entity that rightfully profits from another's labor without their consent. The argument that benefiting = profiting is clearly untrue; a simple glance at the dictionary will reiterate that. Even abstractly speaking, I benefit from having a clean apartment but I do not profit from it. I'm quite confident the audience will understand this distinction. B) Con asserts, \"What I did say is that property rights are determined by *use,* not usefulness\". Of course the audience should keep in mind that this is nothing more than his opinion of what should constitute as property, and in fact we're debating what property should be so merely repeating the argument is not a contention in his favor. Nevertheless income from one's product is a form of use, so it is not the case that sharing IP is loss-free to the sharer. While sharing IP may not involve loss of possession or loss of personal use, the loss of income incident to such sharing is a true and significant loss not to be dismissed [1]. C) Con conveniently tries to make a distinction between ideas and labor which I've already demonstrated as indistinguishable. The 'idea' to be protected in this context is not just a frivolous thought, such as having the idea to put a jacket on when it's cold. Instead it's the RESULT of labor - labor that deserves to be paid to the fullest extent of its value. I'm arguing that the intellectual know-how into say producing a computer algorithm is far more valuable than the piece of paper it's written on. Ergo, it's absurd to compensate someone simply for the price of the paper and labeling it a fair trade as Con suggests. D) Ayn Rand writes, \"Patents and copyrights are the legal implementation of the base of all property rights: a man's right to the product of his mind\" [2]. She's also clarified, \"What [IP] laws acknowledge is the paramount role of mental effort in the production of material values... By forbidding an unauthorized reproduction of the object, the law declares that the physical labor of copying is not the source of the object's value; that the value is created by the originator of the idea\" [3]. This combats Con's repeated assertion that labor alone determines value, and supports my position that the labor going into an idea is just as if not more valuable than the labor itself. What Con advocates is essentially likened to plagiarism: benefiting (in the form of profit) by reproducing another's ideas. E) Property is about ownership. Con repeats, \"When you build a farm on un-owned land, you own the land in the same sense that you own your body -- you have the exclusive right to use that particular thing.\" In this way Con makes it seem as if it's a first-come first-serve basis; the first to \"un-owned\" land gets it. I still see no distinction between this and an idea. First to the idea gets to \"own\" it. So far every one of Con's explanations for justifying tangible property is equally applicable to intangible property. I've already thoroughly combated and explained how IP pertains to economic scarcity. Additionally, Con never addressed my analogy regarding owning a business (a word representing an abstract idea simply referring to the labor your provide). -- Economics -- A) Obviously IP increases an item's value because of lack of competition for selling that product. However in Round 1 I pointed out that this was not a sufficient reason to abandon IP, just as implementing price ceilings to keep costs down are not a sufficient reason to implement those. In other words, this is true but not at all relevant in a capitalist system. B) Con says IP increases costs for inventors (because they have to compensate others if they use something patented), and therefore, \"it's not clear\" that IP increases profits for inventors. This could not be further from the truth. If one didn't profit from their endeavors, they wouldn't invent anything. The fact that they do shows why this reasoning is blatantly false. They're obviously profiting regardless of any existing IP law or they would stop. C) Con notes higher development costs necessarily means higher costs for the people. Absolutely, but that's entirely irrelevant considering capitalism doesn't seek primarily to implement policies that keep prices down, but rather protect the rights of the individual as I explained. In fact high development costs is an argument in favor of IP. Going back to Con's pharmaceutical example, he forgets to mention that this more than any other technology-based industry has come to rely on patents as the primary mechanism to promote innovation [4]. D) While pharmaceutical products rely on substantial amounts of upfront investment and technical knowledge, it is easy to copy once they are widely distributed. As such, there is less incentive to put so much investment into something with a small pay-out. Providing market exclusivity to an inventor through patent protection can encourage the initial outlay of resources needed to develop the product [5]. It costs about 400 million dollars and 10-12 years of labor to do this kind of work [6]. Con thinks it's not fair yet \"reasonable\" for another to profit immensely from another's investment of this magnitude without *significantly* less time, money and work put into it. E) There are also moral concerns. Ambassador Tarso reveals, \"A new generation of antibiotics - not available in Brazil because of lack of an adequate patent law - saved me\" [7]. Lack of protection is inhibiting inventors from making their products available in parts of the world that do not favor IP, which can have detrimental effects including the loss of human life. IP including pharmaceutical patents enhance the conditions for investment, improve the quality of goods and stimulate indigenous innovation, creating better jobs and opportunities for local inventors [8]. F) Con said that historically the pharmaceutical industry grew much faster in countries were patents were fewer and weaker citing Germany and Italy as examples. What time period is Con referring to and can Con prove IP was relevant? A 1988 study of 12 industries indicated that 65% of pharmaceutical products would not have been introduced into the marketplace, and 60% would not have been developed in the absence of adequate patent protection [9]. Moreover in the 10 years after Italy instituted its pharmaceutical patents, retail and wholesale prices rose much less than did prices in general and less than the price index for health-related goods and services [10]. This shows how the institution of pharmaceutical patents does not necessarily lead to price increases. Because the U.S. has such strong IP combined with a lack of price control, this stimulates fierce competition among products competing in the same therapeutic class. This helped us achieve the smallest Producer Price Index increase in pharmaceuticals in the past 20 years [8]. G) The strength of a country's IP regime was clearly identified in a study by the International Finance Corporation, an arm of the World Bank: \"We find that the strength or weakness of a country's system of IP protection seems to have a substantial effect, particularly in high-technology industries, on the kinds of technology transferred by U.S. firms to that country. Also, this factor seems to influence the composition and extent of U.S. direct investment there\" [11]. SOURCES:"],"PremiseEndPos":[23819],"ArgumentID":"00000003","Conclusion":"Intellectual Property","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":127,"nextID":"00000005","PremiseStartPos":[23834],"prevID":"00000003","Premise":["-- Property -- Con begins, \"Pro argues that my claim... is wrong, but conveniently fails to respond to my argument that some of those 'benefits' really are monetary profits.\" The thing is - I don't have to. In fact, I specifically *agreed* with this notion in the last round. I'll repeat, \"What Con advocates is essentially likened to plagiarism: benefiting (in the form of profit) by reproducing another's ideas.\" I specifically pointed out that benefits can be and often ARE monetary profits, so what exactly is Con's point? I have no incentive to argue this notion and have even explained why it works in my favor. I could just as easily point out that Con has failed to respond to the quandary regarding this very issue: plagiarism. Moreover likening the alleged value of one's kept lawn to the behemoth worth of say finding the cure for cancer is an unreasonable analogy. Next Con writes, \"Pro also argues that my claim... is only my opinion -- but so is her claim... The difference is that my claim makes sense...\" A bare assertion indeed. However, I explained that while sharing IP may not involve loss of personal use, the loss of income incident to such sharing is true and significant. Con responded by saying this was analogous to a store owner with a monopoly on stores. Once again, I contend that this is a manipulative analogy. As I explained, this debate is essentially a philosophical debate about what should constitute as property. I could just as easily turn Con's logic against him regarding physical property. By claiming the land where one chooses to build his store is his \"property,\" he's simply relaying a metaphorical idea - specifically one that exists to allow him to utilize his \"property\" as he sees fit, and possibly to generate profit. The same concept applies with IP. Yes land exists as a physical entity, but so often so do the fruits of one's labor. Nevertheless the concept of land being \"property\" is completely abstract and has meaning only because we say it does. We say it's reasonable for someone to be able to own (determine use) of it, and/or be compensated for work on it accordingly. Similarly, Con cannot suggest the absurdity of claiming the validity of IP, because the same logic used to justify it is the same logic applied to material property. Think of it this way -- Con says if he farms certain land, it becomes his property. Why then can I not farm the same land and have it also be my property? It's completely contradictory for him to say this abstract idea of property can only apply to that which is tangible because it is useful. Ideas are exceptionally useful. As Ayn Rand explained, copyrights can be seen as a debt to the inventor by those that profit from copying it. Con concerns himself with the labor of the copier, but the copier is compensated for their labor with IP existing as well. They are simply offering some earnings to the one partly responsible for their profit, just as some of a worker's earnings go to the company they work for. To insist on ignoring property and rewarding only labor is to be a communist. Additionally, keep in mind that debts cannot be perpetual, and similarly, the terms of IP are and can be further limited - for instance to one's lifespan. In this way IP is *better* than real property. While that can be passed on to undeserving heirs, IP seeks not to create feudalistic generations of perpetuated wealth but rather justly compensate the most useful and thus deserving agent. Such is a prime tenant of the capitalist philosophy. Con continues, \"I obviously don't mean the price of the original paper that idea is written on... I said is the creator has the right to whatever someone will pay for the right to use the idea first.\" Actually, Con specifically said in Round 3, \"The original copy of the idea, whether it is on paper or in the programmer's head, is what the programmer owns.\" This validates my contention: that if someone compensates an inventor for the price of paper whatever information was written on, that Con would consider it a fair trade. He also notes that the original copy of the idea - even in someone's head - has the right to be owned. This is the concept behind IP, so it seems my opponent has conceded :) Con concludes by saying I have not justified monopoly rights on ideas. That is ludicrous considering this is what the entire debate has been about. -- Economy -- A) Moot point - we're in agreement. B) Con writes, \"Because the effects [of incentives for inventors] go both ways, we must look at empirical evidence to see whether or not IP increases innovation.\" The empirical evidence I presented defends my point. Additionally studies show the merit of IP may not only be regarding raising the number of innovations, but changing the direction of innovative activity [1]. C) Con writes, \"Current pharmaceutical companies exist in a world with patents, so obviously they use them.\" My point was that they have thrived specifically from using them -- a contention Con never refuted but merely denied contrary to all evidence. Con also insists pharm industries were fine without patent protection in the past, but I've proven they've boomed since and explained the direct correlation to IP. D) Con suggests that it's because of patents that R&D costs for pharm companies are so high. On the contrary, \"This rapid rise in R&D costs has been driven largely by steep increases in the costs of clinical testing, which have grown 5x as fast as preclinical testing costs\" [2]. Moreover he says it's completely wasteful for companies to compete by improving drugs. I guess what some call wasteful others call innovative. E) Con says, \"If patents were abolished, pharmaceutical companies wouldn't be less likely to sell their product in Brazil than they are to sell it anywhere else.\" If patents were abolished, perhaps the necessary investment into said drugs would never have existed. F) Con concedes that patents increase pharm innovation, but says some ask for excessive royalties inhibiting certain R&D. First, the pharm royalty rate for pre-clinical testing is only 2% [3]. Second, the high payoff also attracts many companies to compete, increasing the pace of drug development thereby negating this assessment. He also says it *must* be true that patents lead to dramatic price increases, despite my sources (specifically #10) and explanation in the last round stating otherwise. However he's given no actual rebuttal - just a false statement in response. G) People want to invest where they're protected. Makes sense. -- Conclusion -- My esteemed opponent has failed to give reason we ought to recognize property and not IP. The scarcity argument was not justified. He'd said that air is not property because we can breathe as much as we want without interfering with anyone else's ability to use the air, and similarly, IP should not be property for the same reason. This is another inapplicable analogy. Air is not property because it isn't scarce, but because nobody owns it, nobody's produced it with the fruits of their own labor, it was not granted from one rightful owner to another, and nobody can realistically protect that asset (though you can with both property and IP). So again I repeat -- the same logic applicable to property rights is also applicable to IP, and my opponent hasn't proven otherwise. If you think someone who has done virtually no work in comparison, but is significantly inhibits your gains on something you've put massive amounts of investment into without your consent is wrong - and that you should have at least temporary ownership of your original idea for at least a short amount of time (maximum being the span of your life) - then you support IP and should vote PRO. Furthermore I've explained and proven the merits and responsibility of IP within a functioning capitalist economy. SOURCES:"],"PremiseEndPos":[31702],"ArgumentID":"00000004","Conclusion":"Intellectual Property","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":127,"nextID":"00000006","PremiseStartPos":[31717],"prevID":"00000004","Premise":["My position is that Intellectual Property should be abolished. My burden of proof is to show that IP rights are not legitimate property rights, and that society is better off without them. Definitions: Intellectual Property- Copyrights and patents. Abolished- IP should no longer be granted legal recognition. Intellectual Property (IP) is not real property. To see why, look at what exactly property is. Actual property includes things like land, food, cars, etc. These things have one thing in common: they are scarce. (That is, the economic definition of scarce, meaning that there aren't enough of them for every person to have as much as they want) That's why air, for example, is not property, and cannot be bought and sold. Everyone can have as much air as they want without taking away anyone else's air. What does this have to do with IP? IP, since it is an idea rather than a physical good, also is not scarce. Everyone can posses an idea without taking it from its creator. That's the difference between internet \"piracy\" and real theft: with theft, someone gains something by taking from someone else, but with \"piracy,\" someone gains something without taking anything from anyone. But aren't good ideas scarce? Sure, once someone has a good idea, copies of that idea aren't scarce, but isn't the supply of the original good ideas scarce? Yes, they are. But all that this means is that inventors and artists have property rights in the original copy of their idea, since that is all they've created. IP laws are not necessary for this—it's obviously already theft to steal an author's unpublished manuscript from his house, or an inventor's initial blueprints. Creator's have property rights in the original copy of their ideas, and can sell these original copies like the creator of any other good could do. As I will explain below, this is how creators could be compensated for their work without an intellectual monopoly on it—for example, inventors can sell the results of their ideas first, before anyone else. This \"first-mover\" advantage is extremely valuable, and can adequately compensate innovators, as I will show. But then what is IP? It is property in name only. It's nothing but a coercive government-granted monopoly on the right to sell a certain good. The government could grant GM the exclusive right to sell cars and label it a form of property if it wanted to. In fact, that was the origin of IP laws. In England, IP rights were originally considered the same form of monopoly as the East Indian Trading Company's monopoly on selling tea. The Economics of Intellectual Monopoly Of course, at a basic level, the economic consequences of intellectual monopolies are clear. As with any monopoly, it creates higher costs and lower quality and variety of goods for the consumer. But, supposedly, intellectual monopolies are special. They are supposed to be necessary for innovation. In this next section, I will briefly explain why this belief is false, and, in fact, the opposite is true. Books- Many people believe that IP rights are necessary to give authors incentives to write. After all, if anyone could just copy a book and then sell it themselves, authors wouldn't make any money, would they? They would. Books make 80% of their profits in the first 3 months [1], so someone taking the time to copy and re-sell the book wouldn't have time to distribute it before most of the profit is already earned. Authors could sell the initial manuscript of their book to a publisher, rather than selling the rights to the book. They wouldn't make as much money of course, but they would certainly be able to make a living. Well, that's all fine in theory, but what about in practice? How do I know that it would actually work the way I say? For most of history, IP laws did not exist. Authors managed to produce great works just fine. Take Shakespeare for example. Most of his plays are basically plagiarized from other stories. If those stories had been copyrighted, he wouldn't have had time to write all of the great plays he wrote with all the court battles he'd have to deal with. He also managed to have enough incentives to produce what are widely considered the greatest written works in the English language without requiring an intellectual monopoly. Not only that, but if he was given an intellectual monopoly, he would have spent a considerable amount of his time suing copyright infringers rather than producing plays. Another example is British authors during the 19th century. They enjoyed an intellectual monopoly on their works in Britain and did not in the U.S. But they still earned more profits from the U.S. market than from the British market. For a more modern example, look at the 9-11 Commission Report. It had no copyright restrictions on it; anyone could download it for free off of the internet or publish a copy themselves. But despite this lack of monopoly protection, Norton's edition (the first publisher to sell it) became a bestseller and made more than $1 million in profit. [2] A different publisher, St. Martin, released its own edition with additional analysis which also became a bestseller. [2] Innovation- Contrary to popular belief, IP hinders innovation rather than encourages it. Patents can increase the amount of revenue an inventor would receive for a given idea, but this greater incentive does not necessarily translate into more ideas. Patents also discourage innovation by causing patent-holders to waste much of their time suing people who violate their monopoly rather than inventing. Patents also discourage innovation by restricting the ability of people to improve on existing ideas. Look at the invention of the steam engine. James Watt thought of the idea in 1768, but production didn't really start until 1775, when his monopoly was secured until 1800. Production was slow during those 25 years, and exploded afterwards, and when a superior steam engine was developed, Watt spent most of the 1790s suing its inventor. [3] Because of Watt's monopoly, innovation stalled during those years, with fuel efficiency, for example, stagnating during Watt's patent, but increasing by a factor of five by 1835. [4] This delay of innovation had serious consequences, as the industrial revolution only took off in England after Watt's patent expired and the industry could thrive. But would Watt have had the incentive to invent the steam engine if patents didn't exist? Yes. He actually made most of his money after his patent expired. He was forced to constantly innovate to keep up with the competition, and, as a result, his steam engines were recognized as the best ones and thus the best-selling. What about pharmaceuticals? Don't we need patents for those? No. Historically, the pharmaceutical industry grew much faster in countries were patents were fewer and weaker. The unprotected German industry, for example, grew much faster than the protected British industry, which is the opposite of what you'd expect if IP laws actually encouraged innovation. [5] And when countries did introduce patents, they saw no significant increase in innovation. Switzerland and Italy both had thriving pharmaceutical industries without IP laws, until they were introduced in the late 1970s. [6] Contrary to what one would expect if IP laws actually worked, neither country saw an improvement in pharmaceutical innovation. [6] Sources: [1] Flint, E. (2002), \"Prime Palavar #6,\" April 15. [2] Michele Boldrin and David K. Levine, Against Intellectual Monopoly (New York: Cambridge University Press, 2008), 25. [3] Carnegie, A. (1905), James Watt. Doubleday, Page & Co. [4] Lord, J. (1923), Capital and Steam Power. London: P.S. King & Son. [5] Michele Boldrin and David K. Levine, Against Intellectual Monopoly (New York: Cambridge University Press, 2008), 215. [6] Scherer, F. M (2003), \"Global Welfare in Pharmaceutical Patenting,\" mimeo Haverford College, December."],"PremiseEndPos":[39649],"ArgumentID":"00000005","Conclusion":"Intellectual Property","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":127,"nextID":"00000007","PremiseStartPos":[39664],"prevID":"00000005","Premise":["Property: Pro writes, \"For instance someone else must get my permission before expecting to benefit from my labor without paying me; they are not simply entitled to it without my consent (that's slavery).\" While her conception of what constitutes property and theft seems right at first glance, it becomes absurd when closely examined. Simply benefiting from your labor without your permission does not constitute slavery, unless I forced you to do that labor. Take, for example, positive externalities. If I work hard to get an education, the economy as a whole benefits, even though I never gave anyone my permission to benefit from my labor. Is this slavery? If I keep a nicely-kept lawn and house, my neighbors have higher property values than if I had been lazy and had a messy lawn and crappy looking house. They benefit from my labor without my permission, and give me nothing in exchange for their benefits. Are my neighbors enslaving me? Obviously, using the benefits from labor as the criterion for what property is and isn't leads to ridiculous conclusions. In addition, labor itself isn't the basis for property. If I throw a can of paint into an un-owned ocean, and the paint dissipates through the water, do I then own that body of water? Do I get to decide who may or may not use it? If not, then why does mixing my labor with farmland grant me ownership of that land? Is it because farms are useful—but, then, how does one define \"useful\"? The correct way to determine how one acquires property is through use. Building a farm on un-owned land grants me the right to continue growing crops on that land. Throwing paint in an un-owned body of water grants me the right to throw more paint in that water. So what is ownership? Ownership merely means the right to use something as you see fit. If I own a car, then I have the right to use it however I like, as long as I don't infringe on anyone else's rights. If you take my car and are using it, then I can no longer use it—that's what makes it theft, and an infringement of my rights. That's what makes scarcity important—your use of the air doesn't stop me from using air, so the idea of \"ownership\" of air is absurd. Ideas are the same as air—my use of an idea does not stop you from using it, so it is not theft. Programmers example: This scenario does sound rather unfair. But what seems \"fair\" or \"unfair\" is not how property rights are determined. Regardless, that is not exactly what would happen in the absence of IP laws. The first programmer does have property rights in the original copy of the algorithm—the 2nd programmer isn't allowed to hack into his computer to get it. The 1st programmer can use it himself—it wouldn't matter that the 2nd guy had more resources; the 1st guy could get his operation up and running before the 2nd programmer knew the algorithm existed. Sure, the 2nd programmer could copy the 1st—just as the 2nd person to learn how to plant crops copied the 1st. The copier is benefitting from the innovator's labor, but the original creator isn't losing anything he actually owns. The 1st programmer and farmer would probably have higher future profits if their copiers couldn't compete with them, but people do not have property rights in potential profits; they can only have property rights in things they actually have. Or, he could sell it to the 2nd programmer, and make a profit that way. Neither situation involves theft. Economy: My opponent states that, \"The market determines a product's value, therefore an item that is priced too high would not be embraced. The laws of supply and demand would be effective at decreasing the product's cost.\" That is what would happen—in a free market. In the case of IP, the market cannot decrease the product's cost, because the granting of a monopoly artificially restricts the supply. Pro correctly points out that granting a temporary monopoly for the sale of an idea increases the profits and therefore the incentives of innovators, which results in more innovation. But that's only half of the equation—intellectual monopolies also increase the costs of innovation, because the vast majority of innovations are built on the innovations of others, and those innovations would also be patented. This increase in costs decreases profits, decreasing incentives to innovate. But which effect is greater—the increase in revenue for innovators or the increase in costs? Let's look at the empirical evidence. The examples I used before stand. Pro claims that the Watt anecdote does not, because IP laws were more stringent back then, but this is blatantly false. IP laws have only gotten more and more stringent since Watt's time. In addition, she failed to address my points about the pharmaceutical industry. Even if an example from a long time ago doesn't count, the evidence that pharmaceutical patents did nothing to increase innovation is fairly recent, and clearly still applies. If patents really did increase innovation, then surely the evidence from the pharmaceutical industry, of all industries, would reflect this. Pro's arguments—that innovation requires a large investment of money, labor, and time—fit perfectly with the pharmaceutical industry, where drugs cost hundreds of millions of dollars and years, or even decades, to develop. But the empirical evidence shows that IP laws did not increase innovation in this industry. Studies of IP's effect on other industries have the same results. IP laws do not increase software innovation, for example. [1] [2] Pro also claims that \"IP-intensive\" industries generate 72 percent more value than other industries, but so what? This proves nothing, unless Pro can show that IP laws were responsible for that success, rather than something inherent about those industries. She can't do this because it isn't true. Studies comparing these industries before and after IP laws, such as the evidence from pharmaceutical industries mentioned earlier, show that IP does not increase innovation. Pro suggests IP pools as a potential reform of IP law. These already exist—and the result is cartels rather than monopolies. Large firms often pool their patents with each other, but not with new firms, to keep competitors out of the market. Is this situation better than if they didn't pool at all? Yes—but that doesn't contradict my argument that having no IP law would be even better. [1] Bessen, J. and R. M. Hunt (2003), \"An Empirical Look at Software Patents,\" mimeo, Massachusetts Institute of Technology, May. [2] Levine, L. And K. M. Saunders (2004), \"Software Patents: Innovation or Litigation?\" paper presented at the IFIP 8.6 Working Conference: IT Innovation for Adaptiveness and Competitive Advantage, Leixlip, Ireland."],"PremiseEndPos":[46392],"ArgumentID":"00000006","Conclusion":"Intellectual Property","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":127,"nextID":"00000008","PremiseStartPos":[46407],"prevID":"00000006","Premise":["--Property-- Pro claims that my examples are of people \"benefiting\" from another's labor, but not *profiting*, so they don't count. There's actually no real difference between benefiting and profiting. What exactly is profit? It's not just gaining paper—that alone would be worthless. The reason people want that paper not because of the money itself, but because of what they can get for it. Paper isn't wealth—the value people gain from the things they buy is wealth. This subjective value people gain isn't inherent to things that are bought with money—there's no real difference between the value gained from the \"benefits\" Pro mentions and the value gained from buying things with monetary profits. Of course, even if there were some sort of moral difference between the subjective value gained from \"benefits\" and the subjective value gained from spending monetary profits—my examples are examples of people gaining monetary profits from another's labor. If I keep a nicely kept lawn, it doesn't only make my neighbors feel good in some vague way, there are also clear monetary gains. The value of their home is higher than it would be if I did nothing—this is a clear monetary profit. As for my examples being \"voluntary\"—they are exactly as voluntary as the benefits from copying someone else's creation. The initial action, inventing or fixing your lawn or whatever, is completely voluntary, and the benefits that others gain are involuntary. \"My opponent suggests that because one's labor on it produces something useful, it therefore becomes property.\" \"So far Con's response has been that only useful labor constitutes property.\" That is not what I suggest; in fact, I explicitly stated in my previous round that this is not how something becomes property. Saying something is \"useful\" or \"useless\" is completely subjective and arbitrary. What I did say is that property rights are determined by *use*, not \"usefulness\". That is, when you build a farm on un-owned land, you \"own\" the land in the same sense that you \"own\" your body—you have the exclusive right to use that particular thing. If someone steals your car, it is aggression because they have forcefully interfered with your ability to use that car. If someone copies your idea, they have not forcefully interfered with your ability to use your idea. Pro then claims that because labor belongs to the laborer, ideas rightfully belong to their creators. But she fails to show that the creators of ideas also have the right to every copy of their ideas. If I, using myself and my property, labor to copy another's idea, then that copy of the idea is my property. --Programmer Example-- Pro claims that the knowledge behind the original idea is scarce. This is blatantly false. I can use the idea of another without interfering with that person's ability to use their idea—thus ideas, by the definition of economic scarcity, are not scarce. It's the same reason air is not property—I can breathe as much as I want without interfering with anyone else's ability to use the air, because air isn't scarce. The original copy of the idea, whether it is on paper or in the programmer's head, is what the programmer owns. --Value of Labor I did not say that fairness is irrelevant—I said that what *seems* fair or unfair is irrelevant. Simply saying that something doesn't \"feel\" or \"seem\" right isn't enough to show that it is wrong. Property rights are grounded in reason, not feelings. --Economics— I didn't say that the laws of supply and demand would be completely ineffective; I said that because there is a monopoly, the supply will not increase to lower the price as it would in a free market. Obviously, there are still limits on how high a price can go—my point is that the intellectual monopoly raises the price much higher than it would be in a free market. \"Second, Con first acknowledges that IP increases innovation and then says it doesn't.\" Again, Pro misstates my position. What I actually said was that IP increases revenues for innovators, but also increases costs, and so it is not clear that IP increases profits and therefore incentives for innovators. Thus, we should look at the empirical evidence to see which is stronger—the effects that decrease incentives for innovation and the effects that increase them. Pro says that she \"completely reject[s] the idea that having to build on another's patented idea decreases profits and therefore incentives\"—but this is absurd. If IP increases the revenues of innovators, it must, necessarily, increase the costs to the people that use those innovations. Since innovators (not always, of course, but often) build on the ideas of others, rather than coming up with something 100% new, IP must increase the cost of innovation. For example, look at Henry Ford. He's credited for inventing the assembly line and car. But he didn't invent those things from scratch—he built on the inventions of others for both of those things. [1] He was successful because he utilized those ideas better than others, not because he created brilliant ideas from nothing. If those earlier innovators had been able to patent those inventions, as they could have under today's laws, his success, which provided jobs for millions and cars for millions that never would have been able to afford them before, might never have happened. In my previous rounds, I have provided evidence showing that IP hurts innovation in practice, showing that the effects that reduce innovation must be greater than the ones that increase it. Finally, Pro notes that I didn't respond to her arguments that patents are temporary, and could be made more flexible. That was because these arguments don't really contradict anything I'm saying. Just because patents aren't as bad as they could be, or could be made less bad, doesn't contradict my claim that having no patents would be best of all. --re: Pro's Conclusion-- Pro claims that people that provide services, such as doctors and teachers, do deserve compensation for their work, even though there are no scarce goods involved. This is false—human beings are scarce goods, and self-ownership of these scarce goods is the foundation of property rights. When you pay a doctor for his or her services, you are paying for the use of that person's scarce resources and private property—that person's body. Just as one would pay rent to live in an apartment owned by another person, you have to pay people that provide services for the use of their bodies. This is also how musicians are compensated without IP. The copies of the songs are not scarce goods and are not private property, but the musicians themselves are. Fans pay for concert tickets, because the use of the musicians' bodies to perform shows live is the employment of scarce resources. --Conclusion-- I have shown that Pro's conception of property rights leads to absurdities and cannot be valid, and have offered an alternative justification. I claim that property is defined by first use—that is, if you farm on un-owned land, you gain the right to continue your use of that land, and if someone interferes with your use-rights without your permission, then that is a crime. Pro responded by misstating my justification for property rights, and then refuting that, rather than what I actually said. I have also shown that IP laws do not increase innovation, and Pro has not yet offered any evidence contradicting this, although she supposedly will in the next round. [1] Ford, Henry; with Crowther, Samuel (1922), My Life and Work, Garden City, New York, USA: Garden City Publishing Company, Inc. 25."],"PremiseEndPos":[54013],"ArgumentID":"00000007","Conclusion":"Intellectual Property","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":127,"nextID":"00000000","PremiseStartPos":[54028],"prevID":"00000007","Premise":["--Property-- Pro argues that my claim that there is no real difference between \"benefits\" and \"profits\" is wrong, but conveniently fails to respond to my argument that some of those \"benefits\" really are monetary profits. One example I gave was with home prices—if I keep a well-kept house and lawn, the property values of my neighbor's homes goes up. This is a clear monetary profit. If Pro's claim that profiting off of another's labor without their permission is theft were true, then my neighbors would be stealing from me. I mentioned this in round 2, and round 3, and Pro failed to respond during either of those rounds. Pro also argues that my claim that property is determined by use, not usefulness is only my opinion—but so is her claim that property is determined by labor. The difference is that my claim makes sense, while her claim, if logically followed, would mean that my neighbors are stealing from me if I keep a nicely kept lawn (see previous paragraph). Next, Pro claims that income from one's product is a form of use, and people can have property rights in this income. While this sounds right at first glance, it can't be true. If this were the case, then someone who has property rights in a store also has property rights in the future income of that store, and if someone competes with him, lowering his profits, they are stealing from him. Obviously, this is not how capitalism works. Next, Pro completely misstates my position, again. \"Ergo, it's absurd to compensate someone simply for the price of the paper and labeling it a fair trade as Con suggests.\" This, of course, is not at all what I suggest. I agree that an inventor has property rights in the first copy of the idea. I obviously don't mean the price of the original paper that idea is written on. What I said is that the creator has the right to whatever someone will pay for the right to use the idea first. Pro also claims that labor \"deserves to be paid to the fullest extent of its value\"—and how exactly is that determined? Pro believes that the \"full extent\" is determined by the amount one would get from having a monopoly over the use of an idea—but doesn't justify this claim. There's no objective reason to believe that the \"fullest extent of [an idea's] value\" is the payment for a monopoly on that idea rather than the payment for the rights to the first copy of that idea. Next, Pro claims that creators are appropriating ideas in the same way that a farmer building a farm on un-owned land appropriates it. I agree—these things do confer the same rights. Just as the farmer doesn't gain the rights to every farm, the inventor doesn't gain the rights to every copy of his idea. Property Conclusion: Pro's definition of what theft and property are is incoherent. If followed logically, it leads to the conclusion that my neighbors are stealing from me if I keep a well-kept lawn, as I explained in this round, round 3, and round 2. Pro never responded to this point—choosing instead to misstate my position, or only respond to half of my argument. In addition, Pro never justifies monopoly rights on ideas. She shows that creators have the right to profit from their ideas—but not that they have the right to control every potential copy of their ideas. --Economics-- A) I never claimed that the increase in price was a *sufficient* reason to abandon IP. My argument is that this, in addition to the fact that IP fails to increase innovation, is why IP should be abandoned. B) Pro states that, \"If one didn't profit from their endeavors, they wouldn't invent anything.\" Yes, obviously. But I never claimed that IP results in inventors getting *zero* profits, so this doesn't really rebut my argument. I claimed that IP has effects that increase incentives for inventors to innovate, as well as effects that decrease incentives for inventors to innovate. Because the effects go both ways, we must look at empirical evidence to see whether or not IP increases innovation. C) Yes, the current pharmaceutical industry relies on patents—of course they do! Current pharmaceutical companies exist in a world with patents, so obviously they use them. As I explained earlier, past pharmaceutical industries thrived without patent protection. D) The reported costs of developing new drugs are largely exaggerated, and would be lower without IP law. Without patents, firms could draw on the research of other companies, which would reduce development costs. In addition, about 75% of current R&D spending is on copycats of existing drugs. [1] How many different drugs have you seen that help you get an erection? Why do different companies waste their time and resources making a bunch of different drugs that do the exact same thing? It's because of IP laws. Pharm companies can get a lot of money developing a new erectile dysfunction drug as long as it's somewhat different, chemically, than the current drugs on the market. If there were no IP laws, companies wouldn't waste their money on this nonsense. They wouldn't need their version to be slightly different from their competitors--they could just use the same formula. Since 75% of R&D is spent on this, not having this copy-cat \"research\" would free up a lot of money that could be used to create new, useful drugs. E) This is actually a point in my favor. The lack of patents in Brazil is not because of lack of patents there, but because of patents in the West. If patents were abolished, as I suggest, pharmaceutical companies wouldn't be less likely to sell their product in Brazil than they are to sell it anywhere else. The current system does sometimes hurt people that live in countries without patent protection, but I am not defending the current system. F) Germany was a long time ago, so it isn't as relevant, but Switzerland and Italy were more recent examples. They had thriving pharmaceutical industries when they introduced pharmaceutical patents in 1978 and 1979, respectively. As I explained earlier, if patents really did promote innovation, pharmaceutical innovation would have increased following the introduction of patents in those countries—but it didn't. As for Pro's study, I agree that many of the drugs today wouldn't be produced without patents. But there are also drugs that aren't produced *because* of patents, which is why overall innovation didn't increase after the introduction of patents in the examples mentioned earlier. For an example of this, Peter Ringrose, the chief scientific officer of Bristol-Myers Squibb told the New York Times that, \"There were more than 50 proteins possibly involved in cancer that the company was not working on because the patent holders either would not allow it or were demanding unreasonable royalties.\" [2] There are countless examples of this sort of behavior—all hurting medical innovation. As for Pro's claim that \"the institution of pharmaceutical patents does not necessarily lead to price increases\": this couldn't possibly be true. The entire *point* of patents is to increase prices—if they didn't, the patentee wouldn't get more money for their production, and wouldn't bother patenting anything. G) This, like E, does not demonstrate the costs of not having patents; it merely demonstrates the cost of a country not having patents while other countries do have them. Obviously, businesses will prefer countries where they enjoy monopoly protection over ones where they don't—but they wouldn't have that choice if IP were abolished. Finally, I'd like to thank theLwerd for a great debate—I had a lot of fun, and hope she did too. [1] Michele Boldrin and David K. Levine, Against Intellectual Monopoly (New York: Cambridge University Press, 2008), 226. [2] Pollack, A. (2001), \"Bristol-Myers and Athersys Make Deal on Gene Patents,\" New York Times, January 8."],"PremiseEndPos":[61824],"ArgumentID":"00000008","Conclusion":"Intellectual Property","PremiseStance":["Con"]}}]}