{"MetaData":{"Context":"URL: http://idebate.org/debatabase/debates/environment/house-would-developed-world-fund-african-climate-adaptation\nCrawl date: 2016/10/12 13:29:09\nTitle: This House would, as the developed world, fund African climate adaptation | idebate.org\nIntro: Greece’s economic woes have been at the forefront of the Eurozone debt crisis over the last few years. It has received bailout packages in the form of emergency low interest rate loans in excess of €200 billion and has written off a portion of the existing public debt. Greece’s public debt rose to dangerous highs of 165% of its GDP in 2010 and its Budget Deficit reached a record high of 16% in 2009. Putting these figures into context, the membership criteria for the Eurozone under the Maastricht Treaty dictates that governments must maintain a budget deficit below 3% and total debt must not exceed 60% of GDP. Although it is true that most other European nations do not conform to these criteria, Greece tops the charts comfortably in terms of debt % GDP and only Ireland has a larger budget deficit. ‘Today’s crisis in Greece is mainly the result of short-sighted policies from the part of 1980s PASOK [main leftist party] governments, in two important respects: (a) PASOK’s economic policies created  a deadly mix of a bloated and inefficient welfare state with stifling intervention and overregulation of the private sector. (b) The political legacy of PASOK was even more devastating in the long-term, since its political success transformed Greece’s conservative party (“New Democracy”) into a poor photocopy of PASOK. From 1981 to 2009 both parties mainly of offered welfare populism, cronyism, statism, nepotism, protectionism, and paternalism.’[1] Subsequently, the nation’s public sector grew and now employs one fifth of the total Greek workforce. Crucially, however, PASOK’s legacy was to create a welfare state riddled with inefficiencies and corruption causing it to leak from all directions. Tax evasion has been a huge problem in the country and is estimated to cost the Greek Government €20-30 billion (i.e. two thirds of the budget deficit) every year. [2] Indeed, the unreported (untaxed) proportion of the Greek economy is thought to amount 25% GDP [3]. What’s more, the gravity and unsustainability of Greece’s debt only became apparent in 2008-9 because the Greek Government employed Wall Street firms including Goldman Sachs to help them fudge the numbers and deceive lenders. [4] Two bailout packages later, and the Greek economy shows limited signs of recovery. The severe austerity measures enforced on the Greek Government by the “troika” constituting the International Monetary Fund (IMF), the European Central Bank (ECB) and the European Commission, have done little more than keep the country afloat and prevent it from defaulting (although the budget deficit has dropped to below 10%)[5]. The austerity measures have largely have largely taken the form of drastic increases in income tax, corporate tax and VAT and reduction of the minimum wage (in an attempt to make the private sector more competitive). Thus far, the results have been hard felt: Greece is in its fourth consecutive year of recession and the economy is shrinking at an unparalleled rate (7% so far in 2012). Unemployment in Greece is second highest in Europe (after Spain), at over 20%, while youth unemployment is at 36%. [6] The theory behind harsh austerity measures is that short term pain will eventually lead to a more efficient and competitive economy and, hopefully, a budget surplus that would start eroding at the total debt. Such targets certainly seem unattainable for Greece in the near future. The Greek coalition Government headed by Antonis Samaras unilaterally seeks to remain in the Eurozone, but has been trying to persuade the ECB, IMF and European Commission to reduce the severity of the austerity measures, primarily by demanding more time with which to implement the measures. Such demands have so far been outright rejected. An alternative to austerity measures that many call for, could be for Greece to undergo an orderly default and leave the Eurozone. Such a scheme would most likely be undertaken overnight so as to lessen the impact of speculation about a possible default.  Although it is true that a Greek Government default does not necessarily lead to them exiting the Eurozone, most believe it would follow, and for the purposes of this debate it will be assumed that that would be the case. Exiting the Eurozone would mean Greece would have to adopt a national currency – in most likelihood their pre-Euro Drachma. ‘Briefly put: the return to the drachma should be sudden, accompanied by a short bank holiday and immediate imposition of capital controls’ [7] to prevent mass outflow of capital from the country. It would also most likely be accompanied by an ECB and European Commission backed bailout package to support the Greek banking system. [8] [1]  Hatzis, Aristides: “Greece as a Precautionary Tale of the Welfare State” in After the Welfare State edited by Tom G. Palmer, Atlas Economic Research Foundation, Washington, DC, 2012 http://users.uoa.gr/~ahatzis/Hatzis_2012_09.pdf [2] ibid [3] ibid [4] ibid [5] BBC Eurozone Crisis Statistics (5/9/2012) http://www.bbc.co.uk/news/business-13366011 [6] ibid [7] Lapavitsas, Costas: “Eurozone crisis: what if … Greece leaves the single currency” 14 May 2012, The Guardian, http://www.guardian.co.uk/world/2012/may/14/greece-euro-single-currency-expert-view. [8] Ruparel, Raoul and Persson, Mats: “Better off Out? The short-term options for Greece inside and outside of the euro”, June 2012, Open Europe, 2012 http://www.openeurope.org.uk/Content/Documents/Pdfs/Greece_better_off_out.pdf\nNumber of arguments: 9\n\n\nClaim For: Climate change is already costing lives\n\nEvidence Pro: Lives are already being lost to climate change; a report by Climate Vulnerability Monitor estimates that already almost 5million are lost per year to climate change, even without the distorting numbers from pollution there are 400,000 deaths per year.[1] While attributing individual events to climate change is difficult research by climate scientists suggests that the lack long rains in Somalia in early 2011 is between 24 and 99% the result of greenhouse gasses.  This famine has killed between 50 and 100 thousand people.[2] With lives being lost the urgency of funding adaptation to reduce these loses is clear.   [1] Climate Vulnerability Monitor, ‘A Guide to the cold calculus of a hot planet’, DARA, September 2012, http://www.daraint.org/wp-content/uploads/2012/09/CVM2ndEd-FrontMatter.pdf, p.17 [2] Straziuso, Jason, ‘Global warming may have fueled Somali drought’, Phys.org, 15 May 2013, http://phys.org/news/2013-03-human-climate-big-factor-somali.html  \n\nEvidence Con: Yes there are almost certainly some casualties already to climate change but almost certainly considerably less than either of these numbers; there have always been casualties due to ‘Heat & Cold Illnesses’ (35000) but are all these attributable to climate change? Probably not. There were extreme weather events even before climate change. Even if there are such deaths this does not amount to meaning the developed world should fund adaptation; just like not every outbreak of violence in Africa should be considered the responsibility of the developed world not every natural disaster is. \n\n\nClaim For: Africa does not have the resources to protect itself from climate change\n\nEvidence Pro: A report by the United Nations Environmental Project estimates that adaptation costs to Africa per year could already be $15billion, reach $50billion by 2050 and anything up to $350billion by 2070. Funding for adaptation to Africa in 2011 was only $454milliion.[1] This is not a gap that Africa can make up itself; in 2010 all spending on education was less than $50billion.[2] Africa can’t afford to adapt itself while responding to an expanding population as well as its existing problems of poverty and disease. It is clear that developed countries that do have the resources have to step it and take responsibility. [1] Schaeffer, Michiel et al., ‘Summary’, Africa Adaptation Gap Technical Report, United Nations Environmental Project, 2013 http://www.unep.org/roa/Amcen/docs/publications/Africa_Adapatation_Gap.pdf , p.xi [2] ‘Public spending on education; total (% of GDP) in sub saharan Africa’, Trading Economics, http://www.tradingeconomics.com/sub-saharan-africa/public-spending-on-education-total-percent-of-gdp-wb-data.html, ‘Gross domestic product 2010’, World Bank, http://siteresources.worldbank.org/DATASTATISTICS/Resources/GDP.pdf  \n\nEvidence Con: While Africa may not have the resources now to pay for adaptation costs of $50billion or more after another fifty years of economic growth it may do. Africa could afford the current $7-15billion if it were considered necessary.\n\n\nClaim For: The developed world has the responsibility to help others\n\nEvidence Pro: The IPCC says that it is “extremely likely” that human activities are the cause of the temperature rise.[1] This means the biggest historical emitters have a responsibility to pay for the consequences. From 1900 to 2004 the United States produced 314,772 million metric tonnes of CO2 compared to China’s 89,243 million metric tonnes and while India now produces more CO2 Germany over the same period emitted three times as much.[2] History matters as much of the CO2 remains in the atmosphere for decades or hundreds of years. It is the responsibility of those who caused the problem to protect innocents from the fallout of their actions. [1] Harvey, Fiona, ‘IPCC climate report: human impact is 'unequivocal'’, theguardian.com, 27 September 2013, http://www.theguardian.com/environment/2013/sep/27/ipcc-climate-report-un-secretary-general [2] Vaughn, Adam, ‘A history of CO2 emissions’, Datablog guardian.co.uk, 2 September 2009, http://www.guardian.co.uk/environment/datablog/2009/sep/02/co2-emissions-historical  \n\nEvidence Con: For most of the time they were emitting the west did not have any idea of the consequences. The developed world therefore cannot be held responsible for emissions before the 1980s. On the other hand knowledge of the effects has not prevented developing countries from immensely increasing their emissions. Clearly the developed world is still responsible for more emissions but they are also responsible for developing technologies to reduce emissions such as renewable power. \n\n\nClaim For: Africa will be among the hardest hit\n\nEvidence Pro: The IPCC starts its chapter on Africa “Africa is one of the most vulnerable continents to climate change and climate variability”.[1] It is also the poorest continent in the world so least able to cope. In the GAIN index by the Global Adaptation Institute which measures vulnerability and readiness for climate change eight of the bottom ten are African states.[2] The changes to Africa could be dramatic; 40% of wildlife habitats could disappear, crop yields fall by 5% despite already being the lowest in the world and 70 million are at risk of flooding as sea levels rise.[3] If anywhere needs help from developed countries in adaptation it is Africa. [1] Boko, Michel, et al., ‘Africa’, Climate Change 2007: Impacts, Adaptation and Vulnerability. Contribution of Working Group II to the Fourth Assessment Report of the Intergovernmental Panel on Climate Change’, IPCC, 2007, http://www.ipcc.ch/pdf/assessment-report/ar4/wg2/ar4-wg2-chapter9.pdf, p.435 [2] Gain Index, 2011, http://index.gain.org/ranking [3] Bloomfield, Steve, ‘Africa ‘will be worst hit by climate change’’, The Independent, 6 November 2006, http://www.independent.co.uk/environment/climate-change/africa-will-be-worst-hit-by-climate-change-423143.html  \n\nEvidence Con: Why should developed countries pay because Africa happens to be particularly vulnerable to the effects of climate change? Western countries have nothing to do with Africa’s geography and climate change vulnerability. \n\n\nClaim For: The developed world has the necessary skills\n\nEvidence Pro: Many of the areas of adaptation are areas where the west has the relevant expertise; seasonal forecasting, adjusting farming – perhaps by engineering hardier plants, weather insurance etc. Africa does not have experience or experts in many of the relevant areas, for example Africa lags behind in bioscience,[1] so it makes sense for the west to provide these experts. And while they do so the west might as well also pay the cost of these expertise and also provide the necessary skills education and training to overcome these problems. [1] Wafula, Kevin, ‘Africa still lags behind on bioscience capacities, says Scientist’, Africa Science News, 2011, http://www.africasciencenews.org/en/index.php?option=com_content&view=article&id=764:africa-still-lags-behind-on-bioscience-capacities-says-scientist-&catid=49:food&Itemid=113  \n\nEvidence Con: The developed world will no doubt be willing to provide expertise and some may even be willing to work pro-bono while doing work for poorer countries. The developed world should not be paying for such work. Providing money to pay for western workers in Africa both invites corruption and is really for the benefit of the developed countries by providing work for western firms.[1] Instead the focus has to be on the transfer of skills to Africans so that they can meet the challenges from climate change themselves. [1] Moyo, Dambisa, ‘Why Foreign Aid is Hurting Africa’, The Wall Street Journal, 21 March 2009, http://online.wsj.com/news/articles/SB123758895999200083#articleTabs%3Darticle  \n\n\nClaim Against: Each country should tackle its own problems\n\nEvidence Pro: Every country is going to be affected by climate change in one way or another developed countries included. Australia has often been singled out as being a country that is “anti-climate”[1] but Australia is already being hit by bigger bushfires and sudden floods and the cost on Australian infrastructure is estimated to rise to $9billion per year by 2020 and continue rising,[2] and this is only one small slice of the costs such as crop failures due to drought, health problems – there have already been increases in dengue fever and malaria in Australia.[3] Developed countries which are also going to be severely affected by climate change have a responsibility to their own people first and should not be paying for other countries to adapt. [1] Readfearn, Graham, ‘Australia slides down to bottom on climate change performance index’, theguardian.com, 18 November 2013, http://www.theguardian.com/environment/2013/nov/18/australia-climate-change-un-warsaw [2] The Climate Institute, ‘Coming Ready or Not: Can Australia's infrastructure handle climate change?’, 29 October 2012, http://www.climateinstitute.org.au/articles/media-releases/coming-ready-or-not-can-australias-infrastructure-handle-climate-change.html [3] Buckley, Ralf et al., ‘Climate response Issues, costs and liabilities in adapting to climate change in Australia.’, Griffith University, 2007, http://www.griffith.edu.au/__data/assets/pdf_file/0016/300643/Climate_Response_Issues.pdf, p.24   \n\nEvidence Con: While countries like Australia are going to be hit by Climate Change they at least have the resources to carry out adaptation on their own. Poor countries don’t have the money so there will not be any adaptation. The result will be more natural disasters and deaths through disease both things that are seen as worthy of providing aid. I would be much better to help prevent these disasters being too severe than waiting until they occur to provide aid.\n\n\nClaim Against: Responsibility is not the developed world’s alone\n\nEvidence Pro: First developing countries now produce a large share of emissions; China, India and other rising countries should also have to pay. They also at the same time have increasing financial resources. Second even if countries bear responsibility in proportion to emissions it does not follow developed countries should meet the costs of adaptation. People have always adapted to their climate as an essential part of survival[1] and the climate has always been changing even if at a slower rate so why should the developed world pay in this particular instance? That the west should cut its emissions so that it produces no more than the average per capita is equitable. It is however not equitable for one group to have to pay for the adaptation of others to their environment. [1] Clark, Duncan, ‘What is climate change adaptation?’, theguardian.com, 27 February 2012, http://www.theguardian.com/environment/2012/feb/27/climate-change-adaptation  \n\nEvidence Con: In India 456 million people live on under $1.25 per day,[1] it is absurd to suggest that India despite having higher CO2 emissions than Japan, indeed almost double,[2] should have the same responsibility for cutting emissions, or for paying for the consequences.   [1] The World Bank, ‘New Global Poverty Estimates – What it means for India’, 26 August 2008, http://go.worldbank.org/51QB3OCFU0 [2] Boden, Tom, and Blasing, T.J., ‘Preliminary CO2 emissions 2010’, Carbon Dioxide Analysis Center, http://cdiac.ornl.gov/trends/emis/perlim_2009_2010_estimates.html  \n\n\nClaim Against: There are other more urgent things to be spending money on\n\nEvidence Pro: Money should be spent where it can make most difference. The cost of many methods of adapting to climate change is high compared to the gain. The developed world should focus aid on areas that can do most good rather than on adaptation. Even those who argue that climate change will be very costly and deadly implicitly agree that there are more worthwhile things. In Climate Vulnerability Monitor’s estimates of deaths the vast majority, 3.1million, are due to indoor smoke.[1] This however is something that is not solved through adaptation to climate change but through mitigation; by providing $25 cooking stoves.[2] [1] Climate Vulnerability Monitor, ‘A Guide to the cold calculus of a hot planet’, DARA, September 2012, http://www.daraint.org/wp-content/uploads/2012/09/CVM2ndEd-FrontMatter.pdf, p.17 [2] Aroon, P.J., ‘Secretary Clinton is promoting cookstoves to save the world. Seriously’, ForeignPolicy.com, 22 September 2010, http://hillary.foreignpolicy.com/posts/2010/09/21/clinton_is_promoting_cookstoves_to_save_the_world?hidecomments=yes  \n\nEvidence Con: Aid programs are already dealing with most of ‘the low hanging fruit’ in terms of preventing deaths and will continue to do so. However providing aid to other areas does not absolve the west of the need to provide funds for adaptation when they have created the change in the first place.\n\n\nClaim Against: Adaptation won’t work\n\nEvidence Pro: Adaptation is simply working to reduce the effects of climate change, it will not prevent it from causing damage. Take hurricanes; adaptation would dictate that the buildings should have been made out of stronger materials and sea walls built to stop storm surges. Yet as with any other form of disaster management there is a sensible amount to adapt if building a 10foot sea wall will stop 95% of storm surges is it really worth building one of 20foot for twice the price to stop 99%? Many forms of adaptation are directly contrary to demographic trends on the continent. Yes hardier crops can be introduced to mitigate the problems of drought but will these also feed a growing population? Yes people can migrate from those areas that will be worst hit but can their neighbours take in the extra people? For example climate change is one cause of drought in the Sahel,[1] to the south rainfall and flooding may actually increase in southern Nigeria though it will be unpredictable.[2] The obvious solution then would be migration from the Sahel south but the UN projects Niger’s population to grow to almost 70million by 2050 and Nigeria’s to 440million,[3] could Nigeria really take the extra population from its northern neighbour as well as its own growth? [1] Thomas, Alice, ‘Sahel villagers fleeing climate change must not be ignored’, theguardian.com, 2 August 2013, http://www.theguardian.com/global-development/poverty-matters/2013/aug/02/sahel-climate-change-displacement-migration [2] Uyigue, E., and Agho, M., ‘Coping with Climate Change and Environmental Degradation in the Niger Delta of Southern Nigeria’, Community Research and Development Centre, 2007, http://www.global-greenhouse-warming.com/climate-change-in-Niger-Delta.html [3] United Nations Department of Economic and Social Affairs, ‘World Population Prospects: The 2012 Revision’, esa.un.org, http://esa.un.org/wpp/unpp/panel_population.htm (using medium variant)  \n\nEvidence Con: Many places today have not even done the minimum and need funding to help them do so. There can be no denying that some defences can make a big difference; in 1900 Galveston was hit by a hurricane which killed up to 12000 people, 15 years later after the building of a sea wall only 53 people died in a similar hurricane.[1] In many cases this kind of adaptation is simply sensible policy to prevent disasters that should be carried out regardless of climate change. [1] Morris, Julian, ‘The Terrible Toll of Typhoon Haiyan Doesn't Excuse Bad Policy’, reason.com, 15 November 2013, http://reason.com/archives/2013/11/15/the-terrible-toll-of-typhoon-haiyan-does  \n","DiscussionID":"00000100","Title":"as the developed world, fund African climate adaptation","CrawlDate":"2016/10/12 13:29:09","URL":"http://idebate.org/debatabase/debates/environment/house-would-developed-world-fund-african-climate-adaptation"},"ArgumentList":[{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000002","PremiseStartPos":[18709],"prevID":"00000000","Premise":["Adaptation won’t work"],"PremiseEndPos":[18732],"ArgumentID":"00000001","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000003","PremiseStartPos":[17259],"prevID":"00000001","Premise":["There are other more urgent things to be spending money on"],"PremiseEndPos":[17319],"ArgumentID":"00000002","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000004","PremiseStartPos":[15654],"prevID":"00000002","Premise":["Responsibility is not the developed world’s alone"],"PremiseEndPos":[15705],"ArgumentID":"00000003","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000005","PremiseStartPos":[13643],"prevID":"00000003","Premise":["Each country should tackle its own problems"],"PremiseEndPos":[13688],"ArgumentID":"00000004","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000006","PremiseStartPos":[12026],"prevID":"00000004","Premise":["The developed world has the necessary skills"],"PremiseEndPos":[12072],"ArgumentID":"00000005","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000007","PremiseStartPos":[10502],"prevID":"00000005","Premise":["Africa will be among the hardest hit"],"PremiseEndPos":[10540],"ArgumentID":"00000006","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000008","PremiseStartPos":[8905],"prevID":"00000006","Premise":["The developed world has the responsibility to help others"],"PremiseEndPos":[8964],"ArgumentID":"00000007","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000009","PremiseStartPos":[7411],"prevID":"00000007","Premise":["Africa does not have the resources to protect itself from climate change"],"PremiseEndPos":[7485],"ArgumentID":"00000008","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":153,"ConclusionEndPos":227,"nextID":"00000010","PremiseStartPos":[5767],"prevID":"00000008","Premise":["Climate change is already costing lives"],"PremiseEndPos":[5808],"ArgumentID":"00000009","Conclusion":"This House would, as the developed world, fund African climate adaptation","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":5767,"ConclusionEndPos":5808,"nextID":"00000011","PremiseStartPos":[6805],"prevID":"00000009","Premise":["Yes there are almost certainly some casualties already to climate change but almost certainly considerably less than either of these numbers; there have always been casualties due to ‘Heat & Cold Illnesses’ (35000) but are all these attributable to climate change? Probably not. There were extreme weather events even before climate change. Even if there are such deaths this does not amount to meaning the developed world should fund adaptation; just like not every outbreak of violence in Africa should be considered the responsibility of the developed world not every natural disaster is. "],"PremiseEndPos":[7398],"ArgumentID":"00000010","Conclusion":"Climate change is already costing lives","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":5767,"ConclusionEndPos":5808,"nextID":"00000012","PremiseStartPos":[5822],"prevID":"00000010","Premise":["Lives are already being lost to climate change; a report by Climate Vulnerability Monitor estimates that already almost 5million are lost per year to climate change, even without the distorting numbers from pollution there are 400,000 deaths per year.[1] While attributing individual events to climate change is difficult research by climate scientists suggests that the lack long rains in Somalia in early 2011 is between 24 and 99% the result of greenhouse gasses.  This famine has killed between 50 and 100 thousand people.[2] With lives being lost the urgency of funding adaptation to reduce these loses is clear.   [1] Climate Vulnerability Monitor, ‘A Guide to the cold calculus of a hot planet’, DARA, September 2012, http://www.daraint.org/wp-content/uploads/2012/09/CVM2ndEd-FrontMatter.pdf, p.17 [2] Straziuso, Jason, ‘Global warming may have fueled Somali drought’, Phys.org, 15 May 2013, http://phys.org/news/2013-03-human-climate-big-factor-somali.html  "],"PremiseEndPos":[6790],"ArgumentID":"00000011","Conclusion":"Climate change is already costing lives","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":7411,"ConclusionEndPos":7485,"nextID":"00000013","PremiseStartPos":[8664],"prevID":"00000011","Premise":["While Africa may not have the resources now to pay for adaptation costs of $50billion or more after another fifty years of economic growth it may do. Africa could afford the current $7-15billion if it were considered necessary."],"PremiseEndPos":[8892],"ArgumentID":"00000012","Conclusion":"Africa does not have the resources to protect itself from climate change","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":7411,"ConclusionEndPos":7485,"nextID":"00000014","PremiseStartPos":[7499],"prevID":"00000012","Premise":["A report by the United Nations Environmental Project estimates that adaptation costs to Africa per year could already be $15billion, reach $50billion by 2050 and anything up to $350billion by 2070. Funding for adaptation to Africa in 2011 was only $454milliion.[1] This is not a gap that Africa can make up itself; in 2010 all spending on education was less than $50billion.[2] Africa can’t afford to adapt itself while responding to an expanding population as well as its existing problems of poverty and disease. It is clear that developed countries that do have the resources have to step it and take responsibility. [1] Schaeffer, Michiel et al., ‘Summary’, Africa Adaptation Gap Technical Report, United Nations Environmental Project, 2013 http://www.unep.org/roa/Amcen/docs/publications/Africa_Adapatation_Gap.pdf , p.xi [2] ‘Public spending on education; total (% of GDP) in sub saharan Africa’, Trading Economics, http://www.tradingeconomics.com/sub-saharan-africa/public-spending-on-education-total-percent-of-gdp-wb-data.html, ‘Gross domestic product 2010’, World Bank, http://siteresources.worldbank.org/DATASTATISTICS/Resources/GDP.pdf  "],"PremiseEndPos":[8649],"ArgumentID":"00000013","Conclusion":"Africa does not have the resources to protect itself from climate change","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":8905,"ConclusionEndPos":8964,"nextID":"00000015","PremiseStartPos":[10011],"prevID":"00000013","Premise":["For most of the time they were emitting the west did not have any idea of the consequences. The developed world therefore cannot be held responsible for emissions before the 1980s. On the other hand knowledge of the effects has not prevented developing countries from immensely increasing their emissions. Clearly the developed world is still responsible for more emissions but they are also responsible for developing technologies to reduce emissions such as renewable power. "],"PremiseEndPos":[10489],"ArgumentID":"00000014","Conclusion":"The developed world has the responsibility to help others","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":8905,"ConclusionEndPos":8964,"nextID":"00000016","PremiseStartPos":[8978],"prevID":"00000014","Premise":["The IPCC says that it is “extremely likely” that human activities are the cause of the temperature rise.[1] This means the biggest historical emitters have a responsibility to pay for the consequences. From 1900 to 2004 the United States produced 314,772 million metric tonnes of CO2 compared to China’s 89,243 million metric tonnes and while India now produces more CO2 Germany over the same period emitted three times as much.[2] History matters as much of the CO2 remains in the atmosphere for decades or hundreds of years. It is the responsibility of those who caused the problem to protect innocents from the fallout of their actions. [1] Harvey, Fiona, ‘IPCC climate report: human impact is 'unequivocal'’, theguardian.com, 27 September 2013, http://www.theguardian.com/environment/2013/sep/27/ipcc-climate-report-un-secretary-general [2] Vaughn, Adam, ‘A history of CO2 emissions’, Datablog guardian.co.uk, 2 September 2009, http://www.guardian.co.uk/environment/datablog/2009/sep/02/co2-emissions-historical  "],"PremiseEndPos":[9996],"ArgumentID":"00000015","Conclusion":"The developed world has the responsibility to help others","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":10502,"ConclusionEndPos":10540,"nextID":"00000017","PremiseStartPos":[11795],"prevID":"00000015","Premise":["Why should developed countries pay because Africa happens to be particularly vulnerable to the effects of climate change? Western countries have nothing to do with Africa’s geography and climate change vulnerability. "],"PremiseEndPos":[12013],"ArgumentID":"00000016","Conclusion":"Africa will be among the hardest hit","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":10502,"ConclusionEndPos":10540,"nextID":"00000018","PremiseStartPos":[10554],"prevID":"00000016","Premise":["The IPCC starts its chapter on Africa “Africa is one of the most vulnerable continents to climate change and climate variability”.[1] It is also the poorest continent in the world so least able to cope. In the GAIN index by the Global Adaptation Institute which measures vulnerability and readiness for climate change eight of the bottom ten are African states.[2] The changes to Africa could be dramatic; 40% of wildlife habitats could disappear, crop yields fall by 5% despite already being the lowest in the world and 70 million are at risk of flooding as sea levels rise.[3] If anywhere needs help from developed countries in adaptation it is Africa. [1] Boko, Michel, et al., ‘Africa’, Climate Change 2007: Impacts, Adaptation and Vulnerability. Contribution of Working Group II to the Fourth Assessment Report of the Intergovernmental Panel on Climate Change’, IPCC, 2007, http://www.ipcc.ch/pdf/assessment-report/ar4/wg2/ar4-wg2-chapter9.pdf, p.435 [2] Gain Index, 2011, http://index.gain.org/ranking [3] Bloomfield, Steve, ‘Africa ‘will be worst hit by climate change’’, The Independent, 6 November 2006, http://www.independent.co.uk/environment/climate-change/africa-will-be-worst-hit-by-climate-change-423143.html  "],"PremiseEndPos":[11780],"ArgumentID":"00000017","Conclusion":"Africa will be among the hardest hit","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":12026,"ConclusionEndPos":12072,"nextID":"00000019","PremiseStartPos":[12933],"prevID":"00000017","Premise":["The developed world will no doubt be willing to provide expertise and some may even be willing to work pro-bono while doing work for poorer countries. The developed world should not be paying for such work. Providing money to pay for western workers in Africa both invites corruption and is really for the benefit of the developed countries by providing work for western firms.[1] Instead the focus has to be on the transfer of skills to Africans so that they can meet the challenges from climate change themselves. [1] Moyo, Dambisa, ‘Why Foreign Aid is Hurting Africa’, The Wall Street Journal, 21 March 2009, http://online.wsj.com/news/articles/SB123758895999200083#articleTabs%3Darticle  "],"PremiseEndPos":[13626],"ArgumentID":"00000018","Conclusion":"The developed world has the necessary skills","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":12026,"ConclusionEndPos":12072,"nextID":"00000020","PremiseStartPos":[12086],"prevID":"00000018","Premise":["Many of the areas of adaptation are areas where the west has the relevant expertise; seasonal forecasting, adjusting farming – perhaps by engineering hardier plants, weather insurance etc. Africa does not have experience or experts in many of the relevant areas, for example Africa lags behind in bioscience,[1] so it makes sense for the west to provide these experts. And while they do so the west might as well also pay the cost of these expertise and also provide the necessary skills education and training to overcome these problems. [1] Wafula, Kevin, ‘Africa still lags behind on bioscience capacities, says Scientist’, Africa Science News, 2011, http://www.africasciencenews.org/en/index.php?option=com_content&view=article&id=764:africa-still-lags-behind-on-bioscience-capacities-says-scientist-&catid=49:food&Itemid=113  "],"PremiseEndPos":[12918],"ArgumentID":"00000019","Conclusion":"The developed world has the necessary skills","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":13643,"ConclusionEndPos":13688,"nextID":"00000021","PremiseStartPos":[15183],"prevID":"00000019","Premise":["While countries like Australia are going to be hit by Climate Change they at least have the resources to carry out adaptation on their own. Poor countries don’t have the money so there will not be any adaptation. The result will be more natural disasters and deaths through disease both things that are seen as worthy of providing aid. I would be much better to help prevent these disasters being too severe than waiting until they occur to provide aid."],"PremiseEndPos":[15637],"ArgumentID":"00000020","Conclusion":"Each country should tackle its own problems","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":13643,"ConclusionEndPos":13688,"nextID":"00000022","PremiseStartPos":[13702],"prevID":"00000020","Premise":["Every country is going to be affected by climate change in one way or another developed countries included. Australia has often been singled out as being a country that is “anti-climate”[1] but Australia is already being hit by bigger bushfires and sudden floods and the cost on Australian infrastructure is estimated to rise to $9billion per year by 2020 and continue rising,[2] and this is only one small slice of the costs such as crop failures due to drought, health problems – there have already been increases in dengue fever and malaria in Australia.[3] Developed countries which are also going to be severely affected by climate change have a responsibility to their own people first and should not be paying for other countries to adapt. [1] Readfearn, Graham, ‘Australia slides down to bottom on climate change performance index’, theguardian.com, 18 November 2013, http://www.theguardian.com/environment/2013/nov/18/australia-climate-change-un-warsaw [2] The Climate Institute, ‘Coming Ready or Not: Can Australia's infrastructure handle climate change?’, 29 October 2012, http://www.climateinstitute.org.au/articles/media-releases/coming-ready-or-not-can-australias-infrastructure-handle-climate-change.html [3] Buckley, Ralf et al., ‘Climate response Issues, costs and liabilities in adapting to climate change in Australia.’, Griffith University, 2007, http://www.griffith.edu.au/__data/assets/pdf_file/0016/300643/Climate_Response_Issues.pdf, p.24   "],"PremiseEndPos":[15168],"ArgumentID":"00000021","Conclusion":"Each country should tackle its own problems","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":15654,"ConclusionEndPos":15705,"nextID":"00000023","PremiseStartPos":[16679],"prevID":"00000021","Premise":["In India 456 million people live on under $1.25 per day,[1] it is absurd to suggest that India despite having higher CO2 emissions than Japan, indeed almost double,[2] should have the same responsibility for cutting emissions, or for paying for the consequences.   [1] The World Bank, ‘New Global Poverty Estimates – What it means for India’, 26 August 2008, http://go.worldbank.org/51QB3OCFU0 [2] Boden, Tom, and Blasing, T.J., ‘Preliminary CO2 emissions 2010’, Carbon Dioxide Analysis Center, http://cdiac.ornl.gov/trends/emis/perlim_2009_2010_estimates.html  "],"PremiseEndPos":[17242],"ArgumentID":"00000022","Conclusion":"Responsibility is not the developed world’s alone","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":15654,"ConclusionEndPos":15705,"nextID":"00000024","PremiseStartPos":[15719],"prevID":"00000022","Premise":["First developing countries now produce a large share of emissions; China, India and other rising countries should also have to pay. They also at the same time have increasing financial resources. Second even if countries bear responsibility in proportion to emissions it does not follow developed countries should meet the costs of adaptation. People have always adapted to their climate as an essential part of survival[1] and the climate has always been changing even if at a slower rate so why should the developed world pay in this particular instance? That the west should cut its emissions so that it produces no more than the average per capita is equitable. It is however not equitable for one group to have to pay for the adaptation of others to their environment. [1] Clark, Duncan, ‘What is climate change adaptation?’, theguardian.com, 27 February 2012, http://www.theguardian.com/environment/2012/feb/27/climate-change-adaptation  "],"PremiseEndPos":[16664],"ArgumentID":"00000023","Conclusion":"Responsibility is not the developed world’s alone","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":17259,"ConclusionEndPos":17319,"nextID":"00000025","PremiseStartPos":[18403],"prevID":"00000023","Premise":["Aid programs are already dealing with most of ‘the low hanging fruit’ in terms of preventing deaths and will continue to do so. However providing aid to other areas does not absolve the west of the need to provide funds for adaptation when they have created the change in the first place."],"PremiseEndPos":[18692],"ArgumentID":"00000024","Conclusion":"There are other more urgent things to be spending money on","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":17259,"ConclusionEndPos":17319,"nextID":"00000026","PremiseStartPos":[17333],"prevID":"00000024","Premise":["Money should be spent where it can make most difference. The cost of many methods of adapting to climate change is high compared to the gain. The developed world should focus aid on areas that can do most good rather than on adaptation. Even those who argue that climate change will be very costly and deadly implicitly agree that there are more worthwhile things. In Climate Vulnerability Monitor’s estimates of deaths the vast majority, 3.1million, are due to indoor smoke.[1] This however is something that is not solved through adaptation to climate change but through mitigation; by providing $25 cooking stoves.[2] [1] Climate Vulnerability Monitor, ‘A Guide to the cold calculus of a hot planet’, DARA, September 2012, http://www.daraint.org/wp-content/uploads/2012/09/CVM2ndEd-FrontMatter.pdf, p.17 [2] Aroon, P.J., ‘Secretary Clinton is promoting cookstoves to save the world. Seriously’, ForeignPolicy.com, 22 September 2010, http://hillary.foreignpolicy.com/posts/2010/09/21/clinton_is_promoting_cookstoves_to_save_the_world?hidecomments=yes  "],"PremiseEndPos":[18388],"ArgumentID":"00000025","Conclusion":"There are other more urgent things to be spending money on","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":18709,"ConclusionEndPos":18732,"nextID":"00000027","PremiseStartPos":[20704],"prevID":"00000025","Premise":["Many places today have not even done the minimum and need funding to help them do so. There can be no denying that some defences can make a big difference; in 1900 Galveston was hit by a hurricane which killed up to 12000 people, 15 years later after the building of a sea wall only 53 people died in a similar hurricane.[1] In many cases this kind of adaptation is simply sensible policy to prevent disasters that should be carried out regardless of climate change. [1] Morris, Julian, ‘The Terrible Toll of Typhoon Haiyan Doesn't Excuse Bad Policy’, reason.com, 15 November 2013, http://reason.com/archives/2013/11/15/the-terrible-toll-of-typhoon-haiyan-does  "],"PremiseEndPos":[21367],"ArgumentID":"00000026","Conclusion":"Adaptation won’t work","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":18709,"ConclusionEndPos":18732,"nextID":"00000000","PremiseStartPos":[18746],"prevID":"00000026","Premise":["Adaptation is simply working to reduce the effects of climate change, it will not prevent it from causing damage. Take hurricanes; adaptation would dictate that the buildings should have been made out of stronger materials and sea walls built to stop storm surges. Yet as with any other form of disaster management there is a sensible amount to adapt if building a 10foot sea wall will stop 95% of storm surges is it really worth building one of 20foot for twice the price to stop 99%? Many forms of adaptation are directly contrary to demographic trends on the continent. Yes hardier crops can be introduced to mitigate the problems of drought but will these also feed a growing population? Yes people can migrate from those areas that will be worst hit but can their neighbours take in the extra people? For example climate change is one cause of drought in the Sahel,[1] to the south rainfall and flooding may actually increase in southern Nigeria though it will be unpredictable.[2] The obvious solution then would be migration from the Sahel south but the UN projects Niger’s population to grow to almost 70million by 2050 and Nigeria’s to 440million,[3] could Nigeria really take the extra population from its northern neighbour as well as its own growth? [1] Thomas, Alice, ‘Sahel villagers fleeing climate change must not be ignored’, theguardian.com, 2 August 2013, http://www.theguardian.com/global-development/poverty-matters/2013/aug/02/sahel-climate-change-displacement-migration [2] Uyigue, E., and Agho, M., ‘Coping with Climate Change and Environmental Degradation in the Niger Delta of Southern Nigeria’, Community Research and Development Centre, 2007, http://www.global-greenhouse-warming.com/climate-change-in-Niger-Delta.html [3] United Nations Department of Economic and Social Affairs, ‘World Population Prospects: The 2012 Revision’, esa.un.org, http://esa.un.org/wpp/unpp/panel_population.htm (using medium variant)  "],"PremiseEndPos":[20689],"ArgumentID":"00000027","Conclusion":"Adaptation won’t work","PremiseStance":["Pro"]}}]}