{"MetaData":{"Context":"URL: http://www.debate.org/debates/Human-beings-are-justified-in-killing-animals-for-the-resources-animals-provide./1/\nCrawl date: 2016/09/29 04:13:18\nOnline Debate: Human beings are justified in killing animals for the resources animals provide. | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: I'd like to thank my opponent for creating this debate. It certainly is an interesting topic. I will be arguing that not only are humans justified in killing animals for resources, but that it is also necessary that we do so. 1. Research and Medical Advancement It is well known that animals are often used in the research and development of new products. These animals can range from algae growths to lab rats. Sometimes, larger animals like pigs are used. When developing a new drug, it is necessary to run many animal trials before human trials are allowed. This insures that the drug is safe for human usage and it is quite common for animals to die during this process. In this way, the killing of animals provide a resource that is useful not only for creating new drugs, but for gaining insight on the way some diseases affect the human body. Without the ability to use animals for this purpose, it would be a significant challenge to produce new medical technologies and products. This would adversely affect the human race and the advancement of medical science. 2. Animal Organs and Their Use in Humans In today's world, we already use the heart valves of the pig for human transplants. Human donor hearts are not always available, so the use of pig organs is invaluable to saving human lives. This in and of itself justifies the killing of a pig. Additionally, new research is suggesting that genetically modified animals may be able to donate other organs in the near future. [1] This includes the use of animals kidneys, pancreas', and livers. If we were to stop killing animals, it would be impossible for these technologies to come into reality. This, in turn, would mean many human lives would be lost. 3. Animals and Economic Good The resources that animal provide us do not only include tangible goods. The raising and killing of animals for their various physical resources also produces another resource in turn -- economic good. The animal food industry is a booming one in most parts of the world. If we stopped doing this, many people would no longer have jobs and a large part of the world's revenue generation would be trampled. In hurting the economy and making people lose their jobs, we create a worse of society as a whole. A weak economy stunts growth in nearly all industries, from retail to STEM fields. Preserving a strong economy justifies the killing of animals. 4. Hunting I will discuss two more intangible resources directly gained by the killing of animals. The first is for pleasure. Hunting (and fishing) is widely practiced for sport in many parts of the world. For many people, hunting is one of the most pleasurable things they can do. Often, countries set limitations on the types of animals that can be hunted to be sure that the animals in question are not endangered and that they do not have another use. Since the method used to kill these animals is not a form off torture and since the animals do not better serve humanity while living, it is a net benefit for humanity to hunt. The next resource is a very important one -- space. It is necessary to provide a certain level of animal population control. When unchecked, a particular animal population can grow wildly out of control, presenting a danger to the local ecological setting and, occasionally, to humans. When we allow nature to \"fall out of balance\", it can significantly and adversely affect the biological climate. This can present problems for humans and other animal species alike. Conclusion I have provided four arguments as to why it is ethical and, in some cases, necessary for humans to kill animals for their resources. The opponent has made the assumption that an animal's only use is for its meat. Above, I have shown that to be patently false. Animals have been killed by humans since the beginning of humanity itself and our way of utilizing the resources they provide has grown exponentially since then. I look forward to my opponent's response. Sources 1 -\n\nEvidence Pro: I thank my opponent for submitting an argument and it is completely acceptable that it was limited in size. I'm honestly just happy that there was a response at all. (It is a sad fact that too many people on this site start debates they never intend to finish.) Anyway, let's jump into it! Animal Testing My opponent claims that animal trials in drug testing are no longer necessary due to emerging technology that allows researchers to grow human cells and organs in a type of 'incubator'. While I certainly respect this emerging field, it is just that -- emerging. As the opponent mentions, human cells can indeed be grown outside of a human. However, there has yet to be any complex organ replicated that accurately functions as it would in a person. If this were currently possible, there would no longer be a transplant list and people would be living much longer, as they could simply have their defunct organs replaced with grown ones. It's important that this debate is taking place and concern the status quo, the way things currently are. It's quite possible that sometime down the line animals will not be necessary for testing purposes, however this is not the case now. It is additionally possible that, in the future, we develop a way to remove a fetus from the womb at any stage, allowing for continued healthy growth of the child. But since this hasn't happened yet, the debate around abortion rage on, just as this one does and should. Lastly, it's important to note that drugs are systemic in nature. They affect all parts of the body, often in surprising ways. Animals like pigs and mice have these complete systems and we find that drugs often behave the same way in them as they do us. What's more important, perhaps, is that bad drugs are immediately evident if the animals develop adverse effects. Even if we could grow human organs, fully functioning and all, this would still not be enough to test drugs effectively. A full human analogue of organs would be necessary. But at that point, you've created a new human being -- which comes with a host of issues on its own. Animal Organ Use in Humans I will cede this point to the opponent. He made a solid point about bioengineered animals being able to be useful without necessitating their death, in this scenario I will split the hunting/population control argument into two parts, for clarity, as well as briefly join the hunting and economic argument, as my opponent's way of dealing with the two is identical. Hunting/Economic Good The opponent has attempted to circumvent the heart of my argument by using a semantic argument. A quick search on the definition of 'resource' [ yields a wealth of definitions. Note \"a natural feature or phenomenon that enhances the quality of human life\". This is really the basic concept of what a resource is. There can be no doubt that humans value pleasure as a resource -- as a large amount of human decisions take this directly into account. We eat food we prefer for pleasure, we buy houses we like for pleasure, we spend our leisure time on pleasurable activities. There can be no doubt that pleasure enhances the quality of human life, and in fact may be a key part of what humans consider to my life quality. Given this, it is clear my argument still stands. When the animal is not endangered and when the pleasure a human gets from killing it outweighs all of the benefits humanity gets from it being alive, the killing is completely justified. This argument also applies to the economy. It is clear that economic good directly increases the quality of human life, meaning it should be treated as a resource as well. While this broader definition of 'resource' may not be what my opponent originally foresaw, it is clearly a useful definition in the context of this debate and it demands to be considered. Population Control I do have to agree with my opponent on part of this argument -- nature does often remain in balance when humans do not interfere with it. However, it is a fact of life that humans must inherently interact with nature -- as they are part of it. Even in a world where humans did not kill animals, we would still displace them, transport them from place to place and use them in other ways beneficial to us. It is these uses that create situations where population control is necessary. For instance, it is quite common for the actions of a human to introduce a predator into an ecosystem where it previously did not exist. Often, the animals there have not developed ways of dealing with this predator and it can wreak havoc on the system. Sometimes, hunting in the name of population control is the only way to deal with the problem. In fact, if the goal is to protect animal life, it is often in our best interest to hunt the predator. To picture this, imagine a world exactly like today's, except there are no prisons and no way to incarcerate people. It would be necessary to kill many criminals, as their continued existence threatens more than one life. Similarly, population control is good for the animal kingdom as it helps restore the balance of nature that humans cannot help but upset. Opponent's Additional Thoughts My opponent seems to believe that there are superior ways of solving problems that we currently solve by killing animals. Additionally he believes that close interactions with animals have resulted in many deadly diseases. Regarding his first thought, I have shown this is untrue. I have shown it is in some cases superior for the human race to utilize animals and in other cases superior for both the human and animals races to utilize animals. While future technology may change this, in the status quo animal-based options continue to be superior in many fields. As for his second thought, the rationale is just plain wrong. Regardless of whether we kill animals, we still interact closely with them. The avian flu would not have been avoided had we simply stopped killing chickens. The swine flu would not have been avoided by no longer killing pigs. And in the time when bubonic plague was a threat, it was the cities and regions who attempted to destroy the rat population and infected humans that had the fewest casualties. In that case, killing the animals actually resulted in an increase of two valuable resources -- health and safety. Conclusions My opponent made some fantastic points and even convinced me of one of his arguments. However, the rest I have shown to be inadequate. I look forward to my opponent's response! Thanks for reading!\n\nEvidence Pro: Extend.\n\nEvidence Con: I am new to this debate format. I hope I have completed the normal procedures in opening a debate. The basic premise for my argument (con/against) is that animals are no longer necessary to human survival. Indeed, land resources can be better utilized to provide larger yields of consumable crops than animal feed. Additionally, human beings no longer need animal-based meat products to survive and many vegetarians live healthy lifestyles without animal-based products. This is the basic argument I propose. If my opponent would like to explore moral, economic, or cultural basis for the killing/consumption of animals/animal-based products, I would love to debate those as well. Please excuse any grammatical errors or any other oversight in my writing, I am a student.\n\nEvidence Con: First, like to thank my opponent for engaging me on this topic. I will continue my argument that human beings are not justified in killing animals for the resources they provide. I will additionally discuss the consequences of this fabricated dependence. After addressing my opponents argument, I will similarly highlight some points for discussion. Research and Medical Advancement \"When developing a new drug, it is necessary to run many animal trials before human trials are allowed.\" I argue that it is no longer necessary to test animals for new medicines. Human cells can be grown within an incubator and fabricated to represent organs. Due to stem cell research, animal testing is growing obsolete. Human cells can better represent actual human responses when exposed to new drugs. Involving animals such as pigs and mice in laboratory procedures has produced misleading data before. Although experimenting with human cells is far more expensive, the results produced by such experimentation have far more potential. Animal Organs and Their Use in Humans I would like to address the first permanent and successful artificial heart, the Jarvik-7. The first permanent heart transplant undergone by a human patient took place with a mechanical heart. Additionally, animals can be grown to produce organs outside their bodies. It is not necessary to kill the host of the transplant organ. A host pig, for example, can be inseminated with multiple hearts. Animals and Economic Good/Hunting The word resource indicates, by definition, a stock or supply of money, materials, staff, and other assets that can be drawn on by a person or organization in order to function effectively. Pleasure is not a resource. Likewise, jobs are not a resource. Neither is trade. In this case, the \"resources\" proposed as being derived from animals are not tangible. \"It is necessary to provide a certain level of animal population control.\" Population control is not a function demanded of human beings. Animal populations regulate themselves by exhausting natural resources and starving. Human beings have a very poor track record of keeping nature in balance. If the ultimate goal of human beings it to preserve ecological balance, inaction would be the best approach. My opponent has highlighted multiple ways in which human beings utilize animal species. I maintain that none of these measures are necessary and/or superior to alternate means. Additionally, diseases such as the bubonic plague, swine flue, and bird flue, have found basis in animal species closely associated with human beings. Involving animals in research and transplanting the organs of such animal offers a possible route of cross contamination. Finally I would like to apologize to my opponent for preparing such a limited response. Due to personal conflict, I was unable to spend as much time as I would have preferred discussing this topic. I hope to compose a more adequate response in the next round.\n\nEvidence Con: Amfeather forfeited this round. Pro Extend.\n","DiscussionID":"00000115","Title":"Human beings are justified in killing animals for the resources animals provide.","CrawlDate":"2016/09/29 04:13:18","URL":"http://www.debate.org/debates/Human-beings-are-justified-in-killing-animals-for-the-resources-animals-provide./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":166,"ConclusionEndPos":246,"nextID":"00000002","PremiseStartPos":[298],"prevID":"00000000","Premise":["I'd like to thank my opponent for creating this debate. It certainly is an interesting topic. I will be arguing that not only are humans justified in killing animals for resources, but that it is also necessary that we do so. 1. Research and Medical Advancement It is well known that animals are often used in the research and development of new products. These animals can range from algae growths to lab rats. Sometimes, larger animals like pigs are used. When developing a new drug, it is necessary to run many animal trials before human trials are allowed. This insures that the drug is safe for human usage and it is quite common for animals to die during this process. In this way, the killing of animals provide a resource that is useful not only for creating new drugs, but for gaining insight on the way some diseases affect the human body. Without the ability to use animals for this purpose, it would be a significant challenge to produce new medical technologies and products. This would adversely affect the human race and the advancement of medical science. 2. Animal Organs and Their Use in Humans In today's world, we already use the heart valves of the pig for human transplants. Human donor hearts are not always available, so the use of pig organs is invaluable to saving human lives. This in and of itself justifies the killing of a pig. Additionally, new research is suggesting that genetically modified animals may be able to donate other organs in the near future. [1] This includes the use of animals kidneys, pancreas', and livers. If we were to stop killing animals, it would be impossible for these technologies to come into reality. This, in turn, would mean many human lives would be lost. 3. Animals and Economic Good The resources that animal provide us do not only include tangible goods. The raising and killing of animals for their various physical resources also produces another resource in turn -- economic good. The animal food industry is a booming one in most parts of the world. If we stopped doing this, many people would no longer have jobs and a large part of the world's revenue generation would be trampled. In hurting the economy and making people lose their jobs, we create a worse of society as a whole. A weak economy stunts growth in nearly all industries, from retail to STEM fields. Preserving a strong economy justifies the killing of animals. 4. Hunting I will discuss two more intangible resources directly gained by the killing of animals. The first is for pleasure. Hunting (and fishing) is widely practiced for sport in many parts of the world. For many people, hunting is one of the most pleasurable things they can do. Often, countries set limitations on the types of animals that can be hunted to be sure that the animals in question are not endangered and that they do not have another use. Since the method used to kill these animals is not a form off torture and since the animals do not better serve humanity while living, it is a net benefit for humanity to hunt. The next resource is a very important one -- space. It is necessary to provide a certain level of animal population control. When unchecked, a particular animal population can grow wildly out of control, presenting a danger to the local ecological setting and, occasionally, to humans. When we allow nature to \"fall out of balance\", it can significantly and adversely affect the biological climate. This can present problems for humans and other animal species alike. Conclusion I have provided four arguments as to why it is ethical and, in some cases, necessary for humans to kill animals for their resources. The opponent has made the assumption that an animal's only use is for its meat. Above, I have shown that to be patently false. Animals have been killed by humans since the beginning of humanity itself and our way of utilizing the resources they provide has grown exponentially since then. I look forward to my opponent's response. Sources 1 -"],"PremiseEndPos":[4284],"ArgumentID":"00000001","Conclusion":"Human beings are justified in killing animals for the resources animals provide.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":166,"ConclusionEndPos":246,"nextID":"00000003","PremiseStartPos":[4299],"prevID":"00000001","Premise":["I thank my opponent for submitting an argument and it is completely acceptable that it was limited in size. I'm honestly just happy that there was a response at all. (It is a sad fact that too many people on this site start debates they never intend to finish.) Anyway, let's jump into it! Animal Testing My opponent claims that animal trials in drug testing are no longer necessary due to emerging technology that allows researchers to grow human cells and organs in a type of 'incubator'. While I certainly respect this emerging field, it is just that -- emerging. As the opponent mentions, human cells can indeed be grown outside of a human. However, there has yet to be any complex organ replicated that accurately functions as it would in a person. If this were currently possible, there would no longer be a transplant list and people would be living much longer, as they could simply have their defunct organs replaced with grown ones. It's important that this debate is taking place and concern the status quo, the way things currently are. It's quite possible that sometime down the line animals will not be necessary for testing purposes, however this is not the case now. It is additionally possible that, in the future, we develop a way to remove a fetus from the womb at any stage, allowing for continued healthy growth of the child. But since this hasn't happened yet, the debate around abortion rage on, just as this one does and should. Lastly, it's important to note that drugs are systemic in nature. They affect all parts of the body, often in surprising ways. Animals like pigs and mice have these complete systems and we find that drugs often behave the same way in them as they do us. What's more important, perhaps, is that bad drugs are immediately evident if the animals develop adverse effects. Even if we could grow human organs, fully functioning and all, this would still not be enough to test drugs effectively. A full human analogue of organs would be necessary. But at that point, you've created a new human being -- which comes with a host of issues on its own. Animal Organ Use in Humans I will cede this point to the opponent. He made a solid point about bioengineered animals being able to be useful without necessitating their death, in this scenario I will split the hunting/population control argument into two parts, for clarity, as well as briefly join the hunting and economic argument, as my opponent's way of dealing with the two is identical. Hunting/Economic Good The opponent has attempted to circumvent the heart of my argument by using a semantic argument. A quick search on the definition of 'resource' [ yields a wealth of definitions. Note \"a natural feature or phenomenon that enhances the quality of human life\". This is really the basic concept of what a resource is. There can be no doubt that humans value pleasure as a resource -- as a large amount of human decisions take this directly into account. We eat food we prefer for pleasure, we buy houses we like for pleasure, we spend our leisure time on pleasurable activities. There can be no doubt that pleasure enhances the quality of human life, and in fact may be a key part of what humans consider to my life quality. Given this, it is clear my argument still stands. When the animal is not endangered and when the pleasure a human gets from killing it outweighs all of the benefits humanity gets from it being alive, the killing is completely justified. This argument also applies to the economy. It is clear that economic good directly increases the quality of human life, meaning it should be treated as a resource as well. While this broader definition of 'resource' may not be what my opponent originally foresaw, it is clearly a useful definition in the context of this debate and it demands to be considered. Population Control I do have to agree with my opponent on part of this argument -- nature does often remain in balance when humans do not interfere with it. However, it is a fact of life that humans must inherently interact with nature -- as they are part of it. Even in a world where humans did not kill animals, we would still displace them, transport them from place to place and use them in other ways beneficial to us. It is these uses that create situations where population control is necessary. For instance, it is quite common for the actions of a human to introduce a predator into an ecosystem where it previously did not exist. Often, the animals there have not developed ways of dealing with this predator and it can wreak havoc on the system. Sometimes, hunting in the name of population control is the only way to deal with the problem. In fact, if the goal is to protect animal life, it is often in our best interest to hunt the predator. To picture this, imagine a world exactly like today's, except there are no prisons and no way to incarcerate people. It would be necessary to kill many criminals, as their continued existence threatens more than one life. Similarly, population control is good for the animal kingdom as it helps restore the balance of nature that humans cannot help but upset. Opponent's Additional Thoughts My opponent seems to believe that there are superior ways of solving problems that we currently solve by killing animals. Additionally he believes that close interactions with animals have resulted in many deadly diseases. Regarding his first thought, I have shown this is untrue. I have shown it is in some cases superior for the human race to utilize animals and in other cases superior for both the human and animals races to utilize animals. While future technology may change this, in the status quo animal-based options continue to be superior in many fields. As for his second thought, the rationale is just plain wrong. Regardless of whether we kill animals, we still interact closely with them. The avian flu would not have been avoided had we simply stopped killing chickens. The swine flu would not have been avoided by no longer killing pigs. And in the time when bubonic plague was a threat, it was the cities and regions who attempted to destroy the rat population and infected humans that had the fewest casualties. In that case, killing the animals actually resulted in an increase of two valuable resources -- health and safety. Conclusions My opponent made some fantastic points and even convinced me of one of his arguments. However, the rest I have shown to be inadequate. I look forward to my opponent's response! Thanks for reading!"],"PremiseEndPos":[10828],"ArgumentID":"00000002","Conclusion":"Human beings are justified in killing animals for the resources animals provide.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":166,"ConclusionEndPos":246,"nextID":"00000004","PremiseStartPos":[10843],"prevID":"00000002","Premise":["Extend."],"PremiseEndPos":[10851],"ArgumentID":"00000003","Conclusion":"Human beings are justified in killing animals for the resources animals provide.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":166,"ConclusionEndPos":246,"nextID":"00000005","PremiseStartPos":[10866],"prevID":"00000003","Premise":["I am new to this debate format. I hope I have completed the normal procedures in opening a debate. The basic premise for my argument (con/against) is that animals are no longer necessary to human survival. Indeed, land resources can be better utilized to provide larger yields of consumable crops than animal feed. Additionally, human beings no longer need animal-based meat products to survive and many vegetarians live healthy lifestyles without animal-based products. This is the basic argument I propose. If my opponent would like to explore moral, economic, or cultural basis for the killing/consumption of animals/animal-based products, I would love to debate those as well. Please excuse any grammatical errors or any other oversight in my writing, I am a student."],"PremiseEndPos":[11638],"ArgumentID":"00000004","Conclusion":"Human beings are justified in killing animals for the resources animals provide.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":166,"ConclusionEndPos":246,"nextID":"00000006","PremiseStartPos":[11653],"prevID":"00000004","Premise":["First, like to thank my opponent for engaging me on this topic. I will continue my argument that human beings are not justified in killing animals for the resources they provide. I will additionally discuss the consequences of this fabricated dependence. After addressing my opponents argument, I will similarly highlight some points for discussion. Research and Medical Advancement \"When developing a new drug, it is necessary to run many animal trials before human trials are allowed.\" I argue that it is no longer necessary to test animals for new medicines. Human cells can be grown within an incubator and fabricated to represent organs. Due to stem cell research, animal testing is growing obsolete. Human cells can better represent actual human responses when exposed to new drugs. Involving animals such as pigs and mice in laboratory procedures has produced misleading data before. Although experimenting with human cells is far more expensive, the results produced by such experimentation have far more potential. Animal Organs and Their Use in Humans I would like to address the first permanent and successful artificial heart, the Jarvik-7. The first permanent heart transplant undergone by a human patient took place with a mechanical heart. Additionally, animals can be grown to produce organs outside their bodies. It is not necessary to kill the host of the transplant organ. A host pig, for example, can be inseminated with multiple hearts. Animals and Economic Good/Hunting The word resource indicates, by definition, a stock or supply of money, materials, staff, and other assets that can be drawn on by a person or organization in order to function effectively. Pleasure is not a resource. Likewise, jobs are not a resource. Neither is trade. In this case, the \"resources\" proposed as being derived from animals are not tangible. \"It is necessary to provide a certain level of animal population control.\" Population control is not a function demanded of human beings. Animal populations regulate themselves by exhausting natural resources and starving. Human beings have a very poor track record of keeping nature in balance. If the ultimate goal of human beings it to preserve ecological balance, inaction would be the best approach. My opponent has highlighted multiple ways in which human beings utilize animal species. I maintain that none of these measures are necessary and/or superior to alternate means. Additionally, diseases such as the bubonic plague, swine flue, and bird flue, have found basis in animal species closely associated with human beings. Involving animals in research and transplanting the organs of such animal offers a possible route of cross contamination. Finally I would like to apologize to my opponent for preparing such a limited response. Due to personal conflict, I was unable to spend as much time as I would have preferred discussing this topic. I hope to compose a more adequate response in the next round."],"PremiseEndPos":[14618],"ArgumentID":"00000005","Conclusion":"Human beings are justified in killing animals for the resources animals provide.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":166,"ConclusionEndPos":246,"nextID":"00000000","PremiseStartPos":[14633],"prevID":"00000005","Premise":["Amfeather forfeited this round. Pro Extend."],"PremiseEndPos":[14677],"ArgumentID":"00000006","Conclusion":"Human beings are justified in killing animals for the resources animals provide.","PremiseStance":["Con"]}}]}