{"MetaData":{"Context":"URL: http://www.debate.org/debates/ATMs-should-encourage-selfish-users-to-show-some-consideration-for-others/1/\nCrawl date: 2016/09/29 07:55:05\nDebate Issue: ATM's should encourage selfish users to show some consideration for others | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: Have you ever been unnecessarily delayed queuing for beer vouchers at the hole in the wall? I bet you have. Unfortunately, wherever you live you are going to encounter the type of thoughtless, ignorant scumbags who allow massive queues to form behind them while they faff about doing god knows at ATM's. For this reason, I affirm that it's time the banks revised the ATM's on-screen messages to encourage selfish users to hurry up a bit. Perhaps the programmers could adopt something along the lines of the following: \"We notice you are taking longer than normal to enter your request. Do you have a problem? Are you some sort of retard? Press ‘Yes I am a retard' to RETURN CARD or ‘No, I'm sorry, I'll stop wasting my time and everybody else's and bloody well get on with it' to CONTINUE.\" And if they still don't hurry up then a new message should flash up: \"Look, there are people queuing up behind you and we are sure they have got a lot better things to do with their time than stand and look at the back of your head. Now if you don't get a move on we're going to retain your card and you can bugger off and whistle for cash instead.\" Finally, if they are still dilly-dallying about a final message should be displayed: \"Right, we warned you. We f^cking warned you didn't we? Yes we did and now we've swallowed your card just as we said we would. We hope this will serve as a lesson to you not to be so selfish in the future. You can get your card back from the bank when it reopens but in the meantime, kindly get out of the way so that the person behind you can use the machine. Thank you.\" By employing these revised on-screen scripts, inconsiderate cash machine users would be prompted to conduct their financial transactions without undue delay, thus reducing frustrating queues at ATM's. Thank you.\n\nEvidence Pro: With many thanks to Koopin for accepting this debate I would like to respond to his first argument by pointing out that the cost of revising the scripts for the ATM's would be minimal – no more than a day's work for a couple of programmers and the updates could be uploaded to all the cash machines in the network in a matter of seconds. In any case, the cost should be borne by the bankers who, if you remember, ripped the taxpayer off to the tune of trillions of dollars and used the cash to pay themselves huge bonuses as a reward for their greed and incompetence. (1) Moving on, I should like to make it clear that I wasn't referring to retards in the literal sense, rather people that behave like them. I mean, if someone is so profoundly backward that they can't use a cash machine properly they wouldn't be let out of the asylum unsupervised, much less entrusted with a bank account. No, the people that I was referring to are the ATM users who do not concentrate on the job in hand and instead send texts or chat on the phone or just daydream rather than getting their money out as quickly as possible. Yes, my opponent's sympathies are certainly misplaced. What about all the mentally ill people in the ATM queue behind these inconsiderate scumbags? Some manically depressed person who has been waiting for ages might lose the will to live and top himself right there and then (2). Or there might be a schizophrenic amongst them who will get so stressed that he will suddenly flip his lid and start lashing out at the general public (3) - you just don't know. Certainly I do know that these unnecessary delays upset irascible girlfriends who, in turn, do their innocent boyfriends' heads in by saying things like: \"Do you think I spent hours getting ready to waste half the night sitting in a supermarket car park waiting for you…rabbit, yak, rabbit, yak…why do you have to make us late every time we go out…rabbit, yak, rabbit, yak…I remember now why we split up the last time…rabbit, rabbit, rabbit, yak, yak, yak.\" Finally, if someone is so lackadaisical that the ATM decides to swipe their card I believe they deserve to be inconvenienced and, given that more than half the population of both the US and the UK are overweight (4), if that means they have to walk to the bank rather than drive there is a better than even chance that the exercise will actually do them some good! Thank You. (1) (2) (3) (4)\n\nEvidence Con: I would like to thank my opponent for starting this debate. I also wish to thank the audience for taking the time to read this debate. First I would like to say, there are thousands upon thousands of ATM's in the world. In order to accomplish what you suggest the government would have to spend millions of tax dollars. They would have to pay for the software, they would have to pay for the shredder, they would have to pay for the timer, and they would have to pay the programmers. Those millions in tax dollars could be going towards education, health care, road work, ECT.... Secondly, there are many people who are mentally ill. These people take a longer time processing thoughts than the normal person. When the machine says, 'Are you some sort of retard? Press ‘Yes I am a retard' to RETURN CARD' That would be discriminating. It would mean that they could not get any cash because they are retarded. It is not their fault that they were born mentally ill. Thirdly, people are already depressed in this world; they do not need an ATM to degrade them. Many people find curse words offensive especially the one that you are suggesting the ATM says. There will be a lot of angry people. There are also some people with a retarded family member or friend. Some people find it offensive when you insult someone by calling them retarded. Lastly, sometimes there are emergencies where someone needs to use their card to pay for something. But if the ATM shreds their card, they can't do anything about it until the bank reopens. What if someone runs out of gas? Then they must walk to the bank. I look forward to your argument. Thank You. Sources:\n\nEvidence Con: Thank you for posting your last debate. You failed to provide me with your source explaining how cheap it would be to program all the machines. It is obvious to anyone that it would not be a cheap job. Take the powershred p-57cs. (I have provided the link to it in the sources) It shreds cards and just cost a simple fifty dollars. Seems cheap, but put a shredder in twenty machines, $1000. Put it in two hundred machines, $10,000. Okay now put it in a million machines, $50,000,000! And there are more than a million of these in the world. There would also be a cost in shipping. To pay for a five pound package next day delivery it would cost $54, (This time is calculated by ups, shipping it just a few miles from zip code 10001 to 10008.) It would be a lot more than a days work. Companies have to first schedule a time for the programmers to come out, plus pay each of them. Now a days, programmers do not work for cheap. You say that banks should have to pay for it all. If they did, they would find some way to get it back. The simplest solution would be to charge more at ATMs. There would be piles of new fees no matter where you go. You say that you are not talking about the mentally ill literally, but people do not know that when they go to the ATM. Like I said before, mentally ill people can not always think clearly, your source explains that. They will not take it as a joke. It is cruel and unkind. You have failed to provide sources of how many deaths have happened because of mentally ill people killing themselves while waiting in line for an ATM machine. That is obviously absurd and unheard of. Yes there would be a small chance that a mentally ill person could get stressed and \"flip his lid\". But what do you think will happen if a mentally ill person reads a machine that is cursing at him and insulting him about his illness? Your logic in confusing, are you really claiming that the reason boyfriends and girlfriends fight is because of ATM machines? There are many ATM's in the world, if one sees that the line is to big they can go to another one. That is all I have to say on that matter, seeing that it is not crucial to this debate. Yes, many people are overweight. Walking to the bank will help them burn a small amount of calories, if they run out of gas. But if they run out of gas, they may have to walk home. There are many dangers of walking alone at night, especially for a mentally ill person. running out of gas is not the only thing that can happen, you may have to cancel your plans, you might not be able to go shopping for a child's birthday party, you may need to get some medicine from the store, their are endless possibilities. The banks are also closed on holidays and some on Sundays. There is so much more that could be said, but I believe that I have made my point. Thank you for giving me the opportunity to debate with you. And thank you audience for reading. I hope you have learned something. It is obvious that the world does not need ATMs cursing at us. Vote Con! Sorces:\n","DiscussionID":"00000091","Title":"ATM's should encourage selfish users to show some consideration for others","CrawlDate":"2016/09/29 07:55:05","URL":"http://www.debate.org/debates/ATMs-should-encourage-selfish-users-to-show-some-consideration-for-others/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":232,"nextID":"00000002","PremiseStartPos":[284],"prevID":"00000000","Premise":["Have you ever been unnecessarily delayed queuing for beer vouchers at the hole in the wall? I bet you have. Unfortunately, wherever you live you are going to encounter the type of thoughtless, ignorant scumbags who allow massive queues to form behind them while they faff about doing god knows at ATM's. For this reason, I affirm that it's time the banks revised the ATM's on-screen messages to encourage selfish users to hurry up a bit. Perhaps the programmers could adopt something along the lines of the following: \"We notice you are taking longer than normal to enter your request. Do you have a problem? Are you some sort of retard? Press ‘Yes I am a retard' to RETURN CARD or ‘No, I'm sorry, I'll stop wasting my time and everybody else's and bloody well get on with it' to CONTINUE.\" And if they still don't hurry up then a new message should flash up: \"Look, there are people queuing up behind you and we are sure they have got a lot better things to do with their time than stand and look at the back of your head. Now if you don't get a move on we're going to retain your card and you can bugger off and whistle for cash instead.\" Finally, if they are still dilly-dallying about a final message should be displayed: \"Right, we warned you. We f^cking warned you didn't we? Yes we did and now we've swallowed your card just as we said we would. We hope this will serve as a lesson to you not to be so selfish in the future. You can get your card back from the bank when it reopens but in the meantime, kindly get out of the way so that the person behind you can use the machine. Thank you.\" By employing these revised on-screen scripts, inconsiderate cash machine users would be prompted to conduct their financial transactions without undue delay, thus reducing frustrating queues at ATM's. Thank you."],"PremiseEndPos":[2095],"ArgumentID":"00000001","Conclusion":"ATM's should encourage selfish users to show some consideration for others","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":232,"nextID":"00000003","PremiseStartPos":[2110],"prevID":"00000001","Premise":["With many thanks to Koopin for accepting this debate I would like to respond to his first argument by pointing out that the cost of revising the scripts for the ATM's would be minimal – no more than a day's work for a couple of programmers and the updates could be uploaded to all the cash machines in the network in a matter of seconds. In any case, the cost should be borne by the bankers who, if you remember, ripped the taxpayer off to the tune of trillions of dollars and used the cash to pay themselves huge bonuses as a reward for their greed and incompetence. (1) Moving on, I should like to make it clear that I wasn't referring to retards in the literal sense, rather people that behave like them. I mean, if someone is so profoundly backward that they can't use a cash machine properly they wouldn't be let out of the asylum unsupervised, much less entrusted with a bank account. No, the people that I was referring to are the ATM users who do not concentrate on the job in hand and instead send texts or chat on the phone or just daydream rather than getting their money out as quickly as possible. Yes, my opponent's sympathies are certainly misplaced. What about all the mentally ill people in the ATM queue behind these inconsiderate scumbags? Some manically depressed person who has been waiting for ages might lose the will to live and top himself right there and then (2). Or there might be a schizophrenic amongst them who will get so stressed that he will suddenly flip his lid and start lashing out at the general public (3) - you just don't know. Certainly I do know that these unnecessary delays upset irascible girlfriends who, in turn, do their innocent boyfriends' heads in by saying things like: \"Do you think I spent hours getting ready to waste half the night sitting in a supermarket car park waiting for you…rabbit, yak, rabbit, yak…why do you have to make us late every time we go out…rabbit, yak, rabbit, yak…I remember now why we split up the last time…rabbit, rabbit, rabbit, yak, yak, yak.\" Finally, if someone is so lackadaisical that the ATM decides to swipe their card I believe they deserve to be inconvenienced and, given that more than half the population of both the US and the UK are overweight (4), if that means they have to walk to the bank rather than drive there is a better than even chance that the exercise will actually do them some good! Thank You. (1) (2) (3) (4)"],"PremiseEndPos":[4529],"ArgumentID":"00000002","Conclusion":"ATM's should encourage selfish users to show some consideration for others","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":232,"nextID":"00000004","PremiseStartPos":[4544],"prevID":"00000002","Premise":["I would like to thank my opponent for starting this debate. I also wish to thank the audience for taking the time to read this debate. First I would like to say, there are thousands upon thousands of ATM's in the world. In order to accomplish what you suggest the government would have to spend millions of tax dollars. They would have to pay for the software, they would have to pay for the shredder, they would have to pay for the timer, and they would have to pay the programmers. Those millions in tax dollars could be going towards education, health care, road work, ECT.... Secondly, there are many people who are mentally ill. These people take a longer time processing thoughts than the normal person. When the machine says, 'Are you some sort of retard? Press ‘Yes I am a retard' to RETURN CARD' That would be discriminating. It would mean that they could not get any cash because they are retarded. It is not their fault that they were born mentally ill. Thirdly, people are already depressed in this world; they do not need an ATM to degrade them. Many people find curse words offensive especially the one that you are suggesting the ATM says. There will be a lot of angry people. There are also some people with a retarded family member or friend. Some people find it offensive when you insult someone by calling them retarded. Lastly, sometimes there are emergencies where someone needs to use their card to pay for something. But if the ATM shreds their card, they can't do anything about it until the bank reopens. What if someone runs out of gas? Then they must walk to the bank. I look forward to your argument. Thank You. Sources:"],"PremiseEndPos":[6193],"ArgumentID":"00000003","Conclusion":"ATM's should encourage selfish users to show some consideration for others","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":232,"nextID":"00000000","PremiseStartPos":[6208],"prevID":"00000003","Premise":["Thank you for posting your last debate. You failed to provide me with your source explaining how cheap it would be to program all the machines. It is obvious to anyone that it would not be a cheap job. Take the powershred p-57cs. (I have provided the link to it in the sources) It shreds cards and just cost a simple fifty dollars. Seems cheap, but put a shredder in twenty machines, $1000. Put it in two hundred machines, $10,000. Okay now put it in a million machines, $50,000,000! And there are more than a million of these in the world. There would also be a cost in shipping. To pay for a five pound package next day delivery it would cost $54, (This time is calculated by ups, shipping it just a few miles from zip code 10001 to 10008.) It would be a lot more than a days work. Companies have to first schedule a time for the programmers to come out, plus pay each of them. Now a days, programmers do not work for cheap. You say that banks should have to pay for it all. If they did, they would find some way to get it back. The simplest solution would be to charge more at ATMs. There would be piles of new fees no matter where you go. You say that you are not talking about the mentally ill literally, but people do not know that when they go to the ATM. Like I said before, mentally ill people can not always think clearly, your source explains that. They will not take it as a joke. It is cruel and unkind. You have failed to provide sources of how many deaths have happened because of mentally ill people killing themselves while waiting in line for an ATM machine. That is obviously absurd and unheard of. Yes there would be a small chance that a mentally ill person could get stressed and \"flip his lid\". But what do you think will happen if a mentally ill person reads a machine that is cursing at him and insulting him about his illness? Your logic in confusing, are you really claiming that the reason boyfriends and girlfriends fight is because of ATM machines? There are many ATM's in the world, if one sees that the line is to big they can go to another one. That is all I have to say on that matter, seeing that it is not crucial to this debate. Yes, many people are overweight. Walking to the bank will help them burn a small amount of calories, if they run out of gas. But if they run out of gas, they may have to walk home. There are many dangers of walking alone at night, especially for a mentally ill person. running out of gas is not the only thing that can happen, you may have to cancel your plans, you might not be able to go shopping for a child's birthday party, you may need to get some medicine from the store, their are endless possibilities. The banks are also closed on holidays and some on Sundays. There is so much more that could be said, but I believe that I have made my point. Thank you for giving me the opportunity to debate with you. And thank you audience for reading. I hope you have learned something. It is obvious that the world does not need ATMs cursing at us. Vote Con! Sorces:"],"PremiseEndPos":[9240],"ArgumentID":"00000004","Conclusion":"ATM's should encourage selfish users to show some consideration for others","PremiseStance":["Con"]}}]}