{"MetaData":{"Context":"URL: http://www.forandagainst.com/The_Olympics_In_Beijing_Have_Been_The_Best_One_Ever\nCrawl date: 2016/09/28 05:22:07\nTitle: The Olympics In Beijing Have Been The Best One Ever. - For & Against\nNumber of arguments: 15\n\nClaim: The Olympics In Beijing Have Been The Best One Ever. - For & Against\nFor: Yes. The splendid mix of culture and athletic competition and sportsmanship shown could make the Beijing Olympics possibly one of the best ever Olypics to be held. Hopefully London 2012 will topple it.\nFor: I wouldn't say the best ever, but definitely in the top five best Olympics. I heard the opening cermony was cool, and I watched the closing ceremony. And oh my goodness, I LOVED watching Micheal Phelps swim!! I know I sound like a creepy lovestruck fan, but I can't deny that Mr. Phelps knows how to entertain. I was really ticked when I didn't see him win his final gold medal, which was the best race of all. Although, dad and I were super ticked with gymnastics, because you could totally tell that they were purposefully knocking down American points. However, I would have liked to see Jesse Owens run against the Nazis. I also heard about this one Olympic basketball game held in Communist Russia, where the Russians cheated and beat America. You could totally tell they cheated, and my dad said it took a lot to hold people back because they were about to kill each other. AND THE RUSSIANS GOT AWAY WITH IT!!! Not exactly the best Olympics ever, but it would sure have been interesting to see.\nFor: I reakon the Beijing Olympics are the best because of the opening and closing cerimonies.\nFor: Awesome, never really watched it before, so now i have a better idea of what goes on, i love watching the events and all\nFor: I agree\nFor: No argument, considering the population pool compared to all the others Great Britain are no 1\nFor: For once England has done something to be proud of, I'm almost feeling happy to be English.\nFor: Been the best one for us in GB. Best Ive seen. Bolt and Pheltz were truly amazing.\nFor: From my country's point of view, it's certainly been our most successful for a long time. The facilities look fantastic, and the opening ceremony was spectacular.\nFor: They have been very good so far. Excellently organised and well supported. Especially as a Brit, we have been hugely successful. My favorite was the Sydney Olympics but these rival them.\nAgainst: No. The best olympics were in 1982, when Mary Lou Retton won the gold medal in gymnastics best all-around gymnast.\nAgainst: I see no reason these Olympics were any better than average.\nAgainst: They were pretty good but I wish I would have seen Jesse Owens and the USA show up Hitler and the Nazis in '38...\nAgainst: It's the Olympics. Who cares?\nAgainst: I don't think they should of been held in china. That country has a lot to learn about what the Olympics represent. They do not have an open society and the eat dogs and cats and kill them in the most painful ways possible. They are a terrible nation, and we would be better off if we(the US) had bombed them off the map in the 1940s\n","DiscussionID":"00000016","Title":"The Olympics In Beijing Have Been The Best One Ever.","CrawlDate":"2016/09/28 05:22:07","URL":"http://www.forandagainst.com/The_Olympics_In_Beijing_Have_Been_The_Best_One_Ever"},"ArgumentList":[{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000002","PremiseStartPos":[2751],"prevID":"00000000","Premise":["I don't think they should of been held in china. That country has a lot to learn about what the Olympics represent. They do not have an open society and the eat dogs and cats and kill them in the most painful ways possible. They are a terrible nation, and we would be better off if we(the US) had bombed them off the map in the 1940s"],"PremiseEndPos":[3085],"ArgumentID":"00000001","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000003","PremiseStartPos":[2712],"prevID":"00000001","Premise":["It's the Olympics. Who cares?"],"PremiseEndPos":[2742],"ArgumentID":"00000002","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000004","PremiseStartPos":[2589],"prevID":"00000002","Premise":["They were pretty good but I wish I would have seen Jesse Owens and the USA show up Hitler and the Nazis in '38..."],"PremiseEndPos":[2703],"ArgumentID":"00000003","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000005","PremiseStartPos":[2519],"prevID":"00000003","Premise":["I see no reason these Olympics were any better than average."],"PremiseEndPos":[2580],"ArgumentID":"00000004","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000006","PremiseStartPos":[2395],"prevID":"00000004","Premise":["No. The best olympics were in 1982, when Mary Lou Retton won the gold medal in gymnastics best all-around gymnast."],"PremiseEndPos":[2510],"ArgumentID":"00000005","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000007","PremiseStartPos":[2199],"prevID":"00000005","Premise":["They have been very good so far. Excellently organised and well supported. Especially as a Brit, we have been hugely successful. My favorite was the Sydney Olympics but these rival them."],"PremiseEndPos":[2386],"ArgumentID":"00000006","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000008","PremiseStartPos":[2031],"prevID":"00000006","Premise":["From my country's point of view, it's certainly been our most successful for a long time. The facilities look fantastic, and the opening ceremony was spectacular."],"PremiseEndPos":[2194],"ArgumentID":"00000007","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000009","PremiseStartPos":[1943],"prevID":"00000007","Premise":["Been the best one for us in GB. Best Ive seen. Bolt and Pheltz were truly amazing."],"PremiseEndPos":[2026],"ArgumentID":"00000008","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000010","PremiseStartPos":[1846],"prevID":"00000008","Premise":["For once England has done something to be proud of, I'm almost feeling happy to be English."],"PremiseEndPos":[1938],"ArgumentID":"00000009","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000011","PremiseStartPos":[1746],"prevID":"00000009","Premise":["No argument, considering the population pool compared to all the others Great Britain are no 1"],"PremiseEndPos":[1841],"ArgumentID":"00000010","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000012","PremiseStartPos":[1733],"prevID":"00000010","Premise":["I agree"],"PremiseEndPos":[1741],"ArgumentID":"00000011","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000013","PremiseStartPos":[1607],"prevID":"00000011","Premise":["Awesome, never really watched it before, so now i have a better idea of what goes on, i love watching the events and all"],"PremiseEndPos":[1728],"ArgumentID":"00000012","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000014","PremiseStartPos":[1512],"prevID":"00000012","Premise":["I reakon the Beijing Olympics are the best because of the opening and closing cerimonies."],"PremiseEndPos":[1602],"ArgumentID":"00000013","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000015","PremiseStartPos":[506],"prevID":"00000013","Premise":["I wouldn't say the best ever, but definitely in the top five best Olympics. I heard the opening cermony was cool, and I watched the closing ceremony. And oh my goodness, I LOVED watching Micheal Phelps swim!! I know I sound like a creepy lovestruck fan, but I can't deny that Mr. Phelps knows how to entertain. I was really ticked when I didn't see him win his final gold medal, which was the best race of all. Although, dad and I were super ticked with gymnastics, because you could totally tell that they were purposefully knocking down American points. However, I would have liked to see Jesse Owens run against the Nazis. I also heard about this one Olympic basketball game held in Communist Russia, where the Russians cheated and beat America. You could totally tell they cheated, and my dad said it took a lot to hold people back because they were about to kill each other. AND THE RUSSIANS GOT AWAY WITH IT!!! Not exactly the best Olympics ever, but it would sure have been interesting to see."],"PremiseEndPos":[1507],"ArgumentID":"00000014","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":124,"ConclusionEndPos":177,"nextID":"00000000","PremiseStartPos":[299],"prevID":"00000014","Premise":["Yes. The splendid mix of culture and athletic competition and sportsmanship shown could make the Beijing Olympics possibly one of the best ever Olypics to be held. Hopefully London 2012 will topple it."],"PremiseEndPos":[501],"ArgumentID":"00000015","Conclusion":"The Olympics In Beijing Have Been The Best One Ever.","PremiseStance":["Pro"]}}]}