{"MetaData":{"Context":"URL: http://www.debate.org/debates/Jesus-of-Nazareth-was-raised-from-the-dead-and-was-the-Jewish-Messiah/1/votes/1/\nCrawl date: 2016/09/29 07:01:07\nDebate: Jesus of Nazareth was raised from the dead and was the Jewish Messiah | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: This debate was made for gavin.ogden. Since he's not accepting debates at this time, I had to leave it in the challenge period. If you aren't gavin.ogden, please don't accept this debate. Thank you. I will be arguing as Pro, that Jesus of Nazareth was indeed raised from the dead, and Con will argue that there is not enough evidence. I would like to start out that the Gospels are four, independently written books that tell us the true picture of Jesus's life. These men had absolutely nothing to gain from writing the Gospels, yet they put their lives on the line for this truth. There is more evidence that Jesus Christ was raised from the dead than there is for Alexander the Great's existence. The Bible tells us that the Jewish people were afraid that the disciples would come and steal Jesus's body, so Governor Pilate sent \"a watch\" of Roman guards to protect the tomb. Most think that a watch is around 2-6 men. How could a bunch of tax collectors and fishermen kill Roman soldiers? According to the Bible, hundreds of people saw Jesus after He was ressurected in the 40 days before he ascended! The faith spread like wildfire because people really and truly saw Him. There's also the case for Paul. Paul was a strict Jew. In fact, he ran around persecuting Christians all day long. Paul had some sort of divine experience and converted to Christianity. I don't think someone would make such a drastic turn in their lives for nothing. And you have to remember that Paul was executed for his beliefs. Why would he give his life for a dream? Also, you have to remember that Jesus was only 33 years old when He was crucified. Why would He give His life for a lie?\n\nEvidence Pro: Thanks, Gavin, you too. Allright. I'll start off with talking about the gospels of Matthew and John. These two men lived with Jesus for three whole years, and they eventually wrote these books. In a point in history where Christians were getting killed for their beliefs, why would Matthew and John risk their lives to write this down? Do you think both Matthew AND John were liars? You have to remember that they had had no contact with each other for roughly 15 years, and their stories are basically the same. Based on what Matthew and John said was true, we know that Jesus's tomb was guarded by a watch of guards which is roughly 2-6 men. I doubt some fishermen and tax collectors could kill off some Roman soldiers, move a stone that weighs a ton, and steal Jesus's body. According to the Gospels, hundreds of people saw Jesus after he was ressurected. The fact that the religion spread like wildfire is proof enough. Why did the religion spread so rapidly? It's simple; people saw Jesus alive after he had been crucified. I'll leave it up to you, Gavin to refute these arguments or to make your own. Again, good luck, and I'm looking forward to a great debate.\n\nEvidence Pro: My opponent states, \"From what I gather, my opponent has made an ad populum argument to prove that a man was resurrected from the dead, and that he was \"the messiah.\" This argument is invalid, obviously, because just because someone believes something certainly does not make it so. Furthermore, there are more Non-Christians in the world than Christians, so the ad populum argument can go both ways.\" I apologize if anyone took my argument the wrong way. I meant that at this faith spread so rapidly at its initial point because people saw Jesus. And yeah, there's more people that believe in a God than people that don't. That's not what I was arguing. Population has nothing to do with it. I'd still be a Christian whether there's 2.5 billion of us or just 1 million of us. My opponent also states, \"Also, sources would be useful in this debate, as I have no point of reference for my opponents arguments. I do know, however, that none of the authors of the new testament had any contact with Jesus, thus the bible is strictly a second hand account.\" I'm using the Gospels as my sources, as well as what should be common knowledge. And saying that none of the authors of the Gospels didn't have contact with Jesus is just not true. John and Matthew were both disciples of Jesus. In fact, they lived with Jesus for three whole years. Mark worked closely with Matthew, and Mark also ran around with Paul a lot. Luke used second hand sources. Also, James, you know, the guy that wrote the book of James, was Jesus's half brother. If you're going to attack the accuracy of the Bible, don't attack it by saying the authors weren't sincere. Most scholars agree that these men did indeed write the Gospels. You have to say that they were misguided or had something to gain. Here's a newsflash for everybody, they lived with the guy for three years, so no, not misguided, and they had nothing to gain. Every single disciple (except for John, he was exiled on the island of Patmos) was martyred in a very, very painful fashion. Constantine was no idiot. He was the guy who organized the Bible at the council of Nasea. He, along with all the other leaders of the Christian faith, went through hundreds and hundreds of documents and found the most reliable ones. We've believed in these books for 2000 years and running. I have one more thing to say. I didn't really go into the prophecies too much about Jesus being the Messiah. Really, if Jesus did rise from the dead, then I'd say it's basically a given that he was the Messiah given what He said and did.\n\nEvidence Con: It is very rare that I accept religious debates of any kind, but Charles seems like a nice enough guy, so let's have a little fun. My opponent has a huge burden of proof to meet in this debate, so I will leave it to him to lead the way, here. He must prove, somehow, that a man was in fact raised from the dead and that he was the \"Messiah.\" I will be arguing that not only is this story most likely false, but also that it is not even an original story, and uses all of the same fallacies as many other religions of today and the past. With that, I will pass to my opponent to start his arguments. Good luck, Charles.\n\nEvidence Con: From what I gather, my opponent has made an ad populum argument to prove that a man was resurrected from the dead, and that he was \"the messiah.\" This argument is invalid, obviously, because just because someone believes something certainly does not make it so. Furthermore, there are more Non-Christians in the world than Christians, so the ad populum argument can go both ways. Also, sources would be useful in this debate, as I have no point of reference for my opponents arguments. I do know, however, that none of the authors of the new testament had any contact with Jesus, thus the bible is strictly a second hand account. I suppose I will simply let my opponent try one more time to make a proper argument to affirm the resolution. If he is unable to do so, a con vote will certainly be in order.\n\nEvidence Con: Well, I do appreciate my opponent putting in the time to debate, although I am a little upset that there are absolutely no sources cited to back up the validity of his arguments. There were no real arguments to refute, and at this point it would be in bad taste to make any new arguments to negate. However, Since the pro bore the burden of proof, and failed to affirm the resolution in any way, I urge a vote for the Con. There was no evidence provided for the resurrection of a human being, and furthermore, there certainly was no evidence provided that there even is such a thing as a \"messiah\". In order for my opponent to have won this debate, he would have to prove both parts of the resolution in some kind of convincing fashion. I will simply end with this. There is no evidence to support that anyone has ever been brought back to life after the brain has died. Since it takes 5-10 minutes for the brain to die(due to lack of oxygen), and my opponent claims Jesus was resurrected after 3 days, he left much to be desired. Again, I thank Charles and the readers for your time.\n","DiscussionID":"00000076","Title":"Jesus of Nazareth was raised from the dead and was the Jewish Messiah","CrawlDate":"2016/09/29 07:01:07","URL":"http://www.debate.org/debates/Jesus-of-Nazareth-was-raised-from-the-dead-and-was-the-Jewish-Messiah/1/votes/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":225,"nextID":"00000002","PremiseStartPos":[277],"prevID":"00000000","Premise":["This debate was made for gavin.ogden. Since he's not accepting debates at this time, I had to leave it in the challenge period. If you aren't gavin.ogden, please don't accept this debate. Thank you. I will be arguing as Pro, that Jesus of Nazareth was indeed raised from the dead, and Con will argue that there is not enough evidence. I would like to start out that the Gospels are four, independently written books that tell us the true picture of Jesus's life. These men had absolutely nothing to gain from writing the Gospels, yet they put their lives on the line for this truth. There is more evidence that Jesus Christ was raised from the dead than there is for Alexander the Great's existence. The Bible tells us that the Jewish people were afraid that the disciples would come and steal Jesus's body, so Governor Pilate sent \"a watch\" of Roman guards to protect the tomb. Most think that a watch is around 2-6 men. How could a bunch of tax collectors and fishermen kill Roman soldiers? According to the Bible, hundreds of people saw Jesus after He was ressurected in the 40 days before he ascended! The faith spread like wildfire because people really and truly saw Him. There's also the case for Paul. Paul was a strict Jew. In fact, he ran around persecuting Christians all day long. Paul had some sort of divine experience and converted to Christianity. I don't think someone would make such a drastic turn in their lives for nothing. And you have to remember that Paul was executed for his beliefs. Why would he give his life for a dream? Also, you have to remember that Jesus was only 33 years old when He was crucified. Why would He give His life for a lie?"],"PremiseEndPos":[1948],"ArgumentID":"00000001","Conclusion":"Jesus of Nazareth was raised from the dead and was the Jewish Messiah","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":225,"nextID":"00000003","PremiseStartPos":[1963],"prevID":"00000001","Premise":["Thanks, Gavin, you too. Allright. I'll start off with talking about the gospels of Matthew and John. These two men lived with Jesus for three whole years, and they eventually wrote these books. In a point in history where Christians were getting killed for their beliefs, why would Matthew and John risk their lives to write this down? Do you think both Matthew AND John were liars? You have to remember that they had had no contact with each other for roughly 15 years, and their stories are basically the same. Based on what Matthew and John said was true, we know that Jesus's tomb was guarded by a watch of guards which is roughly 2-6 men. I doubt some fishermen and tax collectors could kill off some Roman soldiers, move a stone that weighs a ton, and steal Jesus's body. According to the Gospels, hundreds of people saw Jesus after he was ressurected. The fact that the religion spread like wildfire is proof enough. Why did the religion spread so rapidly? It's simple; people saw Jesus alive after he had been crucified. I'll leave it up to you, Gavin to refute these arguments or to make your own. Again, good luck, and I'm looking forward to a great debate."],"PremiseEndPos":[3131],"ArgumentID":"00000002","Conclusion":"Jesus of Nazareth was raised from the dead and was the Jewish Messiah","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":225,"nextID":"00000004","PremiseStartPos":[3146],"prevID":"00000002","Premise":["My opponent states, \"From what I gather, my opponent has made an ad populum argument to prove that a man was resurrected from the dead, and that he was \"the messiah.\" This argument is invalid, obviously, because just because someone believes something certainly does not make it so. Furthermore, there are more Non-Christians in the world than Christians, so the ad populum argument can go both ways.\" I apologize if anyone took my argument the wrong way. I meant that at this faith spread so rapidly at its initial point because people saw Jesus. And yeah, there's more people that believe in a God than people that don't. That's not what I was arguing. Population has nothing to do with it. I'd still be a Christian whether there's 2.5 billion of us or just 1 million of us. My opponent also states, \"Also, sources would be useful in this debate, as I have no point of reference for my opponents arguments. I do know, however, that none of the authors of the new testament had any contact with Jesus, thus the bible is strictly a second hand account.\" I'm using the Gospels as my sources, as well as what should be common knowledge. And saying that none of the authors of the Gospels didn't have contact with Jesus is just not true. John and Matthew were both disciples of Jesus. In fact, they lived with Jesus for three whole years. Mark worked closely with Matthew, and Mark also ran around with Paul a lot. Luke used second hand sources. Also, James, you know, the guy that wrote the book of James, was Jesus's half brother. If you're going to attack the accuracy of the Bible, don't attack it by saying the authors weren't sincere. Most scholars agree that these men did indeed write the Gospels. You have to say that they were misguided or had something to gain. Here's a newsflash for everybody, they lived with the guy for three years, so no, not misguided, and they had nothing to gain. Every single disciple (except for John, he was exiled on the island of Patmos) was martyred in a very, very painful fashion. Constantine was no idiot. He was the guy who organized the Bible at the council of Nasea. He, along with all the other leaders of the Christian faith, went through hundreds and hundreds of documents and found the most reliable ones. We've believed in these books for 2000 years and running. I have one more thing to say. I didn't really go into the prophecies too much about Jesus being the Messiah. Really, if Jesus did rise from the dead, then I'd say it's basically a given that he was the Messiah given what He said and did."],"PremiseEndPos":[5697],"ArgumentID":"00000003","Conclusion":"Jesus of Nazareth was raised from the dead and was the Jewish Messiah","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":225,"nextID":"00000005","PremiseStartPos":[5712],"prevID":"00000003","Premise":["It is very rare that I accept religious debates of any kind, but Charles seems like a nice enough guy, so let's have a little fun. My opponent has a huge burden of proof to meet in this debate, so I will leave it to him to lead the way, here. He must prove, somehow, that a man was in fact raised from the dead and that he was the \"Messiah.\" I will be arguing that not only is this story most likely false, but also that it is not even an original story, and uses all of the same fallacies as many other religions of today and the past. With that, I will pass to my opponent to start his arguments. Good luck, Charles."],"PremiseEndPos":[6331],"ArgumentID":"00000004","Conclusion":"Jesus of Nazareth was raised from the dead and was the Jewish Messiah","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":225,"nextID":"00000006","PremiseStartPos":[6346],"prevID":"00000004","Premise":["From what I gather, my opponent has made an ad populum argument to prove that a man was resurrected from the dead, and that he was \"the messiah.\" This argument is invalid, obviously, because just because someone believes something certainly does not make it so. Furthermore, there are more Non-Christians in the world than Christians, so the ad populum argument can go both ways. Also, sources would be useful in this debate, as I have no point of reference for my opponents arguments. I do know, however, that none of the authors of the new testament had any contact with Jesus, thus the bible is strictly a second hand account. I suppose I will simply let my opponent try one more time to make a proper argument to affirm the resolution. If he is unable to do so, a con vote will certainly be in order."],"PremiseEndPos":[7151],"ArgumentID":"00000005","Conclusion":"Jesus of Nazareth was raised from the dead and was the Jewish Messiah","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":156,"ConclusionEndPos":225,"nextID":"00000000","PremiseStartPos":[7166],"prevID":"00000005","Premise":["Well, I do appreciate my opponent putting in the time to debate, although I am a little upset that there are absolutely no sources cited to back up the validity of his arguments. There were no real arguments to refute, and at this point it would be in bad taste to make any new arguments to negate. However, Since the pro bore the burden of proof, and failed to affirm the resolution in any way, I urge a vote for the Con. There was no evidence provided for the resurrection of a human being, and furthermore, there certainly was no evidence provided that there even is such a thing as a \"messiah\". In order for my opponent to have won this debate, he would have to prove both parts of the resolution in some kind of convincing fashion. I will simply end with this. There is no evidence to support that anyone has ever been brought back to life after the brain has died. Since it takes 5-10 minutes for the brain to die(due to lack of oxygen), and my opponent claims Jesus was resurrected after 3 days, he left much to be desired. Again, I thank Charles and the readers for your time."],"PremiseEndPos":[8251],"ArgumentID":"00000006","Conclusion":"Jesus of Nazareth was raised from the dead and was the Jewish Messiah","PremiseStance":["Con"]}}]}