{"MetaData":{"Context":"URL: http://www.debate.org/debates/Men-accused-of-rape-should-be-castrated/1/votes/1/\nCrawl date: 2016/09/29 04:57:04\nDebate Argument: Men accused of rape should be castrated | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: Men who have been accused by two or more women of rape should be castrated. Leave a message in the comments if you'd like to accept. First round is acceptance.\n\nEvidence Pro: Thank you to Mikal for accepting this debate. Castration and rape are important, controversial topics in our society and I hope this will be a useful discussion. In this second round, I will introduce the idea of population evolvement, using abortion and crime as an example. I will then discuss the benefits of the PEACE program to society as a whole and to the individuals concerned, and finally I will make some comments about the restrictions on participation. Abortion and Crime: Can we do More? In their book Freakonomics, Levitt and Dubnar present evidence linking abortion to reduction in crime (see video for summary). They argued that unwanted children are the children most likely to grow up to be criminals, and that abortions cull unwanted children and therefore future criminals. This is an uncomfortable finding for many people, but there is no question that abortion is convenient for the community in general - there are over a million abortions a year in the US (2). Of course, it would be far more efficient and desirable if those unwanted pregnancies could be avoided in the first place - or even a proportion of them. Most estimates put the annual cost to the tax pay of unintended pregnancies at over 10 billion dollars (3), for healthcare costs alone. There are additional private costs (4), emotional and physical costs, and of course pro-life advocates would say the moral cost is beyond all price. The social benefits of abortion, including a lower crime rate, are shared by all, but the burden of abortion falls disproportionately on women. Perhaps more disturbingly, it has been shown that women with unplanned pregnancies are four times more likely to have a violent partner than women whose pregnancies are planned, and that violent men are often trying to force their partners into pregnancy and a more likely to refuse to use condoms than other types of men (5). Population-Enhancing Accuse-Castrate Evolvement (PEACE) PEACE works by shifting the intervention from post-conception back to pre-conception. If the sorts of men most likely to father future criminals are castrated, this works in at least two ways to enhance the future of our communities. 1. Castrated men are better fathers and community members. One of the first and most striking effects of castration is a feeling of calm. Serene parents are likely to raise calmer, better adjusted children, as well as bring emotional stability to all their social interactions. \"Ten days post castration, I felt as a feather floating around everywhere,\" writes one happy eunuch. \"I just kept feeling better and better. For me, the serenity was the strongest of the castration effects.\" (6) 2. Castrating potential rapists will lead to an immediate reduction in sexual assault. Because castration is associated with a drop in testosterone, castra-enhanced individuals are able to better focus on their personal and career goals undistracted by sexual feelings or aggressiveness (7). Sex offenders who are introduced into the PEACE scheme are therefore vastly less likely to reoffend than those who are not. Castration is not a punishment Castrated men live 14-18 years longer than untreated men (8). They are more serene and do not grow bald (9). Therefore, castration should not be seen as a punishment in any way, but rather as a life-style choice and an enhancement. Encouraging compliance When we say that rapists should be castrated, we are talking about an ideal state of affairs as has been described thus far. The means by which this is achieved is a separate issue. Certainly, given the vast social benefits anticipated with PEACE, it makes sense that all health-related costs be borne by the state, and that favorable treatment be given to PEACE inductees by the judicial system, given the huge reduction in recidivism following castration (7). There should also be substantial marketing and counselling services to assist men who choose this option, and perhaps the potential for further incentives as deemed appropriate. Accusation vs Conviction In the comments to this debate, two users suggested that castration services be only offered to men who are convicted of rape. However, such a rule would result in a dramatic reduction in the number of people qualified to access the PEACE program - as rape has a very low 4% conviction rate (10). In order to enjoy the full social benefits of PEACE, we need a more inclusive standard. In addition, linking PEACE involvement to convictions or rape may create a false stigma by connecting PEACE too closely with criminal behavior. Two accusations of rape is still, perhaps, too restrictive as most rapists are never formally accused, and may only have one accuser. Potentially, as PEACE grows and gains appreciation in the broader community, there may be calls for it to be extended to a wider participation group. The consequences of such an extension are beyond the scope of this debate, however. Thank you for your attention. I now pass the debate to my esteemed opponent. (2) (3) (4) (5) (6) (7) (8) (9)\n\nEvidence Pro: Con interpreted the resolution as \"men accused of rape should be forcibly castrated.\" He is not alone. In the comments, several people have assumed coercion even after reading my Round 2 arguments which mention choice specifically. It is not the language that leads to that conclusion. If I said people should be more serene, or you should be given a pay rise, there is no implication of force at all. These are merely recommendations. Yet, when I say \"men accused of rape should be castrated,\" many readers cannot separate the idea from forcible castration. This difference in interpretation puzzled me for a while, until I recognized it for what it is - an expression of testicular privilege. Con and other readers have internalized the stigma against castration so deeply that they simply cannot believe that a man would be castrated voluntarily. Let's talk more about testicular privilege. Eunuch Stigma and Testicular Privilege: Confronting the Myths Here are six common myths. Perhaps these are familiar to you, and maybe you can think of more examples from your own life. MYTH 1: No man would ever volunteer for castration --> FALSE! There are hundreds if not thousands of men who would like to be castrated, despite the sociocultural pressures against it. We don't hear those stories because of bias in the mainstream media. An academic study of 134 men interested in being castrated showed that main reason is to achieve calm and freedom from sexual urges (10). This is a legitimate health concern, and yet 40% of the surveyed men felt uncomfortable raising the issue with a health care provider. They are right to hesitate given the outright prejudice many health professionals exhibit towards the procedure. For example, on this respected health forum (11), a man asks a simple question about castration and is subject to open disbelief and insensitive remarks about needing to talk to a psychiatrist. MYTH 2: Wanting a castration means wanting a sex change. --> FALSE! A study from California State University shows that the majority of voluntary eunuchs identify as male and not as male-to-female transsexuals. (12) MYTH 3: Castration is bad for you --> NUH-UH! As I showed in the previous round, eunuchs live 14-18 years longer on average than other men! MYTH 4: Eunuchs are asexual --> FALSE! This myth is in response to Con's false claim that castration involves getting your \"penis chopped off\". It doesn't. Your penis remains intact and eunuchs still enjoy sex, albeit with more controlled sexual urges. (6 - source from previous round) A historical review in the journal Social Science and Medicine concludes that \" given the right cultural setting and individual motivation, an drogen deprivation [castration] may actually enhance rather than hinder both social and sexual performance.\" (13) MYTH 5: Eunuchs are always bald -->DERP! As I showed last round, castration is the most effective way to stop balding! Men who are particularly sensitive about their hair may consider castration for this reason. (14) MYTH 6: Castrated men are less male than other men. --> NO WAY! Of all the myths, this is the most pernicious. So far, I have shown these consequences of castration - none of which have been contested by Con: Castration leads to a longer life, more serenity, and better hair. It makes rapists less likely to rape, makes men better fathers, and reduces conflict in social interactions. None of these qualities are inherently unmasculine. Dying young, being aggressive, balding and assaulting people are not essential to being a man. To suggest otherwise is to belittle men everywhere. To assume that men would trade over a decade of life and a lifetime of serenity for a pair of testicles is to sell men short. We can't assume that men will not volunteer for castration. On the contrary, I have shown that many definitely do want it even in the context of an extremely repressive culture. Summary: Why our Society needs PEACE In Round 2, I introduced Population-Enhancing Accuse-Castrate Evolvement (PEACE). I showed that PEACE can reduce the number of unwanted children in our society WITHOUT abortion. PEACE creates better environments for children by turning difficult men into serene, better fathers. PEACE directly reduces the incidence of sexual assault and because a large proportion of abortions are to women with violent partners, PEACE will also reduce the incidence of abortion. Con chose not to challenge these ideas. If he addresses them in the final round, I will not have a chance to respond, and I hope readers take this into consideration. Castration is NOT a punishment. It has substantial benefits to the men in question. In Round 2, I proposed several inducements to compliance including health care and legal benefits. Castration does not need to be violently enforced. This is a confronting issue for many people, due to the stigma in our society surrounding castration. It may take a while to educate people about how PEACE can really make our world better. PEACE will require substantial political and financial investment. For this reason, I propose that it be limited to men accused of rape to start with, because this is the demographic whose involvement promises the greatest social benefit. Con argued that men could be falsely accused of rape. On the rare occasions when this occurs, it is no violation of rights because the castration is voluntary. A man who gathers false accusations to himself may have a less-than-serene approach to social interaction and could benefit from PEACE in any case. Thank you to Mikal for this debate and to readers for your attention. (10) (11) (12) (13) (14)\n\nEvidence Con: I accept\n\nEvidence Con: I'm going to offer rebuttals in the following round and strictly focus on contentions in this one. I want to point this back to round one and show what this debate is going to be focused on. Men who are accused by two or more *women* of rape should be castrated. Now on to the contentions C1) Accusations vs Convictions Accusation - a charge or claim that someone has done something illegal or wrong. [1] Conviction - to prove or declare guilty of an offense, especially after a legal trial Literally when we are balancing the difference between an accusations and conviction, it's a monumental difference. One is actually processing and declaring someone guilty by a legal trial or system, and the other is merely asserting that someone is guilty. I feel bad for taking this debate because by the resolution it is immediately flawed. My adversary not only has to show that castration is a viable and ethical way to punish people for rape, but he must also defend the fact that people *accused* of rape should suffer castration. Also this is not just people that are accused by a legal system, it is people that are accused by a majority of women (2 or more). Needless to say that from the start of the debate there are flaws in this perspective. Anyone can theoretically be accused of anything. To show how and why this is flawed let's review a scenario. Say my fiance and 3 of her friends get together and decide they don't like Pro. They call the police and other legal authorities and accuse pro or rape. Note : Accusation is a claim that is not proven to be true, but simply a charge of something. Now according to pro's own resolution, he should be castrated because 2 or more women accused him of rape. Needless to say it's easy to point out the flaw in the resolution and show why it's an impossible BOP to uphold. Any given number of circumstances could occur that could lead to unethical castrations. In pros own resolution he is removing the power away from the legal system and conviction and giving it the public. The amount of faulty castrations would be unheard of by his own criteria. Any 3 women could just get together and accused anyone of rape, leading to non ending castrations. I don't know about other males, but i'm happy I have a penis. I don't want a group of salty btches or some of my exes trying to get my penis chopped off. So just to review this, let's go back over the basic premise of this contention P1) To even properly Defend castration in the case of rape someone would have to be legally charged or convicted of rape P2) Pro is removing the power of conviction and applying accusation as a criteria instead C) The amount of unethical and wrongful castrations would be un ending. In the end pros proposition is not even realistic nor is it viable. Removing and denying someone the right of actually being convicted is actually breaking the 6th amendment in multiple ways as well. I will go over this on my next contention. His position is literally subjective and could be abused by any number of women. The legal system is here for for a reason, and asserting and removing that and replacing it with a 2 women majority is not realistic. C2) Right to a fair trial Another faulty part of this proposition is that it is denying someone the right to a fair trial and the chance to be convicted. You are asserting that if a 2-3 person majority accuse you of something, that is you trial. Per the 6th amendment \" In all criminal prosecutions, the accused shall enjoy the right to a speedy and public trial, by an impartial jury of the State and district wherein the crime shall have been committed; which district shall have been previously ascertained by law, and to be informed of the nature and cause of the accusation; to be confronted with the witnesses against him; to have compulsory process for obtaining witnesses in his favor, and to have the assistance of counsel for his defense. \" [3] It even violates the 14th amendment \" Section 1. All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws. \" [3] Both of these amendments promise someone the due process of law, by an impartial jury of the state and district where the crime was committed. Obviously a 2 women majority is not an impartial jury of the state. Again his proposition is violation amendments left and right. C3) Cruel and unusual punishment Another amendment he has broken is the 8th one \" Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted. \" [3] Torture was banned in all forms a few years back. Torture in it's earliest forms was banned under the Universal Declaration of Human Rights act in 1948[4], but just until recently torture was allowed under the perception of the act. 2 days after Obama took office, he made an executive order to ban torture without exception per the Human Rights act. We can view castration as both cruel and unusual punishment, and even consider it torture. This was not even done to people they were torturing actually. This is beyond both cruel and unusual and is a direct violation of the 8th amendment. Conclusion What my adversary is essentially proposing is an eye for an eye and tooth for a tooth (code of hamurabi). While it seems like a good idea its not, and there are far more humane ways to discourage people of rape. [1] [2] [3] [4]\n\nEvidence Con: This is a brief character debate but I would like to start with addressing the resolution, offering some rebuttals, and showing some contradictions in my adversaries arguments. We are debating the following Resolved - Men accused of rape should be castrated The parameters of the debate are defined as *when two or more women* *accuse* a man of rape he should be castrated. This in its most logical form is literally as it is stated. Men that are said to have raped women (per a 2 or 3 women majority) should be castrated. There is no defending this wording to the resolution. It his bop to show that they ought to be castrated as a punishment for rape. Literally this is saying, because this person raped (x) person he should therefore in turn be castrated for that action. Punishment - suffering, pain, or loss that serves as retribution [1] R1) Not a punishment As I stated in my opening remarks a punishment is the suffering , loss, or pain that serves as retribution towards a certain action. In this case it would be rape. If a certain person commits rape, the resolved in this debate is that he should suffer the loss of his genitals to stop him from raping again. My adversary claims this is not a punishment but saying people that are *accused* of raping *should be or ought to be * castrated in response to them raping. This is literally the point blank definition of punishment. The removal of genitals is literally a retributive act in response to a crime that was committed. The framework for his entire argument centers around the fact that castration is not a punishment but that undermines the resolution behind the debate. This is clearly in response to the act of rape. Men *accused* of rape *ought* to be castrated, in response to the act of rape. This is literally a self contradiction on my adversaries part and defeats the resolution itself. As anything attached to this is not valid. He spends his entire round showing the positive effects of castration but by implementing it as a retributive act in response to rape (punishment) you are removing free will out of the equation. This is not a debate about the positive effects of castration but why it should be implemented as a punishment under a 2 or 3 women majority per the parameters of this debate. R2) The Rest of the arguments Everything he is stating is invalid and can be ignored as it is not applicable to this debate. Saying the positive effects of castration does not justify it as a punishment or retributive action in response to rape. This does not even begin to touch on the fact that he stated it should be done in cases where men are *accused* by two or more women. Every argument in this debate is a non sequitur in regards to the actual resolution and he ignored my entire point that anyone can be accused of rape. Conclusion My adversary literally chose not to offer any rebuttals to my arguments, and per the parameters set up in round 1 we are discussing castration on a male when two or more women *accuse* him of rape. Things he has failed to show and that he has done in this debate (a) He has failed to show how we would counteract the massive amount of wrongful castrations due to lack of a proper conviction (b) He has not addressed how his proposition goes past 3 different amendments. (c) He has contradicted himself and stated that castration is not a punishment when it clearly is. This is a retributive act in response to rape that that is decided by a 2 or 3 women majority which violates someones right to a proper trial. In no way has he laid out a solid foundation for why castration is a proper response to rape. Whether he thinks so or not, this is specifically intended to be and can only be a punishment, and the outline which he gave is directly conflicting with our right to a fair trial and our right to not be imposed to cruel and unusual punishment. He has rebuttaled nothing and most of his arguments are not even relevant to the topic at hand. Due to the lack of a outline for how his proposition is to be legally enforced, is a viable punishment, and does not violate most amendments. I urge the voters to side with neg. [1]\n","DiscussionID":"00000021","Title":"Men accused of rape should be castrated","CrawlDate":"2016/09/29 04:57:04","URL":"http://www.debate.org/debates/Men-accused-of-rape-should-be-castrated/1/votes/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":174,"nextID":"00000002","PremiseStartPos":[226],"prevID":"00000000","Premise":["Men who have been accused by two or more women of rape should be castrated. Leave a message in the comments if you'd like to accept. First round is acceptance."],"PremiseEndPos":[386],"ArgumentID":"00000001","Conclusion":"Men accused of rape should be castrated","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":174,"nextID":"00000003","PremiseStartPos":[401],"prevID":"00000001","Premise":["Thank you to Mikal for accepting this debate. Castration and rape are important, controversial topics in our society and I hope this will be a useful discussion. In this second round, I will introduce the idea of population evolvement, using abortion and crime as an example. I will then discuss the benefits of the PEACE program to society as a whole and to the individuals concerned, and finally I will make some comments about the restrictions on participation. Abortion and Crime: Can we do More? In their book Freakonomics, Levitt and Dubnar present evidence linking abortion to reduction in crime (see video for summary). They argued that unwanted children are the children most likely to grow up to be criminals, and that abortions cull unwanted children and therefore future criminals. This is an uncomfortable finding for many people, but there is no question that abortion is convenient for the community in general - there are over a million abortions a year in the US (2). Of course, it would be far more efficient and desirable if those unwanted pregnancies could be avoided in the first place - or even a proportion of them. Most estimates put the annual cost to the tax pay of unintended pregnancies at over 10 billion dollars (3), for healthcare costs alone. There are additional private costs (4), emotional and physical costs, and of course pro-life advocates would say the moral cost is beyond all price. The social benefits of abortion, including a lower crime rate, are shared by all, but the burden of abortion falls disproportionately on women. Perhaps more disturbingly, it has been shown that women with unplanned pregnancies are four times more likely to have a violent partner than women whose pregnancies are planned, and that violent men are often trying to force their partners into pregnancy and a more likely to refuse to use condoms than other types of men (5). Population-Enhancing Accuse-Castrate Evolvement (PEACE) PEACE works by shifting the intervention from post-conception back to pre-conception. If the sorts of men most likely to father future criminals are castrated, this works in at least two ways to enhance the future of our communities. 1. Castrated men are better fathers and community members. One of the first and most striking effects of castration is a feeling of calm. Serene parents are likely to raise calmer, better adjusted children, as well as bring emotional stability to all their social interactions. \"Ten days post castration, I felt as a feather floating around everywhere,\" writes one happy eunuch. \"I just kept feeling better and better. For me, the serenity was the strongest of the castration effects.\" (6) 2. Castrating potential rapists will lead to an immediate reduction in sexual assault. Because castration is associated with a drop in testosterone, castra-enhanced individuals are able to better focus on their personal and career goals undistracted by sexual feelings or aggressiveness (7). Sex offenders who are introduced into the PEACE scheme are therefore vastly less likely to reoffend than those who are not. Castration is not a punishment Castrated men live 14-18 years longer than untreated men (8). They are more serene and do not grow bald (9). Therefore, castration should not be seen as a punishment in any way, but rather as a life-style choice and an enhancement. Encouraging compliance When we say that rapists should be castrated, we are talking about an ideal state of affairs as has been described thus far. The means by which this is achieved is a separate issue. Certainly, given the vast social benefits anticipated with PEACE, it makes sense that all health-related costs be borne by the state, and that favorable treatment be given to PEACE inductees by the judicial system, given the huge reduction in recidivism following castration (7). There should also be substantial marketing and counselling services to assist men who choose this option, and perhaps the potential for further incentives as deemed appropriate. Accusation vs Conviction In the comments to this debate, two users suggested that castration services be only offered to men who are convicted of rape. However, such a rule would result in a dramatic reduction in the number of people qualified to access the PEACE program - as rape has a very low 4% conviction rate (10). In order to enjoy the full social benefits of PEACE, we need a more inclusive standard. In addition, linking PEACE involvement to convictions or rape may create a false stigma by connecting PEACE too closely with criminal behavior. Two accusations of rape is still, perhaps, too restrictive as most rapists are never formally accused, and may only have one accuser. Potentially, as PEACE grows and gains appreciation in the broader community, there may be calls for it to be extended to a wider participation group. The consequences of such an extension are beyond the scope of this debate, however. Thank you for your attention. I now pass the debate to my esteemed opponent. (2) (3) (4) (5) (6) (7) (8) (9)"],"PremiseEndPos":[5449],"ArgumentID":"00000002","Conclusion":"Men accused of rape should be castrated","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":174,"nextID":"00000004","PremiseStartPos":[5464],"prevID":"00000002","Premise":["Con interpreted the resolution as \"men accused of rape should be forcibly castrated.\" He is not alone. In the comments, several people have assumed coercion even after reading my Round 2 arguments which mention choice specifically. It is not the language that leads to that conclusion. If I said people should be more serene, or you should be given a pay rise, there is no implication of force at all. These are merely recommendations. Yet, when I say \"men accused of rape should be castrated,\" many readers cannot separate the idea from forcible castration. This difference in interpretation puzzled me for a while, until I recognized it for what it is - an expression of testicular privilege. Con and other readers have internalized the stigma against castration so deeply that they simply cannot believe that a man would be castrated voluntarily. Let's talk more about testicular privilege. Eunuch Stigma and Testicular Privilege: Confronting the Myths Here are six common myths. Perhaps these are familiar to you, and maybe you can think of more examples from your own life. MYTH 1: No man would ever volunteer for castration --> FALSE! There are hundreds if not thousands of men who would like to be castrated, despite the sociocultural pressures against it. We don't hear those stories because of bias in the mainstream media. An academic study of 134 men interested in being castrated showed that main reason is to achieve calm and freedom from sexual urges (10). This is a legitimate health concern, and yet 40% of the surveyed men felt uncomfortable raising the issue with a health care provider. They are right to hesitate given the outright prejudice many health professionals exhibit towards the procedure. For example, on this respected health forum (11), a man asks a simple question about castration and is subject to open disbelief and insensitive remarks about needing to talk to a psychiatrist. MYTH 2: Wanting a castration means wanting a sex change. --> FALSE! A study from California State University shows that the majority of voluntary eunuchs identify as male and not as male-to-female transsexuals. (12) MYTH 3: Castration is bad for you --> NUH-UH! As I showed in the previous round, eunuchs live 14-18 years longer on average than other men! MYTH 4: Eunuchs are asexual --> FALSE! This myth is in response to Con's false claim that castration involves getting your \"penis chopped off\". It doesn't. Your penis remains intact and eunuchs still enjoy sex, albeit with more controlled sexual urges. (6 - source from previous round) A historical review in the journal Social Science and Medicine concludes that \" given the right cultural setting and individual motivation, an drogen deprivation [castration] may actually enhance rather than hinder both social and sexual performance.\" (13) MYTH 5: Eunuchs are always bald -->DERP! As I showed last round, castration is the most effective way to stop balding! Men who are particularly sensitive about their hair may consider castration for this reason. (14) MYTH 6: Castrated men are less male than other men. --> NO WAY! Of all the myths, this is the most pernicious. So far, I have shown these consequences of castration - none of which have been contested by Con: Castration leads to a longer life, more serenity, and better hair. It makes rapists less likely to rape, makes men better fathers, and reduces conflict in social interactions. None of these qualities are inherently unmasculine. Dying young, being aggressive, balding and assaulting people are not essential to being a man. To suggest otherwise is to belittle men everywhere. To assume that men would trade over a decade of life and a lifetime of serenity for a pair of testicles is to sell men short. We can't assume that men will not volunteer for castration. On the contrary, I have shown that many definitely do want it even in the context of an extremely repressive culture. Summary: Why our Society needs PEACE In Round 2, I introduced Population-Enhancing Accuse-Castrate Evolvement (PEACE). I showed that PEACE can reduce the number of unwanted children in our society WITHOUT abortion. PEACE creates better environments for children by turning difficult men into serene, better fathers. PEACE directly reduces the incidence of sexual assault and because a large proportion of abortions are to women with violent partners, PEACE will also reduce the incidence of abortion. Con chose not to challenge these ideas. If he addresses them in the final round, I will not have a chance to respond, and I hope readers take this into consideration. Castration is NOT a punishment. It has substantial benefits to the men in question. In Round 2, I proposed several inducements to compliance including health care and legal benefits. Castration does not need to be violently enforced. This is a confronting issue for many people, due to the stigma in our society surrounding castration. It may take a while to educate people about how PEACE can really make our world better. PEACE will require substantial political and financial investment. For this reason, I propose that it be limited to men accused of rape to start with, because this is the demographic whose involvement promises the greatest social benefit. Con argued that men could be falsely accused of rape. On the rare occasions when this occurs, it is no violation of rights because the castration is voluntary. A man who gathers false accusations to himself may have a less-than-serene approach to social interaction and could benefit from PEACE in any case. Thank you to Mikal for this debate and to readers for your attention. (10) (11) (12) (13) (14)"],"PremiseEndPos":[11115],"ArgumentID":"00000003","Conclusion":"Men accused of rape should be castrated","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":174,"nextID":"00000005","PremiseStartPos":[11130],"prevID":"00000003","Premise":["I accept"],"PremiseEndPos":[11139],"ArgumentID":"00000004","Conclusion":"Men accused of rape should be castrated","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":174,"nextID":"00000006","PremiseStartPos":[11154],"prevID":"00000004","Premise":["I'm going to offer rebuttals in the following round and strictly focus on contentions in this one. I want to point this back to round one and show what this debate is going to be focused on. Men who are accused by two or more *women* of rape should be castrated. Now on to the contentions C1) Accusations vs Convictions Accusation - a charge or claim that someone has done something illegal or wrong. [1] Conviction - to prove or declare guilty of an offense, especially after a legal trial Literally when we are balancing the difference between an accusations and conviction, it's a monumental difference. One is actually processing and declaring someone guilty by a legal trial or system, and the other is merely asserting that someone is guilty. I feel bad for taking this debate because by the resolution it is immediately flawed. My adversary not only has to show that castration is a viable and ethical way to punish people for rape, but he must also defend the fact that people *accused* of rape should suffer castration. Also this is not just people that are accused by a legal system, it is people that are accused by a majority of women (2 or more). Needless to say that from the start of the debate there are flaws in this perspective. Anyone can theoretically be accused of anything. To show how and why this is flawed let's review a scenario. Say my fiance and 3 of her friends get together and decide they don't like Pro. They call the police and other legal authorities and accuse pro or rape. Note : Accusation is a claim that is not proven to be true, but simply a charge of something. Now according to pro's own resolution, he should be castrated because 2 or more women accused him of rape. Needless to say it's easy to point out the flaw in the resolution and show why it's an impossible BOP to uphold. Any given number of circumstances could occur that could lead to unethical castrations. In pros own resolution he is removing the power away from the legal system and conviction and giving it the public. The amount of faulty castrations would be unheard of by his own criteria. Any 3 women could just get together and accused anyone of rape, leading to non ending castrations. I don't know about other males, but i'm happy I have a penis. I don't want a group of salty btches or some of my exes trying to get my penis chopped off. So just to review this, let's go back over the basic premise of this contention P1) To even properly Defend castration in the case of rape someone would have to be legally charged or convicted of rape P2) Pro is removing the power of conviction and applying accusation as a criteria instead C) The amount of unethical and wrongful castrations would be un ending. In the end pros proposition is not even realistic nor is it viable. Removing and denying someone the right of actually being convicted is actually breaking the 6th amendment in multiple ways as well. I will go over this on my next contention. His position is literally subjective and could be abused by any number of women. The legal system is here for for a reason, and asserting and removing that and replacing it with a 2 women majority is not realistic. C2) Right to a fair trial Another faulty part of this proposition is that it is denying someone the right to a fair trial and the chance to be convicted. You are asserting that if a 2-3 person majority accuse you of something, that is you trial. Per the 6th amendment \" In all criminal prosecutions, the accused shall enjoy the right to a speedy and public trial, by an impartial jury of the State and district wherein the crime shall have been committed; which district shall have been previously ascertained by law, and to be informed of the nature and cause of the accusation; to be confronted with the witnesses against him; to have compulsory process for obtaining witnesses in his favor, and to have the assistance of counsel for his defense. \" [3] It even violates the 14th amendment \" Section 1. All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws. \" [3] Both of these amendments promise someone the due process of law, by an impartial jury of the state and district where the crime was committed. Obviously a 2 women majority is not an impartial jury of the state. Again his proposition is violation amendments left and right. C3) Cruel and unusual punishment Another amendment he has broken is the 8th one \" Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted. \" [3] Torture was banned in all forms a few years back. Torture in it's earliest forms was banned under the Universal Declaration of Human Rights act in 1948[4], but just until recently torture was allowed under the perception of the act. 2 days after Obama took office, he made an executive order to ban torture without exception per the Human Rights act. We can view castration as both cruel and unusual punishment, and even consider it torture. This was not even done to people they were torturing actually. This is beyond both cruel and unusual and is a direct violation of the 8th amendment. Conclusion What my adversary is essentially proposing is an eye for an eye and tooth for a tooth (code of hamurabi). While it seems like a good idea its not, and there are far more humane ways to discourage people of rape. [1] [2] [3] [4]"],"PremiseEndPos":[16909],"ArgumentID":"00000005","Conclusion":"Men accused of rape should be castrated","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":135,"ConclusionEndPos":174,"nextID":"00000000","PremiseStartPos":[16924],"prevID":"00000005","Premise":["This is a brief character debate but I would like to start with addressing the resolution, offering some rebuttals, and showing some contradictions in my adversaries arguments. We are debating the following Resolved - Men accused of rape should be castrated The parameters of the debate are defined as *when two or more women* *accuse* a man of rape he should be castrated. This in its most logical form is literally as it is stated. Men that are said to have raped women (per a 2 or 3 women majority) should be castrated. There is no defending this wording to the resolution. It his bop to show that they ought to be castrated as a punishment for rape. Literally this is saying, because this person raped (x) person he should therefore in turn be castrated for that action. Punishment - suffering, pain, or loss that serves as retribution [1] R1) Not a punishment As I stated in my opening remarks a punishment is the suffering , loss, or pain that serves as retribution towards a certain action. In this case it would be rape. If a certain person commits rape, the resolved in this debate is that he should suffer the loss of his genitals to stop him from raping again. My adversary claims this is not a punishment but saying people that are *accused* of raping *should be or ought to be * castrated in response to them raping. This is literally the point blank definition of punishment. The removal of genitals is literally a retributive act in response to a crime that was committed. The framework for his entire argument centers around the fact that castration is not a punishment but that undermines the resolution behind the debate. This is clearly in response to the act of rape. Men *accused* of rape *ought* to be castrated, in response to the act of rape. This is literally a self contradiction on my adversaries part and defeats the resolution itself. As anything attached to this is not valid. He spends his entire round showing the positive effects of castration but by implementing it as a retributive act in response to rape (punishment) you are removing free will out of the equation. This is not a debate about the positive effects of castration but why it should be implemented as a punishment under a 2 or 3 women majority per the parameters of this debate. R2) The Rest of the arguments Everything he is stating is invalid and can be ignored as it is not applicable to this debate. Saying the positive effects of castration does not justify it as a punishment or retributive action in response to rape. This does not even begin to touch on the fact that he stated it should be done in cases where men are *accused* by two or more women. Every argument in this debate is a non sequitur in regards to the actual resolution and he ignored my entire point that anyone can be accused of rape. Conclusion My adversary literally chose not to offer any rebuttals to my arguments, and per the parameters set up in round 1 we are discussing castration on a male when two or more women *accuse* him of rape. Things he has failed to show and that he has done in this debate (a) He has failed to show how we would counteract the massive amount of wrongful castrations due to lack of a proper conviction (b) He has not addressed how his proposition goes past 3 different amendments. (c) He has contradicted himself and stated that castration is not a punishment when it clearly is. This is a retributive act in response to rape that that is decided by a 2 or 3 women majority which violates someones right to a proper trial. In no way has he laid out a solid foundation for why castration is a proper response to rape. Whether he thinks so or not, this is specifically intended to be and can only be a punishment, and the outline which he gave is directly conflicting with our right to a fair trial and our right to not be imposed to cruel and unusual punishment. He has rebuttaled nothing and most of his arguments are not even relevant to the topic at hand. Due to the lack of a outline for how his proposition is to be legally enforced, is a viable punishment, and does not violate most amendments. I urge the voters to side with neg. [1]"],"PremiseEndPos":[21073],"ArgumentID":"00000006","Conclusion":"Men accused of rape should be castrated","PremiseStance":["Con"]}}]}