{"MetaData":{"Context":"URL: http://www.debate.org/debates/Andrew-Luck-should-win-the-Offensive-Rookie-of-the-Year-for-the-2012-season/1/\nCrawl date: 2016/09/29 05:54:45\nDebate Topic: Andrew Luck should win the Offensive Rookie of the Year for the 2012 season | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: As Ore_Ele knows, my argument is mostly based on a few basic facts: 1) Luck was leaned on a WHOLE lot more than the other two competing rookies (Wilson and RG3). This is because of the amazing running games of the Seahawks and Redskins. The level of responsibility in the offense of the other two was way below what was put on Luck's shoulders, and the regular-season statistics reflect that - Luck had 627 attempts for 4,374 yards. Compare that to RG3 (393 attempts for 3,200 yards) and Wilson (393 attempts for 3,113 yards). 2) Luck's team was the worst in the league last year, yet he had them in playoff contention for the entire season (Wilson and RG3 had to fight back at the end for the wild card). This is unbelievable, for a rookie to mean this much to a team that a change of that magnitude is possible. Wilson's and RG3's successes have more to do with circumstance than incredible QB play, as the Seahawks have a monstrous defense (particularly the secondary) and the Redskins barely needed to crack .500 to get to the playoffs in a very weak division. Luck's main flaw was interceptions, but with the incredible amount of time he was on the field throwing the ball, that's understandable. Luck has no weapons, no running game, no defense, and no shoulder to lean on but his own. It's fair to assume that if we shuffled these players around as to what teams drafted them, Luck's position would only be strengthened and there's now WAY a Wilson or RG3 would be getting Indy into the playoffs this season. This is a statistical resource for NFL QBs. Some statistics of interest: Passing attempt leaders: 5. Andrew Luck 25. RG3 26. Russell Wilson Yards: 7. Andrew Luck 22. RG3 23. Russell Wilson Rushing yards leaders: 2. Marshawn Lynch (Seattle) 3. Alfred Morris (Washington) 21. Vick Ballard (Indy) When RG3 got hurt, Kirk Cousins was able to win without him because he's just not that important. Similarly, Beast Mode and one of the best defenses around would probably be fine in Seattle without Wilson. But in Indy, it's not even worth showing up if Luck isn't going to be carrying the team on his shoulders, which he's poised to do for the next decade. And that's another important consideration; health. We saw what happens to duel-threat QBs with Michael Vick and RG3's health issues; Wilson will likely suffer the same fate very soon. Luck is a franchise QB for the next 10-15 years, while RG3 and Russell Wilson are probably this year's Tarvaris Jackson, Daunte Culpepper, Vince Young-type of player who shows up young, healthy, and explosive and then is worn-down quickly after taking vicious hits from linebackers game after game. Vince Young made the Madden cover a few years ago, now he can't even hold a BACK-UP QB position without losing it. Duel-threat QBs simply aren't worth isht except for quick bursts when they are very young.\n\nEvidence Pro: R0b1Billion forfeited this round. Con Since my opponent missed his round, I will pass on this round and let this go to voting. Thank you,\n\nEvidence Pro: I concede all points to Con, since he can't rebut anything I have to say.\n\nEvidence Con: I am challenging Rob to this debate because we need more sports debates and this is a position that he's held for a while I will be arguing that Luck should not win the award. To keep comparisons easy, I will only be comparing to other QBs, namely RG3 and Russell Wilson. Please note that we will be arguing on who \"should\" not necessarily who \"will.\" This should be a semantic free debate as it should be clear what the intent and heart of the debate is. Rob may go first if he wishes. Thank you.\n\nEvidence Con: I would like to thank my opponent for his arguments and will start by addressing his before going into my own. === PRO'S CASE === 1) Usage Pro is suggesting that because Luck is asked to do more, however this stat is incomplete. Luck has more passing plays because Indy runs more plays [1]. This year, Indy ran 1126 plays, with Luck passing 627 times and running 62 times [2] for a total of 61% of the plays were done through Luck. Compared to Washington, which only ran 986 plays (and only 902 in the 15 games that RG3 played in) [1]. RG3 passed 393 time and ran 120 times [3] for a total of 57% of the time. The difference in the amount that each team relied on their rookie QB is insignificant. 2) Division strength. My opponent seems to be confused as to which team had the easier run. As I previously pointed out in this thread [4] the opponents that each of the three teams faced has shown that Indy has had be far an easier schedule. Their opponents had a combined record of 95 - 130, while Washington faced 111 - 113 - 1 and Seattle faced 113 - 109 - 3. It is indisputable that Indy had a cake walk, yet Seattle achieved the same 11 - 5 record with a much harder schedule and Washington went 10 - 6 in a division that has 3 potential playoff caliber teams (and went 5 - 1 in that division). 3) Injury risk First thing to note with this, is that it has no bearing on who the best rookie is, only about their risk to the future. On those grounds alone, this can be completely dismissed. However, it should be worth noting that not only is it a red herring for this debate, it is completely inaccurate. While RG3 and Wilson do present injury risks because of their running ability, it is faulty to exclude Luck from this as well. RG3 was #2 in terms of rushing attempts by a QB, Wilson was #3 and Luck was tied at #5 [5]. He is clearly a rushing QB, who still ran half as many times as RG3, so if you say that RG3 will only last a few years, Luck will last only a few longer by the same logic. 4) Correcting some misleading stats My opponent mentions that Ballard is 21st in rushing yards, however he is excluding that Indy runs a 2 RB offense where Brown is carrying the ball 1/3 of the time (his 108 carries to Ballard's 211) [6], if considering them as 1 rather than 2, we see that they would be ranked 10th in total yards. === CON'S CASE === This award is about individual performance. How well did a player perform. This is made clear by Cam Newton winning the award hands down last year, despite his team having a losing record. We will address the players stats and be consitently referring to sources [2][3][7] (they will not be re-sourced every time they are used, most stats will come from the splits section or the stats section). 1) Luck's getting worse with time. Luck's numbers are not too good to begin with, but when you compare his first 8 games to his last 8 games, we see his numbers getting worse. In his first 8 games, he completed 56.5% of his passes (not very good, but okay), while in the last 8 games, that completion rate fell to 51.2. His passing attempts dropped, his average per attempt dropped, he threw more picks, his QBR dropped, his rushes went up while his yards per carry dropped. This is in sharp contrast to say Wilson, who had a mammoth second half of the season. His QBR jumped from 82.4 to 120.3. His completion rate jumped from 61.4 to 67.2 and he threw 16 TDs to only 2 Ints. Griffin, likewise, got better with time, his QBR jumpped from 97.3 to 109.0, while his completion % did drop a little, his yards per pass jumped significantly and he also had 12 TDs to only 2 Ints in the second half. 2) Performance when losing If we stop to look at how each QB performs when they are losing the game, we see the same story. Luck just doesn't perform well. When losing, he is only completing 52.0% of passes, and is throwing as many picks as TDs (14 INT to 15 TDs) giving him a dismal QBR of only 74.1. On the flip side, RG3 is completing 63.5% with 8 TDs to only 1 INT with a QBR of 99.4. Wilson is likewise, completing 61.5% with 12 TDs to 5 INTs with a 99.2 QBR. If we narrow it down to how they perform when down by only a single possession, RG3 runs away with it. When losing by 1-8 points, Luck is still only completing 53.5%, though his QBR jumps to 80.0 (that is sadly pretty high for him). However, RG3 is completing 69.2%, getting 8.2 yards per rush, has 7 TDs to 1 INT, and a QBR of 114.8 (placing him as one of the best QBs to have in that situation). 3) Performance on 3rd down Another key stat is how players do on 3rd down. On 3rd downs, Luck is only completing 51.2% of the time with a QBR of 75.5 and still throwing almost as many INTs as TDs (6 to 7). On the flip side once again, RG3 is completing 59.0%, has 7 TDs to only 1 INT and is averaging 10.9 yards per carry with a QBR of 93.9. 4) Going deep One important key for any QB is the ability to present a deep threat to stretch out the defense and create holes underneath. If a QB can't create that deep risk, that will hurt him for the short ball. If we look at passes thrown more than 20 yards, the difference can be sickening. Luck has made 83 attempts and only completed 26 for a completion rate of 31.3%, meanwhile RG3 has made 33 attempts and completed 15 for 45.5%, about 50% better than Luck's. Luck has thrown 8 TDs and 6 INTs on those 83 attempts, while RG3 has an astounding 7 TDs and no picks at all for his deep ball passes. Luck's QBR on deep attempts is only 72.9 while RG3 holds a 131.6 heads and shoulders above nearly everyone else in the league. Just as a fun comparison, Aaron Rodgers only made 48 deep pass attempts, completed 39.6% for 10 TDs and 2 INTs with a QBR of 109.3, and if we look at Rodger's record setting 2011 year, he went 30 for 57 for 13 TDs and 1 INT for a QBR of 130.2. From these we can see that Luck has not really done very well and benefited from an easy schedule and a good deal of luck (lol). With that, I pass this back to my opponent. [1] [2] [3] [4] [5] [6] [7]\n\nEvidence Con: Since my opponent missed his round, I will pass on this round and let this go to voting. Thank you,\n","DiscussionID":"00000101","Title":"Andrew Luck should win the Offensive Rookie of the Year for the 2012 season","CrawlDate":"2016/09/29 05:54:45","URL":"http://www.debate.org/debates/Andrew-Luck-should-win-the-Offensive-Rookie-of-the-Year-for-the-2012-season/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":160,"ConclusionEndPos":235,"nextID":"00000002","PremiseStartPos":[287],"prevID":"00000000","Premise":["As Ore_Ele knows, my argument is mostly based on a few basic facts: 1) Luck was leaned on a WHOLE lot more than the other two competing rookies (Wilson and RG3). This is because of the amazing running games of the Seahawks and Redskins. The level of responsibility in the offense of the other two was way below what was put on Luck's shoulders, and the regular-season statistics reflect that - Luck had 627 attempts for 4,374 yards. Compare that to RG3 (393 attempts for 3,200 yards) and Wilson (393 attempts for 3,113 yards). 2) Luck's team was the worst in the league last year, yet he had them in playoff contention for the entire season (Wilson and RG3 had to fight back at the end for the wild card). This is unbelievable, for a rookie to mean this much to a team that a change of that magnitude is possible. Wilson's and RG3's successes have more to do with circumstance than incredible QB play, as the Seahawks have a monstrous defense (particularly the secondary) and the Redskins barely needed to crack .500 to get to the playoffs in a very weak division. Luck's main flaw was interceptions, but with the incredible amount of time he was on the field throwing the ball, that's understandable. Luck has no weapons, no running game, no defense, and no shoulder to lean on but his own. It's fair to assume that if we shuffled these players around as to what teams drafted them, Luck's position would only be strengthened and there's now WAY a Wilson or RG3 would be getting Indy into the playoffs this season. This is a statistical resource for NFL QBs. Some statistics of interest: Passing attempt leaders: 5. Andrew Luck 25. RG3 26. Russell Wilson Yards: 7. Andrew Luck 22. RG3 23. Russell Wilson Rushing yards leaders: 2. Marshawn Lynch (Seattle) 3. Alfred Morris (Washington) 21. Vick Ballard (Indy) When RG3 got hurt, Kirk Cousins was able to win without him because he's just not that important. Similarly, Beast Mode and one of the best defenses around would probably be fine in Seattle without Wilson. But in Indy, it's not even worth showing up if Luck isn't going to be carrying the team on his shoulders, which he's poised to do for the next decade. And that's another important consideration; health. We saw what happens to duel-threat QBs with Michael Vick and RG3's health issues; Wilson will likely suffer the same fate very soon. Luck is a franchise QB for the next 10-15 years, while RG3 and Russell Wilson are probably this year's Tarvaris Jackson, Daunte Culpepper, Vince Young-type of player who shows up young, healthy, and explosive and then is worn-down quickly after taking vicious hits from linebackers game after game. Vince Young made the Madden cover a few years ago, now he can't even hold a BACK-UP QB position without losing it. Duel-threat QBs simply aren't worth isht except for quick bursts when they are very young."],"PremiseEndPos":[3144],"ArgumentID":"00000001","Conclusion":"Andrew Luck should win the Offensive Rookie of the Year for the 2012 season","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":160,"ConclusionEndPos":235,"nextID":"00000003","PremiseStartPos":[3159],"prevID":"00000001","Premise":["R0b1Billion forfeited this round. Con Since my opponent missed his round, I will pass on this round and let this go to voting. Thank you,"],"PremiseEndPos":[3297],"ArgumentID":"00000002","Conclusion":"Andrew Luck should win the Offensive Rookie of the Year for the 2012 season","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":160,"ConclusionEndPos":235,"nextID":"00000004","PremiseStartPos":[3312],"prevID":"00000002","Premise":["I concede all points to Con, since he can't rebut anything I have to say."],"PremiseEndPos":[3386],"ArgumentID":"00000003","Conclusion":"Andrew Luck should win the Offensive Rookie of the Year for the 2012 season","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":160,"ConclusionEndPos":235,"nextID":"00000005","PremiseStartPos":[3401],"prevID":"00000003","Premise":["I am challenging Rob to this debate because we need more sports debates and this is a position that he's held for a while I will be arguing that Luck should not win the award. To keep comparisons easy, I will only be comparing to other QBs, namely RG3 and Russell Wilson. Please note that we will be arguing on who \"should\" not necessarily who \"will.\" This should be a semantic free debate as it should be clear what the intent and heart of the debate is. Rob may go first if he wishes. Thank you."],"PremiseEndPos":[3899],"ArgumentID":"00000004","Conclusion":"Andrew Luck should win the Offensive Rookie of the Year for the 2012 season","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":160,"ConclusionEndPos":235,"nextID":"00000006","PremiseStartPos":[3914],"prevID":"00000004","Premise":["I would like to thank my opponent for his arguments and will start by addressing his before going into my own. === PRO'S CASE === 1) Usage Pro is suggesting that because Luck is asked to do more, however this stat is incomplete. Luck has more passing plays because Indy runs more plays [1]. This year, Indy ran 1126 plays, with Luck passing 627 times and running 62 times [2] for a total of 61% of the plays were done through Luck. Compared to Washington, which only ran 986 plays (and only 902 in the 15 games that RG3 played in) [1]. RG3 passed 393 time and ran 120 times [3] for a total of 57% of the time. The difference in the amount that each team relied on their rookie QB is insignificant. 2) Division strength. My opponent seems to be confused as to which team had the easier run. As I previously pointed out in this thread [4] the opponents that each of the three teams faced has shown that Indy has had be far an easier schedule. Their opponents had a combined record of 95 - 130, while Washington faced 111 - 113 - 1 and Seattle faced 113 - 109 - 3. It is indisputable that Indy had a cake walk, yet Seattle achieved the same 11 - 5 record with a much harder schedule and Washington went 10 - 6 in a division that has 3 potential playoff caliber teams (and went 5 - 1 in that division). 3) Injury risk First thing to note with this, is that it has no bearing on who the best rookie is, only about their risk to the future. On those grounds alone, this can be completely dismissed. However, it should be worth noting that not only is it a red herring for this debate, it is completely inaccurate. While RG3 and Wilson do present injury risks because of their running ability, it is faulty to exclude Luck from this as well. RG3 was #2 in terms of rushing attempts by a QB, Wilson was #3 and Luck was tied at #5 [5]. He is clearly a rushing QB, who still ran half as many times as RG3, so if you say that RG3 will only last a few years, Luck will last only a few longer by the same logic. 4) Correcting some misleading stats My opponent mentions that Ballard is 21st in rushing yards, however he is excluding that Indy runs a 2 RB offense where Brown is carrying the ball 1/3 of the time (his 108 carries to Ballard's 211) [6], if considering them as 1 rather than 2, we see that they would be ranked 10th in total yards. === CON'S CASE === This award is about individual performance. How well did a player perform. This is made clear by Cam Newton winning the award hands down last year, despite his team having a losing record. We will address the players stats and be consitently referring to sources [2][3][7] (they will not be re-sourced every time they are used, most stats will come from the splits section or the stats section). 1) Luck's getting worse with time. Luck's numbers are not too good to begin with, but when you compare his first 8 games to his last 8 games, we see his numbers getting worse. In his first 8 games, he completed 56.5% of his passes (not very good, but okay), while in the last 8 games, that completion rate fell to 51.2. His passing attempts dropped, his average per attempt dropped, he threw more picks, his QBR dropped, his rushes went up while his yards per carry dropped. This is in sharp contrast to say Wilson, who had a mammoth second half of the season. His QBR jumped from 82.4 to 120.3. His completion rate jumped from 61.4 to 67.2 and he threw 16 TDs to only 2 Ints. Griffin, likewise, got better with time, his QBR jumpped from 97.3 to 109.0, while his completion % did drop a little, his yards per pass jumped significantly and he also had 12 TDs to only 2 Ints in the second half. 2) Performance when losing If we stop to look at how each QB performs when they are losing the game, we see the same story. Luck just doesn't perform well. When losing, he is only completing 52.0% of passes, and is throwing as many picks as TDs (14 INT to 15 TDs) giving him a dismal QBR of only 74.1. On the flip side, RG3 is completing 63.5% with 8 TDs to only 1 INT with a QBR of 99.4. Wilson is likewise, completing 61.5% with 12 TDs to 5 INTs with a 99.2 QBR. If we narrow it down to how they perform when down by only a single possession, RG3 runs away with it. When losing by 1-8 points, Luck is still only completing 53.5%, though his QBR jumps to 80.0 (that is sadly pretty high for him). However, RG3 is completing 69.2%, getting 8.2 yards per rush, has 7 TDs to 1 INT, and a QBR of 114.8 (placing him as one of the best QBs to have in that situation). 3) Performance on 3rd down Another key stat is how players do on 3rd down. On 3rd downs, Luck is only completing 51.2% of the time with a QBR of 75.5 and still throwing almost as many INTs as TDs (6 to 7). On the flip side once again, RG3 is completing 59.0%, has 7 TDs to only 1 INT and is averaging 10.9 yards per carry with a QBR of 93.9. 4) Going deep One important key for any QB is the ability to present a deep threat to stretch out the defense and create holes underneath. If a QB can't create that deep risk, that will hurt him for the short ball. If we look at passes thrown more than 20 yards, the difference can be sickening. Luck has made 83 attempts and only completed 26 for a completion rate of 31.3%, meanwhile RG3 has made 33 attempts and completed 15 for 45.5%, about 50% better than Luck's. Luck has thrown 8 TDs and 6 INTs on those 83 attempts, while RG3 has an astounding 7 TDs and no picks at all for his deep ball passes. Luck's QBR on deep attempts is only 72.9 while RG3 holds a 131.6 heads and shoulders above nearly everyone else in the league. Just as a fun comparison, Aaron Rodgers only made 48 deep pass attempts, completed 39.6% for 10 TDs and 2 INTs with a QBR of 109.3, and if we look at Rodger's record setting 2011 year, he went 30 for 57 for 13 TDs and 1 INT for a QBR of 130.2. From these we can see that Luck has not really done very well and benefited from an easy schedule and a good deal of luck (lol). With that, I pass this back to my opponent. [1] [2] [3] [4] [5] [6] [7]"],"PremiseEndPos":[9936],"ArgumentID":"00000005","Conclusion":"Andrew Luck should win the Offensive Rookie of the Year for the 2012 season","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":160,"ConclusionEndPos":235,"nextID":"00000000","PremiseStartPos":[9951],"prevID":"00000005","Premise":["Since my opponent missed his round, I will pass on this round and let this go to voting. Thank you,"],"PremiseEndPos":[10051],"ArgumentID":"00000006","Conclusion":"Andrew Luck should win the Offensive Rookie of the Year for the 2012 season","PremiseStance":["Con"]}}]}