{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-16kadams-Trial/1/votes/2/\nCrawl date: 2016/09/29 03:23:14\nDebate Topic: The 16kadams Trial | Debate.org\nNumber of arguments: 7\n\n\nEvidence Pro: This is the official trial of 16kadams. 4 rounds Debate resolution will simply be \"Trial of 16kadams\" Charges by the prosectution will be presented in the first round, I will quickly make a summary of the charges, then the defense is going to accept this debate. Full evidence begins in the next round. Guilt or innocence will be determined by the voters of DDO and not by any special jury Innomen will determine the process of sentencing if 16kadams is found guilty of any charges Voting period will last 1 week Summary - there is evidence that 1kadams used his grandfathers account (angelo) to vote on his own debates and we know this becuase angelo's account was closed and reopened at least once just to vote on 16kadams debates - 16kadams has convinced many friends and family members to join DDO just to debate them in order to boost his own numbers. Hes used his grandfather, little sister, and at least two friends - the IP address of 16kadams at one point was the same as Angelo which implies that he has logged on under angelo and misused that account - there are cases where he was thought to be behind other accounts such as chainmachine, accounts which lose multiple debates to 16k and have horrific debating styles against him, but against other opponants those same accounts argue with the same style 16k uses - It was believed that he was using proxies to change his IP address to avoid charges of multi accounting but in light of new evidence it shows that his IP address changes all the time and that he actually has access to instructions on how to change your IP address (see above) - Lastly there is the issue of poor voting where 16kadams was accused of voting improperly or even votebombing debates almost always in favor of the conservative side.... This round is for acceptance only; defense may bring in an abstract of their case. Good luck :-)\n\nEvidence Pro: We accept your opening stance. Note that the prosecution team has worked together for this opening argument. OPENING ARGUMENTS 1) On the charge that 16k used his grandfather's DDO account (Angelo) to vote on his own debates and vote in his favor. That conflicts with Rule G in the Terms of Service which states that \"Users will not impersonate any person or entity, including without limitation Debate.org officials, staff, and/or Members.\"Âï¿½ 2) On the charge that 16k convinced friends and family members to join DDO just to debate them, This conflicts with Rule R which states \"Users will not use the Service in any way that violates the terms of this Agreement, or that aids, encourages, or purports to authorize anyone else to violate the terms of this Agreement.\"Âï¿½ Since 16k is using people close to him to have them establish accounts on DDO, that allows him the potential to exploit or impersonate those accounts. Forcing people to get accounts that he could potentially impersonate or exploit conflicts with Rule G which violates the TOS, meaning that forcing people in his family to get into DDO aids in 16k exploiting those accounts and violate the TOS, which goes against Rule R. 3) On the charge that the IP address of 16k was the same as Angelo, this implies that he has logged on under Angelo and misused that account, which conflicts with Rule G 4) On the charge of multiaccounting, this again conflicts with Rule G. 5) On the charge of exploiting his ever changing IP address and having instructions for changing his IP address, that could be exploited to allow him to impersonate other members, which conflicts with Rule G 6) The final charge of poor voting where 16k was accused of voting improperly on debates almost always in favor of the conservative side.... The second clause of Rule T states that all members must agree to \"No personal attacks against other members or a member's opinions.\" Votebombing a debate in favor of the conservative side of any issue is a personal attack on the debater representing the liberal side of the issue. Since 16kadams is corrupting the voting process in favor of his own opinions rather than the quality of the arguments in the debate, this violates Rule T. Charge 1) Angelo engaged in 16kadams in 3 debates and lost each one. Whats more concerning is the fact that Angelo voted in favor of 16kadams 11 out of 11 times. Here are all several debates that Angelo voted on for 16K at the time angelo's vote gave 16k the lead no effect on the outcome href=\" target=\"blank\"> 7 POINT VOTE BOMB WHICH GAVE 16K THE WIN Of the debates that Angelo voted on, 2 directly resulted in 16k winning and a third resulted in tying one. Several others resulted in lead changes in favor of 16k This suspicious voting behavior was recognized by the others and soon after, Angelo had terminated his account. 1 week later an IP check was run by Innomen which revealed that 16k and Angelo had the same IP address. This means that Angelo was using the same IP address as 16k when his account closed, suggesting that the account was under the influence of 16k. Charge 2) 16k stated numerous times that DJmooshy was not a multiaccount but a friend of his whose account was unjustly closed. 16k also admitted to making his little sister get a DDO account to debate her \"alex1018\". Other known friends of 16k include his grandfather and \"elephaunt\"who 16k knows in real life friends get DDO accounts leaves them more vulnerable for 16k to use them himself for his own gain, which violates Rule G and Rule R Charge 3) Proof for Charge 3 comes from the fact that 16k and Angelo's IP address were the same about 2 weeks ago, a full week after Angelo had left, suggesting that 16k manipulated Angelo's account before it closed after it was revealed that he voted in favor of 16k 11 times. Charge 4) Evidence here revolves around the account chainmachine, a recent member who in his first few days on the site debated 16k 3 times, lost horrifically in all 3, but in other debates uses a debating style identical to that of 16k. This is the argument style of chainmachine against 16k is the argument style of chainmachine against anybody else. is also suspected of being a multi account of 16kadams because of its original similarity to Angelo's early account, Angelo: Socialist, Profile pic was of a Chinese Flag even though he is not Asian, supports Obama Chainmachine: Communist, Profile Pic is of a Communist Russia Flag, also supports Obama. More evidence about chainmachine being a possible multiaccount of 16k came in the forums. Chainmachine, who had no forum posts before, happened to go to the forums, happened to find the forum implicating 16k, and posted this \"No I am not 16kadams. I admit he is a superior debater than me, also debate.org has little to no people who share my far left opinions. Also if you notice all my arguments with 16kadams are issues that are very one sided voting wise because of the political views of the majority of the users. I don't know about these other accounts but I think 16kadams is perfectly valid and is just a human debater like the rest of us.\" parts in bold show superficial dialogue spoken by chainmachine ,but the underlined part shows knowledge of DDO that no 4 day old account could have known. This suggests that chainmachine could be a multi account of someone else who has a deep knowledge of DDO, but it leans towards 16kadams since chainmachine just happened to go to the exact forum MINUTES AFTER HIS NAME WAS MENTIONED to defend 16k. Charge 5) 16kadams prior to the trial sent this link to imabench, is the PM he one of the prosecutors. All of that shows how 16k could be using a variety of tools to manipulate his ever changing IP address to use other accounts on DDO. In the second picture near the top, there is actually a tab that if you click it allows one to VIEW INSTRUCTIONS FOR HOW TO CHANGE ONES IP ADDRESS.. The last piece of evidence was another IP check that revealed that 16k's alternate IP address was a number that traces to Pennsylvania. Normally if one were simply getting a new IP address every time they logged on, that IP address would still be concentrated to near where 16k was living. However this alternative IP address suggests that 16k is using proxies since Dynamic IP Addresses DO NOT JUMP ACROSS STATE LINES like 16k's does. The final charge of votebombing debates would chew up what few characters I have left, If possible I will post some of those votebombed debates in later rounds. The evidence is very clear taht 16kadams is guilty. Unto the defense.\n\nEvidence Pro: Microsuck forfeited this round. Con Unfortunately, given Pro’s forfeit there is little left for the defense to do in this round. Thus far, we have outlined our own case and responded to all of the charges. Pro has spectacularly failed to fulfil his initially high burden of proof or even mount a credible case for the prosecution, let alone engage with the defense’s explanation of the charges brought against the defendant. As of now, and with only 1 round to go, Pro has an almost insurmountable task to achieve the level of certainty demanded to win a conviction. He still has to make a credible case, as well as engage with the rebuttal to the charges given in round 2. All of this, as well as the necessary preconditions which the defense set out in R1, which would be needed for a successful prosecution of the defendant, makes his task almost impossible. In short, unless Pro’s final round is astoundingly good, he can’t even hope to win the debate. If he falls short of this very high standard, a vote for Con is simply the only justifiable decision from the jury. While it is undoubtedly less than ideal that Pro conceeded a round, especially in a debate of this nature, where Pro has the burden of proof, it is simply a position we are left in because of Pro's failure to post in time. As such, we the defense also ask that conduct points be considered accordingly, especially given the increasing sense of frivolousness and carelessness with which this trial has been carried out from Pro. With that, we hand it back to Pro in anticipation for the final round.\n\nEvidence Pro: I apologize for missing the round. I pray that you all will forgive me and the jury looks at the evidence and not the forfeit. -->Case<-- A1: Multi-accounting charge 16kadams has confirmed that his grandfather has used a computer in 16k's house to access DDO whilst on one his frequent house visits. ... Against this point, discuss the timeline. He logged on a week after 16k's grandfather left the state and had the same IP at that point. The prosecution also makes an unwarranted assertion: \"...an IP check was run by Innomen which revealed that 16k and Angelo had the same IP address. This means that Angelo was using the same IP address as 16k when his account closed\" This is a non-sequitor. It does not follow that because Innomen's check found they had the same ip at one point, that they had the same IP when it was closed. Therefore his conclusion that it must be under the influence of 16K is unwarranted. Turn this, because this this means that the last time Angelo's account was used, a full week after Angelo moved to Texas from 16kadams' home in New Mexico, Angelo and 16kadams had the same IP address. This means that 16kadams was in possession of Angelo's account because logically, Angelo could not have used a device that was located in another state. Whilst it would be entirely possible for 16k to abuse his grandfather's account, the only evidence to suggest that he has is Angelo's voting record. ... Here in the esteemed DDO courts we most certainly do not recognize the sins of the grandfather as sins of the son. This is a strawman. The argument is that Angelo's behavior is consistent with that of a multi account, and not that 16k should be punished for his Grandfather's behavior. 11/11 votes were for 16 k, including a vote for him a full week after he had previously deactivated his account and moved to Texas. In fact, he only activated his account to vote on 16k's debate. This charge fails to illustrate where the TOS has been broken....The only thing that could be established is a potential opportunity (not even a proven one) The assertion: \"...Firstly, the claim that 16K forced friends to make accounts is unproven. Secondly, it would not break TOS clause G (and subsequently R) as it would not be an act of impersonation. \"the claim . . . is unproven\" 16kadams actually admits that he forced a friend, djmooshy, who did not want to debate him, to sign up and initiate a troll debate with him. All evidence suggesting that the user known as Chaimachine is a multi-account of 16kadams is completely insubstantial... 1. His first forum post is a defense of 16k, and he never posts any other time after that. That definitely indicates that he is a multiaccount. Who logs in to a forum that he has never seen and just defends a random stranger against whom he debated online? The thread was not even about 16k. Further more as 16kadams has a dynamic IP, an IP address changes every time the User Logs on. [ ] Therefore one can assume the dynamic IP explains the supposed IP changes. He dropped the analysis about how the IP address changes across state lines. Evidence for the charges When Angelo's account closed, he had the same IP address as 16k when the account closed. If 16k was exploiing Angelo's account and 16k decided to kill it from his computer, that would leave Angelo with the same IP address as 16k. Now the only way that 16k would be innocent of misrepresenting Angelo's account is if Angelo suddenly decided to visit his grandson in another state and kill his account for no reason 5 days after the DDO community noticed his voting behavior. The odds of that are small to begin with but when you take into account similar gramatical errors that 16k and Angelo made in their time on DDO despite having the age difference of about 50 years, along with the very stereotypically liberal account he had (socialist with a flag of soviet china as his profile picture who supported obama), the fact that Angelo gave no reason why he was closing his account just 5 days after the DDO community began to realize Angelo's voting pattern in favor of 16k, and the numerous past accusations of 16k multiaccounting, all this circumstancial evidence points towards the conclusion that 16k could have manipulated Angelo's account. The charge of 16k using his family and friends to get DDO violates the TOS since 16k has admitted to forcing these people to get DDO accounts to debate them. However the TOS comes into play when these accounts are left open to misrepresentation by 16k since the TOS forbids aiding in anything that could break the TOS. Making his family members and friends get DDO accounts makes it possible that 16k could later gain access to these accounts and misuse them for his own gain. 16k is aiding himself in breaking the TOS by making those close to him get DDO accounts which are more likely to be exploited by him. This may sound absurd but considering that 16k has already admitted to harassing his own sister to get on DDO to debate her, the numerous personal friends he has in real life being on DDO, and the evidence of misusing his grandfatehrs account, then this charge is very valid. The chainmachine accusation is being used because not because he has the same average intelligence as 16kadams, its because - In 4 days Chainmachine had 3 completed, yes completed, debates with 16k and he had lost all of them - Chainmachine had a remarkably similar and stereotypically leftist profile that conservatives would have of liberals (a communist with a communist Russia flag as a profile pic who supports Obama), much like Angelo's early account - Chainmachine who originally had a dreadful debating style while debating 16k now has the exact same debating style as 16k when debating others. - The deep knowledge that chainmachine already has about the people on DDO that no 4 day old account could ever have known about - The fact that barely 3 hours after 16k was suspected of being chainmachine, chainmachine, who had never had a forum post ever before, just happened to go onto the forums, just happened to find the one about 16k and Angelo (chainmachine was not in the title of that thread) and gave a defense on behalf of 16k that contains lingo that is only learned on DDO after one spends a long time on the site (not 4 days), that contans language showing a deep knowledge of DDO no 4 day account would no of, and contains language that sounds completely fake and almost not human. - The fact that chainmachine offered to put himself on trial on the thread discussing why 16kadams deactivated his account hours after all the new eveidence suggesting he was multiaccounting surfaced. Ip address is a big argument because 16k does have a dynamic IP address, but the IP address changes only between other local ISP's (internet service providers). What implies proxy use in this case though is that IP checks by innomen revealed that 16k's ip address jumps between state lines between New Mexico and Pennsylvania, something that can only be explained by the use of proxies. Dynamic IP address can be exploited to switch between other local IP addresses within a certain area without the use of proxies. This means that by exploiting his constantly changing local IP address, 16k could multiaccount through other accounts that are located close to him geographically. Perhaps the greatest evidence of 16k is the votebombed debates that 16k has participated in, almost all of which are simply against the liberal side / in favor of the conservative side, or just against liberal accounts on DDO Thank you.\n\nEvidence Con: Accused - 16kadams Defence team - Thaddeus, Unitedandy and 16kadams = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = Introduction As Pro indicates, the resolution of the debate is to ascertain whether 16kadams should be charged in relation to accusations by Pro. We, as the defence, will show that these charges have no basis. In the first round, we will attempt merely to clarify some important issues, and will respond to any and all charges in R2, as and when Pro identifies and provides evidence to affirm the resolution. Before we can do anything, however, we must first determine “guilt”. What is guilt? In order for an activity to be deemed worthy of punishment, there are 2 minimal conditions that it must have: 1. It must first break a DDO rule. Any charge Pro presents must correspond to a violation of the DDO Terms of Use ( For each charge, Pro must clearly identify which rule is being broken. Any action which does not break a DDO rule specifically should be considered irrelevant to the debate. While there are undoubtedly practices which may improve the site if enacted, Pro must argue that the defendant has broken EXISTING rules. And 2. Any successful charge will have to be proven beyond reasonable doubt. This means that the evidence will eliminate all plausible explanations other than guilt. Both of these conditions must be met for each and every charge that Pro wishes to bring against the defendant. This illuminates a very important point in the debate - where the burden of proof lies. As the prosecution, Pro will have to shoulder the burden demanded. Anything other than a clearly identified and fully established case of rule-breaking demands a vote for Con. This is because of the presumption of innocence. Presumption of innocence “The burden of proof is thus on the prosecution, which has to collect and present enough compelling evidence to convince the trier of fact, … that the accused is guilty beyond a reasonable doubt. If reasonable doubt remains, the accused is to be acquitted.” (1) Obviously, the dangers of punishing an innocent member of DDO community could be catastrophic for debates on the site. Debates depend on voting. In order to guard against deterring voting behaviour, it is essential that we treat prospective members as innocent until proven guilty. This demands that unless and until Pro provides a plethora of corroborating evidence relating to a specific charge, we should regard the case as unproven and vote Con. Conclusion This trial solely regards the guilt or innocence of 16kadams. Whether one approves of his actions or not is irrelevant. Only by finding him guilty, in accordance with the criteria set out above can a vote for Pro be justified. We now pass the debate over to Pro to present the charges. Sources (1)\n\nEvidence Con: Introduction Thank you prosecution. I would like to draw the readers attention to the poor conduct that the prosecution has shown in their case. They have presented as many charges as possible, many being duplicates, and some are not even charges, but rather haphazard presentation of evidence. This technique is often described as \"shotgun argumentation\", where one makes as many arguments as possible, regardless of validity, in the attempt to hinder the defenses ability to respond fully to each charge. I do not believe this was purposeful. Hopefully this will not be an issue in future rounds. It would also be beneficial for all involved if a more measured approach to this trial was taken. It is more than evident from the emotive way the prosecution is presenting their case (use of caps and language), that they are too emotionally involved. The defense would remind them that their duty is to present their case fairly and nothing more and their personal feelings towards any users involved should be ignored. The structure that shall be used in the defense is to look at each charge in turn with direct reference to the part of the TOS it is in violation of. I shall then proceed to formalize the charges into groups which shall make it easier for the readers and debaters to understand. Charges Charge 1 Charge of Impersonation of 16k's grandfather (TOS G) Charge 2 Charge of aiding or encouraging friends to commit acts of impersonation and consequently break the TOS. Also a charge of possesing multiple accounts. Henceforth known as 2a and 2b. (TOS R, consequently in violation of TOS G. Additional charge of TOS A) It is worth noting that charge 2a and 2b are contradictory. It is very unlikely that he both encouraged his friends to break the TOS and also created and possesses the very same accounts. Charge 3 At one point the user known as 16kadams had the same IP address as the user known as \"Angelo\" This is quite obviously not a charge, and rather a piece of evidence. Therefore charge 3 must be dropped on the grounds that it is not a charge. Charge 4 Possesion of mutliple accounts (TOS A) Charge 5 Exploitation of changing IP address. (TOS G) This charge can be dropped on the grounds that it too is not a charge, but rather an accusation of a means of performing an already stated violation. Charge 6 Making personal attacks against other members via votebombing (TOS T) It seems rather evident that charges be considated into; Charge A: TOS violations with relation to the user known as Angelo A1: Multi-accounting charge (TOS A) or A2: Using Angelo's account illigitemately (TOS G) Charge B: TOS violations with relation to the users know as DJmooshy,alex1018, Chainmachine and Elephaunt B1: Encouraging users to break the TOS (TOS R and TOS G) or B2: Multi-accounting charge (TOS A) Charge C: TOS violations with regard to the user known as 16kadams voting record (TOS T) Charge C is dropped instantaneously by the prosecution, rendering it meaningless at this point. A1: Multi-accounting charge 16kadams has confirmed that his grandfather has used a computer in 16k's house to access DDO whilst on one his frequent house visits. Due to the circumstantial nature of the evidence presented by the prosecution (it is far from conclusive and leaves a great amount of doubt) there is insufficient evidence to prove this charge. The prosecution also makes an unwarranted assertion: \"...an IP check was run by Innomen which revealed that 16k and Angelo had the same IP address. This means that Angelo was using the same IP address as 16k when his account closed\" This is a non-sequitor. It does not follow that because Innomen's check found they had the same ip at one point, that they had the same IP when it was closed. Therefore his conclusion that it must be under the influence of 16K is unwarranted. A2: Whilst it would be entirely possible for 16k to abuse his grandfather's account, the only evidence to suggest that he has is Angelo's voting record. This is completely inconclusive. While it is obviously a less than stellar voting record, there is no reason to believe that this is Angelo's misdeeds rather than 16K's. Here in the esteemed DDO courts we most certainly do not recognize the sins of the grandfather as sins of the son. B1: This charge fails to illustrate where the TOS has been broken. It is not substantiating what part of the TOS 16K is encouraging them to break. Furthermore, even if the prosecution had detailed what part of the TOS they had supposedly been encouraged to break this charge is impossible to prove. The only thing that could be established is a potential opportunity (not even a proven one) The assertion: \"Making friends get DDO accounts leaves them more vulnerable for 16k to use them himself for his own gain, which violates Rule G and Rule R\" is completely unsubstantiated and false. Firstly, the claim that 16K forced friends to make accounts is unproven. Secondly, it would not break TOS clause G (and subsequently R) as it would not be an act of impersonation. [ ] B2: All evidence suggesting that the user known as Chaimachine is a multi-account of 16kadams is completely insubstantial. Many users of about average intelligence have very similar writing styles. 16K is no exception. The post on the forums written by Chainmachine would indicate that he knows 16K, however, it is not proof by any stretch of the imagination, by itself that Chainmachine is a multi-account. Alpha: Dynamic IP The picture sent by 16k was merely sent to demonstrate that he was not using proxies, an allegation made by the prosecution prior to the trial. The bizarre thing is that the prosecution now seem to be implying that because he has a dynamic IP he must have been abusing it. This is nonsensical. Every assertion in the last few paragraphs is totally unsupported and pure speculation. Without evidence, they can not be considered charges. In fact, even a confession of using proxies would not constitute a charge as it is not against the terms of service. [ ] Whether the website gives advice regarding how to change one's IP is immaterial. Further more as 16kadams has a dynamic IP, an IP address changes every time the User Logs on. [ ] Therefore one can assume the dynamic IP explains the supposed IP changes. So far the prosecution has not been able to provide any evidence substantial enough to reasonably or conclusively prove that 16kadams has broken any of the terms of service. There is substantial doubt proving 16kadams not guilty and therefore the prosecution does not fulfill the burden of proof. [ ] Therefore one should vote for the defenses side.\n\nEvidence Con: Unfortunately, given Pro’s forfeit there is little left for the defense to do in this round. Thus far, we have outlined our own case and responded to all of the charges. Pro has spectacularly failed to fulfil his initially high burden of proof or even mount a credible case for the prosecution, let alone engage with the defense’s explanation of the charges brought against the defendant. As of now, and with only 1 round to go, Pro has an almost insurmountable task to achieve the level of certainty demanded to win a conviction. He still has to make a credible case, as well as engage with the rebuttal to the charges given in round 2. All of this, as well as the necessary preconditions which the defense set out in R1, which would be needed for a successful prosecution of the defendant, makes his task almost impossible. In short, unless Pro’s final round is astoundingly good, he can’t even hope to win the debate. If he falls short of this very high standard, a vote for Con is simply the only justifiable decision from the jury. While it is undoubtedly less than ideal that Pro conceeded a round, especially in a debate of this nature, where Pro has the burden of proof, it is simply a position we are left in because of Pro's failure to post in time. As such, we the defense also ask that conduct points be considered accordingly, especially given the increasing sense of frivolousness and carelessness with which this trial has been carried out from Pro. With that, we hand it back to Pro in anticipation for the final round.\n\nEvidence Con: Introduction Thank you for responding. It is worth noting that the prosecution choose to ignore the layout proposed in the second round, again opting for a more haphazard method of presenting the charges. They also provide no sources for any of the evidence claims they make, where in many cases, they would be vital to proving the charges. This alone makes the prosecutions case insufficient. I shall proceed to defend 16K from each charge in turn. A1 & A2 This charge has been treated by the prosecution as an \"or\" proposition; that either 16k created the user known as Angelo's account or gained access to his grandfather's account and impersonated him. Hence, the defence shall respond to the charges collectively accordingly. The prosecution first requests that we discuss the timeline. I would be very amenable to this suggestion, but unfortunately no cohesive version of the timeline is presented or sourced. The prosecution claims that they knew the whereabouts of 16K's grandfather at given times. Without evidence this claim is far too incredible to entertain. IPs At this point it may be worth clarifying some information about IPs which the prosecution seems to be confused about. The US has approximately 20 geographically assigned IPs as of 2006. Here is a simple model of IPv4 mapping; Though these IPs are assigned geographically they are not assigned via state lines. It is also completely possible to have an IP address which is not geographically determined. For example; IPs beginning in 166 (subnets), the supposed alternate IP address Angelo was found to have. This IP allocation has no bearing on geographical location and people with this IP subnet can be found from the US to Japan. Behaviour The prosecution also claim the voting misconduct of Angelo's is indictative of a multi-account. However, such behaviour, especially once familial relationships are noted, could equally be attributed to an over-enthuseastic grandfather who is blind to his grandson's faults. If no further evidence is presented on the matter, his behaviour can only be deemed as inconclusive evidence. Behaviour The prosecutions case here is completely speculative, unsourced and some of the details false. Angelo never had a \"soviet china\" flag. The prosecution even admit that all the evidence is circumstancial. The voting behaviour can easily be explained by the familial ties, and age is no indicator of ones adherence to grammar and spelling. B1 Djmushy The only argument that prosecution makes here is the unsourced claim that 16K admits to \"forcing\" his friend to join and debate him. Presumably the prosecution is only accidently making the claim that a 15 year old child employed physical force or blackmail on one of his friends to make him open an account and debate him (badgering a reluctant friend is not \"force\"). Even if the prosecution were able to source this claim, the defence would remind them that this is not against the terms of service, but a personal issue. Should it be done to a certain volume; that could be considered spam - but a single debate, no matter how \"trolly\" is legitimate provided two different parties are engaging in the debate. To claim that purely having friends and family who own DDO accounts is a violation of the TOS is an absurdity. Whilst it is entirely possible that 16K may have gained access to these accounts, purely having the possible potential does not constitute a violation of the TOS. However, the defence would like to offer the following life advice to the defendant; that harrassing one's friends to debate is not a very good way to keep friends. B2 Chainmachine Behaviour I would remind the readers that all the behavoural observations are again unsourced. 1. Debates with 16K The defence was not aware that to debate someone else, one had to own their account. Whilst it is mildly uncommon to debate someone several times in a row, there are many obvious explanations. One, for example, could be that, being new to site, he chose to debate someone he had found an ideological nemesis in. Having debated him before, and not feeling quite comfortable debating others yet, he chose to debate him a few more times before looking for others to debate. 2. Poor debating style The prosecution claims that chainmachine's style was initially poor and developed into a style similar to 16K's. The prosecution fails to give examples of such similarities. A brief investigation by the defence found no such examples. Furthermore, would it be unreasonable to emulate a debator that you believed to be superior? No matter how misplaced this belief may be, it does seem that chainmachine has some sort of respect for 16K. We should not be so judgemental that we declare everyone who respects someone who is generally looked down upon to be a multi-account. 3. Knowledge of people on DDO Again this is unsourced and no examples are given. However, the defence will make the observation that many people lurk around DDO before making an account for a varying period of time. This could easily explain such matters. 4. Suspicious post An alternative explanation is that, as previousl stated, the user known as chainmachine has some respect for 16k and decided to read a thread with his name in the title. From his debates it is clear he is not the sharpest tool in the shed, and wrote a bizzarre defence. We do not know how long chainmachine was lurking for before making an account, so the any accusation of knowing things he ought not to know holds no water. Whether or not he sounded human has absolutely no relevence to whether the account is a multi-account of 16K's or not. 5. Offering to be put on trial This is an odd accusation. He has become aware that he was accused of being a multi-account and he offers himself to be put on trial. How does this provide further evidence he is a multiaccount? 6. Having a communist flag is actually rather common in members who are communists. It doesn't just suggest a stereotypical view of communists. Counter points - If chainmachine is a multiaccount, an inordinate amount of effort has gone into it. Several debates with a variety of users, some of significant length ,public discussions with other users and bothering to change his profile picture several times. It is far more reasonable to believe he is a none too bright misguided individual than part of a insidious plot by 16k. Auxillary charges IP I would remind the prosecution that the use of proxies is not against the terms of service, and the information provided about proxies above. Votebombs For the supposed greatest piece of evidence, remarkably little is provided. With so little analysis or evidence, we can only consider this charge dropped. In addition votebombing is not against the terms of service. Conclusion Again the prosecution completely fail to demonstrate any of the charges made against the defendant with any conclusivity. They fail to provide sources for accusations made, wildly speculate off circumstancial evidence, and even attempt to prosecute 16Kadams for infractions which even they do not think he has commited yet, but believe he has the possibility of committing. There is no option but to acquit 16kadams of all charges.\n","DiscussionID":"00000046","Title":"The 16kadams Trial","CrawlDate":"2016/09/29 03:23:14","URL":"http://www.debate.org/debates/The-16kadams-Trial/1/votes/2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":111,"ConclusionEndPos":129,"nextID":"00000002","PremiseStartPos":[181],"prevID":"00000000","Premise":["This is the official trial of 16kadams. 4 rounds Debate resolution will simply be \"Trial of 16kadams\" Charges by the prosectution will be presented in the first round, I will quickly make a summary of the charges, then the defense is going to accept this debate. Full evidence begins in the next round. Guilt or innocence will be determined by the voters of DDO and not by any special jury Innomen will determine the process of sentencing if 16kadams is found guilty of any charges Voting period will last 1 week Summary - there is evidence that 1kadams used his grandfathers account (angelo) to vote on his own debates and we know this becuase angelo's account was closed and reopened at least once just to vote on 16kadams debates - 16kadams has convinced many friends and family members to join DDO just to debate them in order to boost his own numbers. Hes used his grandfather, little sister, and at least two friends - the IP address of 16kadams at one point was the same as Angelo which implies that he has logged on under angelo and misused that account - there are cases where he was thought to be behind other accounts such as chainmachine, accounts which lose multiple debates to 16k and have horrific debating styles against him, but against other opponants those same accounts argue with the same style 16k uses - It was believed that he was using proxies to change his IP address to avoid charges of multi accounting but in light of new evidence it shows that his IP address changes all the time and that he actually has access to instructions on how to change your IP address (see above) - Lastly there is the issue of poor voting where 16kadams was accused of voting improperly or even votebombing debates almost always in favor of the conservative side.... This round is for acceptance only; defense may bring in an abstract of their case. Good luck :-)"],"PremiseEndPos":[2052],"ArgumentID":"00000001","Conclusion":"The 16kadams Trial","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":111,"ConclusionEndPos":129,"nextID":"00000003","PremiseStartPos":[2067],"prevID":"00000001","Premise":["We accept your opening stance. Note that the prosecution team has worked together for this opening argument. OPENING ARGUMENTS 1) On the charge that 16k used his grandfather's DDO account (Angelo) to vote on his own debates and vote in his favor. That conflicts with Rule G in the Terms of Service which states that \"Users will not impersonate any person or entity, including without limitation Debate.org officials, staff, and/or Members.\"Âï¿½ 2) On the charge that 16k convinced friends and family members to join DDO just to debate them, This conflicts with Rule R which states \"Users will not use the Service in any way that violates the terms of this Agreement, or that aids, encourages, or purports to authorize anyone else to violate the terms of this Agreement.\"Âï¿½ Since 16k is using people close to him to have them establish accounts on DDO, that allows him the potential to exploit or impersonate those accounts. Forcing people to get accounts that he could potentially impersonate or exploit conflicts with Rule G which violates the TOS, meaning that forcing people in his family to get into DDO aids in 16k exploiting those accounts and violate the TOS, which goes against Rule R. 3) On the charge that the IP address of 16k was the same as Angelo, this implies that he has logged on under Angelo and misused that account, which conflicts with Rule G 4) On the charge of multiaccounting, this again conflicts with Rule G. 5) On the charge of exploiting his ever changing IP address and having instructions for changing his IP address, that could be exploited to allow him to impersonate other members, which conflicts with Rule G 6) The final charge of poor voting where 16k was accused of voting improperly on debates almost always in favor of the conservative side.... The second clause of Rule T states that all members must agree to \"No personal attacks against other members or a member's opinions.\" Votebombing a debate in favor of the conservative side of any issue is a personal attack on the debater representing the liberal side of the issue. Since 16kadams is corrupting the voting process in favor of his own opinions rather than the quality of the arguments in the debate, this violates Rule T. Charge 1) Angelo engaged in 16kadams in 3 debates and lost each one. Whats more concerning is the fact that Angelo voted in favor of 16kadams 11 out of 11 times. Here are all several debates that Angelo voted on for 16K at the time angelo's vote gave 16k the lead no effect on the outcome href=\" target=\"blank\"> 7 POINT VOTE BOMB WHICH GAVE 16K THE WIN Of the debates that Angelo voted on, 2 directly resulted in 16k winning and a third resulted in tying one. Several others resulted in lead changes in favor of 16k This suspicious voting behavior was recognized by the others and soon after, Angelo had terminated his account. 1 week later an IP check was run by Innomen which revealed that 16k and Angelo had the same IP address. This means that Angelo was using the same IP address as 16k when his account closed, suggesting that the account was under the influence of 16k. Charge 2) 16k stated numerous times that DJmooshy was not a multiaccount but a friend of his whose account was unjustly closed. 16k also admitted to making his little sister get a DDO account to debate her \"alex1018\". Other known friends of 16k include his grandfather and \"elephaunt\"who 16k knows in real life friends get DDO accounts leaves them more vulnerable for 16k to use them himself for his own gain, which violates Rule G and Rule R Charge 3) Proof for Charge 3 comes from the fact that 16k and Angelo's IP address were the same about 2 weeks ago, a full week after Angelo had left, suggesting that 16k manipulated Angelo's account before it closed after it was revealed that he voted in favor of 16k 11 times. Charge 4) Evidence here revolves around the account chainmachine, a recent member who in his first few days on the site debated 16k 3 times, lost horrifically in all 3, but in other debates uses a debating style identical to that of 16k. This is the argument style of chainmachine against 16k is the argument style of chainmachine against anybody else. is also suspected of being a multi account of 16kadams because of its original similarity to Angelo's early account, Angelo: Socialist, Profile pic was of a Chinese Flag even though he is not Asian, supports Obama Chainmachine: Communist, Profile Pic is of a Communist Russia Flag, also supports Obama. More evidence about chainmachine being a possible multiaccount of 16k came in the forums. Chainmachine, who had no forum posts before, happened to go to the forums, happened to find the forum implicating 16k, and posted this \"No I am not 16kadams. I admit he is a superior debater than me, also debate.org has little to no people who share my far left opinions. Also if you notice all my arguments with 16kadams are issues that are very one sided voting wise because of the political views of the majority of the users. I don't know about these other accounts but I think 16kadams is perfectly valid and is just a human debater like the rest of us.\" parts in bold show superficial dialogue spoken by chainmachine ,but the underlined part shows knowledge of DDO that no 4 day old account could have known. This suggests that chainmachine could be a multi account of someone else who has a deep knowledge of DDO, but it leans towards 16kadams since chainmachine just happened to go to the exact forum MINUTES AFTER HIS NAME WAS MENTIONED to defend 16k. Charge 5) 16kadams prior to the trial sent this link to imabench, is the PM he one of the prosecutors. All of that shows how 16k could be using a variety of tools to manipulate his ever changing IP address to use other accounts on DDO. In the second picture near the top, there is actually a tab that if you click it allows one to VIEW INSTRUCTIONS FOR HOW TO CHANGE ONES IP ADDRESS.. The last piece of evidence was another IP check that revealed that 16k's alternate IP address was a number that traces to Pennsylvania. Normally if one were simply getting a new IP address every time they logged on, that IP address would still be concentrated to near where 16k was living. However this alternative IP address suggests that 16k is using proxies since Dynamic IP Addresses DO NOT JUMP ACROSS STATE LINES like 16k's does. The final charge of votebombing debates would chew up what few characters I have left, If possible I will post some of those votebombed debates in later rounds. The evidence is very clear taht 16kadams is guilty. Unto the defense."],"PremiseEndPos":[8647],"ArgumentID":"00000002","Conclusion":"The 16kadams Trial","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":111,"ConclusionEndPos":129,"nextID":"00000004","PremiseStartPos":[8662],"prevID":"00000002","Premise":["Microsuck forfeited this round. Con Unfortunately, given Pro’s forfeit there is little left for the defense to do in this round. Thus far, we have outlined our own case and responded to all of the charges. Pro has spectacularly failed to fulfil his initially high burden of proof or even mount a credible case for the prosecution, let alone engage with the defense’s explanation of the charges brought against the defendant. As of now, and with only 1 round to go, Pro has an almost insurmountable task to achieve the level of certainty demanded to win a conviction. He still has to make a credible case, as well as engage with the rebuttal to the charges given in round 2. All of this, as well as the necessary preconditions which the defense set out in R1, which would be needed for a successful prosecution of the defendant, makes his task almost impossible. In short, unless Pro’s final round is astoundingly good, he can’t even hope to win the debate. If he falls short of this very high standard, a vote for Con is simply the only justifiable decision from the jury. While it is undoubtedly less than ideal that Pro conceeded a round, especially in a debate of this nature, where Pro has the burden of proof, it is simply a position we are left in because of Pro's failure to post in time. As such, we the defense also ask that conduct points be considered accordingly, especially given the increasing sense of frivolousness and carelessness with which this trial has been carried out from Pro. With that, we hand it back to Pro in anticipation for the final round."],"PremiseEndPos":[10234],"ArgumentID":"00000003","Conclusion":"The 16kadams Trial","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":111,"ConclusionEndPos":129,"nextID":"00000005","PremiseStartPos":[10249],"prevID":"00000003","Premise":["I apologize for missing the round. I pray that you all will forgive me and the jury looks at the evidence and not the forfeit. -->Case<-- A1: Multi-accounting charge 16kadams has confirmed that his grandfather has used a computer in 16k's house to access DDO whilst on one his frequent house visits. ... Against this point, discuss the timeline. He logged on a week after 16k's grandfather left the state and had the same IP at that point. The prosecution also makes an unwarranted assertion: \"...an IP check was run by Innomen which revealed that 16k and Angelo had the same IP address. This means that Angelo was using the same IP address as 16k when his account closed\" This is a non-sequitor. It does not follow that because Innomen's check found they had the same ip at one point, that they had the same IP when it was closed. Therefore his conclusion that it must be under the influence of 16K is unwarranted. Turn this, because this this means that the last time Angelo's account was used, a full week after Angelo moved to Texas from 16kadams' home in New Mexico, Angelo and 16kadams had the same IP address. This means that 16kadams was in possession of Angelo's account because logically, Angelo could not have used a device that was located in another state. Whilst it would be entirely possible for 16k to abuse his grandfather's account, the only evidence to suggest that he has is Angelo's voting record. ... Here in the esteemed DDO courts we most certainly do not recognize the sins of the grandfather as sins of the son. This is a strawman. The argument is that Angelo's behavior is consistent with that of a multi account, and not that 16k should be punished for his Grandfather's behavior. 11/11 votes were for 16 k, including a vote for him a full week after he had previously deactivated his account and moved to Texas. In fact, he only activated his account to vote on 16k's debate. This charge fails to illustrate where the TOS has been broken....The only thing that could be established is a potential opportunity (not even a proven one) The assertion: \"...Firstly, the claim that 16K forced friends to make accounts is unproven. Secondly, it would not break TOS clause G (and subsequently R) as it would not be an act of impersonation. \"the claim . . . is unproven\" 16kadams actually admits that he forced a friend, djmooshy, who did not want to debate him, to sign up and initiate a troll debate with him. All evidence suggesting that the user known as Chaimachine is a multi-account of 16kadams is completely insubstantial... 1. His first forum post is a defense of 16k, and he never posts any other time after that. That definitely indicates that he is a multiaccount. Who logs in to a forum that he has never seen and just defends a random stranger against whom he debated online? The thread was not even about 16k. Further more as 16kadams has a dynamic IP, an IP address changes every time the User Logs on. [ ] Therefore one can assume the dynamic IP explains the supposed IP changes. He dropped the analysis about how the IP address changes across state lines. Evidence for the charges When Angelo's account closed, he had the same IP address as 16k when the account closed. If 16k was exploiing Angelo's account and 16k decided to kill it from his computer, that would leave Angelo with the same IP address as 16k. Now the only way that 16k would be innocent of misrepresenting Angelo's account is if Angelo suddenly decided to visit his grandson in another state and kill his account for no reason 5 days after the DDO community noticed his voting behavior. The odds of that are small to begin with but when you take into account similar gramatical errors that 16k and Angelo made in their time on DDO despite having the age difference of about 50 years, along with the very stereotypically liberal account he had (socialist with a flag of soviet china as his profile picture who supported obama), the fact that Angelo gave no reason why he was closing his account just 5 days after the DDO community began to realize Angelo's voting pattern in favor of 16k, and the numerous past accusations of 16k multiaccounting, all this circumstancial evidence points towards the conclusion that 16k could have manipulated Angelo's account. The charge of 16k using his family and friends to get DDO violates the TOS since 16k has admitted to forcing these people to get DDO accounts to debate them. However the TOS comes into play when these accounts are left open to misrepresentation by 16k since the TOS forbids aiding in anything that could break the TOS. Making his family members and friends get DDO accounts makes it possible that 16k could later gain access to these accounts and misuse them for his own gain. 16k is aiding himself in breaking the TOS by making those close to him get DDO accounts which are more likely to be exploited by him. This may sound absurd but considering that 16k has already admitted to harassing his own sister to get on DDO to debate her, the numerous personal friends he has in real life being on DDO, and the evidence of misusing his grandfatehrs account, then this charge is very valid. The chainmachine accusation is being used because not because he has the same average intelligence as 16kadams, its because - In 4 days Chainmachine had 3 completed, yes completed, debates with 16k and he had lost all of them - Chainmachine had a remarkably similar and stereotypically leftist profile that conservatives would have of liberals (a communist with a communist Russia flag as a profile pic who supports Obama), much like Angelo's early account - Chainmachine who originally had a dreadful debating style while debating 16k now has the exact same debating style as 16k when debating others. - The deep knowledge that chainmachine already has about the people on DDO that no 4 day old account could ever have known about - The fact that barely 3 hours after 16k was suspected of being chainmachine, chainmachine, who had never had a forum post ever before, just happened to go onto the forums, just happened to find the one about 16k and Angelo (chainmachine was not in the title of that thread) and gave a defense on behalf of 16k that contains lingo that is only learned on DDO after one spends a long time on the site (not 4 days), that contans language showing a deep knowledge of DDO no 4 day account would no of, and contains language that sounds completely fake and almost not human. - The fact that chainmachine offered to put himself on trial on the thread discussing why 16kadams deactivated his account hours after all the new eveidence suggesting he was multiaccounting surfaced. Ip address is a big argument because 16k does have a dynamic IP address, but the IP address changes only between other local ISP's (internet service providers). What implies proxy use in this case though is that IP checks by innomen revealed that 16k's ip address jumps between state lines between New Mexico and Pennsylvania, something that can only be explained by the use of proxies. Dynamic IP address can be exploited to switch between other local IP addresses within a certain area without the use of proxies. This means that by exploiting his constantly changing local IP address, 16k could multiaccount through other accounts that are located close to him geographically. Perhaps the greatest evidence of 16k is the votebombed debates that 16k has participated in, almost all of which are simply against the liberal side / in favor of the conservative side, or just against liberal accounts on DDO Thank you."],"PremiseEndPos":[17821],"ArgumentID":"00000004","Conclusion":"The 16kadams Trial","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":111,"ConclusionEndPos":129,"nextID":"00000006","PremiseStartPos":[17836],"prevID":"00000004","Premise":["Accused - 16kadams Defence team - Thaddeus, Unitedandy and 16kadams = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = Introduction As Pro indicates, the resolution of the debate is to ascertain whether 16kadams should be charged in relation to accusations by Pro. We, as the defence, will show that these charges have no basis. In the first round, we will attempt merely to clarify some important issues, and will respond to any and all charges in R2, as and when Pro identifies and provides evidence to affirm the resolution. Before we can do anything, however, we must first determine “guilt”. What is guilt? In order for an activity to be deemed worthy of punishment, there are 2 minimal conditions that it must have: 1. It must first break a DDO rule. Any charge Pro presents must correspond to a violation of the DDO Terms of Use ( For each charge, Pro must clearly identify which rule is being broken. Any action which does not break a DDO rule specifically should be considered irrelevant to the debate. While there are undoubtedly practices which may improve the site if enacted, Pro must argue that the defendant has broken EXISTING rules. And 2. Any successful charge will have to be proven beyond reasonable doubt. This means that the evidence will eliminate all plausible explanations other than guilt. Both of these conditions must be met for each and every charge that Pro wishes to bring against the defendant. This illuminates a very important point in the debate - where the burden of proof lies. As the prosecution, Pro will have to shoulder the burden demanded. Anything other than a clearly identified and fully established case of rule-breaking demands a vote for Con. This is because of the presumption of innocence. Presumption of innocence “The burden of proof is thus on the prosecution, which has to collect and present enough compelling evidence to convince the trier of fact, … that the accused is guilty beyond a reasonable doubt. If reasonable doubt remains, the accused is to be acquitted.” (1) Obviously, the dangers of punishing an innocent member of DDO community could be catastrophic for debates on the site. Debates depend on voting. In order to guard against deterring voting behaviour, it is essential that we treat prospective members as innocent until proven guilty. This demands that unless and until Pro provides a plethora of corroborating evidence relating to a specific charge, we should regard the case as unproven and vote Con. Conclusion This trial solely regards the guilt or innocence of 16kadams. Whether one approves of his actions or not is irrelevant. Only by finding him guilty, in accordance with the criteria set out above can a vote for Pro be justified. We now pass the debate over to Pro to present the charges. Sources (1)"],"PremiseEndPos":[20677],"ArgumentID":"00000005","Conclusion":"The 16kadams Trial","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":111,"ConclusionEndPos":129,"nextID":"00000007","PremiseStartPos":[20692],"prevID":"00000005","Premise":["Introduction Thank you prosecution. I would like to draw the readers attention to the poor conduct that the prosecution has shown in their case. They have presented as many charges as possible, many being duplicates, and some are not even charges, but rather haphazard presentation of evidence. This technique is often described as \"shotgun argumentation\", where one makes as many arguments as possible, regardless of validity, in the attempt to hinder the defenses ability to respond fully to each charge. I do not believe this was purposeful. Hopefully this will not be an issue in future rounds. It would also be beneficial for all involved if a more measured approach to this trial was taken. It is more than evident from the emotive way the prosecution is presenting their case (use of caps and language), that they are too emotionally involved. The defense would remind them that their duty is to present their case fairly and nothing more and their personal feelings towards any users involved should be ignored. The structure that shall be used in the defense is to look at each charge in turn with direct reference to the part of the TOS it is in violation of. I shall then proceed to formalize the charges into groups which shall make it easier for the readers and debaters to understand. Charges Charge 1 Charge of Impersonation of 16k's grandfather (TOS G) Charge 2 Charge of aiding or encouraging friends to commit acts of impersonation and consequently break the TOS. Also a charge of possesing multiple accounts. Henceforth known as 2a and 2b. (TOS R, consequently in violation of TOS G. Additional charge of TOS A) It is worth noting that charge 2a and 2b are contradictory. It is very unlikely that he both encouraged his friends to break the TOS and also created and possesses the very same accounts. Charge 3 At one point the user known as 16kadams had the same IP address as the user known as \"Angelo\" This is quite obviously not a charge, and rather a piece of evidence. Therefore charge 3 must be dropped on the grounds that it is not a charge. Charge 4 Possesion of mutliple accounts (TOS A) Charge 5 Exploitation of changing IP address. (TOS G) This charge can be dropped on the grounds that it too is not a charge, but rather an accusation of a means of performing an already stated violation. Charge 6 Making personal attacks against other members via votebombing (TOS T) It seems rather evident that charges be considated into; Charge A: TOS violations with relation to the user known as Angelo A1: Multi-accounting charge (TOS A) or A2: Using Angelo's account illigitemately (TOS G) Charge B: TOS violations with relation to the users know as DJmooshy,alex1018, Chainmachine and Elephaunt B1: Encouraging users to break the TOS (TOS R and TOS G) or B2: Multi-accounting charge (TOS A) Charge C: TOS violations with regard to the user known as 16kadams voting record (TOS T) Charge C is dropped instantaneously by the prosecution, rendering it meaningless at this point. A1: Multi-accounting charge 16kadams has confirmed that his grandfather has used a computer in 16k's house to access DDO whilst on one his frequent house visits. Due to the circumstantial nature of the evidence presented by the prosecution (it is far from conclusive and leaves a great amount of doubt) there is insufficient evidence to prove this charge. The prosecution also makes an unwarranted assertion: \"...an IP check was run by Innomen which revealed that 16k and Angelo had the same IP address. This means that Angelo was using the same IP address as 16k when his account closed\" This is a non-sequitor. It does not follow that because Innomen's check found they had the same ip at one point, that they had the same IP when it was closed. Therefore his conclusion that it must be under the influence of 16K is unwarranted. A2: Whilst it would be entirely possible for 16k to abuse his grandfather's account, the only evidence to suggest that he has is Angelo's voting record. This is completely inconclusive. While it is obviously a less than stellar voting record, there is no reason to believe that this is Angelo's misdeeds rather than 16K's. Here in the esteemed DDO courts we most certainly do not recognize the sins of the grandfather as sins of the son. B1: This charge fails to illustrate where the TOS has been broken. It is not substantiating what part of the TOS 16K is encouraging them to break. Furthermore, even if the prosecution had detailed what part of the TOS they had supposedly been encouraged to break this charge is impossible to prove. The only thing that could be established is a potential opportunity (not even a proven one) The assertion: \"Making friends get DDO accounts leaves them more vulnerable for 16k to use them himself for his own gain, which violates Rule G and Rule R\" is completely unsubstantiated and false. Firstly, the claim that 16K forced friends to make accounts is unproven. Secondly, it would not break TOS clause G (and subsequently R) as it would not be an act of impersonation. [ ] B2: All evidence suggesting that the user known as Chaimachine is a multi-account of 16kadams is completely insubstantial. Many users of about average intelligence have very similar writing styles. 16K is no exception. The post on the forums written by Chainmachine would indicate that he knows 16K, however, it is not proof by any stretch of the imagination, by itself that Chainmachine is a multi-account. Alpha: Dynamic IP The picture sent by 16k was merely sent to demonstrate that he was not using proxies, an allegation made by the prosecution prior to the trial. The bizarre thing is that the prosecution now seem to be implying that because he has a dynamic IP he must have been abusing it. This is nonsensical. Every assertion in the last few paragraphs is totally unsupported and pure speculation. Without evidence, they can not be considered charges. In fact, even a confession of using proxies would not constitute a charge as it is not against the terms of service. [ ] Whether the website gives advice regarding how to change one's IP is immaterial. Further more as 16kadams has a dynamic IP, an IP address changes every time the User Logs on. [ ] Therefore one can assume the dynamic IP explains the supposed IP changes. So far the prosecution has not been able to provide any evidence substantial enough to reasonably or conclusively prove that 16kadams has broken any of the terms of service. There is substantial doubt proving 16kadams not guilty and therefore the prosecution does not fulfill the burden of proof. [ ] Therefore one should vote for the defenses side."],"PremiseEndPos":[27318],"ArgumentID":"00000006","Conclusion":"The 16kadams Trial","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":111,"ConclusionEndPos":129,"nextID":"00000008","PremiseStartPos":[27333],"prevID":"00000006","Premise":["Unfortunately, given Pro’s forfeit there is little left for the defense to do in this round. Thus far, we have outlined our own case and responded to all of the charges. Pro has spectacularly failed to fulfil his initially high burden of proof or even mount a credible case for the prosecution, let alone engage with the defense’s explanation of the charges brought against the defendant. As of now, and with only 1 round to go, Pro has an almost insurmountable task to achieve the level of certainty demanded to win a conviction. He still has to make a credible case, as well as engage with the rebuttal to the charges given in round 2. All of this, as well as the necessary preconditions which the defense set out in R1, which would be needed for a successful prosecution of the defendant, makes his task almost impossible. In short, unless Pro’s final round is astoundingly good, he can’t even hope to win the debate. If he falls short of this very high standard, a vote for Con is simply the only justifiable decision from the jury. While it is undoubtedly less than ideal that Pro conceeded a round, especially in a debate of this nature, where Pro has the burden of proof, it is simply a position we are left in because of Pro's failure to post in time. As such, we the defense also ask that conduct points be considered accordingly, especially given the increasing sense of frivolousness and carelessness with which this trial has been carried out from Pro. With that, we hand it back to Pro in anticipation for the final round."],"PremiseEndPos":[28869],"ArgumentID":"00000007","Conclusion":"The 16kadams Trial","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":111,"ConclusionEndPos":129,"nextID":"00000000","PremiseStartPos":[28884],"prevID":"00000007","Premise":["Introduction Thank you for responding. It is worth noting that the prosecution choose to ignore the layout proposed in the second round, again opting for a more haphazard method of presenting the charges. They also provide no sources for any of the evidence claims they make, where in many cases, they would be vital to proving the charges. This alone makes the prosecutions case insufficient. I shall proceed to defend 16K from each charge in turn. A1 & A2 This charge has been treated by the prosecution as an \"or\" proposition; that either 16k created the user known as Angelo's account or gained access to his grandfather's account and impersonated him. Hence, the defence shall respond to the charges collectively accordingly. The prosecution first requests that we discuss the timeline. I would be very amenable to this suggestion, but unfortunately no cohesive version of the timeline is presented or sourced. The prosecution claims that they knew the whereabouts of 16K's grandfather at given times. Without evidence this claim is far too incredible to entertain. IPs At this point it may be worth clarifying some information about IPs which the prosecution seems to be confused about. The US has approximately 20 geographically assigned IPs as of 2006. Here is a simple model of IPv4 mapping; Though these IPs are assigned geographically they are not assigned via state lines. It is also completely possible to have an IP address which is not geographically determined. For example; IPs beginning in 166 (subnets), the supposed alternate IP address Angelo was found to have. This IP allocation has no bearing on geographical location and people with this IP subnet can be found from the US to Japan. Behaviour The prosecution also claim the voting misconduct of Angelo's is indictative of a multi-account. However, such behaviour, especially once familial relationships are noted, could equally be attributed to an over-enthuseastic grandfather who is blind to his grandson's faults. If no further evidence is presented on the matter, his behaviour can only be deemed as inconclusive evidence. Behaviour The prosecutions case here is completely speculative, unsourced and some of the details false. Angelo never had a \"soviet china\" flag. The prosecution even admit that all the evidence is circumstancial. The voting behaviour can easily be explained by the familial ties, and age is no indicator of ones adherence to grammar and spelling. B1 Djmushy The only argument that prosecution makes here is the unsourced claim that 16K admits to \"forcing\" his friend to join and debate him. Presumably the prosecution is only accidently making the claim that a 15 year old child employed physical force or blackmail on one of his friends to make him open an account and debate him (badgering a reluctant friend is not \"force\"). Even if the prosecution were able to source this claim, the defence would remind them that this is not against the terms of service, but a personal issue. Should it be done to a certain volume; that could be considered spam - but a single debate, no matter how \"trolly\" is legitimate provided two different parties are engaging in the debate. To claim that purely having friends and family who own DDO accounts is a violation of the TOS is an absurdity. Whilst it is entirely possible that 16K may have gained access to these accounts, purely having the possible potential does not constitute a violation of the TOS. However, the defence would like to offer the following life advice to the defendant; that harrassing one's friends to debate is not a very good way to keep friends. B2 Chainmachine Behaviour I would remind the readers that all the behavoural observations are again unsourced. 1. Debates with 16K The defence was not aware that to debate someone else, one had to own their account. Whilst it is mildly uncommon to debate someone several times in a row, there are many obvious explanations. One, for example, could be that, being new to site, he chose to debate someone he had found an ideological nemesis in. Having debated him before, and not feeling quite comfortable debating others yet, he chose to debate him a few more times before looking for others to debate. 2. Poor debating style The prosecution claims that chainmachine's style was initially poor and developed into a style similar to 16K's. The prosecution fails to give examples of such similarities. A brief investigation by the defence found no such examples. Furthermore, would it be unreasonable to emulate a debator that you believed to be superior? No matter how misplaced this belief may be, it does seem that chainmachine has some sort of respect for 16K. We should not be so judgemental that we declare everyone who respects someone who is generally looked down upon to be a multi-account. 3. Knowledge of people on DDO Again this is unsourced and no examples are given. However, the defence will make the observation that many people lurk around DDO before making an account for a varying period of time. This could easily explain such matters. 4. Suspicious post An alternative explanation is that, as previousl stated, the user known as chainmachine has some respect for 16k and decided to read a thread with his name in the title. From his debates it is clear he is not the sharpest tool in the shed, and wrote a bizzarre defence. We do not know how long chainmachine was lurking for before making an account, so the any accusation of knowing things he ought not to know holds no water. Whether or not he sounded human has absolutely no relevence to whether the account is a multi-account of 16K's or not. 5. Offering to be put on trial This is an odd accusation. He has become aware that he was accused of being a multi-account and he offers himself to be put on trial. How does this provide further evidence he is a multiaccount? 6. Having a communist flag is actually rather common in members who are communists. It doesn't just suggest a stereotypical view of communists. Counter points - If chainmachine is a multiaccount, an inordinate amount of effort has gone into it. Several debates with a variety of users, some of significant length ,public discussions with other users and bothering to change his profile picture several times. It is far more reasonable to believe he is a none too bright misguided individual than part of a insidious plot by 16k. Auxillary charges IP I would remind the prosecution that the use of proxies is not against the terms of service, and the information provided about proxies above. Votebombs For the supposed greatest piece of evidence, remarkably little is provided. With so little analysis or evidence, we can only consider this charge dropped. In addition votebombing is not against the terms of service. Conclusion Again the prosecution completely fail to demonstrate any of the charges made against the defendant with any conclusivity. They fail to provide sources for accusations made, wildly speculate off circumstancial evidence, and even attempt to prosecute 16Kadams for infractions which even they do not think he has commited yet, but believe he has the possibility of committing. There is no option but to acquit 16kadams of all charges."],"PremiseEndPos":[36100],"ArgumentID":"00000008","Conclusion":"The 16kadams Trial","PremiseStance":["Con"]}}]}