{"MetaData":{"Context":"URL: http://www.debate.org/debates/Joke-battle/2/\nCrawl date: 2016/09/29 04:15:48\nDebate Issue: Joke battle | Debate.org\nNumber of arguments: 10\n\n\nEvidence Pro: First round is acceptance, The rules are, 1 joke per round, you can choose anything that is comical in any way shape or form. Either by text, video, or audio, or anything else including photos or whatever. Votes are to be given to the funniest contender, and not to friends solely because they are friends. Votes must be awarded on merit. Good luck and let the jokes begin.\n\nEvidence Pro: .\n\nEvidence Pro: Well played to my opponent.\n\nEvidence Pro: Thanks Trinitrotoluene\n\nEvidence Pro: My wife and I were happy for twenty years...then we met.\n\nEvidence Con: I accept. You may present your first joke!\n\nEvidence Con: \n\nEvidence Con: Well done.\n\nEvidence Con: All the passengers are seated on a plane out on the tarmac and the flight attendant announces, \"We're just waiting for the pilots.\" The passengers look out the window and see two men dressed as pilots walking towards the plane. Both men are using guide dogs and appear to be blind. There are murmurs among the passengers, and some believe it is a joke. The men board the plane and go into the cockpit. More concerned murmurs and uneasy chuckles from the passengers. The plane taxis normally to the runway and begins its takeoff. As passengers look out the window they realize they are nearing the end of the runway. The entire passenger cabin begins screaming but the plane lifts off just before the end of the runway. The passengers calm down and chuckle to themselves. In the cockpit, the pilot turns to his copilot and says, \"You know, one day those people are gonna scream too late and we're all going to die!\n\nEvidence Con: What did the leper say to the prostitute? . . . Keep the tip.\n","DiscussionID":"00000030","Title":"Joke battle","CrawlDate":"2016/09/29 04:15:48","URL":"http://www.debate.org/debates/Joke-battle/2/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000002","PremiseStartPos":[160],"prevID":"00000000","Premise":["First round is acceptance, The rules are, 1 joke per round, you can choose anything that is comical in any way shape or form. Either by text, video, or audio, or anything else including photos or whatever. Votes are to be given to the funniest contender, and not to friends solely because they are friends. Votes must be awarded on merit. Good luck and let the jokes begin."],"PremiseEndPos":[534],"ArgumentID":"00000001","Conclusion":"Joke battle","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000003","PremiseStartPos":[549],"prevID":"00000001","Premise":["."],"PremiseEndPos":[551],"ArgumentID":"00000002","Conclusion":"Joke battle","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000004","PremiseStartPos":[566],"prevID":"00000002","Premise":["Well played to my opponent."],"PremiseEndPos":[594],"ArgumentID":"00000003","Conclusion":"Joke battle","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000005","PremiseStartPos":[609],"prevID":"00000003","Premise":["Thanks Trinitrotoluene"],"PremiseEndPos":[632],"ArgumentID":"00000004","Conclusion":"Joke battle","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000006","PremiseStartPos":[647],"prevID":"00000004","Premise":["My wife and I were happy for twenty years...then we met."],"PremiseEndPos":[704],"ArgumentID":"00000005","Conclusion":"Joke battle","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000007","PremiseStartPos":[719],"prevID":"00000005","Premise":["I accept. You may present your first joke!"],"PremiseEndPos":[762],"ArgumentID":"00000006","Conclusion":"Joke battle","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000008","PremiseStartPos":[793],"prevID":"00000006","Premise":["Well done."],"PremiseEndPos":[804],"ArgumentID":"00000007","Conclusion":"Joke battle","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000009","PremiseStartPos":[819],"prevID":"00000007","Premise":["All the passengers are seated on a plane out on the tarmac and the flight attendant announces, \"We're just waiting for the pilots.\" The passengers look out the window and see two men dressed as pilots walking towards the plane. Both men are using guide dogs and appear to be blind. There are murmurs among the passengers, and some believe it is a joke. The men board the plane and go into the cockpit. More concerned murmurs and uneasy chuckles from the passengers. The plane taxis normally to the runway and begins its takeoff. As passengers look out the window they realize they are nearing the end of the runway. The entire passenger cabin begins screaming but the plane lifts off just before the end of the runway. The passengers calm down and chuckle to themselves. In the cockpit, the pilot turns to his copilot and says, \"You know, one day those people are gonna scream too late and we're all going to die!"],"PremiseEndPos":[1733],"ArgumentID":"00000008","Conclusion":"Joke battle","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":96,"ConclusionEndPos":107,"nextID":"00000000","PremiseStartPos":[1748],"prevID":"00000008","Premise":["What did the leper say to the prostitute? . . . Keep the tip."],"PremiseEndPos":[1810],"ArgumentID":"00000009","Conclusion":"Joke battle","PremiseStance":["Con"]}}]}