{"MetaData":{"Context":"URL: http://www.debate.org/debates/Genetic-Testing-use-by-medical-insurance/1/\nCrawl date: 2016/09/29 07:27:37\nDebate Topic: Genetic Testing (use by medical insurance) | Debate.org\nNumber of arguments: 7\n\n\nEvidence Pro: What is genetic testing? Genetic testing is the testing of DNA for chromosomal, gene, or protein changes. Genetic testing is good for identifying diseases that you are born with. According to genetic testing can \"confirm or rule out a suspected genetic condition or help determine a person\"s chance of developing or passing on a genetic disorder.\" Based off the information given at www.genome.gov/19516567 genetic testing shows if someone is a carrier for a disease, which in turn can give insight on how much of a chance a child has of receiving the genetic disorder. The site also provided information on Prenatal and newborn screenings saying that they can be done to show if a child has a genetic disease. This makes it easier for the parents to know what is wrong and how to handle the disease. This makes everyday living with the disorder easier and more efficient. Genetic testing therefore should be allowed because of how it helps with identifying diseases.\n\nEvidence Pro: Even though most ethnic groups/ religions view genetic testing as wrongful or unnecessary, it does not go against the laws of nature and people do have the freedom of speech and religion. It could be possible that their religion doesn't view it as wrong or unneeded. For genetic testing there is multiple physiological aspects/views that are being dealt with. For instance according to www.cancer.gov/cancertopics/understandingcancer/genetesting/page29 there is less stress after the testing is done. Knowing gives a feeling or relief. Other benefits of genetic testing are as follows: fewer checkups, informed decisions, and intervention. One question commonly asked about Genetic testing is \"Does genetic testing go against the laws of nature?\" Technically genetic testing does not go against nature because one main law of nature is that it is survival of the fittest, and by doing genetic testing humans are just adapting and changing. Society can greatly benefit from doing genetic testing.\n\nEvidence Pro: Even though you don't receive an exact diagnoses sometimes as of now, there is still the fact of know what you might have. And with further research scientists could possibly get an exact result every time, its just a matter of cooperation and time. Your previous, \"Genetic testing only identify the chances or probabilities.\" is false because genetic testing gives information on if a person has a genetic disease, if they can pass it on, and the chances of passing it on to their child. Another reason why genetic testing should be considered good is that it helps in other aspects of medicine as well. For example, according to genetic testing can help find out how our bodies will react to certain drugs. This can help doctors give exact dosages and the right type of medicine to people. Genetic testing could also prove to help find cures in the near future. This could cure cancer and its death toll on the world's population annually. With further research, genetic testing could become very valuable to surviving.\n\nEvidence Pro: Most people wont even abort babies because it is another risky topic to go with, and because of most people's religions they wont do it anyway. There may be few but it wouldn't really bring question to genetic testing because no one really question the reasoning behind an abortion. Most people just plain don't like it. In the future genetic testing will be needed and that's inevitable to deny. With further research the cure for cancer and other diseases can be found. Less death will occur but bring down food supplies greatly. A process for longer life could also be found out from genetic testing. Even gene mutations for different aspects of the body could give light to positive gene mutations like a smart gene or a gene that controls how athletic someone will be. I mean what if you could get these done? You would most likely get it if you had the money for it.\n\nEvidence Con: Although genetic testing is a beneficial factor to help patients identify a genetic disorder, is it really the right thing to do? Genetic screenings/testing are going against the work f nature. Many religions and ethnic groups believe that doing genetic testing are to be immortal because they are interfering wit the work of nature. It is going against the work of god. Others have a fear that genetic testing will change the way humans reproduce. According to www.noso.edu, people fear that instead of natural reproduction, people will use fetus and embryo genetic screenings to select better for their child. Although genetic testing can be very beneficial, most people do not use it for the good.\n\nEvidence Con: You had mentioned that after genetic testing is done the patient is less stressed and has a feeling of relief. However, genetic testing does not relief that stress. Patients are going in to get a genetic test to see what is going on with their genes, however genetic testing aren't 100 percent certain. Genetic testing do not rule out every possibility of developing a disease. According to cancer.org, some test may be read wrong. Every lab has a different way of testing for a genetic disorder. Sometimes, getting a test wont even help a person out, the results will probably not show up. Genetic testing only identify the chances or probabilities. If a person reads positive, that doesn't neccessarily mean they are not getting that disorder. Yes, there are therapies to help a person calm their nerves, but genetic testing aren't going to statisfy them.\n\nEvidence Con: In a previous argument, you had mentioned that there are screenings for parents to see their unborn child and determine if they have a genetic disease or not. No is that a good thing or bad thing. Well, according to www.noso.edu, this is a problem. Yes, genetic testing for your unborn child can be a good thing, but some parents will rather abort their child if it ends up with a genetic disorder. The abortion rates will become bigger issue and people will start to question, should genetic testing be allowed for parents to run on their unborn children. Another issue this website had talked about was the discrimination of people with a genetic disorder. \"insurance companies and employers would like to be able to determine insurance rates and employment statuses based on the genetic composition of people.\" If a person has a high risk factor of certain disease, they may be prevented from obtaining insurance. Which leads into the next topic, who should pay for a genetic testing?\n","DiscussionID":"00000039","Title":"Genetic Testing (use by medical insurance)","CrawlDate":"2016/09/29 07:27:37","URL":"http://www.debate.org/debates/Genetic-Testing-use-by-medical-insurance/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":167,"nextID":"00000002","PremiseStartPos":[219],"prevID":"00000000","Premise":["What is genetic testing? Genetic testing is the testing of DNA for chromosomal, gene, or protein changes. Genetic testing is good for identifying diseases that you are born with. According to genetic testing can \"confirm or rule out a suspected genetic condition or help determine a person\"s chance of developing or passing on a genetic disorder.\" Based off the information given at www.genome.gov/19516567 genetic testing shows if someone is a carrier for a disease, which in turn can give insight on how much of a chance a child has of receiving the genetic disorder. The site also provided information on Prenatal and newborn screenings saying that they can be done to show if a child has a genetic disease. This makes it easier for the parents to know what is wrong and how to handle the disease. This makes everyday living with the disorder easier and more efficient. Genetic testing therefore should be allowed because of how it helps with identifying diseases."],"PremiseEndPos":[1187],"ArgumentID":"00000001","Conclusion":"Genetic Testing (use by medical insurance)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":167,"nextID":"00000003","PremiseStartPos":[1202],"prevID":"00000001","Premise":["Even though most ethnic groups/ religions view genetic testing as wrongful or unnecessary, it does not go against the laws of nature and people do have the freedom of speech and religion. It could be possible that their religion doesn't view it as wrong or unneeded. For genetic testing there is multiple physiological aspects/views that are being dealt with. For instance according to www.cancer.gov/cancertopics/understandingcancer/genetesting/page29 there is less stress after the testing is done. Knowing gives a feeling or relief. Other benefits of genetic testing are as follows: fewer checkups, informed decisions, and intervention. One question commonly asked about Genetic testing is \"Does genetic testing go against the laws of nature?\" Technically genetic testing does not go against nature because one main law of nature is that it is survival of the fittest, and by doing genetic testing humans are just adapting and changing. Society can greatly benefit from doing genetic testing."],"PremiseEndPos":[2198],"ArgumentID":"00000002","Conclusion":"Genetic Testing (use by medical insurance)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":167,"nextID":"00000004","PremiseStartPos":[2213],"prevID":"00000002","Premise":["Even though you don't receive an exact diagnoses sometimes as of now, there is still the fact of know what you might have. And with further research scientists could possibly get an exact result every time, its just a matter of cooperation and time. Your previous, \"Genetic testing only identify the chances or probabilities.\" is false because genetic testing gives information on if a person has a genetic disease, if they can pass it on, and the chances of passing it on to their child. Another reason why genetic testing should be considered good is that it helps in other aspects of medicine as well. For example, according to genetic testing can help find out how our bodies will react to certain drugs. This can help doctors give exact dosages and the right type of medicine to people. Genetic testing could also prove to help find cures in the near future. This could cure cancer and its death toll on the world's population annually. With further research, genetic testing could become very valuable to surviving."],"PremiseEndPos":[3235],"ArgumentID":"00000003","Conclusion":"Genetic Testing (use by medical insurance)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":167,"nextID":"00000005","PremiseStartPos":[3250],"prevID":"00000003","Premise":["Most people wont even abort babies because it is another risky topic to go with, and because of most people's religions they wont do it anyway. There may be few but it wouldn't really bring question to genetic testing because no one really question the reasoning behind an abortion. Most people just plain don't like it. In the future genetic testing will be needed and that's inevitable to deny. With further research the cure for cancer and other diseases can be found. Less death will occur but bring down food supplies greatly. A process for longer life could also be found out from genetic testing. Even gene mutations for different aspects of the body could give light to positive gene mutations like a smart gene or a gene that controls how athletic someone will be. I mean what if you could get these done? You would most likely get it if you had the money for it."],"PremiseEndPos":[4123],"ArgumentID":"00000004","Conclusion":"Genetic Testing (use by medical insurance)","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":167,"nextID":"00000006","PremiseStartPos":[4138],"prevID":"00000004","Premise":["Although genetic testing is a beneficial factor to help patients identify a genetic disorder, is it really the right thing to do? Genetic screenings/testing are going against the work f nature. Many religions and ethnic groups believe that doing genetic testing are to be immortal because they are interfering wit the work of nature. It is going against the work of god. Others have a fear that genetic testing will change the way humans reproduce. According to www.noso.edu, people fear that instead of natural reproduction, people will use fetus and embryo genetic screenings to select better for their child. Although genetic testing can be very beneficial, most people do not use it for the good."],"PremiseEndPos":[4839],"ArgumentID":"00000005","Conclusion":"Genetic Testing (use by medical insurance)","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":167,"nextID":"00000007","PremiseStartPos":[4854],"prevID":"00000005","Premise":["You had mentioned that after genetic testing is done the patient is less stressed and has a feeling of relief. However, genetic testing does not relief that stress. Patients are going in to get a genetic test to see what is going on with their genes, however genetic testing aren't 100 percent certain. Genetic testing do not rule out every possibility of developing a disease. According to cancer.org, some test may be read wrong. Every lab has a different way of testing for a genetic disorder. Sometimes, getting a test wont even help a person out, the results will probably not show up. Genetic testing only identify the chances or probabilities. If a person reads positive, that doesn't neccessarily mean they are not getting that disorder. Yes, there are therapies to help a person calm their nerves, but genetic testing aren't going to statisfy them."],"PremiseEndPos":[5712],"ArgumentID":"00000006","Conclusion":"Genetic Testing (use by medical insurance)","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":125,"ConclusionEndPos":167,"nextID":"00000000","PremiseStartPos":[5727],"prevID":"00000006","Premise":["In a previous argument, you had mentioned that there are screenings for parents to see their unborn child and determine if they have a genetic disease or not. No is that a good thing or bad thing. Well, according to www.noso.edu, this is a problem. Yes, genetic testing for your unborn child can be a good thing, but some parents will rather abort their child if it ends up with a genetic disorder. The abortion rates will become bigger issue and people will start to question, should genetic testing be allowed for parents to run on their unborn children. Another issue this website had talked about was the discrimination of people with a genetic disorder. \"insurance companies and employers would like to be able to determine insurance rates and employment statuses based on the genetic composition of people.\" If a person has a high risk factor of certain disease, they may be prevented from obtaining insurance. Which leads into the next topic, who should pay for a genetic testing?"],"PremiseEndPos":[6715],"ArgumentID":"00000007","Conclusion":"Genetic Testing (use by medical insurance)","PremiseStance":["Con"]}}]}