{"MetaData":{"Context":"URL: http://www.debate.org/debates/Why-should-we-vote-for-Trump/1/\nCrawl date: 2016/09/29 03:07:55\nDebate: Why should we vote for Trump | Debate.org\nNumber of arguments: 2\n\n\nEvidence Pro: I am personally not americian, I'm from New Zealand but I wanted to do a speech on why we should vote for trump, so please give me your opinion.\n\nEvidence Con: My opponent says that, \" I wanted to do a speech on why we should vote for trump, so please give me your opinion.\" I am Con, so I have to argue that we should not vote for Trump. My opponent has to affirm that we should vote for Trump. I do not need to give a reason why we should vote for Trump, because it is in my opponent's side, and it doesn't have to do with my burden, only making my burden negative. So I will give my opinion, and reason on why we should not vote Trump, because that is my burden. With that, challenge accepted. Ready to get goin*\n","DiscussionID":"00000040","Title":"Why should we vote for Trump","CrawlDate":"2016/09/29 03:07:55","URL":"http://www.debate.org/debates/Why-should-we-vote-for-Trump/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":107,"ConclusionEndPos":135,"nextID":"00000002","PremiseStartPos":[187],"prevID":"00000000","Premise":["I am personally not americian, I'm from New Zealand but I wanted to do a speech on why we should vote for trump, so please give me your opinion."],"PremiseEndPos":[332],"ArgumentID":"00000001","Conclusion":"Why should we vote for Trump","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":107,"ConclusionEndPos":135,"nextID":"00000000","PremiseStartPos":[347],"prevID":"00000001","Premise":["My opponent says that, \" I wanted to do a speech on why we should vote for trump, so please give me your opinion.\" I am Con, so I have to argue that we should not vote for Trump. My opponent has to affirm that we should vote for Trump. I do not need to give a reason why we should vote for Trump, because it is in my opponent's side, and it doesn't have to do with my burden, only making my burden negative. So I will give my opinion, and reason on why we should not vote Trump, because that is my burden. With that, challenge accepted. Ready to get goin*"],"PremiseEndPos":[903],"ArgumentID":"00000002","Conclusion":"Why should we vote for Trump","PremiseStance":["Con"]}}]}