{"MetaData":{"Context":"URL: http://www.debate.org/debates/Should-Video-Games-be-Restricted-by-Parents/1/\nCrawl date: 2016/09/29 05:59:57\nDebate Issue: Should Video Games be Restricted by Parents | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: I believe video games must be restricted by the parents to a certain extent, I am not saying completely it is true that kids come home stressed out after school, But one thing we have to keep in mind is that the video games the kids play influences them a lot. It can sometimes influence his/her character. It can take away his concentration from studies completely at times. Just imagine a kid is playing a video game which has not been recommended for his age for example games like Grand Theft Auto, Bullet storm etc. these games are all very violent they even have sexual scenes in them and also in these games they use a very vulgar language which aren't recommended for children, seeing these things in games they would want to try this out in real life. That can also lead to the kids under the age of 12 being exposed to drugs. For something silly a kid can even kill his own brother or sister without hesitation because in the games he has played killing people and monsters was \" F U N\". It is also not necessary for parents to buy them these games, it will be supplied to them by their friends. I would always recommend kids to play video games but thing is all must be careful because everything has its other side. So watch out ! and think again before buying Your kid a gaming console and a Game.\n\nEvidence Pro: You said parents can stop this but how can you be sure that they have the time to do this, if they did have the time to do this why do you think there are minors doing drugs. and most of the parents don't know about it. The kid chooses a game not according to his likes alone it may be recommended by his friends too, so the parents can't always see to it that their kids are kept away from violent games.\n\nEvidence Con: Should kids be restricted from playing video games? I believe that kids should be allowed to play video games for the following reasons; they relief stress, they are very fun, and they are educational. -Relieves stress -students come home after school stressed out -playing video games allow them to forget about their worries and relax -When all stress is relieved, his/her mood is back to normal and will do better in his/her work -Very fun -ex: Minecraft -You can play with other people from around the world in your games -You can go kill monsters and other players Educational -Sometimes includes lots of thinking -Makes your mind sharper -Can make your reflexes faster In summary video games are very beneficial. Video games can relief our stress, very fun, and educational That is why I believe that kids should not be restrained from playing video games\n\nEvidence Con: Well yes. I agree with what you are saying. \"games can be violent and lead to certain behaviors.\" That is VERY true. But, there is a certain twist to it. Those specific video games can be banned by the parents. If they have no control over this, this would be the child's decision if he/she wants to play those games. Its just like stopping people from taking drugs, smoking. I mean we just can't stop these things ether way. I suppose you understand my point. If this child chooses to play these video games, no one can stop that decision besides the parents or guardian.\n\nEvidence Con: Good point. I think you got me. It was nice debating with you! (how do i forfeit) -.-\n","DiscussionID":"00000013","Title":"Should Video Games be Restricted by Parents","CrawlDate":"2016/09/29 05:59:57","URL":"http://www.debate.org/debates/Should-Video-Games-be-Restricted-by-Parents/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":171,"nextID":"00000002","PremiseStartPos":[223],"prevID":"00000000","Premise":["I believe video games must be restricted by the parents to a certain extent, I am not saying completely it is true that kids come home stressed out after school, But one thing we have to keep in mind is that the video games the kids play influences them a lot. It can sometimes influence his/her character. It can take away his concentration from studies completely at times. Just imagine a kid is playing a video game which has not been recommended for his age for example games like Grand Theft Auto, Bullet storm etc. these games are all very violent they even have sexual scenes in them and also in these games they use a very vulgar language which aren't recommended for children, seeing these things in games they would want to try this out in real life. That can also lead to the kids under the age of 12 being exposed to drugs. For something silly a kid can even kill his own brother or sister without hesitation because in the games he has played killing people and monsters was \" F U N\". It is also not necessary for parents to buy them these games, it will be supplied to them by their friends. I would always recommend kids to play video games but thing is all must be careful because everything has its other side. So watch out ! and think again before buying Your kid a gaming console and a Game."],"PremiseEndPos":[1534],"ArgumentID":"00000001","Conclusion":"Should Video Games be Restricted by Parents","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":171,"nextID":"00000003","PremiseStartPos":[1549],"prevID":"00000001","Premise":["You said parents can stop this but how can you be sure that they have the time to do this, if they did have the time to do this why do you think there are minors doing drugs. and most of the parents don't know about it. The kid chooses a game not according to his likes alone it may be recommended by his friends too, so the parents can't always see to it that their kids are kept away from violent games."],"PremiseEndPos":[1955],"ArgumentID":"00000002","Conclusion":"Should Video Games be Restricted by Parents","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":171,"nextID":"00000004","PremiseStartPos":[1970],"prevID":"00000002","Premise":["Should kids be restricted from playing video games? I believe that kids should be allowed to play video games for the following reasons; they relief stress, they are very fun, and they are educational. -Relieves stress -students come home after school stressed out -playing video games allow them to forget about their worries and relax -When all stress is relieved, his/her mood is back to normal and will do better in his/her work -Very fun -ex: Minecraft -You can play with other people from around the world in your games -You can go kill monsters and other players Educational -Sometimes includes lots of thinking -Makes your mind sharper -Can make your reflexes faster In summary video games are very beneficial. Video games can relief our stress, very fun, and educational That is why I believe that kids should not be restrained from playing video games"],"PremiseEndPos":[2832],"ArgumentID":"00000003","Conclusion":"Should Video Games be Restricted by Parents","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":171,"nextID":"00000005","PremiseStartPos":[2847],"prevID":"00000003","Premise":["Well yes. I agree with what you are saying. \"games can be violent and lead to certain behaviors.\" That is VERY true. But, there is a certain twist to it. Those specific video games can be banned by the parents. If they have no control over this, this would be the child's decision if he/she wants to play those games. Its just like stopping people from taking drugs, smoking. I mean we just can't stop these things ether way. I suppose you understand my point. If this child chooses to play these video games, no one can stop that decision besides the parents or guardian."],"PremiseEndPos":[3420],"ArgumentID":"00000004","Conclusion":"Should Video Games be Restricted by Parents","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":171,"nextID":"00000000","PremiseStartPos":[3435],"prevID":"00000004","Premise":["Good point. I think you got me. It was nice debating with you! (how do i forfeit) -.-"],"PremiseEndPos":[3521],"ArgumentID":"00000005","Conclusion":"Should Video Games be Restricted by Parents","PremiseStance":["Con"]}}]}