{"MetaData":{"Context":"URL: http://www.debate.org/debates/Finish-this-sentence/1/\nCrawl date: 2016/09/29 07:42:20\nOnline Debate: Finish this sentence | Debate.org\nNumber of arguments: 9\n\n\nEvidence Pro: Rules: First person writes part of a sentence. Second person finishes the sentence, using correct grammar and if necessary punctuation. Second person then writes the beginning of his own sentence. He may continue the sentence from before and add on another before he puts the sentence for the other person to finish if he wishes. First person continues that sentence and the cycle repeats. Please no use of profanities. Jack sucked in a deep breath, staring at the gigantic ...\n\nEvidence Pro: Mary slowly staggered back in fear as she saw the huge moss green and muddy brown Cyclops, with an eye patch over his eye, rising out of the water right in front of her. {In the sentence before, I was thinking of a kraken or monster. What did you think I would have responded to your sentence?} Never in her life had she been more speechless than when she realized her best...\n\nEvidence Pro: As the unrelenting flames began to grow, the atoms holding together the building began to rip apart and the little girl in the closet's tears dried with the heat, as she saw a dark black shadow walking towards her. POI- By the way, (as a person with OCD when it comes to English,) in your sentence, after \"her best friend had betrayed her,\" there should have been a full stop or period. Sentence- As the water level increased...\n\nEvidence Pro: As I said before, I really didn't mean to be offensive. I was just pointing it out. Harriet suddenly found herself in a flashing, fiery vortex; clocks and little memories flying about her. (Jily!:)) James and Lily just wanted...\n\nEvidence Pro: I'll wait for Dudestop to post his sentence. (I ship Jily [James and Lily from Harry Potter] by the way. That is where my idea of that sentence came from Dudestop.)\n\nEvidence Con: I've never done one of these before, so thanks for the challenge mate. I'll make a sentence after I finish the one given by Pro. I'll include the first part she had. Jack sucked in a deep breath, staring at the outlandish beanstalk he had purchased. Mary slowly staggered back in fear as she saw the (Finish the sentence) Thank You Mate!\n\nEvidence Con: Thanks pro. I'll answer questions: \"{In the sentence before, I was thinking of a kraken or monster. What did you think I would have responded to your sentence?\" I was thinking of a monster, or anything that would strike fear into ones heart to the point of staggering slowly back upon sight. I'll finish this sentence: Never in her life had she been more speechless than when she realized her best friend had betrayed her, a single tear dripped down her small blue eyes as she stood wobbling towards the edge of the cliff, watching her churlish friend grinning widely before her. I'll now create a sentence for Pro to finish: As the unrelenting flames continued to grow... Have a nice day.\n\nEvidence Con: \"As the unrelenting flames began to grow, the atoms holding together the building began to rip apart and the little girl in the closet's tears dried with the heat, as she saw a dark black shadow walking towards her. POI- By the way, (as a person with OCD when it comes to English,) in your sentence, after \"her best friend had betrayed her,\" there should have been a full stop or period.\" There's nothing noble in telling people off about publicly shaming people for grammatical gaffes and typos... Sentence- As the water level increased, Suzie lost her will to live, and felt all time around her stop as she released herself into the cool water. Harriet suddenly found herself in-\n\nEvidence Con: DudeStop forfeited this round. Pro I'll wait for Dudestop to post his sentence. (I ship Jily [James and Lily from Harry Potter] by the way. That is where my idea of that sentence came from Dudestop.)\n\nEvidence Con: James and Lily just wanted Harry to know that they loved and would continue to love him profoundly, even after death.\n","DiscussionID":"00000024","Title":"Finish this sentence","CrawlDate":"2016/09/29 07:42:20","URL":"http://www.debate.org/debates/Finish-this-sentence/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000002","PremiseStartPos":[178],"prevID":"00000000","Premise":["Rules: First person writes part of a sentence. Second person finishes the sentence, using correct grammar and if necessary punctuation. Second person then writes the beginning of his own sentence. He may continue the sentence from before and add on another before he puts the sentence for the other person to finish if he wishes. First person continues that sentence and the cycle repeats. Please no use of profanities. Jack sucked in a deep breath, staring at the gigantic ..."],"PremiseEndPos":[656],"ArgumentID":"00000001","Conclusion":"Finish this sentence","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000003","PremiseStartPos":[671],"prevID":"00000001","Premise":["Mary slowly staggered back in fear as she saw the huge moss green and muddy brown Cyclops, with an eye patch over his eye, rising out of the water right in front of her. {In the sentence before, I was thinking of a kraken or monster. What did you think I would have responded to your sentence?} Never in her life had she been more speechless than when she realized her best..."],"PremiseEndPos":[1048],"ArgumentID":"00000002","Conclusion":"Finish this sentence","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000004","PremiseStartPos":[1063],"prevID":"00000002","Premise":["As the unrelenting flames began to grow, the atoms holding together the building began to rip apart and the little girl in the closet's tears dried with the heat, as she saw a dark black shadow walking towards her. POI- By the way, (as a person with OCD when it comes to English,) in your sentence, after \"her best friend had betrayed her,\" there should have been a full stop or period. Sentence- As the water level increased..."],"PremiseEndPos":[1492],"ArgumentID":"00000003","Conclusion":"Finish this sentence","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000005","PremiseStartPos":[1507],"prevID":"00000003","Premise":["As I said before, I really didn't mean to be offensive. I was just pointing it out. Harriet suddenly found herself in a flashing, fiery vortex; clocks and little memories flying about her. (Jily!:)) James and Lily just wanted..."],"PremiseEndPos":[1736],"ArgumentID":"00000004","Conclusion":"Finish this sentence","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000006","PremiseStartPos":[1751],"prevID":"00000004","Premise":["I'll wait for Dudestop to post his sentence. (I ship Jily [James and Lily from Harry Potter] by the way. That is where my idea of that sentence came from Dudestop.)"],"PremiseEndPos":[1916],"ArgumentID":"00000005","Conclusion":"Finish this sentence","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000007","PremiseStartPos":[1931],"prevID":"00000005","Premise":["I've never done one of these before, so thanks for the challenge mate. I'll make a sentence after I finish the one given by Pro. I'll include the first part she had. Jack sucked in a deep breath, staring at the outlandish beanstalk he had purchased. Mary slowly staggered back in fear as she saw the (Finish the sentence) Thank You Mate!"],"PremiseEndPos":[2269],"ArgumentID":"00000006","Conclusion":"Finish this sentence","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000008","PremiseStartPos":[2284],"prevID":"00000006","Premise":["Thanks pro. I'll answer questions: \"{In the sentence before, I was thinking of a kraken or monster. What did you think I would have responded to your sentence?\" I was thinking of a monster, or anything that would strike fear into ones heart to the point of staggering slowly back upon sight. I'll finish this sentence: Never in her life had she been more speechless than when she realized her best friend had betrayed her, a single tear dripped down her small blue eyes as she stood wobbling towards the edge of the cliff, watching her churlish friend grinning widely before her. I'll now create a sentence for Pro to finish: As the unrelenting flames continued to grow... Have a nice day."],"PremiseEndPos":[2974],"ArgumentID":"00000007","Conclusion":"Finish this sentence","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000009","PremiseStartPos":[2989],"prevID":"00000007","Premise":["\"As the unrelenting flames began to grow, the atoms holding together the building began to rip apart and the little girl in the closet's tears dried with the heat, as she saw a dark black shadow walking towards her. POI- By the way, (as a person with OCD when it comes to English,) in your sentence, after \"her best friend had betrayed her,\" there should have been a full stop or period.\" There's nothing noble in telling people off about publicly shaming people for grammatical gaffes and typos... Sentence- As the water level increased, Suzie lost her will to live, and felt all time around her stop as she released herself into the cool water. Harriet suddenly found herself in-"],"PremiseEndPos":[3671],"ArgumentID":"00000008","Conclusion":"Finish this sentence","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000010","PremiseStartPos":[3686],"prevID":"00000008","Premise":["DudeStop forfeited this round. Pro I'll wait for Dudestop to post his sentence. (I ship Jily [James and Lily from Harry Potter] by the way. That is where my idea of that sentence came from Dudestop.)"],"PremiseEndPos":[3886],"ArgumentID":"00000009","Conclusion":"Finish this sentence","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":106,"ConclusionEndPos":126,"nextID":"00000000","PremiseStartPos":[3901],"prevID":"00000009","Premise":["James and Lily just wanted Harry to know that they loved and would continue to love him profoundly, even after death."],"PremiseEndPos":[4019],"ArgumentID":"00000010","Conclusion":"Finish this sentence","PremiseStance":["Con"]}}]}