{"MetaData":{"Context":"URL: http://www.debate.org/debates/Science-cannot-disprove-God/1/\nCrawl date: 2016/09/29 07:48:44\nDebate Argument: Science cannot disprove God | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: This is a continuation of the debate titled \"Science cannot disprove God, nor does it even come close to offering anything on the matter\" between NathanDuclos (CON) and Tommy.leadbetter (PRO) that ended in a forfeiture by PRO. I have dropped the second portion of PRO's resolution as it seemed somewhat indeterminable in a debate due to the nonspecific nature of the word \"close\". However, it will no doubt be addressed during this debate. As the instigator, I accept full BOP. In accepting this debate, CON accepts the following definitions: God: A supreme being, creator of the universe, that has attributes of omniscience, omnipotence, omnipresence, omnibenevolence and eternal existence. Disprove: Prove that something is false, namely God's existence CON will need to either provide a valid argument supporting an instance where science is capable of disproving God or successfully invalidate PRO's arguments. There will be four rounds. First round is for acceptance. Second round is for arguments. Third round is for rebuttals (no new arguments allowed). The final round is for final rebuttals and closing statements. Thanks and good luck.\n\nEvidence Pro: OPENING STATEMENT To begin, I\"d like to approach the second part of the original debate resolution. This was stripped out for this debate, since the wording seemed indeterminable due to the nonspecific nature of the word \"close\". \"Nor does it [SCIENCE] even come close to offering anything on the matter [of God\"s existence]\" Science is, by definition, the systematic study of the structure and behavior of the physical and natural world through observation and experiment. [1] God is a Supreme Being and higher power by the definition accepted in Round 1. He is considered supernatural because He operates and exists above and beyond nature. He is not subject to the laws of science. [2] The realm of religion and the realm of science do sometimes overlap when religion takes a stance on an element of the natural world, such as the age of the earth, the origins of humanity, the relationship between the sun and earth, etc. However, the realm of God and science will never overlap because God is by definition above nature. Science, the study of the physical and natural world, cannot be applied to explore any aspect of God\"s existence. Science and God are absolutely un-relatable. ARGUEMENT Tommy.Ledbetter\"s original resolution was: \"Science cannot disprove God\". To reword for clarity (removing the double negative): \"Science cannot prove God\"s nonexistence\". Science, as I stated, requires observation and experiment. Creating a proven scientific theory requires heavily scrutinized evidence and repeated testing. [3] Herein lies the pinnacle of the debate. For science to prove any theory, it requires observation and evidence. Regarding nonexistence, both are not available. To prove, scientifically, that God does not exist would require an observer to be both omniscient and omnipresent. This is a paradox, since the observer would in-turn meet the very definition we set for God. Therefore, my argument is: Premise 1 (P1): Non-existence affirms that there is no observational evidence available P2: To prove that there is no observational evidence, the observer would need to be both omniscient and omnipresent. P3: An omniscient and omnipresent being would be God P1 >> P2 >> P3 >>C1: Proving non-existence using observational evidence can only be accomplished by God. P4: Science requires observation, experimentation, and the scrutinization of evidence P4 >> C1 >> C2: Science requires God to prove God\"s non-existence Science cannot disprove God\"s existence because science requires a logically impossible and contradictory accomplishment in requiring observation of that which cannot be observed and evidence of that where no evidence is available and similarly, in requiring an element from the natural and physical world to take a stance on an element of the supernatural world. I look forward to Con\"s argument. Thanks. [1] [2] [3]\n\nEvidence Pro: Thanks for the round 2 arguments. I\"ll provide my rebuttal below. OPENING STATEMENT My argument, outlined in ROUND 2, can be summed as the logical proof: Something that utilizes observation to prove cannot prove something that cannot be observed. This resolution is extremely simple. It was almost simple enough that I would have discounted it as hollow truism was it not for at least one taker. The intension of this debate is to examine the objective of science. What is the purpose of science and, specifically, when is science indifferent on a subject. This debate does not concern itself with the question of God\"s existence. In fact, whether the resolution is accepted or not, the question of God\"s existence will remain unanswered. We are only concerning ourselves with one question: can science disprove God. My opponent\"s tactic so far has been to load his shotgun and shoot us with a canned version of your typical atheistic theological arguments against the existence of God. He hopes that at least something from the mix will stick. Unfortunately, nothing does and most of CON\"s arguments aren\"t relevant within the scope of this debate. REBUTTAL GOING FORWARDS A) Whether the reworded resolution is a double negative or not, is of no consequence. The rewording is independent of my argument. In believing this to be a tactic to distract the voters from the merits of my argument, I am ok with keeping the original wording as it has no overall affect. My argument remains the same, although I will reword the first premise and the first conclusion for clarity. Premise 1 (P1): Disproving God\"s existence affirms that there is no observational evidence available P2: To prove that there is no observational evidence, the observer would need to be both omniscient and omnipresent. P3: An omniscient and omnipresent being would be God P1 >> P2 >> P3 >>C1: Disproving God\"s existence using observational evidence can only be accomplished by God. P4: Science requires observation, experimentation, and the scrutinization of evidence P4 >> C1 >> C2: Science requires God to prove God\"s non-existence B) As to CON\"s affirmation that my argument is \"A cannot disprove X\": This argument commits the straw-man fallacy. This argument is conveniently simplified to exclude the restrictions set upon A and X. To reform CON\"s argument correctly: A, which utilizes observation and evidence, cannot disprove X, which requires that no observation or evidence exists. BLACK SWAN FALLACY The black swan fallacy is not applicable to my argument. There is no possibility that science will ever disprove God because it is, as I have shown, logically impossible. CON\"s use of the black swan fallacy here is tantamount to stating that we should not discount the possibility that a three sided square exists somewhere in the universe. A three sided square cannot exist, and we do not need to scour the universe to determine so. It is not logically possible because a square is restricted to having four sides by its definition. Similarly, Science is restricted to the use of evidence and observation. It is logically impossible to examine the evidence of non-existence without being both omniscient and omnipresent. GOD OF THE GAPS - ARGUEMNT FROM EITHER OR Both of these arguments are exactly the same, but CON has worded them slightly differently. CON argues that at some point, our scientific knowledge may push God out of necessity. While this is true, as our knowledge of the universe grows our ability to credit God may decrease. The gap that He fills would decrease inversely to the growth of our understanding. However, that gap would not close until we reached a point where we had an understanding of all things (become omniscient ourselves). Even at this seemingly impossible point, we could still not disprove God through scientific means. He can exist without evidence. Therefore, even if, in our omniscient state, in finding no evidence of God we would still be doubtful of his existence or non-existence. THE SHIFTING ARGUMENT - THE BURDEN OF PROOF Unfortunately science will not disprove any of those creatures, if we consider them to be above the laws of nature and essentially meet the definition of God. We cannot prove, by means of observation, non-existence; it is illogical. CON argues that this then then opens us up to the belief in any being, whether a smurf or closet monster, that arises from his mind. He asks, \"Are you saying that I need to go to every closet in the existence to prove my son wrong?\" This argument commits the affirmative conclusion from a negative premise fallacy. Remember, we are not working to prove the affirmative, that any being exists. We are only taking a stance on the limitations of science and specifically, of physical evidence and observation. Although science cannot disprove God, as I have shown, we cannot draw the conclusion the God exists. The burden of proof for existence falls on the simpler theory with fewer assertions, a universe with no supernatural beings. Therefore I would tell your son, \"There has never been a shred of evidence found that supports the existence of a closet monster, therefore we should not believe that one exists.\" Thanks again CON. I look forward to reviewing your rebuttal.\n\nEvidence Pro: FINAL REMARKS I would like to remind CON that, per the rules accepted in the first round, neither he nor I can introduce any new arguments. The final round is for the final rebuttal and closing statements. I would also ask the judges to reject, at their discretion, any sources or evidence that CON presents in the final round. Most judges would consider introducing evidence or sources in the final round bad form if not bad conduct since it would not permit me the ability to cross examine. FINAL REBUTTAL What can be asserted without evidence can be dismissed without evidence. CON affirms that we should negate the resolution due to lack of evidence. I have provided the necessary evidence that supports each premise and that demands that we hold the resolution true. This is a curious allegation by CON, as he has not presented a single shred of evidence to back the counter arguments. While I have the full burden of proof, CON\"s counter arguments still need to be supported by adequate evidence. We are nearing the end of the final round; a four round debate. Yet, CON has only provided a single source for his arguments. A Google definition, in which he waited until the end of the third round to offer. Ironically, the definition matches the one I presented in the opening round. Con has not presented any arguments with substance. He continually claims that science can disprove closet monsters, gay pixies and God but hasn\"t actually provided any evidence to support this claim. While this is not an adequate argument for my resolution, such would be ad ignorantiam, but it does beg that the judges ask themselves: isn\"t this reason enough to dismiss the counter arguments instead? The intension of this debate is to examine the objective of science CON claims that, \"Science does not have an intention, it\"s a methodology.\" However, my statement was misconstrued by CON. My statement was that this debate had an intention. Science is a methodology, and it has its limitations as such. These limitations were defined in the opening round, but CON defines them again for us in ROUND 3. Science is the systematic study of the structure and behavior of the PHYSICAL and NATURAL world through OBSERVATION and EXPERIMENT. How can science, limited to observing the natural world, study a supreme being that exists above and beyond nature? How can we study the evidence of non-existence? These are logical contradictions that are the basis of my argument; utilizing the definitions of \"science\" and \"God\" from my opening round. CON\"s argument here begs the question, why did he wait until nearly the end of the debate to define such an important term? An even larger oddity: why did CON present the same definition, word for word, as I did in the opening round? Did CON not realize that his definition matched? Has he not paid attention to such a key component of this debate? I don\"t know for sure, but this incident does create some incredulity on the part of CON\"s counter arguments. What is the purpose of science and, specifically, when is science indifferent on a subject I did not state, as CON claims, that science had a personality. It does have a purpose and an objective. The purpose and objective are outlined in the very definition that CON and I presented: to study the structure and behavior of the physical and natural world. We can also, thereby, make the conclusion that science is not effective at understanding the supernatural world. We are concerning ourselves with one question: can science disprove God CON has misconstrued my statements here, as well. I have not claimed that we have no means to study God. In fact, I have no doubt that it is one of the most studied topics in human culture. It cannot, however, be studied by science. We use philosophy, specifically metaphysics or theology. Theology is the study of the concepts of religions and God-deitites. You can find philosophical arguments for and against the existence of God, but you will never find a scientific paper that disproves God. My opponent\"s tactic so far has been to load his shotgun and shoot us with a canned version of your typical atheistic theological arguments against the existence of God To CON: I do apologize if you took offense to this statement. I believe that this resolution can be accepted by both atheists and theists. It does not take a stance on the existence or non-existence of God. It was not a subjective judgement; my comment was regarding the legitimacy of your arguments. I was merely conveying that, if there was an \"Atheists Cookbook\" of common arguments against the existence of God, that you had blindly copied the first five pages into your arguments. Your arguments have been aligned with proving or disproving gay pixies and the closet monster but have largely ignored the main topic, the limitations of science. My closet monster has special privilege CON claims that the realm of science is discovering truth and that you can apply scientific methodology to supernatural claims. While science\"s objective is most definitely rooted in finding truth, it accomplishes this specifically with the intense scrutiny of evidence. Science, by both my and CON\"s definition, is limited to the natural universe and as such cannot be applied to supernatural claims. Non-existence, by definition, demands that no evidence exists. It is, therefore, a contradiction to study non-existent evidence. Black Swan Fallacy My claim was not that the existence or non-existence of God is unknowable but that it is logically impossible to make such a conclusion through scientific study. The Black Swan Fallacy dictates that, \"Every swan that I have ever seen is white; therefore; there are no black swans.\" The fallacy is an appeal from ignorance; it asserts that a proposition is true because it has not yet been proven false. It ignores the possibility that there is insufficient information to prove the proposition either true or false. This fallacy cannot be applied to propositions that are logically true and require no investigation. For instance: the proposition that a logical statement cannot simultaneously be both true and false or the proposition that there are no three sides squares do not require any additional investigation or information. By the definition of true and false or the definition of a square, we can prove these propositions true without having to scour the universe. Similarly, there is a contradiction that is logically true in my resolution. We cannot study evidence of non-existence. God of the Gaps - Argument from Either Or The question you are referring to, between Ken Ham and Bill Nye, was whether or not creation is a viable model of origins in today\"s modern scientific era. This question is completely outside the context of this resolution. Both Mr. Ham and Mr. Nye are debating historical occurrences in the natural world; occurrences within the realm of science. I\"m not sure if you read my opening statement for this debate, but I actually mentioned this exact topic. \"The realm of religion and the realm of science do sometimes overlap when religion takes a stance on an element of the natural world, such as the age of the earth, the origins of humanity, the relationship between the sun and earth, etc.\" If you asked Mr. Nye what would change his mind on the existence of God, he would almost surely have the same answer: evidence. However, if you asked him instead why he didn\"t believe in God, I have confidence that he would say: because the burden of proof lies on the simpler theory with fewer assertions. A universe absent of supernatural beings certainly is simpler. Mr. Nye would most definitely not say that he does not believe in God because science has proven that supernatural beings could not and do not exist. God of the Gaps and Argument from Either Or are the same arguments, with regard to this resolution, because they rely on the possibility that somewhere there exists information that is contradictory to the resolution in question. This is not true for this resolution because, if false, the resolution would contradict the very definitions we have included for God and science. It would be a contradiction to find evidence of non-existence. CON rejects the claim that God can exist without evidence. This is not surprising, since this very notion is critically damaging to every counter argument that he has presented. This, however, does not mean that \"He can exist without existing, \" as CON claims. Our definition states that God is supernatural and therefore, by definition, he is ABOVE NATURE. He is omnipotent and therefore can exist without evidence to us. CLOSING STATEMENTS My resolution only permits that you, the judges, use logic and it does not require that you abandon your belief or disbelief in God. Whether you hold the resolution true or not, we are not left with an answer on the existence or non-existence of God. We only need to consider the contradiction in terms to determine that this resolution is true and that there is no amount of information that could be gathered to prove otherwise. To study and scrutinize the evidence of absence is a contradiction. For the understanding of the structure and behavior of the natural world to also include the supernatural would be a contradiction.\n\nEvidence Con: Sorry for the delay in accepting things, I have a 9 year old who likes to argue as much as most people here, though this is more fun to debate then \"should I have a bath.\" and \"Why are we here (kfc not Mcdumps)?\" Thank you for very continuing the debate. . . I actually really wanted to see how this stood with someone who was actually willing to discuss that.\n\nEvidence Con: Dear Pro Thanks for the follow through. Between beers, bars and burgers this is an interesting claim, because it has a built in pre-supposition that seems un-falsifiable, but when examined yet again to its conclusion is very easily shown to be false. Some of these are quoted from the previous debate. Going forwards Shifting the burden of proof Science cannot disprove god vs Science cannot prove Gods non-existence.” “Science cannot disprove god” is not a double negative. Very simply “A cannot disprove x.” Which is silly because we use do this all the time, did aliens make the sun rise, and was god needed for evolution to occur. What you doing by saying Science cannot prove Gods non-existence is shifting the burden of proof. And as you are arguing everything after from that point you have not a) made any claims that further the original claim. B) Have not provided an argument for the original claim. Black Swan Fallacy of argument 1. Science cannot disprove god. I have never seen an answer to the question so one must not exist. Just because it hasn’t yet, doesn’t mean that it will not in the future. 2000 years ago people believed Lightening, planetary formation and evolution were all unknown. However as the knowledge from science has progressed things went from unknowable to unknown, to known. They are now all fields of study. Argument from Ignorance or God of the Gaps Science cannot disprove god. What about Transitional Fossils? Though slightly different then Black swan, is God of the Gaps. Rather then I don’t know of any answer other than god, you have placed god into the tiny spots between what we know. There is a gap in understanding, be it a transitional fossil, the development of morality, the big bang, the cause must be supernatural and in this case god. However as Scientific knowledge has expanded the realm of god has shrunk to ever smaller proportions. - At a certain point our knowledge may push god out of necessity. Argument from Either Or One of these theories is not like the other. Gay pixies named bob who eat spaghetti did it. Even if science doesn’t disprove god, it can prove something else was responsible. I’m going to pay a little homage to Douglas Adams here and the Atheist Experience. Science may prove something else created existence like - possibly that self-replicating gay pixies named bob who live on the sun made the universe with the help of pan dimensional beings that exist in our universe as mice. If this is true, it negates God. – If mice did it, you don’t need god. The Shifted Argument Science cannot disprove an undefinable thing. How many ignostics does it take to change a light bulb? Even If you switch the terms you are still left with a number of problems. Could science ever disprove Gay pixies will the sun to rise, could science ever show that plants will the sun to exist so they have something to give them energy? This is the quality of claim that you are defending. IF you replace GOD with anything equally stupid as a concept, you can see the basic flaw in your argument even with shifting the burden of proof. Again your first claim Non-existence affirms that there is no observational evidence available Closet monsters, Smurfs and God are equally valid because you don’t ever disprove them So by following your logic with another subject, smurfs which are described as having the ability to hid their existence should not be ruled out because we can’t disprove them because science can’t examine every aspect of the universe? Again, you seem to confuse unknowable vs Unknown and confidence and certainty. Again, you’re coming from a pre-suppositional point of view. However let’s put this in to another way. When my son was little he would swear there is a Skittery monster (an omnipotent and all seeing monster by every definition that smelled of my grandmother) was in the closest watching him and judging him. This monster obviously by his description had magical powers and could teleport at will. Which is why when I open the door and put on lights, no monster. By going through the non-evidence, his burning body (no scorch marks in the closet), his giant wings (nothing disturbed), the smell of rotten laundry could be confused with a monster, however this self-described monster smelt like my grandmothers perfume. So again, no evidence showing him, however there is ample evidence that the monster is a logical, ration and fear based response of the fear of the dark, based off evolutionary creatures who see patterns where there is none. Using the scientific method we examine things (including concepts which are separate from the natural world) to see if these things hold true. Are you saying I need to go to every closet in existence to prove my son wrong? Science is a methodology, however it has debunked many supernatural things like homeopathy, pixies, loch ness, yet you claim special privilege for a particular closet monster concept. You also claim - To prove that there is no observational evidence, the observer would need to be both omniscient and omnipresent Besides that Omniscient is non-sensical (because you would also have to know two contrary things) like a round square. I don’t need to see all squares to know all squares have four sides of equal size. That’s the definition of the concept. Also by definition a square and circle cannot be the same thing. But this is what you’re saying with the god concept, a thing that breaks everything known to be true and has contradictory aspects exists and that it’s unfalsifiable. By definition something that is self-negating for everything else you’re claiming special privilege. That alone lets us examine the god claim in a naturalistic realm, the purview of science. So the original claim has not been addressed and the first two steps in your other claim have also been addressed, from which all your argument follows. So were back again to me rejecting the claim “science cannot disprove god”. to my response it has for other magical creatures . . .\n\nEvidence Con: Dear Pro and audience. Thank you for paying attention through this debate. I know is a length read and very dry. And I would like to assure you that my sons closet monster is not to treat this subject lightly, but to point out comparatively what Pro is defending and saying is beyond the realm of science. I hope you will stay through to the end and vote (either for me or pro). I appreciate your attention. “What can be asserted without evidence can be dismissed without evidence.\" – Christopher Hitchens. The perception of the double negative is not a distraction but shows the presumptive view of the whole argument and a flaw Pro's case. The original premise of pro is Science cannot disprove god. Can science disprove the closet monster, loch ness or gay pixies on the sun? I believe it can and has. And if it can dismiss other supernatural closet monsters why not one more? Pro- The intension of this debate is to examine the objective of science. Science does not have an intention, it’s a methodology. Google definition is the intellectual and practical activity encompassing the systematic study of the structure and behavior of the physical and natural world through observation and experiment. Pro - What is the purpose of science and, specifically, when is science indifferent on a subject. Your applying that a methodology of examine the universe has an intent and personality. Which is not true and slightly biased. Science is not indifferent. You are implying that a methodology that is effective at understanding can’t understand something. Pro - We are only concerning ourselves with one question: can science disprove God. And so far you have not provided a why or evidence that it cannot, you have only restated, science cannot study it because it is un-studyable. To which I have shown you several logical fallacy’s, black swan, gaps and closet monsters. To which your response has been Pro - My opponent’s tactic so far has been to load his shotgun and shoot us with a canned version of your typical atheistic theological arguments against the existence of God. I didn't state there is no god. I’m' not sure that there is or isn't a god, I have yet to be convinced and seen no evidence that is not in some way flawed. It’s also not part of the debate, what pro is attempting to do is equate my personal belief with that of the argument itself. The argument is can science disprove God and by equating his lack of argument as my fault (a shifting of the BOP). However I would point out that pro is making a Subjective judgment, based on personal opinions, interpretations, points of view, emotions and judgment. My objection is based on logic and reason and analysis. What I’m doing is showing that there is a logical fallacy in your claim. They are not Atheistic rebuttals, there just effective rebuttals to a poor claim you have yet to provide support for. My closet monster has special privilege Pro - This argument is conveniently simplified to exclude the restrictions set upon A and X. To reform CON\"s argument correctly: A, which utilizes observation and evidence, cannot disprove X, which requires that no observation or evidence exists. My son has a closet monster that is all powerful that cannot be observed and is powerful enough to avoid detection. Do you believe that the monster exists? Or do you have a reasons to show why no monster exist? This is not a straw man argument on my part, my object still stands. What you’re doing now is special pleading. You’re claiming that your closet monster has greater standing in being disproved by science because of the conviction of your beliefs and popularity and logical inconsistent and non-sensible assumptions. You would not suggest that the closet monster cannot be dismissed by the naturalist methody of study of science do you? I turned on the lights, checked the closet, I understand this is a common fear from all children at the same age, ext, ext. This is completely the realm of science, discovering the truth. You apply it to a number of supernatural claims, I just suggest that it may go one claim further. BLACK SWAN FALLACY You claim - There is no possibility that science will ever disprove God because it is, as I have shown, logically impossible. (the whole paragraph) You haven’t shown it, you just repeated it. Ad nausea. What I’m stating is just because PRO has not seen the answer doesn’t mean one may not exist. Again, you say something is unknowable, how do you demonstrate this. You presumed your right and went to circle logic. Just because its unknown doesn’t mean its unknowable, you have to show how its right. GOD OF THE GAPS - ARGUEMNT FROM EITHER OR You claim - Therefore, even if, in our omniscient state, in finding no evidence of God we would still be doubtful of his existence or non-existence. So what you’re saying is basically ken ham vs Bill Nye when asked what would change your mind, ken ham said “nothing” Bill Nye “evidence.” What you are claiming is we to stupid to figure stuff out, and that there is a limit to our intelligence. Which is fine, but I’m asking for proof of your claim. God of the Gaps and either or. . . . I see after reading your claim, the reason you think GAPS argument and Pixxies argument are similar is your presume your point of view is valid. One states that god is not required and the other has that pixies did it. They are completely different. This flaw in your perception does not equate to negating my rebuttal. Also again, unknown vs unknowable. I reject your claim of HE CAN EXIST Without Evidence. What you are arguing is “HE CAN EXIST WIHTOUT EXISTING” if he exists then he’s measurable in some way, and if measurable then he clearly falls within natural realm and study able. On a side note - Pro seems to fail to grasp the Law of non-contradiction and principle of non-contradiction. A is a circle, b is a square, two propositions \"A is B\" and \"A is not B\" are mutually exclusive. If god possess a property of anything, be it all powerful or ageless or pink, that means he can be studied. Also I didn’t claim a 3 sided square was possible as pro asserts, what I’m saying is that I don’t need to have absolute knowledge to know a rectangle having all four sides of equal length is a square where ever in the universe, and a square and a circle are two different things that are not the same. I don’t need absolute knowledge, just enough to understand the difference between I don’t know and no one can ever know. Which is by the way what pro is claiming, we cant ever known and no method of understaning, evidence ever will contradict that possisiton.\n\nEvidence Con: Dear Pro and All . . . . After several rounds I would like to thank everyone for following this. I would like to also thank anyone that votes. I totally appreciate your time and effort to follow this. As such, I’m going to keep my rebuttal somewhat brief. Also compraing the closet monster to god, and vice versa is not to talk down to the audience or pro, but to illistrate the absolute sillyness of the claim pro takes. Science cannot disprove the closet monster. Black swan – How do you know that science cannot provide an answer? Just because you dont know of something, doesnt mean it doesnt exist, or someone else doesnt know the answer. Black Swan #2 – Pro is claiming that you can’t study non-evidence, there is no evidence of a closet monster by definition. If you think science can disprove the closet monster but you still believe pro’s claim. Special privilege – if you accept that closet monster (or any other non-evidence imaginary creature) can be dismissed but not your god, then your claiming special privilege. Ignorance or Gaps – You need to check every closet, even those not made yet, to prove there is no closet monster. That no matter what evidence, you can always claim further ignorance or gaps. Transition fossils – Daddy, there are gaps in the understanding of what the closet monster is, who knows what he can do or his ultimate powers, he’s the closet monster. Gay pixies named bob – Science shows that it wasn’t the closet monster, but something else, so science gave an answer other then god, and disproved god. Unknown vs Unknowable – Pro claims you don’t know, and you can never know that the closet monster doesn’t exist. Just like individuals claim lightening and evolution 400 years ago. Which again is unsupported, despite the numerous ways and sincerity of the claim. Straw man of Science – Pro has demonstrated a lack of understanding of science. (see following point) Logical – As i have pointed out, Logic is not of the material natural world, yet it can be tested by science. Logic can be tested by the scientific method despite its non-material existence. God has attributes that exist (as given by pro) and can be tested, aka science, to see if they are valid. This is part of the methodology of science, pro just rejects the results and claims and contradiction that would eliminate his closet monster. Atheistic arguments – Pro is a pre-suppositional and implies that my arguments are biased because of my lack of belief, and asks to put aside your views on god. My belief on god has nothing to do with this debate. There is no need to apologize and you’re absolutely right, there is no theist vs a-theist debate here. If you made an equally unsupported claim, I would use the same webpage that has a list of logical fallacy’s to point out the fault in that argument to. Bill nye - Your conflating the individual with the argument, which you have done in the argument and missed the point (or Im really too subtle for my own good). Your presuming your first claim is true and proceed. What I’m asking for is the necessity and evidence of your 1st claim. You can be logically coherent but your starting point still false. I’m going to paraphrase my son and Pro My Son and Pro claim that the Closet Monster/God can exist without evidence. You cannot use a methodology of understanding (science) to disprove this being or study it. Not only that you cannot question the closet monster/god, and you can’t falsify him. My son and pro refuse to accept that turning on the lights, knowing why children are afraid of the dark, and other acts (science) can disprove the Closet monster/ god because he’s just too smart at hiding his existence. Also the sincerity of my belief says it’s real. He exists without evidence and leaves no trace, despite we know his existence in my closet/life. And if you turn of the lights on / reason \"He can exist without existing, and evidence, despite contrary claims.\" Our definition states that closet monster / God is supernatural and therefore, by definition, he is ABOVE NATURE, because that means something that scape goats everything. He is omnipotent and therefore can exist without evidence to us. And you can never show me I’m wrong, ever no matter what you say. I’m sure that many of us were little we believed in the closet monster. My son believes in the closet monster. I do not leave the light on for my son for reasons sake (and he’ll never sleep). And for reason sake you should vote con, not because of shot gun atheist arguments, but a list of logical, reasonable and solid fallacy’s that Pro relies on.\n","DiscussionID":"00000072","Title":"Science cannot disprove God","CrawlDate":"2016/09/29 07:48:44","URL":"http://www.debate.org/debates/Science-cannot-disprove-God/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":115,"ConclusionEndPos":142,"nextID":"00000002","PremiseStartPos":[194],"prevID":"00000000","Premise":["This is a continuation of the debate titled \"Science cannot disprove God, nor does it even come close to offering anything on the matter\" between NathanDuclos (CON) and Tommy.leadbetter (PRO) that ended in a forfeiture by PRO. I have dropped the second portion of PRO's resolution as it seemed somewhat indeterminable in a debate due to the nonspecific nature of the word \"close\". However, it will no doubt be addressed during this debate. As the instigator, I accept full BOP. In accepting this debate, CON accepts the following definitions: God: A supreme being, creator of the universe, that has attributes of omniscience, omnipotence, omnipresence, omnibenevolence and eternal existence. Disprove: Prove that something is false, namely God's existence CON will need to either provide a valid argument supporting an instance where science is capable of disproving God or successfully invalidate PRO's arguments. There will be four rounds. First round is for acceptance. Second round is for arguments. Third round is for rebuttals (no new arguments allowed). The final round is for final rebuttals and closing statements. Thanks and good luck."],"PremiseEndPos":[1340],"ArgumentID":"00000001","Conclusion":"Science cannot disprove God","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":115,"ConclusionEndPos":142,"nextID":"00000003","PremiseStartPos":[1355],"prevID":"00000001","Premise":["OPENING STATEMENT To begin, I\"d like to approach the second part of the original debate resolution. This was stripped out for this debate, since the wording seemed indeterminable due to the nonspecific nature of the word \"close\". \"Nor does it [SCIENCE] even come close to offering anything on the matter [of God\"s existence]\" Science is, by definition, the systematic study of the structure and behavior of the physical and natural world through observation and experiment. [1] God is a Supreme Being and higher power by the definition accepted in Round 1. He is considered supernatural because He operates and exists above and beyond nature. He is not subject to the laws of science. [2] The realm of religion and the realm of science do sometimes overlap when religion takes a stance on an element of the natural world, such as the age of the earth, the origins of humanity, the relationship between the sun and earth, etc. However, the realm of God and science will never overlap because God is by definition above nature. Science, the study of the physical and natural world, cannot be applied to explore any aspect of God\"s existence. Science and God are absolutely un-relatable. ARGUEMENT Tommy.Ledbetter\"s original resolution was: \"Science cannot disprove God\". To reword for clarity (removing the double negative): \"Science cannot prove God\"s nonexistence\". Science, as I stated, requires observation and experiment. Creating a proven scientific theory requires heavily scrutinized evidence and repeated testing. [3] Herein lies the pinnacle of the debate. For science to prove any theory, it requires observation and evidence. Regarding nonexistence, both are not available. To prove, scientifically, that God does not exist would require an observer to be both omniscient and omnipresent. This is a paradox, since the observer would in-turn meet the very definition we set for God. Therefore, my argument is: Premise 1 (P1): Non-existence affirms that there is no observational evidence available P2: To prove that there is no observational evidence, the observer would need to be both omniscient and omnipresent. P3: An omniscient and omnipresent being would be God P1 >> P2 >> P3 >>C1: Proving non-existence using observational evidence can only be accomplished by God. P4: Science requires observation, experimentation, and the scrutinization of evidence P4 >> C1 >> C2: Science requires God to prove God\"s non-existence Science cannot disprove God\"s existence because science requires a logically impossible and contradictory accomplishment in requiring observation of that which cannot be observed and evidence of that where no evidence is available and similarly, in requiring an element from the natural and physical world to take a stance on an element of the supernatural world. I look forward to Con\"s argument. Thanks. [1] [2] [3]"],"PremiseEndPos":[4207],"ArgumentID":"00000002","Conclusion":"Science cannot disprove God","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":115,"ConclusionEndPos":142,"nextID":"00000004","PremiseStartPos":[4222],"prevID":"00000002","Premise":["Thanks for the round 2 arguments. I\"ll provide my rebuttal below. OPENING STATEMENT My argument, outlined in ROUND 2, can be summed as the logical proof: Something that utilizes observation to prove cannot prove something that cannot be observed. This resolution is extremely simple. It was almost simple enough that I would have discounted it as hollow truism was it not for at least one taker. The intension of this debate is to examine the objective of science. What is the purpose of science and, specifically, when is science indifferent on a subject. This debate does not concern itself with the question of God\"s existence. In fact, whether the resolution is accepted or not, the question of God\"s existence will remain unanswered. We are only concerning ourselves with one question: can science disprove God. My opponent\"s tactic so far has been to load his shotgun and shoot us with a canned version of your typical atheistic theological arguments against the existence of God. He hopes that at least something from the mix will stick. Unfortunately, nothing does and most of CON\"s arguments aren\"t relevant within the scope of this debate. REBUTTAL GOING FORWARDS A) Whether the reworded resolution is a double negative or not, is of no consequence. The rewording is independent of my argument. In believing this to be a tactic to distract the voters from the merits of my argument, I am ok with keeping the original wording as it has no overall affect. My argument remains the same, although I will reword the first premise and the first conclusion for clarity. Premise 1 (P1): Disproving God\"s existence affirms that there is no observational evidence available P2: To prove that there is no observational evidence, the observer would need to be both omniscient and omnipresent. P3: An omniscient and omnipresent being would be God P1 >> P2 >> P3 >>C1: Disproving God\"s existence using observational evidence can only be accomplished by God. P4: Science requires observation, experimentation, and the scrutinization of evidence P4 >> C1 >> C2: Science requires God to prove God\"s non-existence B) As to CON\"s affirmation that my argument is \"A cannot disprove X\": This argument commits the straw-man fallacy. This argument is conveniently simplified to exclude the restrictions set upon A and X. To reform CON\"s argument correctly: A, which utilizes observation and evidence, cannot disprove X, which requires that no observation or evidence exists. BLACK SWAN FALLACY The black swan fallacy is not applicable to my argument. There is no possibility that science will ever disprove God because it is, as I have shown, logically impossible. CON\"s use of the black swan fallacy here is tantamount to stating that we should not discount the possibility that a three sided square exists somewhere in the universe. A three sided square cannot exist, and we do not need to scour the universe to determine so. It is not logically possible because a square is restricted to having four sides by its definition. Similarly, Science is restricted to the use of evidence and observation. It is logically impossible to examine the evidence of non-existence without being both omniscient and omnipresent. GOD OF THE GAPS - ARGUEMNT FROM EITHER OR Both of these arguments are exactly the same, but CON has worded them slightly differently. CON argues that at some point, our scientific knowledge may push God out of necessity. While this is true, as our knowledge of the universe grows our ability to credit God may decrease. The gap that He fills would decrease inversely to the growth of our understanding. However, that gap would not close until we reached a point where we had an understanding of all things (become omniscient ourselves). Even at this seemingly impossible point, we could still not disprove God through scientific means. He can exist without evidence. Therefore, even if, in our omniscient state, in finding no evidence of God we would still be doubtful of his existence or non-existence. THE SHIFTING ARGUMENT - THE BURDEN OF PROOF Unfortunately science will not disprove any of those creatures, if we consider them to be above the laws of nature and essentially meet the definition of God. We cannot prove, by means of observation, non-existence; it is illogical. CON argues that this then then opens us up to the belief in any being, whether a smurf or closet monster, that arises from his mind. He asks, \"Are you saying that I need to go to every closet in the existence to prove my son wrong?\" This argument commits the affirmative conclusion from a negative premise fallacy. Remember, we are not working to prove the affirmative, that any being exists. We are only taking a stance on the limitations of science and specifically, of physical evidence and observation. Although science cannot disprove God, as I have shown, we cannot draw the conclusion the God exists. The burden of proof for existence falls on the simpler theory with fewer assertions, a universe with no supernatural beings. Therefore I would tell your son, \"There has never been a shred of evidence found that supports the existence of a closet monster, therefore we should not believe that one exists.\" Thanks again CON. I look forward to reviewing your rebuttal."],"PremiseEndPos":[9480],"ArgumentID":"00000003","Conclusion":"Science cannot disprove God","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":115,"ConclusionEndPos":142,"nextID":"00000005","PremiseStartPos":[9495],"prevID":"00000003","Premise":["FINAL REMARKS I would like to remind CON that, per the rules accepted in the first round, neither he nor I can introduce any new arguments. The final round is for the final rebuttal and closing statements. I would also ask the judges to reject, at their discretion, any sources or evidence that CON presents in the final round. Most judges would consider introducing evidence or sources in the final round bad form if not bad conduct since it would not permit me the ability to cross examine. FINAL REBUTTAL What can be asserted without evidence can be dismissed without evidence. CON affirms that we should negate the resolution due to lack of evidence. I have provided the necessary evidence that supports each premise and that demands that we hold the resolution true. This is a curious allegation by CON, as he has not presented a single shred of evidence to back the counter arguments. While I have the full burden of proof, CON\"s counter arguments still need to be supported by adequate evidence. We are nearing the end of the final round; a four round debate. Yet, CON has only provided a single source for his arguments. A Google definition, in which he waited until the end of the third round to offer. Ironically, the definition matches the one I presented in the opening round. Con has not presented any arguments with substance. He continually claims that science can disprove closet monsters, gay pixies and God but hasn\"t actually provided any evidence to support this claim. While this is not an adequate argument for my resolution, such would be ad ignorantiam, but it does beg that the judges ask themselves: isn\"t this reason enough to dismiss the counter arguments instead? The intension of this debate is to examine the objective of science CON claims that, \"Science does not have an intention, it\"s a methodology.\" However, my statement was misconstrued by CON. My statement was that this debate had an intention. Science is a methodology, and it has its limitations as such. These limitations were defined in the opening round, but CON defines them again for us in ROUND 3. Science is the systematic study of the structure and behavior of the PHYSICAL and NATURAL world through OBSERVATION and EXPERIMENT. How can science, limited to observing the natural world, study a supreme being that exists above and beyond nature? How can we study the evidence of non-existence? These are logical contradictions that are the basis of my argument; utilizing the definitions of \"science\" and \"God\" from my opening round. CON\"s argument here begs the question, why did he wait until nearly the end of the debate to define such an important term? An even larger oddity: why did CON present the same definition, word for word, as I did in the opening round? Did CON not realize that his definition matched? Has he not paid attention to such a key component of this debate? I don\"t know for sure, but this incident does create some incredulity on the part of CON\"s counter arguments. What is the purpose of science and, specifically, when is science indifferent on a subject I did not state, as CON claims, that science had a personality. It does have a purpose and an objective. The purpose and objective are outlined in the very definition that CON and I presented: to study the structure and behavior of the physical and natural world. We can also, thereby, make the conclusion that science is not effective at understanding the supernatural world. We are concerning ourselves with one question: can science disprove God CON has misconstrued my statements here, as well. I have not claimed that we have no means to study God. In fact, I have no doubt that it is one of the most studied topics in human culture. It cannot, however, be studied by science. We use philosophy, specifically metaphysics or theology. Theology is the study of the concepts of religions and God-deitites. You can find philosophical arguments for and against the existence of God, but you will never find a scientific paper that disproves God. My opponent\"s tactic so far has been to load his shotgun and shoot us with a canned version of your typical atheistic theological arguments against the existence of God To CON: I do apologize if you took offense to this statement. I believe that this resolution can be accepted by both atheists and theists. It does not take a stance on the existence or non-existence of God. It was not a subjective judgement; my comment was regarding the legitimacy of your arguments. I was merely conveying that, if there was an \"Atheists Cookbook\" of common arguments against the existence of God, that you had blindly copied the first five pages into your arguments. Your arguments have been aligned with proving or disproving gay pixies and the closet monster but have largely ignored the main topic, the limitations of science. My closet monster has special privilege CON claims that the realm of science is discovering truth and that you can apply scientific methodology to supernatural claims. While science\"s objective is most definitely rooted in finding truth, it accomplishes this specifically with the intense scrutiny of evidence. Science, by both my and CON\"s definition, is limited to the natural universe and as such cannot be applied to supernatural claims. Non-existence, by definition, demands that no evidence exists. It is, therefore, a contradiction to study non-existent evidence. Black Swan Fallacy My claim was not that the existence or non-existence of God is unknowable but that it is logically impossible to make such a conclusion through scientific study. The Black Swan Fallacy dictates that, \"Every swan that I have ever seen is white; therefore; there are no black swans.\" The fallacy is an appeal from ignorance; it asserts that a proposition is true because it has not yet been proven false. It ignores the possibility that there is insufficient information to prove the proposition either true or false. This fallacy cannot be applied to propositions that are logically true and require no investigation. For instance: the proposition that a logical statement cannot simultaneously be both true and false or the proposition that there are no three sides squares do not require any additional investigation or information. By the definition of true and false or the definition of a square, we can prove these propositions true without having to scour the universe. Similarly, there is a contradiction that is logically true in my resolution. We cannot study evidence of non-existence. God of the Gaps - Argument from Either Or The question you are referring to, between Ken Ham and Bill Nye, was whether or not creation is a viable model of origins in today\"s modern scientific era. This question is completely outside the context of this resolution. Both Mr. Ham and Mr. Nye are debating historical occurrences in the natural world; occurrences within the realm of science. I\"m not sure if you read my opening statement for this debate, but I actually mentioned this exact topic. \"The realm of religion and the realm of science do sometimes overlap when religion takes a stance on an element of the natural world, such as the age of the earth, the origins of humanity, the relationship between the sun and earth, etc.\" If you asked Mr. Nye what would change his mind on the existence of God, he would almost surely have the same answer: evidence. However, if you asked him instead why he didn\"t believe in God, I have confidence that he would say: because the burden of proof lies on the simpler theory with fewer assertions. A universe absent of supernatural beings certainly is simpler. Mr. Nye would most definitely not say that he does not believe in God because science has proven that supernatural beings could not and do not exist. God of the Gaps and Argument from Either Or are the same arguments, with regard to this resolution, because they rely on the possibility that somewhere there exists information that is contradictory to the resolution in question. This is not true for this resolution because, if false, the resolution would contradict the very definitions we have included for God and science. It would be a contradiction to find evidence of non-existence. CON rejects the claim that God can exist without evidence. This is not surprising, since this very notion is critically damaging to every counter argument that he has presented. This, however, does not mean that \"He can exist without existing, \" as CON claims. Our definition states that God is supernatural and therefore, by definition, he is ABOVE NATURE. He is omnipotent and therefore can exist without evidence to us. CLOSING STATEMENTS My resolution only permits that you, the judges, use logic and it does not require that you abandon your belief or disbelief in God. Whether you hold the resolution true or not, we are not left with an answer on the existence or non-existence of God. We only need to consider the contradiction in terms to determine that this resolution is true and that there is no amount of information that could be gathered to prove otherwise. To study and scrutinize the evidence of absence is a contradiction. For the understanding of the structure and behavior of the natural world to also include the supernatural would be a contradiction."],"PremiseEndPos":[18795],"ArgumentID":"00000004","Conclusion":"Science cannot disprove God","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":115,"ConclusionEndPos":142,"nextID":"00000006","PremiseStartPos":[18810],"prevID":"00000004","Premise":["Sorry for the delay in accepting things, I have a 9 year old who likes to argue as much as most people here, though this is more fun to debate then \"should I have a bath.\" and \"Why are we here (kfc not Mcdumps)?\" Thank you for very continuing the debate. . . I actually really wanted to see how this stood with someone who was actually willing to discuss that."],"PremiseEndPos":[19171],"ArgumentID":"00000005","Conclusion":"Science cannot disprove God","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":115,"ConclusionEndPos":142,"nextID":"00000007","PremiseStartPos":[19186],"prevID":"00000005","Premise":["Dear Pro Thanks for the follow through. Between beers, bars and burgers this is an interesting claim, because it has a built in pre-supposition that seems un-falsifiable, but when examined yet again to its conclusion is very easily shown to be false. Some of these are quoted from the previous debate. Going forwards Shifting the burden of proof Science cannot disprove god vs Science cannot prove Gods non-existence.” “Science cannot disprove god” is not a double negative. Very simply “A cannot disprove x.” Which is silly because we use do this all the time, did aliens make the sun rise, and was god needed for evolution to occur. What you doing by saying Science cannot prove Gods non-existence is shifting the burden of proof. And as you are arguing everything after from that point you have not a) made any claims that further the original claim. B) Have not provided an argument for the original claim. Black Swan Fallacy of argument 1. Science cannot disprove god. I have never seen an answer to the question so one must not exist. Just because it hasn’t yet, doesn’t mean that it will not in the future. 2000 years ago people believed Lightening, planetary formation and evolution were all unknown. However as the knowledge from science has progressed things went from unknowable to unknown, to known. They are now all fields of study. Argument from Ignorance or God of the Gaps Science cannot disprove god. What about Transitional Fossils? Though slightly different then Black swan, is God of the Gaps. Rather then I don’t know of any answer other than god, you have placed god into the tiny spots between what we know. There is a gap in understanding, be it a transitional fossil, the development of morality, the big bang, the cause must be supernatural and in this case god. However as Scientific knowledge has expanded the realm of god has shrunk to ever smaller proportions. - At a certain point our knowledge may push god out of necessity. Argument from Either Or One of these theories is not like the other. Gay pixies named bob who eat spaghetti did it. Even if science doesn’t disprove god, it can prove something else was responsible. I’m going to pay a little homage to Douglas Adams here and the Atheist Experience. Science may prove something else created existence like - possibly that self-replicating gay pixies named bob who live on the sun made the universe with the help of pan dimensional beings that exist in our universe as mice. If this is true, it negates God. – If mice did it, you don’t need god. The Shifted Argument Science cannot disprove an undefinable thing. How many ignostics does it take to change a light bulb? Even If you switch the terms you are still left with a number of problems. Could science ever disprove Gay pixies will the sun to rise, could science ever show that plants will the sun to exist so they have something to give them energy? This is the quality of claim that you are defending. IF you replace GOD with anything equally stupid as a concept, you can see the basic flaw in your argument even with shifting the burden of proof. Again your first claim Non-existence affirms that there is no observational evidence available Closet monsters, Smurfs and God are equally valid because you don’t ever disprove them So by following your logic with another subject, smurfs which are described as having the ability to hid their existence should not be ruled out because we can’t disprove them because science can’t examine every aspect of the universe? Again, you seem to confuse unknowable vs Unknown and confidence and certainty. Again, you’re coming from a pre-suppositional point of view. However let’s put this in to another way. When my son was little he would swear there is a Skittery monster (an omnipotent and all seeing monster by every definition that smelled of my grandmother) was in the closest watching him and judging him. This monster obviously by his description had magical powers and could teleport at will. Which is why when I open the door and put on lights, no monster. By going through the non-evidence, his burning body (no scorch marks in the closet), his giant wings (nothing disturbed), the smell of rotten laundry could be confused with a monster, however this self-described monster smelt like my grandmothers perfume. So again, no evidence showing him, however there is ample evidence that the monster is a logical, ration and fear based response of the fear of the dark, based off evolutionary creatures who see patterns where there is none. Using the scientific method we examine things (including concepts which are separate from the natural world) to see if these things hold true. Are you saying I need to go to every closet in existence to prove my son wrong? Science is a methodology, however it has debunked many supernatural things like homeopathy, pixies, loch ness, yet you claim special privilege for a particular closet monster concept. You also claim - To prove that there is no observational evidence, the observer would need to be both omniscient and omnipresent Besides that Omniscient is non-sensical (because you would also have to know two contrary things) like a round square. I don’t need to see all squares to know all squares have four sides of equal size. That’s the definition of the concept. Also by definition a square and circle cannot be the same thing. But this is what you’re saying with the god concept, a thing that breaks everything known to be true and has contradictory aspects exists and that it’s unfalsifiable. By definition something that is self-negating for everything else you’re claiming special privilege. That alone lets us examine the god claim in a naturalistic realm, the purview of science. So the original claim has not been addressed and the first two steps in your other claim have also been addressed, from which all your argument follows. So were back again to me rejecting the claim “science cannot disprove god”. to my response it has for other magical creatures . . ."],"PremiseEndPos":[25204],"ArgumentID":"00000006","Conclusion":"Science cannot disprove God","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":115,"ConclusionEndPos":142,"nextID":"00000008","PremiseStartPos":[25219],"prevID":"00000006","Premise":["Dear Pro and audience. Thank you for paying attention through this debate. I know is a length read and very dry. And I would like to assure you that my sons closet monster is not to treat this subject lightly, but to point out comparatively what Pro is defending and saying is beyond the realm of science. I hope you will stay through to the end and vote (either for me or pro). I appreciate your attention. “What can be asserted without evidence can be dismissed without evidence.\" – Christopher Hitchens. The perception of the double negative is not a distraction but shows the presumptive view of the whole argument and a flaw Pro's case. The original premise of pro is Science cannot disprove god. Can science disprove the closet monster, loch ness or gay pixies on the sun? I believe it can and has. And if it can dismiss other supernatural closet monsters why not one more? Pro- The intension of this debate is to examine the objective of science. Science does not have an intention, it’s a methodology. Google definition is the intellectual and practical activity encompassing the systematic study of the structure and behavior of the physical and natural world through observation and experiment. Pro - What is the purpose of science and, specifically, when is science indifferent on a subject. Your applying that a methodology of examine the universe has an intent and personality. Which is not true and slightly biased. Science is not indifferent. You are implying that a methodology that is effective at understanding can’t understand something. Pro - We are only concerning ourselves with one question: can science disprove God. And so far you have not provided a why or evidence that it cannot, you have only restated, science cannot study it because it is un-studyable. To which I have shown you several logical fallacy’s, black swan, gaps and closet monsters. To which your response has been Pro - My opponent’s tactic so far has been to load his shotgun and shoot us with a canned version of your typical atheistic theological arguments against the existence of God. I didn't state there is no god. I’m' not sure that there is or isn't a god, I have yet to be convinced and seen no evidence that is not in some way flawed. It’s also not part of the debate, what pro is attempting to do is equate my personal belief with that of the argument itself. The argument is can science disprove God and by equating his lack of argument as my fault (a shifting of the BOP). However I would point out that pro is making a Subjective judgment, based on personal opinions, interpretations, points of view, emotions and judgment. My objection is based on logic and reason and analysis. What I’m doing is showing that there is a logical fallacy in your claim. They are not Atheistic rebuttals, there just effective rebuttals to a poor claim you have yet to provide support for. My closet monster has special privilege Pro - This argument is conveniently simplified to exclude the restrictions set upon A and X. To reform CON\"s argument correctly: A, which utilizes observation and evidence, cannot disprove X, which requires that no observation or evidence exists. My son has a closet monster that is all powerful that cannot be observed and is powerful enough to avoid detection. Do you believe that the monster exists? Or do you have a reasons to show why no monster exist? This is not a straw man argument on my part, my object still stands. What you’re doing now is special pleading. You’re claiming that your closet monster has greater standing in being disproved by science because of the conviction of your beliefs and popularity and logical inconsistent and non-sensible assumptions. You would not suggest that the closet monster cannot be dismissed by the naturalist methody of study of science do you? I turned on the lights, checked the closet, I understand this is a common fear from all children at the same age, ext, ext. This is completely the realm of science, discovering the truth. You apply it to a number of supernatural claims, I just suggest that it may go one claim further. BLACK SWAN FALLACY You claim - There is no possibility that science will ever disprove God because it is, as I have shown, logically impossible. (the whole paragraph) You haven’t shown it, you just repeated it. Ad nausea. What I’m stating is just because PRO has not seen the answer doesn’t mean one may not exist. Again, you say something is unknowable, how do you demonstrate this. You presumed your right and went to circle logic. Just because its unknown doesn’t mean its unknowable, you have to show how its right. GOD OF THE GAPS - ARGUEMNT FROM EITHER OR You claim - Therefore, even if, in our omniscient state, in finding no evidence of God we would still be doubtful of his existence or non-existence. So what you’re saying is basically ken ham vs Bill Nye when asked what would change your mind, ken ham said “nothing” Bill Nye “evidence.” What you are claiming is we to stupid to figure stuff out, and that there is a limit to our intelligence. Which is fine, but I’m asking for proof of your claim. God of the Gaps and either or. . . . I see after reading your claim, the reason you think GAPS argument and Pixxies argument are similar is your presume your point of view is valid. One states that god is not required and the other has that pixies did it. They are completely different. This flaw in your perception does not equate to negating my rebuttal. Also again, unknown vs unknowable. I reject your claim of HE CAN EXIST Without Evidence. What you are arguing is “HE CAN EXIST WIHTOUT EXISTING” if he exists then he’s measurable in some way, and if measurable then he clearly falls within natural realm and study able. On a side note - Pro seems to fail to grasp the Law of non-contradiction and principle of non-contradiction. A is a circle, b is a square, two propositions \"A is B\" and \"A is not B\" are mutually exclusive. If god possess a property of anything, be it all powerful or ageless or pink, that means he can be studied. Also I didn’t claim a 3 sided square was possible as pro asserts, what I’m saying is that I don’t need to have absolute knowledge to know a rectangle having all four sides of equal length is a square where ever in the universe, and a square and a circle are two different things that are not the same. I don’t need absolute knowledge, just enough to understand the difference between I don’t know and no one can ever know. Which is by the way what pro is claiming, we cant ever known and no method of understaning, evidence ever will contradict that possisiton."],"PremiseEndPos":[31831],"ArgumentID":"00000007","Conclusion":"Science cannot disprove God","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":115,"ConclusionEndPos":142,"nextID":"00000000","PremiseStartPos":[31846],"prevID":"00000007","Premise":["Dear Pro and All . . . . After several rounds I would like to thank everyone for following this. I would like to also thank anyone that votes. I totally appreciate your time and effort to follow this. As such, I’m going to keep my rebuttal somewhat brief. Also compraing the closet monster to god, and vice versa is not to talk down to the audience or pro, but to illistrate the absolute sillyness of the claim pro takes. Science cannot disprove the closet monster. Black swan – How do you know that science cannot provide an answer? Just because you dont know of something, doesnt mean it doesnt exist, or someone else doesnt know the answer. Black Swan #2 – Pro is claiming that you can’t study non-evidence, there is no evidence of a closet monster by definition. If you think science can disprove the closet monster but you still believe pro’s claim. Special privilege – if you accept that closet monster (or any other non-evidence imaginary creature) can be dismissed but not your god, then your claiming special privilege. Ignorance or Gaps – You need to check every closet, even those not made yet, to prove there is no closet monster. That no matter what evidence, you can always claim further ignorance or gaps. Transition fossils – Daddy, there are gaps in the understanding of what the closet monster is, who knows what he can do or his ultimate powers, he’s the closet monster. Gay pixies named bob – Science shows that it wasn’t the closet monster, but something else, so science gave an answer other then god, and disproved god. Unknown vs Unknowable – Pro claims you don’t know, and you can never know that the closet monster doesn’t exist. Just like individuals claim lightening and evolution 400 years ago. Which again is unsupported, despite the numerous ways and sincerity of the claim. Straw man of Science – Pro has demonstrated a lack of understanding of science. (see following point) Logical – As i have pointed out, Logic is not of the material natural world, yet it can be tested by science. Logic can be tested by the scientific method despite its non-material existence. God has attributes that exist (as given by pro) and can be tested, aka science, to see if they are valid. This is part of the methodology of science, pro just rejects the results and claims and contradiction that would eliminate his closet monster. Atheistic arguments – Pro is a pre-suppositional and implies that my arguments are biased because of my lack of belief, and asks to put aside your views on god. My belief on god has nothing to do with this debate. There is no need to apologize and you’re absolutely right, there is no theist vs a-theist debate here. If you made an equally unsupported claim, I would use the same webpage that has a list of logical fallacy’s to point out the fault in that argument to. Bill nye - Your conflating the individual with the argument, which you have done in the argument and missed the point (or Im really too subtle for my own good). Your presuming your first claim is true and proceed. What I’m asking for is the necessity and evidence of your 1st claim. You can be logically coherent but your starting point still false. I’m going to paraphrase my son and Pro My Son and Pro claim that the Closet Monster/God can exist without evidence. You cannot use a methodology of understanding (science) to disprove this being or study it. Not only that you cannot question the closet monster/god, and you can’t falsify him. My son and pro refuse to accept that turning on the lights, knowing why children are afraid of the dark, and other acts (science) can disprove the Closet monster/ god because he’s just too smart at hiding his existence. Also the sincerity of my belief says it’s real. He exists without evidence and leaves no trace, despite we know his existence in my closet/life. And if you turn of the lights on / reason \"He can exist without existing, and evidence, despite contrary claims.\" Our definition states that closet monster / God is supernatural and therefore, by definition, he is ABOVE NATURE, because that means something that scape goats everything. He is omnipotent and therefore can exist without evidence to us. And you can never show me I’m wrong, ever no matter what you say. I’m sure that many of us were little we believed in the closet monster. My son believes in the closet monster. I do not leave the light on for my son for reasons sake (and he’ll never sleep). And for reason sake you should vote con, not because of shot gun atheist arguments, but a list of logical, reasonable and solid fallacy’s that Pro relies on."],"PremiseEndPos":[36438],"ArgumentID":"00000008","Conclusion":"Science cannot disprove God","PremiseStance":["Con"]}}]}