{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-earth-is-hundreds-of-years-old/1/\nCrawl date: 2016/09/29 06:24:28\nDebate Argument: The earth is hundreds of years old | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: This will be a great, quick debate. Some history and info on debating: See also: Discourse For discussion in Wikipedia, see Wikipedia:Talk page. \"Debates\" redirects here. For the United States presidential election debates, see United States presidential election debates and United States presidential election debates, 2012. For the American band, see Debate Team (band). This page has some issues A Debate among Scholars Razmnama illustration Debate is contention in argument; dispute, controversy; discussion; especially the discussion of questions of public interest in Parliament or in any assembly.[1] Debate is a method of interactive and representational argument. Debate is a broader form of argument than deductive reasoning, which only examines whether a conclusion is a consequence of premises, and factual argument, which only examines what is or isn't the case, or rhetoric, which is a technique of persuasion. Though logical consistency, factual accuracy and some degree of emotional appeal to the audience are important elements of the art of persuasion, in debating, one side often prevails over the other side by presenting a superior \"context\" and/or framework of the issue, which is far more subtle and strategic. The outcome of a debate depends upon consensus or some formal way of reaching a resolution, rather than the objective facts as such. Round one in this debate is for acceptance only, anything other than \"I accept\" will result in forfeiture of this debate and will declare the proponent the winner. In a formal debating contest, there are rules for participants to discuss and decide on differences, within a framework defining how they will interact. Debating is commonly carried out in many assemblies of various types to discuss matters and to make resolutions about action to be taken, often by a vote. Deliberative bodies such as parliaments, legislative assemblies, and meetings of all sorts engage in debates. In particular, in parliamentary democracies a legislature debates and decides on new laws. Formal debates between candidates for elected office, such as the leaders debates and the U.S. presidential election debates, are sometimes held in democracies. Debating is also carried out for educational and recreational purposes, usually associated with educational establishments. The major goal of the study of debate as a method or art is to develop the ability to debate rationally from either position with equal ease. Although informal debate is common the quality and depth of a debate improves with knowledge and skill of its participants as debaters. The outcome of a contest may be decided by audience vote, by judges, or by some combination of the two. ----------- I have evidence to assert my position for this debate and hope I get a worthy opponent :)\n\nEvidence Pro: \"Round one in this debate is for acceptance only, anything other than \"I accept\" will result in forfeiture of this debate and will declare the proponent the winner.\"\n\nEvidence Con: Sorry I posted this in the comments on accident as well by mistake Accept. Remember as per the name of this debate \"The earth is hundreds of years old\", you are stating the earth can be no older than 999 years. Thousands would infer a different numerical value.\n\nEvidence Con: Where as you never stated that Round was for acceptance only and that I was not allowed to inquire about clarification in your R1 stance, I was justified in establishing the terms of the debate. Also now that this has somehow skipped to round 3, I will pose my argument. (1) Logic (1) We are currently in the year 2013. As I clarified in my acceptance. Pro states that the earth is \"hundreds\" of years old, this means that for this argument we are debating that the earth is less than 1000 years old. Since we have countless historical documents and evidence that shows that people were alive for more than 1 thousand years, I conclude that there is no way to refute this. I am sure this would have been an interesting debate , and pro would have used semantics and tried to joust me with words. Since pro accused my R1 stance as a breach in conduct, when this was unjustifiable, and not shown within his R1 stance he has wasted his argument In closing. I have show that the earth is more than 1 thousand years old and pro has offered no evidence to support this hypothesis. Therefore I have nothing to refute and my point stands. Vote Con!\n","DiscussionID":"00000010","Title":"The earth is hundreds of years old","CrawlDate":"2016/09/29 06:24:28","URL":"http://www.debate.org/debates/The-earth-is-hundreds-of-years-old/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":156,"nextID":"00000002","PremiseStartPos":[208],"prevID":"00000000","Premise":["This will be a great, quick debate. Some history and info on debating: See also: Discourse For discussion in Wikipedia, see Wikipedia:Talk page. \"Debates\" redirects here. For the United States presidential election debates, see United States presidential election debates and United States presidential election debates, 2012. For the American band, see Debate Team (band). This page has some issues A Debate among Scholars Razmnama illustration Debate is contention in argument; dispute, controversy; discussion; especially the discussion of questions of public interest in Parliament or in any assembly.[1] Debate is a method of interactive and representational argument. Debate is a broader form of argument than deductive reasoning, which only examines whether a conclusion is a consequence of premises, and factual argument, which only examines what is or isn't the case, or rhetoric, which is a technique of persuasion. Though logical consistency, factual accuracy and some degree of emotional appeal to the audience are important elements of the art of persuasion, in debating, one side often prevails over the other side by presenting a superior \"context\" and/or framework of the issue, which is far more subtle and strategic. The outcome of a debate depends upon consensus or some formal way of reaching a resolution, rather than the objective facts as such. Round one in this debate is for acceptance only, anything other than \"I accept\" will result in forfeiture of this debate and will declare the proponent the winner. In a formal debating contest, there are rules for participants to discuss and decide on differences, within a framework defining how they will interact. Debating is commonly carried out in many assemblies of various types to discuss matters and to make resolutions about action to be taken, often by a vote. Deliberative bodies such as parliaments, legislative assemblies, and meetings of all sorts engage in debates. In particular, in parliamentary democracies a legislature debates and decides on new laws. Formal debates between candidates for elected office, such as the leaders debates and the U.S. presidential election debates, are sometimes held in democracies. Debating is also carried out for educational and recreational purposes, usually associated with educational establishments. The major goal of the study of debate as a method or art is to develop the ability to debate rationally from either position with equal ease. Although informal debate is common the quality and depth of a debate improves with knowledge and skill of its participants as debaters. The outcome of a contest may be decided by audience vote, by judges, or by some combination of the two. ----------- I have evidence to assert my position for this debate and hope I get a worthy opponent :)"],"PremiseEndPos":[3018],"ArgumentID":"00000001","Conclusion":"The earth is hundreds of years old","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":156,"nextID":"00000003","PremiseStartPos":[3033],"prevID":"00000001","Premise":["\"Round one in this debate is for acceptance only, anything other than \"I accept\" will result in forfeiture of this debate and will declare the proponent the winner.\""],"PremiseEndPos":[3199],"ArgumentID":"00000002","Conclusion":"The earth is hundreds of years old","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":156,"nextID":"00000004","PremiseStartPos":[3214],"prevID":"00000002","Premise":["Sorry I posted this in the comments on accident as well by mistake Accept. Remember as per the name of this debate \"The earth is hundreds of years old\", you are stating the earth can be no older than 999 years. Thousands would infer a different numerical value."],"PremiseEndPos":[3476],"ArgumentID":"00000003","Conclusion":"The earth is hundreds of years old","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":156,"nextID":"00000000","PremiseStartPos":[3491],"prevID":"00000003","Premise":["Where as you never stated that Round was for acceptance only and that I was not allowed to inquire about clarification in your R1 stance, I was justified in establishing the terms of the debate. Also now that this has somehow skipped to round 3, I will pose my argument. (1) Logic (1) We are currently in the year 2013. As I clarified in my acceptance. Pro states that the earth is \"hundreds\" of years old, this means that for this argument we are debating that the earth is less than 1000 years old. Since we have countless historical documents and evidence that shows that people were alive for more than 1 thousand years, I conclude that there is no way to refute this. I am sure this would have been an interesting debate , and pro would have used semantics and tried to joust me with words. Since pro accused my R1 stance as a breach in conduct, when this was unjustifiable, and not shown within his R1 stance he has wasted his argument In closing. I have show that the earth is more than 1 thousand years old and pro has offered no evidence to support this hypothesis. Therefore I have nothing to refute and my point stands. Vote Con!"],"PremiseEndPos":[4632],"ArgumentID":"00000004","Conclusion":"The earth is hundreds of years old","PremiseStance":["Con"]}}]}