{"MetaData":{"Context":"URL: http://www.debate.org/debates/Death-Penalty/223/\nCrawl date: 2016/09/29 03:08:41\nDebate: Death Penalty | Debate.org\nNumber of arguments: 5\n\n\nEvidence Pro: Well, we are more than likely killing a guilty person. The fact that we won't ever have to risk that inmate escaping prison, terrorizing other inmates, or roaming the streets again is satisfying. People should pay the consequences for their crime, and especially when their crime is serial murder. You've taken the lives of people, several people usually, and ruined the live's of those people's families. What about the costs of the funeral, what about life insurance, what about the student loans that never got paid back? Someone needs to pay, and they need to pay hard. Not only that, a capital case is usually more expensive, but it's after the case. Your tax dollars for the rest of that criminals days goes to housing him. You're basically paying(I think yearly), for a place to stay for the guy who raped sally sues 4 year old daughter. Also, there's usually several years of time before murderers get their rightful judgement. Sometimes even 20 years, before an inmate receives the death penalty. That's plenty of time for an innocent man to appeal to the court, but if he doesn't get those appeals accepted, then it wouldn't matter. He wouldn't leave jail anyway...just like he wouldn't live. Unfortunately, mistakes happen, but theirs plenty of good to come from the death penalty.\n\nEvidence Pro: Apologies, con. No, I meant that during a case that capital punishment is more expensive. But for life in prison the case is 740,000, and then an added 90,000 for every year that prisoner is left to rot. Meaning that after 10-15 years, the one person is executed at the same cost as someone spending life in prison, with the person still alive having most likely many years more. Also, the constitution says that once you're imprisoned some rights get taken away. Similar to how you took away the rights to someone else. Why if someone else gets their right to life taken away, why shouldn't they get their life taken away.\n\nEvidence Con: Just debate all rounds, even the first one. We are killing a person! What if that person was innocent? There are many cases of innocents. It shows that there are 148 cases of this, and 4.1 percent are innocents! href=\" target=\"blank\"> This is a lot of people! If we kill any of these innocent people, we cannot return them. We should rather but these people in jail, not killing them. This is because the death penalty costs a lot, look at this. \"Cases without the death penalty cost $740,000, while cases where the death penalty is sought cost $1.26 million.\" is a lot of money!!! We can just put them in jail, it saves a lot, and if they are innocent, we can take them out of jail, put we can't take them out of their grave!!! So death penalty should not be allowed!!!\n\nEvidence Con: I will post my rebuttals this round. Pro says that we are most likely going to kill a guilty person. As I said, guilty person, innocent person, all people have the right of life. Death penalty violates this rule. Pro says that we have to make them pay for killing, and murder. We should rather just make them to a full-life prison, it will cost less. And anyways, there isn't much difference to a full-life of prison and to die. The cost is different, as I showed, really different, so we should just setence them to a full-life prison, because we don't kill anyone, and we can always bring them back if innocent. Pro says that a capital case is more expensive. You are literally arguing my side!!! More expensive means bad, and you concede that, so please vote for me!!! Pro says that there are many years for the judgement, and the innocents can appeal. Well, then why are these cases? They won't believe them. Pro says, \"He wouldn't leave jail anyway...\" This is false, as I showed that they can leave jail, but they it is impossible to leave from life. are at least many people who will be alive if there was not death penalty, so we should ban it. Pro says that mistakes happen, and there are good things about death penalty. I have shown that the death penalty is bad, it has no good effects. Also, mistakes happen. A terror attack. Mistakes happen. Breaking the Mona Lisa. Mistakes happen. Breaking the eiffel tower. Mistakes happen. Light a house in fire. Mistakes happen. Killing the entire human race. Mistakes happen. Mistakes should not happen, therefore we should ban the death penalty. As a result, vote Con.\n\nEvidence Con: My opponent does not refute my case at all. Extend it. I will refute my opponent's round 2. My opponent shows the cost of the death penalty. However, this is a bare assertion, as my opponent provides no source. I provided a source, and my opponent seems to disagree on this, and provides statistics, but he provides no sources, making it a bare assertion, so there is no reason to buy his, buy mine. Pro says that some laws get taken away if you are imprisoned. Again, this is a bare assertion. Also, the right of life will not we taken away, as everyone has the right of life. In the end, my opponent fails to refute my innocent argument, only saying mistake happen, and I refuted that. He says my cost argument is false, and gives statistics, but it is a bare assertion, when mine are sourced, so vote for Con. Also, my plan was to just put them in jail for the whole time, and Pro fails to refute that. As a result, please vote Con!\n","DiscussionID":"00000074","Title":"Death Penalty","CrawlDate":"2016/09/29 03:08:41","URL":"http://www.debate.org/debates/Death-Penalty/223/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":107,"nextID":"00000002","PremiseStartPos":[159],"prevID":"00000000","Premise":["Well, we are more than likely killing a guilty person. The fact that we won't ever have to risk that inmate escaping prison, terrorizing other inmates, or roaming the streets again is satisfying. People should pay the consequences for their crime, and especially when their crime is serial murder. You've taken the lives of people, several people usually, and ruined the live's of those people's families. What about the costs of the funeral, what about life insurance, what about the student loans that never got paid back? Someone needs to pay, and they need to pay hard. Not only that, a capital case is usually more expensive, but it's after the case. Your tax dollars for the rest of that criminals days goes to housing him. You're basically paying(I think yearly), for a place to stay for the guy who raped sally sues 4 year old daughter. Also, there's usually several years of time before murderers get their rightful judgement. Sometimes even 20 years, before an inmate receives the death penalty. That's plenty of time for an innocent man to appeal to the court, but if he doesn't get those appeals accepted, then it wouldn't matter. He wouldn't leave jail anyway...just like he wouldn't live. Unfortunately, mistakes happen, but theirs plenty of good to come from the death penalty."],"PremiseEndPos":[1452],"ArgumentID":"00000001","Conclusion":"Death Penalty","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":107,"nextID":"00000003","PremiseStartPos":[1467],"prevID":"00000001","Premise":["Apologies, con. No, I meant that during a case that capital punishment is more expensive. But for life in prison the case is 740,000, and then an added 90,000 for every year that prisoner is left to rot. Meaning that after 10-15 years, the one person is executed at the same cost as someone spending life in prison, with the person still alive having most likely many years more. Also, the constitution says that once you're imprisoned some rights get taken away. Similar to how you took away the rights to someone else. Why if someone else gets their right to life taken away, why shouldn't they get their life taken away."],"PremiseEndPos":[2091],"ArgumentID":"00000002","Conclusion":"Death Penalty","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":107,"nextID":"00000004","PremiseStartPos":[2106],"prevID":"00000002","Premise":["Just debate all rounds, even the first one. We are killing a person! What if that person was innocent? There are many cases of innocents. It shows that there are 148 cases of this, and 4.1 percent are innocents! href=\" target=\"blank\"> This is a lot of people! If we kill any of these innocent people, we cannot return them. We should rather but these people in jail, not killing them. This is because the death penalty costs a lot, look at this. \"Cases without the death penalty cost $740,000, while cases where the death penalty is sought cost $1.26 million.\" is a lot of money!!! We can just put them in jail, it saves a lot, and if they are innocent, we can take them out of jail, put we can't take them out of their grave!!! So death penalty should not be allowed!!!"],"PremiseEndPos":[2877],"ArgumentID":"00000003","Conclusion":"Death Penalty","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":107,"nextID":"00000005","PremiseStartPos":[2892],"prevID":"00000003","Premise":["I will post my rebuttals this round. Pro says that we are most likely going to kill a guilty person. As I said, guilty person, innocent person, all people have the right of life. Death penalty violates this rule. Pro says that we have to make them pay for killing, and murder. We should rather just make them to a full-life prison, it will cost less. And anyways, there isn't much difference to a full-life of prison and to die. The cost is different, as I showed, really different, so we should just setence them to a full-life prison, because we don't kill anyone, and we can always bring them back if innocent. Pro says that a capital case is more expensive. You are literally arguing my side!!! More expensive means bad, and you concede that, so please vote for me!!! Pro says that there are many years for the judgement, and the innocents can appeal. Well, then why are these cases? They won't believe them. Pro says, \"He wouldn't leave jail anyway...\" This is false, as I showed that they can leave jail, but they it is impossible to leave from life. are at least many people who will be alive if there was not death penalty, so we should ban it. Pro says that mistakes happen, and there are good things about death penalty. I have shown that the death penalty is bad, it has no good effects. Also, mistakes happen. A terror attack. Mistakes happen. Breaking the Mona Lisa. Mistakes happen. Breaking the eiffel tower. Mistakes happen. Light a house in fire. Mistakes happen. Killing the entire human race. Mistakes happen. Mistakes should not happen, therefore we should ban the death penalty. As a result, vote Con."],"PremiseEndPos":[4515],"ArgumentID":"00000004","Conclusion":"Death Penalty","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":107,"nextID":"00000000","PremiseStartPos":[4530],"prevID":"00000004","Premise":["My opponent does not refute my case at all. Extend it. I will refute my opponent's round 2. My opponent shows the cost of the death penalty. However, this is a bare assertion, as my opponent provides no source. I provided a source, and my opponent seems to disagree on this, and provides statistics, but he provides no sources, making it a bare assertion, so there is no reason to buy his, buy mine. Pro says that some laws get taken away if you are imprisoned. Again, this is a bare assertion. Also, the right of life will not we taken away, as everyone has the right of life. In the end, my opponent fails to refute my innocent argument, only saying mistake happen, and I refuted that. He says my cost argument is false, and gives statistics, but it is a bare assertion, when mine are sourced, so vote for Con. Also, my plan was to just put them in jail for the whole time, and Pro fails to refute that. As a result, please vote Con!"],"PremiseEndPos":[5466],"ArgumentID":"00000005","Conclusion":"Death Penalty","PremiseStance":["Con"]}}]}