{"MetaData":{"Context":"URL: http://www.debate.org/debates/All-victim-less-crimes-should-be-decriminalized./1/\nCrawl date: 2016/09/29 06:07:22\nOnline Debate: All victim-less crimes should be decriminalized. | Debate.org\nNumber of arguments: 10\n\n\nEvidence Pro: Full Resolution: The United States ought to decriminalize all victim-less crimes. Freedom to ones own autonomy is possibly the most commonly regarded right one ought to have.Any kind of law that infringes on ones autonomy must be justified. Examples. Laws against murder are justified because murder infringes on another's autonomy. Laws against marijuana are not justified because using marijuana does not infringe on another's autonomy. ==Definitions== Infringe: An act so as to limit or undermine. Autonomy: Independence or freedom, as of the will or one's actions. Victim-less crime: A legal offense to which all parties consented too. Decriminalize: The abolition of criminal penalties in relation to certain acts. ==Rules== 1. No forfeits 2. Any citations or foot/endnotes must be provided in the text of the debate 3. No new arguments in the final round 4. Maintain a civil and decorous atmosphere 5. No trolling or semantics 6. My opponent accepts all definitions and waives his/her right to add definitions 7. Violation of any of these rules or of any of the R1 set-up merits a loss ==Structure== R1. Acceptance R2. Pro and Con present their case. No rebuttals R3. Rebuttals R4. Rebuttals R5. Rebuttals and conclusion. No new arguments.\n\nEvidence Pro: Thank you Allenn for accept this debate. It is my position that promotes self-interest. The united states government should not have the authority to govern how one chooses to live their life. The only time the government should interfere with ones autonomy is when that individuals self-interests infringes on another's. With this reasoning we can promote freedom to its fullest. -Philosophy- John stuart Mill theorized that, \"The only purpose for which power can be rightfully exercised over any member of a civilized community, against his will, is to prevent harm to others\"[1]. This is what has become commonly known as the \"harm principle\". This is a solid platform for enacting laws while still promoting freedom. The majority cannot rule that slavery be brought back, nor can they discriminate against those with different self-interests that do not harm them. This helps ensure that even the minority, no matter how small, is treated with the same freedom as everybody else. -Legalized \"Harm\"- Consent is an affirmation of ones self-interest. After all, one does not consent to that which they do not want. Only that which goes against one's self-interest should truly be defined as a harm. As such, there can only be a victim if ones autonomy is infringed on. In boxing matches, both participants consent to the fight and understand that both may possibly be injured during the brawl. In this situation it wouldn't make sense to say that the one who gets injured is a victim, because he was well aware of the possible consequences. This can also be said for many physical sports such as football, rugby, or wrestling. Players who get hurt during these sports also cannot press criminal charges because they have acknowledged the harm prior to playing. \"In New York, you can\"t bring a lawsuit for a sports-related injury if, by participating, you assumed the risk of getting hurt.\" [2]. Smoking cigarettes and drinking alcohol are other forms of legalized \"harms\" between buyer and seller. The cigarette boxes themselves must be labeled with warnings so as to inform the individual of the possible \"harms\" they will suffer, the same can be said for alcohol bottles. The government has already acknowledged that people are going to serve their self-interests regardless of what the government thinks (see prohibition), and have instead chosen to legalize and regulate these harms. Further evidence of this can be found from the sudden surge of legalizing not only medical but even recreational marijuana. My state in particular has recently taken the initiative of starting to legalizing marijuana for recreational use [3]. -Promoting freedom- Everything I have stated above has been legalized due to the fact that the individuals who promote them have accepted these possible harms. If consensual harms can be legalized because of the assumed risk and the fact that their is an interest in them, it naturally follows that other crimes with these qualifications, should at-least be decriminalized. Among such crimes include, prostitution, gambling, illicit drug use, assisted-suicide, (formally) sodomy[4]. All of these crimes involve two parties, both of whom have consented to the desired action. Both of each others self-interests are being met. The government shouldn't focus on making or enforcing crimes that go against two consenting parties self-interests, instead they should try to promote some form of regulation for them, or at least make the knowledge of the harms associated with those interests more easily available to the public. The autonomy of the individual is the most important part country of a \"free\" country, considering this is what fuels the nation as a whole. By allowing everybody to maintain their autonomy we ultimately benefit the nation and help ensure equal rights for all. With that being said, I look forward to Cons response. [1] [2] [3] [4]\n\nEvidence Pro: Thank you Con for the response. I will first address Con's case and provide rebuttals where needed, then move on to reaffirming my own case -Con's position- She starts off by stating that \" Anything that harms our individuals is something that we should act against. I think the value of the combination of life, happiness and survival is much more important than the value of freedom, and that we have a duty to promote these values to the fullest.\" This does seem reasonable taken at face value, however this simply is not the case of the reality we live in. I preempt this argument in my last round by stating a number of \"legalized harms\" that the government already acknowledges as something they can't prevent. Be it for revenue purposes or simply ones own right to their autonomy. If we are to utilize Con's train of thought to decide which laws to enact, then one ought to criminalize the use of alcohol, cigerattes, nearly every physical sport, and unhealthy foods like fast food. I think it's rather evident that Con's basis for enacting laws is far to restrictive and would lead to absurdities, which completely go against ones self-interest. If Con truly is for \"life and happiness\", allowing people do serve their self-interest would indeed be the best route, regardless of the harm done to oneself. Throwing survival in her beliefs hurts her case because america is not a utilitarian government, and doesn't go out of its way to make sure everyone lives an optimally healthy life. -Who is the Victim- Con believes that a victim is an individual who has been \"acted on and usually adversely affected by a force or agent\". Although this is essentially the dictionary definition \"victim\", it would not be proper to enact laws based on this definition. As I stated in my previous round, doing this would lead to absurdities such as criminalizing the use of alcohol, cigerattes, nearly every physical sport, and unhealthy foods like fast food. The definition is FAR to over-encompassing to used as a legal basis. I however offer an alternative solution to the definition of the word \"victim\" for legal use, and that is \"that which goes against ones self-interest\". It would also seems that the United States government has already taken a similar train of thought. That is why the use of alcohol, cigerattes, nearly every physical sport, and unhealthy foods like fast food are completely legal already, because people have an interest in these things and the government couldn't hope to enforce it. Instead they regulate is and profit from it, in turn, further helping society as a whole. Indeed, these \"harmful\" activities indirectly benefit society due to someone needing to have a job and spend money to do these. -Defending ALL victimless crimes- Con is correct, I deliberately set this debate up for me to defend ALL forms of victimless crimes. I must defend against any contention she makes against any and all victimless crimes. That is of cource, if they are indeed a \"victimless crime\". Per my definition of victimless-crime, \"A legal offense to which all parties consented too.\" She can not call child prostitution a victimless crime. The age of consent is usually 18, sometime 16 in the U.S [1]. Since a child does not posses the mental faculties to understand the decisions of sex, having sex with a minor is considered rape. Everyone knows rape is not a victimless crime. Drinking and driving are not victimless crimes either. The drunk driver never considers the self-interests of the other drivers on the road. There is no agreement between drivers that the risk is accepted. No rational driver would consent to someone driving drunk to begin with. Tax evasion does not qualify as a victimless crime. People are obligated to pay their taxes when they make money. It is an agreement that has long been kept between the worker and their government. If this agreement is broken, criminal action can be taken. Parties that purchase drugs from their supplier are indeed victimless crimes. Both parties self interests are being met and the assumed risks are accepted by both, much like in a boxing match. If the government ought to criminalize \"any and all drug use\" then it only follows that alcohol be done with entirely [2]. Obviously, this cannot be done (see prohibition). -My affirmation- Since Con has failed to demonstrate a coherent thought process to base laws off of, I believe my position of allowing self-interest to flourish, coupled with the harm principle, stands firm as the logical choice for deciding on what laws ought to be erected. Best of luck to Con! [1] [2]\n\nEvidence Pro: Thanks Con, To begin round 3, Con starts by attempting to move the goal posts. This is a debate about the United States, not some generic government whose basis for creating laws hasn\"t been formed yet. Con believes that all she has to do is put forth her idea of how a government ought to be run, however, she doesn\"t take into consideration how the United States does run. This misunderstanding may be due to Con being relatively new here, so it\"s a good thing we still have two more rounds for rebuttals so she can more directly refute the victimless crimes themselves instead of trying to create a new government order. It should be noted that Con concedes (by not responding) that the government has already legalized certain harms such as boxing, smoking cigarettes, drinking alcohol, and eating fast food, based on one\"s right to freedom or there is a revenue benefit for the government. She provides us with no explanation for why these types of harms should be legal but not the others, such as drug use. Instead, Con simply reaffirms her belief that the government ought to hold life above liberty. The problem with this is that this isn\"t a reflection of our society. If the government DID hold life above liberty, we would see the things I listed above being criminalized because they harm the individual, this is not the case. The United States is called the \"Land of the free\" for a reason. The only time this freedom is not going to be upheld is if it infringes on some else\"s freedom. This is ALREADY the way the United States operates, I am here hosting this debate to merely point out that victimless crimes don\"t infringe on someone\"s freedom, there for there is no reason to make them criminal. Con should disagree with me on this and proceed to prove that these victimless crimes do indeed infringe on someone\"s free will. If she does not, I win the debate. Now that we\"ve stablished that the United States does indeed hold freedom above all else, we can begin examining which crimes do not infringe on another self-interest (freedom). -Victimless crimes- Con has pointed to several examples of victimless crimes that she believes infringe on another persons self-interest. So long as I can prove that this is not the case, I win the debate (justified by R2 philosophy). 1.\" Drug use \" Con provides us with a baseless assertion saying that \"the adverse effects of drug use, especially the worst drugs, outweigh the freedom it gives the person choosing to do it.\" The main reason why this argument doesn\"t hold water, regardless of its truthfulness, is because cigarettes are already legal. Nearly 480,000 deaths occur each year due to tobacco use, including deaths from secondhand smoke [1]. When we compare this to heroin, there is an incredibly huge drop. According to the CDC, only 6,235 deaths were related to heroin use in 2013 [2]. Similarly to how the marijuana legalization arguments go, if the government has legalized a more dangerous substance than the one at hand, it naturally follows that the substance in question also be legalized. Even alcohol causes more deaths than heroin. 2. Suicide and assisted suicide. Suicide does not infringe on anyone\"s self-interests, while at the same time fulfilling one\"s own self-interest. With this reasoning alone, suicide and assisted should be legal. If Con believes that there is some external detriment to suicide besides ones self, she will need to prove it. That includes with sources. -Regular crimes- I will start my rebuttals by first restating the definition of a \"victimless crime\". \"Victim-less crime: A legal offense to which all parties consented too.\" With this in mind, most of Con\"s objections don\"t even begin to qualify as a \"victimless crime\" since there is always one party that does not consent. 1.\"Child prostitution is a victim-less crime\" I was really quiet speechless when I read this. I will trust the judges understand the differences between manipulation/coercion and consent when they vote on this debate. Using Con\"s logic, a man could give a 8 year old girl flunitrazepam (roofies) and have their way with her, and still call it consensual because \"Consent is consent no matter in what state of mind it comes from. \"\". This is simply absurd. It is common knowledge that child molestation is a regular crime. 2. \"Tax evasion is a victim-less crime because that's what the definitions say it is\" I implore Con to skim over my definition a second time. People who make money are obligated to pay taxes on it. The obligation to pay federal tax is, in fact, written down. It\"s called, the Tax Code. To be exact, it\"s the Internal Revenue Code, which is Title 26 of the United States Code [3]. Just because a federal worker doesn\"t have to contact you and inform you that, in agreement for making money, you must pay taxes, doesn\"t make it a victimless crime. It\"s an assumed consensual agreement made by both parties. Tax evasion is a regular crime. 3.\"Drunk driving is a classic example of a victim-less crime\" Con fails to see that all drivers on the road are assumed to be sober and of a clear mind, capable of performing their operational tasks. When one steps into a car and is not under these conditions, they are automatically violating the self-interests of those on the road. This is not consensual. This is a regular crime. -Moral Values- This is an awfully weak argument. The legalization of same sex marriage is proof that the United States does not base laws off of morality. In Texas v Lawrence, sodomy laws were banned based on the fact that the government doesn\"t have a right to decide what consensual adults do in the bedroom [4]. A law obviously made based on the morality of those in charge. What also knocks down this theory of passing laws based on morality, is the fact that morality itself is entirely subjective. The government could think that atheism is immoral, and then pass laws discriminating against atheists. The same could be said for inter-racial marriage or same-sex marriage. This is a faulty system to erect laws upon. Conclusion: Con began by trying to establish a viable concept for enacting laws, however her ideals of survival conflict with the reality of the United States. I show several \"legalized harms\" to demonstrate that the government is not obligated to protect it's citizens from themselves. In fact, the government accepts this fact and decide to regulate these harms such as cigarettes and alcohol. Unless Con can think of a more viable concept than my own (moral nihilism and the harm principle), for enacting laws and conforming to existing laws, she has no basis to refute my arguments on. Con needs a platform to stand on before she can hold a law up in the air. [1] [2] [3] [4]\n\nEvidence Pro: Thanks Con, Before I begin, readers should take note that Con has dropped the “Moral Values” argument from R4. Something utilitarianism requires. -Moving Goal Posts.- It seems Con has either not understood my explanation on the purpose of this debate, or she is intentionally trying to move the goal posts. The United States status quo already permits numerous things that can harm oneself. I gave examples of these “legalized harms” in my R2 to show this. This alone is proof that the government allows people to harm themselves, even if that mean losing 480,000 citizens every year from tobacco use [1]. I made this point to demonstrate that the United States already has already become closer to adopting a form a government that utilizes “moral nihilism” and the “harm principle”. My argument on “moral values” explains that same-sex marriage legalization is proof that the government doesn’t create laws based on morality, which is an action of “moral nihilism”. Con wishes for us to believe otherwise though. She asserts that I don’t take “generic human ethic values” into consideration. Her critical flaw though is that every human has their own “values” (self-interest). She can’t even begin to argue which laws should, or shouldn’t be erected, because she has no starting point to make her utilitarian claims from. Utilitarian governments discard individual self-interest so that it can optimize the public’s overall welfare. Con seems to think this is what the United States does though, because (some) drugs and (some) assisted suicides are currently illegal. I find this hardly to be indicative of a utilitarian system though since not only has marijuana been legalized in several state but so has assisted suicide in Oregon, Washington, and Vermont. ----Rebuttals---- Con was essentially supposed to demonstrate that the harms of all these victimless crimes infringe on another persons autonomy in some shape or form. Con hasn’t even really made an attempt to do this, she simply speculates and asserts that the government is utilitarian and ought to strive for an optimal society. Again, this is the United States were talking about. A lot of her time is spent being confused about what a victim-less crime even is. For that, I will try to provide a better explaination. --Victimless Crimes-- I will start by restating my definition of a victimless crime since Con hasn’t separated them from regular crimes. “Victim-less crime: A legal offense to which all parties consented too.” Con needs to understand victimless crimes are just crimes that occur while all parties involved are consenting. Every single law of society has been prematurely agreed to by the individual (social contract theory). I theorized (or rather, John Mill) that governments can’t erect laws that infringe on one autonomy unless their self-interests infringe on another person’s. I brought up very specific crimes that I found didn’t meet the criteria of “infringing on another’s autonomy” such as drug use. She has not explained how her neighbor using heroin infringes on her freedom. The neighbor example can be applied to all my \"victimless crime\" contentions. --Drug use-- Con has finally decided to put up an assertion with a source. She states that “50% of heroin addicts die”. I honestly thought “everybody dies” when I read this. Her source actually goes on to explain that “The stud(y) followed 581 male heroin addicts for 33 years – from 1964 to 1997. In 1997, nearly half of the men had died. The most common causes of death were drug overdose (21.6 percent), followed by homicide, suicide and accidents (19 percent), liver disease (15.2 percent) and cardiovascular disease and cancer (both at 11.7 percent).”[2]. However, she fails to explain why dying from any of these things somehow infringes on another's self-interests. I gave the death count from tobacco to show how many people can die from a substance and still not have anyones self-interests be infringed on. --Suicide & Assisted Suicide-- Con goes back to her utilitarian argument here and just asserts that life is more valuable than freedom, and that “What's the point of freedom if you sacrifice both life and happiness for it?” Somehow at this point, Con still doesn’t understand that one’s freedom is their happiness. What she’s really asking me here is “what’s the point of freedom if you sacrifice your life”. To respond to this question, all I can say is that people do want the freedom to die sometimes, or eventually. Me, you, and the government, cannot understand on an emotional level why some people want to die or feel they deserve to die. That’s why there’s virtually no laws on suicide [3]. Assisted suicide is also offered in Washington, Oregon, and Vermont [4]. Freedom of one’s self-interests includes the freedom to take it away, whatever reason they have for that self-interest. (Maybe they were a serial child rapist and thought they deserved to die. Maybe they don’t want to live with being old. Maybe they just think living amounts to nothing, and that it’s all pointless in the end.) There’s no reason to force them to suffer when. --Regular Crimes-- -Drunk Driving- Con states, “there aren't always other drivers on the road”…” Kozu is basically claiming that since people on the road don't want drunk drivers in their midst, then all drunk driving isn't a victim-less crime.” With this response, it become very clear that Con has missed my point. It’s not about drivers on the road that don’t want drunk drivers in their midst. It’s about the fact that everyone who gets their license in the first place has already agreed that they will not drive drunk per federal law [5]. The agreements between existing parties have already been made. The moment that agreement is broken, it becomes a “regular crime”. It’s no different than murder laws, those tied to societies rules prematurely agree to them. -Child Prostitution- I will quote Con’s beliefs stated in R3. “ Consent is consent no matter in what state of mind it comes from. “ I used the drugged 8yo example to demonstrate Con’s beliefs. In R4, she steps back from this statement and decides that an undrugged 8yo girls can consent to sex just like any adult. She does give a glimmer of light though here as to why she believe prostitution isn’t a victimless crime. She states that “with normal prostitution where adults can be forced without consent into prostitution too. “ This is however an assumed risk on the prostitutes part. I went in great detail in my R2 about the risks of assumptions just like in boxing or other sports. It doesn’t matter what those risks are as long as the individual accepts them. That’s why Grand Prix racing isn’t illegal despite it resulting in 1 in 100 people dying from it. It is nearly the most dangerous activity in the world [6]. -Tax Evasion- As I explained earlier, the tax code is a law we all prematurely agree to follow via social contract theory. If people were to break this agreement, it would infringe on the governments self-interest of receiving tax revenue. Conclusion: Con has thus far been unable to demostrate how any of the victimless crimes i'v stated, have infringed on anyones elses autonomy. This reasoning alone is enough for the government to recognize these actions as \"victimless crimes\". She asks me \"when does consent end\", but i answer this in R2 with the harm principle. Con was supposed to demonstrate these victimless crimes effect people besides the parties consenting, she has not done this. Inspite of the misunderstandings I did enjoy this debate very much! I thank Con for participationg and for advocating her position. [1] [2] [3] [4] [5] [6]\n\nEvidence Con: Sooo.. victim-less crimes are crimes gauged by existence of consent and not by the existence of a victim? That's kind of misleading, but ok. I leave you to do the honors of writing the first round. Good luck!\n\nEvidence Con: Thank you Kozu. My position is that human beings have a vested interest in our species to protect ourselves and each other from things that harm those within our species. Anything that harms our individuals is something that we should act against. I think the value of the combination of life, happiness and survival is much more important than the value of freedom, and that we have a duty to promote these values to the fullest. The United States government should be allowed to promote the natural interests of our species, an overwhelming majority, over that of a masochistic minority. Our government is a Democracy after all. -The Victim and the Agent- One of the definitions of the word 'victim' is 'one that is acted on and usually adversely affected by a force or agent'. People shouldn't be allowed to harm themselves just because it is their wish to do so. I don't support criminalizing all victim-less crimes because that's impossible and sometimes very cruel to enforce (e.g. punishing families of suicide victims), but victim-less crimes like selling, owning and doing extreme drugs like meth or heroine should remain criminalized. The victims would be both the addicted unable-to-quit drug users and the perpetrators would be the drug dealers and the users themselves. Victim-less crimes do actually produce victims, so the terminology is actually pretty misleading. Since these crimes do produce victims, it is in our government's right to stop these crimes from happening. It is in our government's right to criminalize these crimes. -Kozu defends all victimless crimes- Note that Kozu's position forces him to abet all victim-less crimes, which means Kozu must defend the decriminalization of all victim-less crimes no matter how ridiculous some can be. I agree that there are a number of victim-less crimes that need not be considered crimes, but decriminalizing all victimless crimes would be terrible. Victimless crimes hurt our society more than violent crimes. Let me list some victimless crimes that I think should not be decriminalized. -Drinking and driving -child prostitution -tax evasion -any-and-all-drug use If Kozu cannot defend the decriminalization of every victim-less crime that I list from here and later, then I win the debate. So I think I'm not allowed to do rebuttals on anything yet? Let's see what Kozu has to say about what I just wrote.\n\nEvidence Con: So a part of our arguments come down to a discussion on the value of freedom and whether the value I put forth are more worthy of consideration in this case. These are values of happiness and life - utilitarian values - as Kozu suggests. If my arguments or claims in favor of utilitarian values exceed Kozu's in favor of freedom to the judge, then I win. The other part of our debate is based on Kozu's ability to defend his claim that all victim-less crimes should be decriminalized. If I can reasonably show any single victim-less crime that should be or remain criminalized, then I win. The risk of victim-less crimes like suicide or assisted suicide to terminate an otherwise potentially happier life means that decriminalizing all victim-less crimes would be bad and against utilitarian value. Kozu's response when he said \"america is not a utilitarian government\" shows that he knows this. And utilitarian is a type of philosophy, not a state, so this doesn't make sense anyway. It is perfectly reasonable for our government to consider certain moral values when making laws. So we're down to me saying that utilitarian value is way more important than freedom. What's the point of freedom if you sacrifice both life and happiness for it? Freedom is not the most important thing. I think the point of freedom is to give better opportunities for life and happiness. Even if decriminalizing victim-less crime might bring more freedom, it will take away a lot of life and happiness in the end. Since freedom is the ability to make choices, taking away life by assisted suicide is taking away the person's ability to make more choice. It is taking away the person's freedom to the worst degree possible. Besides, lots of people who do look to commit suicide usually are in non-temporary lows in mood. That means they probably would have enjoyed more happy if they didn't let themselves be killed. So I think by this point I prove that we should not decriminalize all victim-less crimes. Maybe some, but not all. And my other point is to show any single one victim-less crime to be bad, and Kozu agrees to that. I think my first argument right before this actually showed assisted suicide to be bad, so that by itself is one. Sir Kozu over there tries to negate some of the other ones I made up in my last post, so I will respond to his responses. First is drunk driving, which Kozu says isn't a victim-less crime because of other people killed. But drunk driving itself isn't the one that kills the people. Car accidents kill people. Drunk driving raises the risk of car accidents. Drunk driving cause car accidents, but drunk driving and car accidents aren't the same thing. In drunk driving, there is only the driver who chooses to drink alcohol and drive. The only party involved is the driver and the element of consent is in him allowing himself to drink alcohol. Drunk driving is a classic example of a victim-less crime. In the end, the car accident results in lots of people dying. These people are victims even if Kozu doesn't want to admit that they are. The definition of victim is debatable, and I say that the definition I gave of victim where a person is badly affected by a force is good enough. Kozu can be nitpicky, but the definition I gave matters because we're talking about human life here. Tax evasion is a victim-less crime because that's what the definitions say it is. Victim-less crime depends on consent, and the person consenting to not pay his taxes makes it victim-less by definition and a crime by law. Drug use is where Kozu admits to it being a victim-less crime, but the adverse effects of drug use, especially the worst drugs, outweigh the freedom it gives the person choosing to do it. Child prostitution is a victim-less crime because a crime can be committed by people of all ages, and nowhere does it say that victim-less crimes only apply to people under a certain age. Consent is consent no matter in what state of mind it comes from. Child prostitution is still a victim-less crime and it is still horrible horrible horrible. -My negation- I show that victim-less crimes sacrifice too much for freedom to be worth it. I also show a lot of things to be victim-less crimes and bad. Let's see what Kozu has to say?\n\nEvidence Con: -Values- Part of this debate depends on one value judgment over another, namely utilitarian values versus Kozu's value of absolute freedom. Kozu tells us that as long as all parties involved give full consent to an action, then outside parties are morally obligated to allow them to do so. Kozu tells us that the government should morally prioritize maximizing freedom over other moral values. How does this mean that I am not taking into consideration how the United States runs? The United States is a democracy run by humans, and humans generally value life, happiness and freedom. Am I wrong? Kozu's value assertion is that freedom exceed all other values. Kozu not only doesn't take into consideration how the United States runs, but he also doesn't take into consideration generic human ethical values that govern drive democratic, human decisions. Sure some harms are legalized, but other harms aren't. Cocaine and meth are 100% illegal in the United States. Meth is illegal everywhere in the world. How can cigarettes be legal in just about every corner of the world, but meth illegal in the same way? Simply, it is the belief that the degree of harm that meth would cause to society and individuals outweigh the value of freedom. The worst drugs being illegal while lesser drugs like tobacco remain legal is proof that our government operates under values other than freedom. \"Land of the Free\" though we may be, freedom has its limits. There comes a point where freedom steps over certain boundaries on other important values - such as utilitarian values - and the law's containing both legal and illegal harms is proof that this is true. Kozu points to the legal harms, but ignores the implications of currently illegal harms. He ignores that his own value of freedom is a moral value, and gives us the baseless assertion that no other moral values hold any significance to the United States lawmakers and laws. -Defending all Victim-less Crimes- 1. Drug use In light on the value debate, I defend against the decriminalization of drugs like heroin and meth. Kozu says lots more died of Tobacco than the illegal heroin, but there's still the fact that heroin is illegal. Tobacco is not, and is sold in quantities a millionfold of heroin. If heroin were sold at the rate of Tobacco, the rate of death would be higher. 50% of heroin addicts die [1]. If the same number of tobacco addicts were to be heroin instead, the death rate would be terrible. Kozu ignores actual ratio - the reason drugs like heroin and meth are banned. He also supports decriminalizing heroin, meth, and all of the worst drugs in the world. In the case of drugs like heroin, freedom is only subsidiary to more important utilitarian considerations. 2. Suicide & Assisted Suicide Self interest - freedom - is an important value, but it's not the most important value. Can I quote myself? Let me quote myself: \"What's the point of freedom if you sacrifice both life and happiness for it? Freedom is not the most important thing. I think the point of freedom is to give better opportunities for life and happiness. Even if decriminalizing victim-less crime might bring more freedom, it will take away a lot of life and happiness in the end. Since freedom is the ability to make choices, taking away life by assisted suicide is taking away the person's ability to make more choice. It is taking away the person's freedom to the worst degree possible. Besides, lots of people who do look to commit suicide usually are in temporary lows in mood.\" - they aren't in the right states of mind and so are incapable of making rational decisions. It's stupid not to deter them in some way, and even stupider to encourage them with assisted suicide when it's possible and even likely that they'd regret their choice. Suicide also has a ton terrible effects on friends and family. 3. Drunk Driving Kozu fails to see that there aren't always other drivers on the road. That means his criteria only qualifies adhoc, which means that it is not qualified as a reason to reject drunk driving as a victim-less crime. Kozu is basically claiming that since people on the road don't want drunk drivers in their midst, then all drunk driving isn't a victim-less crime. But literally you could apply this to all victim-less crimes. There's always someone who doesn't want the people committing victim-less crimes to do so. They obviously don't consent. I don't consent to allowing companies to mass market and sell heroin and cocaine. I don't consent to people buying and using them, but it's still a victim-less crime to smoke/sell these drugs. Family members probably won't consent to allowing someone among them to commit suicide. Where does the consent end? Does everyone qualify as a participant? If Kozu's criteria is accepted, there'd be no such thing as victim-less crimes. That's completely ridiculous. 4. Child prostitution If prostitution is a victim-less crime - and Kozu did actually mention prostitution as a victim-less crime earlier in round 1 - child-prostitution would also be a victim-less crime. Kozu suggests that the case in which a child is fed drugs - possibly without consent - disqualifies child prostitution as a victim-less crime. Once again, Kozu gives an ad hoc criteria because a child is fully capable of giving willing consent. Not all cases of child prostitution would be drug-induced consent, and not all cases are cases of forced-prostitution. It's the same with normal prostitution where adults can be forced without consent into prostitution too. But we aren't hearing a peep from Kozu about how adult prostitution isn't a victim-less crime. How come the same case that Kozu makes for children don't apply to adults? Kozu's case only half-applies because it doesn't comprehensively cover all cases. Unless Kozu can give a comprehensive criteria to distinguish child prostitution from normal prostitution, Kozu's accepting adult prostitution to be a victim-less crime means that he must also accept that child prostitution is a victim-less crime. And no, feeding a child drugs in order to procure consent isn't full consent because the child does not consent to take a drug which would alter her decision. 5. Tax Evasion Yes tax evasion is illegal as per the tax code -which is law, but being illegal by law doesn't distinguish a crime from being a victim-less crime. Assisted suicide is illegal by law in most places. A lot of drugs are illegal by law. Does that mean that they aren't victim-less crimes? Kozu keeps coming up with half-qualifying criteria which he applies only to some cases but not to others. His arguments and his cases have generally been pretty inconsistent. One individual refusing to pay taxes only concerns the consent of the individual and adversely affects the individual because the law will punish him. -Conclusion- Again I ask Kozu, where does the consent end? When do we stop including people as possible consenting members because at the rate Kozu is going, some cases can have more consenting members than others. By Kozu's criteria, there's no such thing as a victim-less crime. Literally every single crime and victim-less crime can be shown at some level to require someone else's consent. Where does it stop? You can't half-apply some criteria to some cases and completely ignore it for other cases!! [1]\n\nEvidence Con: -Values- Kozu says that I am moving the goal posts of this debate, namely that I am misrepresenting the American government. The evidence Kozu provides for this assertion is the existence of harms that have already been legalized like tobacco smoking. But Kozu's point completely ignores the existence of illegal harms like using or owning illegal harms like meth and heroine. I'm not saying that America doesn't value freedom. I'm saying that the American government holds many values in addition to freedom. The old American creed states \"Life, Liberty and the Pursuit of Happiness\". Liberty constitutes only 1/3 of this creed. Kozu's position of decriminalizing every single victim-less crime ignores and often violates other parts of America's values. If anyone is guilty of moving the goalpost, it'd be Kozu. Kozu's arguments imply that Liberty is the most important value in all cases. This is where the value side of the debate comes in. Kozu says one thing about the American government. I say another. We disagree, so we debate it. My position states that America holds utilitarian values of life and happiness in addition to the value of freedom, and that American policies do weigh all three to some degree when considering policies. Kozu's position basically states that America rejects any and all sacrifices to liberty; liberty at any and all costs, even a complete annihiliation and sacrifice of Life and Pursuit of Happiness - utilitarian values. Obviously we are at odds here, but I think many would agree that Kozu's position is a lot more improbable and unreasonable. I don't see how I'm moving the goalpost. If Kozu can argue that America's sole value is that of liberty - self-interest, I can argue that it is not. While I do concede that some degree of sacrifice to liberty is made when we criminalize certain victim-less crimes, my argument has been that this sacrifice makes more sense in certain cases. This sacrifice is needed because there are other values besides liberty that need to be considered. Kozu's willingness to sacrifice all life and happiness for the sake of freedom is astounding. The values I put forth directly contradict the values needed for Kozu to win this debate since his entire set of arguments depends on the superiority of the value of liberty. I think Kozu loses this side of the debate, which means he fails to prove that all victim-less crimes deserve to be decriminalized. By this argument, I win the debate. -Victim-less Crimes- Correct. I do need to show that all parties involved are consenting, but Kozu gives me a really inconsistent criteria to determine involvement. This is where I think I win this argument. Kozu's inconsistency in rejecting some victim-less crimes with this criteria while allowing others to qualify with these same criteria invalidates many of his refutations. I do not need to show that my drug-addict neighbor is infringing on my autonomy because as I've been arguing this whole time through the value side of this debate, autonomy, self interest - liberty & freedom, do not represent the only values that lawmakers consider when making a law. Kozu's implied assertion that all other values are discarded is unreasonable and unfounded. The neighbor example depends on value assertions to which I've thoroughly responded. So again, Kozu defends the claim that all victim-less crimes should be decriminalized. If I can show any single victim-less crime to not deserve decriminalization, then I win this debate. --Drug Use-- Drugs like meth and heroin are the worst drugs in the world. Heroin has an estimated 23% addiction rate for users[1]. Heroin destroys the body, and creates one of the strongest physical addictions of any drug. According to many sources, heroin's use and even just its withdrawal can be fatal. Heroin is illegal everywhere, but heroin has been shown to be largely responsible for 4 out of 5 drug-related deaths according to a 2008 report.[2] There is a very severe violation of life and consequently the pursuit of happiness in the case of heroin. Drug use should remain criminalized. --Suicide & Assisted Suicide-- I think the value argument proves that this point should not be decriminalized. This takes a little bit of value judgment. I think that in some cases, assisted suicide should be allowed. Like, if someone is suffering a terrible terminal illness, then that person is totally entitled to ask for euthanasia. Not all cases would be like this, and I think general legalization of assisted suicide should not happen. Assisted suicide should be provided in certain professional, medical or similar such environments. Laymen should not be able to provide that service, and should be punished for trying to do so. The case against assisted suicide is based in large part on my value case. Assisted suicide abets the value of freedom, but heavily infringes on life and consequently pursuit of happiness. This is very similar to the drug case, but the rate of death in this case is 100%. -Regular Crimes- Basically Kozu makes the same refutation for Tax evasion, drunk driving, and child prostitution - that they are regular crimes. Kozu is basically saying that for something to be a victim-less crime, it can't be a regular crime. According to Kozu, if it is a regular crime, then it's not a victim-less crime. This is simply not true. A lot of crimes, like the possession and use of heroin, are both victim-less and regular. Again, Kozu makes half-qualifying criteria for some things but don't apply it to others. Kozu agrees that all drug use are victim-less crimes, but some of these drugs are also regular crimes. According to Kozu's case, these drugs aren't victim-less crimes. Living under the law, all citizens agree to obey the law. The law states that possession and use of some drugs is illegal. Does that mean that these drugs aren't victim-less crimes? According to Kozu's refutation to Tax evasion, drunk driving and child prostitution, that would be the case. But Kozu clearly believes that all drug use qualify as victim-less crimes. Kozu can't have it both ways. His refutation is inconsistent, and so it fails. If Kozu believes all drug use to be victim-less crimes, then his refutation cannot stand. Any victim-less crime that has yet to be decriminalized - any victim-less crime that is illegal - that Kozu accepts as a victim-less crime further stacks as evidence of Kozu's argumentative inconsistency. So I want to conclude that tax evasion, drunk driving, and prostitution should all remain criminalized, each with the reasons I've originally attached to them. Conclusion: Kozu has thus far been unable to demonstrate how autonomy is the only value worth considering in America's lawmaking system. I don't need to show that autonomy - liberty - is not sacrificed. I chose to show that the sacrifice in liberty is justified. Kozu doesn't really come up with a strong response to that, and so he sacrifices the entire values on which his arguments are founded. Kozu does not satisfactorily prove that all victim-less crimes should be decriminalized. On the other hand, I think I've satisfactorily shown that not all victim-less crimes should be decriminalized - that some victim-less crimes should stay criminalized. Kozu, you've been delightfully challenging, and I really enjoyed this debate. [1] [2]\n","DiscussionID":"00000025","Title":"All victim-less crimes should be decriminalized.","CrawlDate":"2016/09/29 06:07:22","URL":"http://www.debate.org/debates/All-victim-less-crimes-should-be-decriminalized./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000002","PremiseStartPos":[235],"prevID":"00000000","Premise":["Full Resolution: The United States ought to decriminalize all victim-less crimes. Freedom to ones own autonomy is possibly the most commonly regarded right one ought to have.Any kind of law that infringes on ones autonomy must be justified. Examples. Laws against murder are justified because murder infringes on another's autonomy. Laws against marijuana are not justified because using marijuana does not infringe on another's autonomy. ==Definitions== Infringe: An act so as to limit or undermine. Autonomy: Independence or freedom, as of the will or one's actions. Victim-less crime: A legal offense to which all parties consented too. Decriminalize: The abolition of criminal penalties in relation to certain acts. ==Rules== 1. No forfeits 2. Any citations or foot/endnotes must be provided in the text of the debate 3. No new arguments in the final round 4. Maintain a civil and decorous atmosphere 5. No trolling or semantics 6. My opponent accepts all definitions and waives his/her right to add definitions 7. Violation of any of these rules or of any of the R1 set-up merits a loss ==Structure== R1. Acceptance R2. Pro and Con present their case. No rebuttals R3. Rebuttals R4. Rebuttals R5. Rebuttals and conclusion. No new arguments."],"PremiseEndPos":[1481],"ArgumentID":"00000001","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000003","PremiseStartPos":[1496],"prevID":"00000001","Premise":["Thank you Allenn for accept this debate. It is my position that promotes self-interest. The united states government should not have the authority to govern how one chooses to live their life. The only time the government should interfere with ones autonomy is when that individuals self-interests infringes on another's. With this reasoning we can promote freedom to its fullest. -Philosophy- John stuart Mill theorized that, \"The only purpose for which power can be rightfully exercised over any member of a civilized community, against his will, is to prevent harm to others\"[1]. This is what has become commonly known as the \"harm principle\". This is a solid platform for enacting laws while still promoting freedom. The majority cannot rule that slavery be brought back, nor can they discriminate against those with different self-interests that do not harm them. This helps ensure that even the minority, no matter how small, is treated with the same freedom as everybody else. -Legalized \"Harm\"- Consent is an affirmation of ones self-interest. After all, one does not consent to that which they do not want. Only that which goes against one's self-interest should truly be defined as a harm. As such, there can only be a victim if ones autonomy is infringed on. In boxing matches, both participants consent to the fight and understand that both may possibly be injured during the brawl. In this situation it wouldn't make sense to say that the one who gets injured is a victim, because he was well aware of the possible consequences. This can also be said for many physical sports such as football, rugby, or wrestling. Players who get hurt during these sports also cannot press criminal charges because they have acknowledged the harm prior to playing. \"In New York, you can\"t bring a lawsuit for a sports-related injury if, by participating, you assumed the risk of getting hurt.\" [2]. Smoking cigarettes and drinking alcohol are other forms of legalized \"harms\" between buyer and seller. The cigarette boxes themselves must be labeled with warnings so as to inform the individual of the possible \"harms\" they will suffer, the same can be said for alcohol bottles. The government has already acknowledged that people are going to serve their self-interests regardless of what the government thinks (see prohibition), and have instead chosen to legalize and regulate these harms. Further evidence of this can be found from the sudden surge of legalizing not only medical but even recreational marijuana. My state in particular has recently taken the initiative of starting to legalizing marijuana for recreational use [3]. -Promoting freedom- Everything I have stated above has been legalized due to the fact that the individuals who promote them have accepted these possible harms. If consensual harms can be legalized because of the assumed risk and the fact that their is an interest in them, it naturally follows that other crimes with these qualifications, should at-least be decriminalized. Among such crimes include, prostitution, gambling, illicit drug use, assisted-suicide, (formally) sodomy[4]. All of these crimes involve two parties, both of whom have consented to the desired action. Both of each others self-interests are being met. The government shouldn't focus on making or enforcing crimes that go against two consenting parties self-interests, instead they should try to promote some form of regulation for them, or at least make the knowledge of the harms associated with those interests more easily available to the public. The autonomy of the individual is the most important part country of a \"free\" country, considering this is what fuels the nation as a whole. By allowing everybody to maintain their autonomy we ultimately benefit the nation and help ensure equal rights for all. With that being said, I look forward to Cons response. [1] [2] [3] [4]"],"PremiseEndPos":[5383],"ArgumentID":"00000002","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000004","PremiseStartPos":[5398],"prevID":"00000002","Premise":["Thank you Con for the response. I will first address Con's case and provide rebuttals where needed, then move on to reaffirming my own case -Con's position- She starts off by stating that \" Anything that harms our individuals is something that we should act against. I think the value of the combination of life, happiness and survival is much more important than the value of freedom, and that we have a duty to promote these values to the fullest.\" This does seem reasonable taken at face value, however this simply is not the case of the reality we live in. I preempt this argument in my last round by stating a number of \"legalized harms\" that the government already acknowledges as something they can't prevent. Be it for revenue purposes or simply ones own right to their autonomy. If we are to utilize Con's train of thought to decide which laws to enact, then one ought to criminalize the use of alcohol, cigerattes, nearly every physical sport, and unhealthy foods like fast food. I think it's rather evident that Con's basis for enacting laws is far to restrictive and would lead to absurdities, which completely go against ones self-interest. If Con truly is for \"life and happiness\", allowing people do serve their self-interest would indeed be the best route, regardless of the harm done to oneself. Throwing survival in her beliefs hurts her case because america is not a utilitarian government, and doesn't go out of its way to make sure everyone lives an optimally healthy life. -Who is the Victim- Con believes that a victim is an individual who has been \"acted on and usually adversely affected by a force or agent\". Although this is essentially the dictionary definition \"victim\", it would not be proper to enact laws based on this definition. As I stated in my previous round, doing this would lead to absurdities such as criminalizing the use of alcohol, cigerattes, nearly every physical sport, and unhealthy foods like fast food. The definition is FAR to over-encompassing to used as a legal basis. I however offer an alternative solution to the definition of the word \"victim\" for legal use, and that is \"that which goes against ones self-interest\". It would also seems that the United States government has already taken a similar train of thought. That is why the use of alcohol, cigerattes, nearly every physical sport, and unhealthy foods like fast food are completely legal already, because people have an interest in these things and the government couldn't hope to enforce it. Instead they regulate is and profit from it, in turn, further helping society as a whole. Indeed, these \"harmful\" activities indirectly benefit society due to someone needing to have a job and spend money to do these. -Defending ALL victimless crimes- Con is correct, I deliberately set this debate up for me to defend ALL forms of victimless crimes. I must defend against any contention she makes against any and all victimless crimes. That is of cource, if they are indeed a \"victimless crime\". Per my definition of victimless-crime, \"A legal offense to which all parties consented too.\" She can not call child prostitution a victimless crime. The age of consent is usually 18, sometime 16 in the U.S [1]. Since a child does not posses the mental faculties to understand the decisions of sex, having sex with a minor is considered rape. Everyone knows rape is not a victimless crime. Drinking and driving are not victimless crimes either. The drunk driver never considers the self-interests of the other drivers on the road. There is no agreement between drivers that the risk is accepted. No rational driver would consent to someone driving drunk to begin with. Tax evasion does not qualify as a victimless crime. People are obligated to pay their taxes when they make money. It is an agreement that has long been kept between the worker and their government. If this agreement is broken, criminal action can be taken. Parties that purchase drugs from their supplier are indeed victimless crimes. Both parties self interests are being met and the assumed risks are accepted by both, much like in a boxing match. If the government ought to criminalize \"any and all drug use\" then it only follows that alcohol be done with entirely [2]. Obviously, this cannot be done (see prohibition). -My affirmation- Since Con has failed to demonstrate a coherent thought process to base laws off of, I believe my position of allowing self-interest to flourish, coupled with the harm principle, stands firm as the logical choice for deciding on what laws ought to be erected. Best of luck to Con! [1] [2]"],"PremiseEndPos":[9999],"ArgumentID":"00000003","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000005","PremiseStartPos":[10014],"prevID":"00000003","Premise":["Thanks Con, To begin round 3, Con starts by attempting to move the goal posts. This is a debate about the United States, not some generic government whose basis for creating laws hasn\"t been formed yet. Con believes that all she has to do is put forth her idea of how a government ought to be run, however, she doesn\"t take into consideration how the United States does run. This misunderstanding may be due to Con being relatively new here, so it\"s a good thing we still have two more rounds for rebuttals so she can more directly refute the victimless crimes themselves instead of trying to create a new government order. It should be noted that Con concedes (by not responding) that the government has already legalized certain harms such as boxing, smoking cigarettes, drinking alcohol, and eating fast food, based on one\"s right to freedom or there is a revenue benefit for the government. She provides us with no explanation for why these types of harms should be legal but not the others, such as drug use. Instead, Con simply reaffirms her belief that the government ought to hold life above liberty. The problem with this is that this isn\"t a reflection of our society. If the government DID hold life above liberty, we would see the things I listed above being criminalized because they harm the individual, this is not the case. The United States is called the \"Land of the free\" for a reason. The only time this freedom is not going to be upheld is if it infringes on some else\"s freedom. This is ALREADY the way the United States operates, I am here hosting this debate to merely point out that victimless crimes don\"t infringe on someone\"s freedom, there for there is no reason to make them criminal. Con should disagree with me on this and proceed to prove that these victimless crimes do indeed infringe on someone\"s free will. If she does not, I win the debate. Now that we\"ve stablished that the United States does indeed hold freedom above all else, we can begin examining which crimes do not infringe on another self-interest (freedom). -Victimless crimes- Con has pointed to several examples of victimless crimes that she believes infringe on another persons self-interest. So long as I can prove that this is not the case, I win the debate (justified by R2 philosophy). 1.\" Drug use \" Con provides us with a baseless assertion saying that \"the adverse effects of drug use, especially the worst drugs, outweigh the freedom it gives the person choosing to do it.\" The main reason why this argument doesn\"t hold water, regardless of its truthfulness, is because cigarettes are already legal. Nearly 480,000 deaths occur each year due to tobacco use, including deaths from secondhand smoke [1]. When we compare this to heroin, there is an incredibly huge drop. According to the CDC, only 6,235 deaths were related to heroin use in 2013 [2]. Similarly to how the marijuana legalization arguments go, if the government has legalized a more dangerous substance than the one at hand, it naturally follows that the substance in question also be legalized. Even alcohol causes more deaths than heroin. 2. Suicide and assisted suicide. Suicide does not infringe on anyone\"s self-interests, while at the same time fulfilling one\"s own self-interest. With this reasoning alone, suicide and assisted should be legal. If Con believes that there is some external detriment to suicide besides ones self, she will need to prove it. That includes with sources. -Regular crimes- I will start my rebuttals by first restating the definition of a \"victimless crime\". \"Victim-less crime: A legal offense to which all parties consented too.\" With this in mind, most of Con\"s objections don\"t even begin to qualify as a \"victimless crime\" since there is always one party that does not consent. 1.\"Child prostitution is a victim-less crime\" I was really quiet speechless when I read this. I will trust the judges understand the differences between manipulation/coercion and consent when they vote on this debate. Using Con\"s logic, a man could give a 8 year old girl flunitrazepam (roofies) and have their way with her, and still call it consensual because \"Consent is consent no matter in what state of mind it comes from. \"\". This is simply absurd. It is common knowledge that child molestation is a regular crime. 2. \"Tax evasion is a victim-less crime because that's what the definitions say it is\" I implore Con to skim over my definition a second time. People who make money are obligated to pay taxes on it. The obligation to pay federal tax is, in fact, written down. It\"s called, the Tax Code. To be exact, it\"s the Internal Revenue Code, which is Title 26 of the United States Code [3]. Just because a federal worker doesn\"t have to contact you and inform you that, in agreement for making money, you must pay taxes, doesn\"t make it a victimless crime. It\"s an assumed consensual agreement made by both parties. Tax evasion is a regular crime. 3.\"Drunk driving is a classic example of a victim-less crime\" Con fails to see that all drivers on the road are assumed to be sober and of a clear mind, capable of performing their operational tasks. When one steps into a car and is not under these conditions, they are automatically violating the self-interests of those on the road. This is not consensual. This is a regular crime. -Moral Values- This is an awfully weak argument. The legalization of same sex marriage is proof that the United States does not base laws off of morality. In Texas v Lawrence, sodomy laws were banned based on the fact that the government doesn\"t have a right to decide what consensual adults do in the bedroom [4]. A law obviously made based on the morality of those in charge. What also knocks down this theory of passing laws based on morality, is the fact that morality itself is entirely subjective. The government could think that atheism is immoral, and then pass laws discriminating against atheists. The same could be said for inter-racial marriage or same-sex marriage. This is a faulty system to erect laws upon. Conclusion: Con began by trying to establish a viable concept for enacting laws, however her ideals of survival conflict with the reality of the United States. I show several \"legalized harms\" to demonstrate that the government is not obligated to protect it's citizens from themselves. In fact, the government accepts this fact and decide to regulate these harms such as cigarettes and alcohol. Unless Con can think of a more viable concept than my own (moral nihilism and the harm principle), for enacting laws and conforming to existing laws, she has no basis to refute my arguments on. Con needs a platform to stand on before she can hold a law up in the air. [1] [2] [3] [4]"],"PremiseEndPos":[16750],"ArgumentID":"00000004","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000006","PremiseStartPos":[16765],"prevID":"00000004","Premise":["Thanks Con, Before I begin, readers should take note that Con has dropped the “Moral Values” argument from R4. Something utilitarianism requires. -Moving Goal Posts.- It seems Con has either not understood my explanation on the purpose of this debate, or she is intentionally trying to move the goal posts. The United States status quo already permits numerous things that can harm oneself. I gave examples of these “legalized harms” in my R2 to show this. This alone is proof that the government allows people to harm themselves, even if that mean losing 480,000 citizens every year from tobacco use [1]. I made this point to demonstrate that the United States already has already become closer to adopting a form a government that utilizes “moral nihilism” and the “harm principle”. My argument on “moral values” explains that same-sex marriage legalization is proof that the government doesn’t create laws based on morality, which is an action of “moral nihilism”. Con wishes for us to believe otherwise though. She asserts that I don’t take “generic human ethic values” into consideration. Her critical flaw though is that every human has their own “values” (self-interest). She can’t even begin to argue which laws should, or shouldn’t be erected, because she has no starting point to make her utilitarian claims from. Utilitarian governments discard individual self-interest so that it can optimize the public’s overall welfare. Con seems to think this is what the United States does though, because (some) drugs and (some) assisted suicides are currently illegal. I find this hardly to be indicative of a utilitarian system though since not only has marijuana been legalized in several state but so has assisted suicide in Oregon, Washington, and Vermont. ----Rebuttals---- Con was essentially supposed to demonstrate that the harms of all these victimless crimes infringe on another persons autonomy in some shape or form. Con hasn’t even really made an attempt to do this, she simply speculates and asserts that the government is utilitarian and ought to strive for an optimal society. Again, this is the United States were talking about. A lot of her time is spent being confused about what a victim-less crime even is. For that, I will try to provide a better explaination. --Victimless Crimes-- I will start by restating my definition of a victimless crime since Con hasn’t separated them from regular crimes. “Victim-less crime: A legal offense to which all parties consented too.” Con needs to understand victimless crimes are just crimes that occur while all parties involved are consenting. Every single law of society has been prematurely agreed to by the individual (social contract theory). I theorized (or rather, John Mill) that governments can’t erect laws that infringe on one autonomy unless their self-interests infringe on another person’s. I brought up very specific crimes that I found didn’t meet the criteria of “infringing on another’s autonomy” such as drug use. She has not explained how her neighbor using heroin infringes on her freedom. The neighbor example can be applied to all my \"victimless crime\" contentions. --Drug use-- Con has finally decided to put up an assertion with a source. She states that “50% of heroin addicts die”. I honestly thought “everybody dies” when I read this. Her source actually goes on to explain that “The stud(y) followed 581 male heroin addicts for 33 years – from 1964 to 1997. In 1997, nearly half of the men had died. The most common causes of death were drug overdose (21.6 percent), followed by homicide, suicide and accidents (19 percent), liver disease (15.2 percent) and cardiovascular disease and cancer (both at 11.7 percent).”[2]. However, she fails to explain why dying from any of these things somehow infringes on another's self-interests. I gave the death count from tobacco to show how many people can die from a substance and still not have anyones self-interests be infringed on. --Suicide & Assisted Suicide-- Con goes back to her utilitarian argument here and just asserts that life is more valuable than freedom, and that “What's the point of freedom if you sacrifice both life and happiness for it?” Somehow at this point, Con still doesn’t understand that one’s freedom is their happiness. What she’s really asking me here is “what’s the point of freedom if you sacrifice your life”. To respond to this question, all I can say is that people do want the freedom to die sometimes, or eventually. Me, you, and the government, cannot understand on an emotional level why some people want to die or feel they deserve to die. That’s why there’s virtually no laws on suicide [3]. Assisted suicide is also offered in Washington, Oregon, and Vermont [4]. Freedom of one’s self-interests includes the freedom to take it away, whatever reason they have for that self-interest. (Maybe they were a serial child rapist and thought they deserved to die. Maybe they don’t want to live with being old. Maybe they just think living amounts to nothing, and that it’s all pointless in the end.) There’s no reason to force them to suffer when. --Regular Crimes-- -Drunk Driving- Con states, “there aren't always other drivers on the road”…” Kozu is basically claiming that since people on the road don't want drunk drivers in their midst, then all drunk driving isn't a victim-less crime.” With this response, it become very clear that Con has missed my point. It’s not about drivers on the road that don’t want drunk drivers in their midst. It’s about the fact that everyone who gets their license in the first place has already agreed that they will not drive drunk per federal law [5]. The agreements between existing parties have already been made. The moment that agreement is broken, it becomes a “regular crime”. It’s no different than murder laws, those tied to societies rules prematurely agree to them. -Child Prostitution- I will quote Con’s beliefs stated in R3. “ Consent is consent no matter in what state of mind it comes from. “ I used the drugged 8yo example to demonstrate Con’s beliefs. In R4, she steps back from this statement and decides that an undrugged 8yo girls can consent to sex just like any adult. She does give a glimmer of light though here as to why she believe prostitution isn’t a victimless crime. She states that “with normal prostitution where adults can be forced without consent into prostitution too. “ This is however an assumed risk on the prostitutes part. I went in great detail in my R2 about the risks of assumptions just like in boxing or other sports. It doesn’t matter what those risks are as long as the individual accepts them. That’s why Grand Prix racing isn’t illegal despite it resulting in 1 in 100 people dying from it. It is nearly the most dangerous activity in the world [6]. -Tax Evasion- As I explained earlier, the tax code is a law we all prematurely agree to follow via social contract theory. If people were to break this agreement, it would infringe on the governments self-interest of receiving tax revenue. Conclusion: Con has thus far been unable to demostrate how any of the victimless crimes i'v stated, have infringed on anyones elses autonomy. This reasoning alone is enough for the government to recognize these actions as \"victimless crimes\". She asks me \"when does consent end\", but i answer this in R2 with the harm principle. Con was supposed to demonstrate these victimless crimes effect people besides the parties consenting, she has not done this. Inspite of the misunderstandings I did enjoy this debate very much! I thank Con for participationg and for advocating her position. [1] [2] [3] [4] [5] [6]"],"PremiseEndPos":[24425],"ArgumentID":"00000005","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000007","PremiseStartPos":[24440],"prevID":"00000005","Premise":["Sooo.. victim-less crimes are crimes gauged by existence of consent and not by the existence of a victim? That's kind of misleading, but ok. I leave you to do the honors of writing the first round. Good luck!"],"PremiseEndPos":[24649],"ArgumentID":"00000006","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000008","PremiseStartPos":[24664],"prevID":"00000006","Premise":["Thank you Kozu. My position is that human beings have a vested interest in our species to protect ourselves and each other from things that harm those within our species. Anything that harms our individuals is something that we should act against. I think the value of the combination of life, happiness and survival is much more important than the value of freedom, and that we have a duty to promote these values to the fullest. The United States government should be allowed to promote the natural interests of our species, an overwhelming majority, over that of a masochistic minority. Our government is a Democracy after all. -The Victim and the Agent- One of the definitions of the word 'victim' is 'one that is acted on and usually adversely affected by a force or agent'. People shouldn't be allowed to harm themselves just because it is their wish to do so. I don't support criminalizing all victim-less crimes because that's impossible and sometimes very cruel to enforce (e.g. punishing families of suicide victims), but victim-less crimes like selling, owning and doing extreme drugs like meth or heroine should remain criminalized. The victims would be both the addicted unable-to-quit drug users and the perpetrators would be the drug dealers and the users themselves. Victim-less crimes do actually produce victims, so the terminology is actually pretty misleading. Since these crimes do produce victims, it is in our government's right to stop these crimes from happening. It is in our government's right to criminalize these crimes. -Kozu defends all victimless crimes- Note that Kozu's position forces him to abet all victim-less crimes, which means Kozu must defend the decriminalization of all victim-less crimes no matter how ridiculous some can be. I agree that there are a number of victim-less crimes that need not be considered crimes, but decriminalizing all victimless crimes would be terrible. Victimless crimes hurt our society more than violent crimes. Let me list some victimless crimes that I think should not be decriminalized. -Drinking and driving -child prostitution -tax evasion -any-and-all-drug use If Kozu cannot defend the decriminalization of every victim-less crime that I list from here and later, then I win the debate. So I think I'm not allowed to do rebuttals on anything yet? Let's see what Kozu has to say about what I just wrote."],"PremiseEndPos":[27045],"ArgumentID":"00000007","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000009","PremiseStartPos":[27060],"prevID":"00000007","Premise":["So a part of our arguments come down to a discussion on the value of freedom and whether the value I put forth are more worthy of consideration in this case. These are values of happiness and life - utilitarian values - as Kozu suggests. If my arguments or claims in favor of utilitarian values exceed Kozu's in favor of freedom to the judge, then I win. The other part of our debate is based on Kozu's ability to defend his claim that all victim-less crimes should be decriminalized. If I can reasonably show any single victim-less crime that should be or remain criminalized, then I win. The risk of victim-less crimes like suicide or assisted suicide to terminate an otherwise potentially happier life means that decriminalizing all victim-less crimes would be bad and against utilitarian value. Kozu's response when he said \"america is not a utilitarian government\" shows that he knows this. And utilitarian is a type of philosophy, not a state, so this doesn't make sense anyway. It is perfectly reasonable for our government to consider certain moral values when making laws. So we're down to me saying that utilitarian value is way more important than freedom. What's the point of freedom if you sacrifice both life and happiness for it? Freedom is not the most important thing. I think the point of freedom is to give better opportunities for life and happiness. Even if decriminalizing victim-less crime might bring more freedom, it will take away a lot of life and happiness in the end. Since freedom is the ability to make choices, taking away life by assisted suicide is taking away the person's ability to make more choice. It is taking away the person's freedom to the worst degree possible. Besides, lots of people who do look to commit suicide usually are in non-temporary lows in mood. That means they probably would have enjoyed more happy if they didn't let themselves be killed. So I think by this point I prove that we should not decriminalize all victim-less crimes. Maybe some, but not all. And my other point is to show any single one victim-less crime to be bad, and Kozu agrees to that. I think my first argument right before this actually showed assisted suicide to be bad, so that by itself is one. Sir Kozu over there tries to negate some of the other ones I made up in my last post, so I will respond to his responses. First is drunk driving, which Kozu says isn't a victim-less crime because of other people killed. But drunk driving itself isn't the one that kills the people. Car accidents kill people. Drunk driving raises the risk of car accidents. Drunk driving cause car accidents, but drunk driving and car accidents aren't the same thing. In drunk driving, there is only the driver who chooses to drink alcohol and drive. The only party involved is the driver and the element of consent is in him allowing himself to drink alcohol. Drunk driving is a classic example of a victim-less crime. In the end, the car accident results in lots of people dying. These people are victims even if Kozu doesn't want to admit that they are. The definition of victim is debatable, and I say that the definition I gave of victim where a person is badly affected by a force is good enough. Kozu can be nitpicky, but the definition I gave matters because we're talking about human life here. Tax evasion is a victim-less crime because that's what the definitions say it is. Victim-less crime depends on consent, and the person consenting to not pay his taxes makes it victim-less by definition and a crime by law. Drug use is where Kozu admits to it being a victim-less crime, but the adverse effects of drug use, especially the worst drugs, outweigh the freedom it gives the person choosing to do it. Child prostitution is a victim-less crime because a crime can be committed by people of all ages, and nowhere does it say that victim-less crimes only apply to people under a certain age. Consent is consent no matter in what state of mind it comes from. Child prostitution is still a victim-less crime and it is still horrible horrible horrible. -My negation- I show that victim-less crimes sacrifice too much for freedom to be worth it. I also show a lot of things to be victim-less crimes and bad. Let's see what Kozu has to say?"],"PremiseEndPos":[31316],"ArgumentID":"00000008","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000010","PremiseStartPos":[31331],"prevID":"00000008","Premise":["-Values- Part of this debate depends on one value judgment over another, namely utilitarian values versus Kozu's value of absolute freedom. Kozu tells us that as long as all parties involved give full consent to an action, then outside parties are morally obligated to allow them to do so. Kozu tells us that the government should morally prioritize maximizing freedom over other moral values. How does this mean that I am not taking into consideration how the United States runs? The United States is a democracy run by humans, and humans generally value life, happiness and freedom. Am I wrong? Kozu's value assertion is that freedom exceed all other values. Kozu not only doesn't take into consideration how the United States runs, but he also doesn't take into consideration generic human ethical values that govern drive democratic, human decisions. Sure some harms are legalized, but other harms aren't. Cocaine and meth are 100% illegal in the United States. Meth is illegal everywhere in the world. How can cigarettes be legal in just about every corner of the world, but meth illegal in the same way? Simply, it is the belief that the degree of harm that meth would cause to society and individuals outweigh the value of freedom. The worst drugs being illegal while lesser drugs like tobacco remain legal is proof that our government operates under values other than freedom. \"Land of the Free\" though we may be, freedom has its limits. There comes a point where freedom steps over certain boundaries on other important values - such as utilitarian values - and the law's containing both legal and illegal harms is proof that this is true. Kozu points to the legal harms, but ignores the implications of currently illegal harms. He ignores that his own value of freedom is a moral value, and gives us the baseless assertion that no other moral values hold any significance to the United States lawmakers and laws. -Defending all Victim-less Crimes- 1. Drug use In light on the value debate, I defend against the decriminalization of drugs like heroin and meth. Kozu says lots more died of Tobacco than the illegal heroin, but there's still the fact that heroin is illegal. Tobacco is not, and is sold in quantities a millionfold of heroin. If heroin were sold at the rate of Tobacco, the rate of death would be higher. 50% of heroin addicts die [1]. If the same number of tobacco addicts were to be heroin instead, the death rate would be terrible. Kozu ignores actual ratio - the reason drugs like heroin and meth are banned. He also supports decriminalizing heroin, meth, and all of the worst drugs in the world. In the case of drugs like heroin, freedom is only subsidiary to more important utilitarian considerations. 2. Suicide & Assisted Suicide Self interest - freedom - is an important value, but it's not the most important value. Can I quote myself? Let me quote myself: \"What's the point of freedom if you sacrifice both life and happiness for it? Freedom is not the most important thing. I think the point of freedom is to give better opportunities for life and happiness. Even if decriminalizing victim-less crime might bring more freedom, it will take away a lot of life and happiness in the end. Since freedom is the ability to make choices, taking away life by assisted suicide is taking away the person's ability to make more choice. It is taking away the person's freedom to the worst degree possible. Besides, lots of people who do look to commit suicide usually are in temporary lows in mood.\" - they aren't in the right states of mind and so are incapable of making rational decisions. It's stupid not to deter them in some way, and even stupider to encourage them with assisted suicide when it's possible and even likely that they'd regret their choice. Suicide also has a ton terrible effects on friends and family. 3. Drunk Driving Kozu fails to see that there aren't always other drivers on the road. That means his criteria only qualifies adhoc, which means that it is not qualified as a reason to reject drunk driving as a victim-less crime. Kozu is basically claiming that since people on the road don't want drunk drivers in their midst, then all drunk driving isn't a victim-less crime. But literally you could apply this to all victim-less crimes. There's always someone who doesn't want the people committing victim-less crimes to do so. They obviously don't consent. I don't consent to allowing companies to mass market and sell heroin and cocaine. I don't consent to people buying and using them, but it's still a victim-less crime to smoke/sell these drugs. Family members probably won't consent to allowing someone among them to commit suicide. Where does the consent end? Does everyone qualify as a participant? If Kozu's criteria is accepted, there'd be no such thing as victim-less crimes. That's completely ridiculous. 4. Child prostitution If prostitution is a victim-less crime - and Kozu did actually mention prostitution as a victim-less crime earlier in round 1 - child-prostitution would also be a victim-less crime. Kozu suggests that the case in which a child is fed drugs - possibly without consent - disqualifies child prostitution as a victim-less crime. Once again, Kozu gives an ad hoc criteria because a child is fully capable of giving willing consent. Not all cases of child prostitution would be drug-induced consent, and not all cases are cases of forced-prostitution. It's the same with normal prostitution where adults can be forced without consent into prostitution too. But we aren't hearing a peep from Kozu about how adult prostitution isn't a victim-less crime. How come the same case that Kozu makes for children don't apply to adults? Kozu's case only half-applies because it doesn't comprehensively cover all cases. Unless Kozu can give a comprehensive criteria to distinguish child prostitution from normal prostitution, Kozu's accepting adult prostitution to be a victim-less crime means that he must also accept that child prostitution is a victim-less crime. And no, feeding a child drugs in order to procure consent isn't full consent because the child does not consent to take a drug which would alter her decision. 5. Tax Evasion Yes tax evasion is illegal as per the tax code -which is law, but being illegal by law doesn't distinguish a crime from being a victim-less crime. Assisted suicide is illegal by law in most places. A lot of drugs are illegal by law. Does that mean that they aren't victim-less crimes? Kozu keeps coming up with half-qualifying criteria which he applies only to some cases but not to others. His arguments and his cases have generally been pretty inconsistent. One individual refusing to pay taxes only concerns the consent of the individual and adversely affects the individual because the law will punish him. -Conclusion- Again I ask Kozu, where does the consent end? When do we stop including people as possible consenting members because at the rate Kozu is going, some cases can have more consenting members than others. By Kozu's criteria, there's no such thing as a victim-less crime. Literally every single crime and victim-less crime can be shown at some level to require someone else's consent. Where does it stop? You can't half-apply some criteria to some cases and completely ignore it for other cases!! [1]"],"PremiseEndPos":[38666],"ArgumentID":"00000009","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":134,"ConclusionEndPos":182,"nextID":"00000000","PremiseStartPos":[38681],"prevID":"00000009","Premise":["-Values- Kozu says that I am moving the goal posts of this debate, namely that I am misrepresenting the American government. The evidence Kozu provides for this assertion is the existence of harms that have already been legalized like tobacco smoking. But Kozu's point completely ignores the existence of illegal harms like using or owning illegal harms like meth and heroine. I'm not saying that America doesn't value freedom. I'm saying that the American government holds many values in addition to freedom. The old American creed states \"Life, Liberty and the Pursuit of Happiness\". Liberty constitutes only 1/3 of this creed. Kozu's position of decriminalizing every single victim-less crime ignores and often violates other parts of America's values. If anyone is guilty of moving the goalpost, it'd be Kozu. Kozu's arguments imply that Liberty is the most important value in all cases. This is where the value side of the debate comes in. Kozu says one thing about the American government. I say another. We disagree, so we debate it. My position states that America holds utilitarian values of life and happiness in addition to the value of freedom, and that American policies do weigh all three to some degree when considering policies. Kozu's position basically states that America rejects any and all sacrifices to liberty; liberty at any and all costs, even a complete annihiliation and sacrifice of Life and Pursuit of Happiness - utilitarian values. Obviously we are at odds here, but I think many would agree that Kozu's position is a lot more improbable and unreasonable. I don't see how I'm moving the goalpost. If Kozu can argue that America's sole value is that of liberty - self-interest, I can argue that it is not. While I do concede that some degree of sacrifice to liberty is made when we criminalize certain victim-less crimes, my argument has been that this sacrifice makes more sense in certain cases. This sacrifice is needed because there are other values besides liberty that need to be considered. Kozu's willingness to sacrifice all life and happiness for the sake of freedom is astounding. The values I put forth directly contradict the values needed for Kozu to win this debate since his entire set of arguments depends on the superiority of the value of liberty. I think Kozu loses this side of the debate, which means he fails to prove that all victim-less crimes deserve to be decriminalized. By this argument, I win the debate. -Victim-less Crimes- Correct. I do need to show that all parties involved are consenting, but Kozu gives me a really inconsistent criteria to determine involvement. This is where I think I win this argument. Kozu's inconsistency in rejecting some victim-less crimes with this criteria while allowing others to qualify with these same criteria invalidates many of his refutations. I do not need to show that my drug-addict neighbor is infringing on my autonomy because as I've been arguing this whole time through the value side of this debate, autonomy, self interest - liberty & freedom, do not represent the only values that lawmakers consider when making a law. Kozu's implied assertion that all other values are discarded is unreasonable and unfounded. The neighbor example depends on value assertions to which I've thoroughly responded. So again, Kozu defends the claim that all victim-less crimes should be decriminalized. If I can show any single victim-less crime to not deserve decriminalization, then I win this debate. --Drug Use-- Drugs like meth and heroin are the worst drugs in the world. Heroin has an estimated 23% addiction rate for users[1]. Heroin destroys the body, and creates one of the strongest physical addictions of any drug. According to many sources, heroin's use and even just its withdrawal can be fatal. Heroin is illegal everywhere, but heroin has been shown to be largely responsible for 4 out of 5 drug-related deaths according to a 2008 report.[2] There is a very severe violation of life and consequently the pursuit of happiness in the case of heroin. Drug use should remain criminalized. --Suicide & Assisted Suicide-- I think the value argument proves that this point should not be decriminalized. This takes a little bit of value judgment. I think that in some cases, assisted suicide should be allowed. Like, if someone is suffering a terrible terminal illness, then that person is totally entitled to ask for euthanasia. Not all cases would be like this, and I think general legalization of assisted suicide should not happen. Assisted suicide should be provided in certain professional, medical or similar such environments. Laymen should not be able to provide that service, and should be punished for trying to do so. The case against assisted suicide is based in large part on my value case. Assisted suicide abets the value of freedom, but heavily infringes on life and consequently pursuit of happiness. This is very similar to the drug case, but the rate of death in this case is 100%. -Regular Crimes- Basically Kozu makes the same refutation for Tax evasion, drunk driving, and child prostitution - that they are regular crimes. Kozu is basically saying that for something to be a victim-less crime, it can't be a regular crime. According to Kozu, if it is a regular crime, then it's not a victim-less crime. This is simply not true. A lot of crimes, like the possession and use of heroin, are both victim-less and regular. Again, Kozu makes half-qualifying criteria for some things but don't apply it to others. Kozu agrees that all drug use are victim-less crimes, but some of these drugs are also regular crimes. According to Kozu's case, these drugs aren't victim-less crimes. Living under the law, all citizens agree to obey the law. The law states that possession and use of some drugs is illegal. Does that mean that these drugs aren't victim-less crimes? According to Kozu's refutation to Tax evasion, drunk driving and child prostitution, that would be the case. But Kozu clearly believes that all drug use qualify as victim-less crimes. Kozu can't have it both ways. His refutation is inconsistent, and so it fails. If Kozu believes all drug use to be victim-less crimes, then his refutation cannot stand. Any victim-less crime that has yet to be decriminalized - any victim-less crime that is illegal - that Kozu accepts as a victim-less crime further stacks as evidence of Kozu's argumentative inconsistency. So I want to conclude that tax evasion, drunk driving, and prostitution should all remain criminalized, each with the reasons I've originally attached to them. Conclusion: Kozu has thus far been unable to demonstrate how autonomy is the only value worth considering in America's lawmaking system. I don't need to show that autonomy - liberty - is not sacrificed. I chose to show that the sacrifice in liberty is justified. Kozu doesn't really come up with a strong response to that, and so he sacrifices the entire values on which his arguments are founded. Kozu does not satisfactorily prove that all victim-less crimes should be decriminalized. On the other hand, I think I've satisfactorily shown that not all victim-less crimes should be decriminalized - that some victim-less crimes should stay criminalized. Kozu, you've been delightfully challenging, and I really enjoyed this debate. [1] [2]"],"PremiseEndPos":[46019],"ArgumentID":"00000010","Conclusion":"All victim-less crimes should be decriminalized.","PremiseStance":["Con"]}}]}