{"MetaData":{"Context":"URL: http://www.debate.org/debates/People-should-not-have-the-right-to-carry-buy-or-keep-guns./1/\nCrawl date: 2016/09/29 03:48:18\nDebate Argument: People should not have the right to carry, buy, or keep guns. | Debate.org\nNumber of arguments: 7\n\n\nEvidence Pro: This is a policy debate between PhantomEXO and I. Round 1- Acceptance (No Argumentation) Round 2- Arguments Round 3- Arguments Round 4- Rebuttals (no new arguments) Round 5- Rebuttals (no new arguments)\n\nEvidence Pro: Alright, I want to start off by reminding my opponent that this debate is a policy debate, and as you will soon find out, I will be pushing to get legislation passed. This is just a heads up. Thank you so much for taking time to read this debate. This is a prevalent issue that may soon become a reality for you. We value life. Keeping your life is your main priority. If you ask the regular man what he values most in life, they will tell you that it is their life. People are inherently selfish when it comes to protecting themselves. Yet, how do we keep our lives? We abolish or try to take away those things that set themselves up against what is threatening our lives. This is the view I shall apply today. Whether it is people, guns, or knives. ANYTHING that sets itself up against our lives and the lives of those around us must be stopped. Harms When guns are used recreationally, it results in a higher death toll. 1. Murder There were 464,033 total gun deaths between 1999 and 2013: 270,237 suicides (58.2% of total deaths); 174,773 homicides (37.7%); and 9,983 unintentional deaths (2.2%). Guns were the leading cause of death by homicide (66.6% of all homicides) and by suicide (52.2% of all suicides). Firearms were the 12th leading cause of all deaths, representing 1.3% of total deaths topping liver disease, hypertension, and Parkinson’s disease, as well as deaths from fires, drowning, and machinery accidents (1) 2. Domestic Violence Five women are murdered with guns every day in the United States. (2) A woman's risk of being murdered increases 500% if a gun is present during a domestic dispute (3) The numbers say it all. When guns are in a circulation, it results in death. If the problems exist, then the due course of action is to take away the cause, whether it is the guns or the murderers. The plan to stop the murderers is already in action. The next course of action is to take away weapons. How will we achieve this? I propose we attempt to pass a bill. Included in this bill will be one statement and three mandates. Create A Bill It will make the possession and or use of guns illegal. Guns will only be able to be obtained by police officers or other law enforcement branches with consent from either the chief of police or the head body of that organization. If this bill is passed, then the government will create a due date for all guns to be turned over. A new branch of law enforcement will be created with the following ideals. They will be in charge of collecting the guns and turning them over for use for the government. They will do so by a process called the Letters Of Confiscation. These letters will be a notice for collecting with a return handout on the back that is to be sent back. The information slots will be able to be filled in to show that the individual has proof that he or she has no guns in their possession. They will be very clear and consice. They will only issue three letters. If they have reason to believe that people still own guns, they will obtain a search warrant and search for guns. If any are found, then they will be fined or sentenced up to three months in prison. This is a very fair and nice way of taking the guns. What are some advantages to these mandates over the current system? Create A Bill No guns This bill will go through the legislative process which includes many debates and discussion by congress. It also includes the president's option to veto it within ten days. If the President doesn’t veto it, then the bill becomes law. This is a very fair process. If it does become a bill, it makes it unlawful to own guns, which in turn makes it easier to take them away. Guns will only be given to police officers by consent of the chief of police. This process allows for us to still be able to have protection. Even If we can’t protect ourselves, we still need protection. This will come from the police who are already doing a fine job. New branch of law enforcement. It creates more job oppertunities. It is under the IRS which allows them to track any serial numbers on guns from all the way back to 1968 They will have two jobs. Find who has guns Take those guns and turn them over to the government. All of this comes together in a grand solution. We take away the guns in a very realistic, fair manner. We seek protection. As my opponent will probably tell you, we should be able to protect ourselves. We already have protection! Police officers are doing a fine job of stopping crime. We see that guns are an issue. Guns are the leading cause for murder, domestic violence killing, and suicide. There is no doubt that a decrease in the guns will bring all three of these numbers down. If that is the case, then we need to do something. I have proposed a bill that should be passed. If my opponent disagrees with the bill, he must attack it. The bill that I am pushing to be passed is based off two main assumptions. First, that guns causes an increase in the risk of death in murder, suicide, and domestic violence. And that taking away the guns will diminish this risk. Second, That the bill is correct and realistic. My opponent has to destroy both of these internal links if he hopes to succeed. If he destroys them, then I have lost, but if he fails, then it stands to reason that the bill should be passed and I have won. Those are his two burdens of proof. I ask those who are reading this to contemplate them and to stay vigilant as to whether or not he disproves them. If he fails to do so, then you should vote for me. Bibliography 1. CDC, \"Data & Statistics (WISQARS),\" wisqars.cdc.gov (accessed Oct. 21, 2014 2. Arkadi Gerney and Chelsea Parsons, \"Women under the Gun: How Gun Violence Affects Women and 4 Policy Solutions to Better Protect Them,\" www.americanprogress.org, June 2014 3.Mayors against Illegal Guns, \"The Connection between Domestic Violence and Weak Gun Laws,\" www.ncadv.org, Feb. 27, 2013\n\nEvidence Pro: Thank you so much for responding. I have to say, i wasn’t expecting that quick of a response. I want to say that the fourth and fifth round cannot be used to disprove my bill because you cannot bring up any new arguments in a rebuttal round. Just add some of your arguments in your next speech and then you can add evidence to support it. “in 2013, 33,804 people died from motor vehicle traffic accidents \" and 33, 636 died from firearms. With your way of thinking, should we not then try to ban cars? They are dangerous and can easily kill us.” First, I need to see your sources so I can thoroughly investigate your claims. Also without citing your sources, your evidence is counted as void and unreliable and will not be used. You did cite them in the comments but please include it in your next argument. I looked at the website and was surprised. The article was written by a doctor about his personal feelings about gun control. He is not defending that guns should be saved, in fact he does quite the opposite. “We would think it was absurd if someone said that it was their right to drive faster than the speed limit, drive the wrong way on a one-way street or not put their kid in a car seat. I can’t imagine someone framing motor vehicle safety as a personal freedom issue. We get that cars are dangerous. But somehow gun safety discussions end up being about rights — instead of safety.”- He isn’t defending gun rights, he is saying that we should respect guns and try to keep people safe. In theory, this article supports my claim! He does say that he thinks that we shouldn’t take away guns but he does acknowledge that guns are not safe. Also, I would add that you should try to make your sources credible. Your evidence came from a doctor. Unless this doctor has some degree that helps him with statistics, he isn’t a credible source. I get what you are trying to say, but please give me the original source of that evidence. Don’t give me a source to a doctor summarizing his feelings about the gun issue, give me the source to his evidence. Thank you. I also did some extra digging and I found this source, which he cited. It is very interesting, as you will see when you visit it, that the death toll for poisoning is 48,545 deaths total or 15.4 out of 100,000 people, motor vehicle accidents is 33, 804 deaths total or 10.7 out of 100,000 people and firearms is 33,636 deaths total or 10.6 out of 100,000 people. This goes to show my main point, which is that we must attempt to stop the things that are being used to take lives. We try to stop poisoning, we try to stop car accidents, and now we are trying to take away guns. Second, if your evidence is credible, it still is a fair question. With my logic, shouldn’t we ban all things that take away life? Let’s go back to my logic, I said that “We should abolish or try to take away those things that set themselves up against what is threatening our lives.” I still will hold true to this, and I think you are misunderstanding me. There are different ways that we deal with preventing things that take away life. We try to lock murderers up. We try to get drunks off the road. We attempt to stop them. There are already gun control laws in the respect of how much ammo you can buy and such. I am proposing that we take the next step and take away the guns. See, we already are trying to lower accidents and death tolls. the solution to stop people dying in cars is to make the cars safer and upgrade our ability to see when drunk people are driving on the road. I hope that leads you back to what I am trying to say. As for your plan, I wish you would have organized it better and listed the advantages to your system over mine. Essentially you are running a counter plan on a plan already in existence. In a true policy debate you would be breaking the inherent barrier, but for the purposes of this debate, we will keep your counter plan. I will list the negative qualities of your plan. first off, your bill destroys the moral value of your argument. You said that guns can be used to hunt and are used as tools, yet your bill allows the possibility for the government to take away guns. Essentially, you can’t have your cake and eat it too. You can’t say guns are a good thing and still give the possibility for guns to be confiscated. Please expound on this point. Can the police officers confiscate guns? Second, you didn’t add any extra information about the cards. If you want to pass a bill in congress with a new card or license system, please give some information about what it will include and more about its purpose. If you are creating a card, won’t that create more work? and how will the computer systems read it? Won’t people just be able to use a regular credit card? I need more information in order to understand your bill. Third, about your stress test. You really need to give some backing to this. I need more information. How does it test for stress? There is one question in particular that you MUST answer if you wish to keep this argument: “What is the standard for the stress test? How much stress is too much?” Also, please define stress. Is it regular stress, or is it a psychological problem? Fourth, what is the purpose of this statement? “If the police find a gun on someone, they can scan the type of gun and the gun's serial number, and find who owned it. Then they can investigate.” What are they investigating? Why investigate it? And if they are investigating, under what situation can they take guns? I will now take this time to support my main assumption. Before I start, I want to note that my opponent made no attempt to destroy any of them. “guns cause an increase in the risk of death in murder, suicide, and domestic violence. And taking away the guns will diminish this risk.” Over 50,000 homicides and suicides occur each year in the United States (1), making them among the leading causes of death, particularly for young people. In 2001, homicide was the second leading cause of death and suicide the third for persons 15–24 years of age (2). Approximately 60 percent of all homicides and suicides in the United States are committed with a firearm - (1)(Arias E, Anderson RN, Kung HC, et al. Deaths: final data for 2001. Natl Vital Stat Rep 2003;52:1–116.) (2)(Centers for Disease Control and Prevention. Web-based Injury Statistics Query and Reporting System (WISQARS). Atlanta, GA: National Center for Injury Prevention and Control, 2004. (Available at the following Internet website: Kellermann et al. (13, 14) examined the relation between gun ownership and injury outcomes. After they controlled for a number of potentially confounding factors, the presence of a gun in the home was associated with a nearly fivefold risk of suicide (adjusted odds ratio = 4.8) (13) and an almost threefold risk of homicide (adjusted odds ratio = 2.7) (14). - (13) Kellermann AL, Rivara FP, Somes G, et al. Suicide in relation to gun ownership. N Engl J Med 1992;327:467–72. (14)Kellermann AL, Rivara FP, Rushforth NB, et al. Gun ownership as a risk factor for homicide in the home. N Engl J Med 1993;329:1084–91. Both of these studies indicate one thing. There is a higher risk for death when a gun is in the home than if it is not. That is indisputable. We know that guns cause death, and when a gun is in a home then it increases the probability of death. We know that it causes death, so what should we do about it? My plan will take away the main cause of homicide and suicide. My plan is a fair, logical, and benefitial way of confiscating guns. If we don't pass my bill, then what happens? We keep the guns and the homicide and suicide rates stay the same. If we do pass my bill, then what happens? We lose our guns, the homicide and suicide rates go down AND we still have protection from criminals who still have guns! I prefer the second option. What about you? you are reading this and are going to make a desicion. Please think carefully. Which is more important? gun rights? or life? That really is what the debate will rest on. I also want to ask my opponent to please give some backing to his arguemnts. WHERE do we find the right to keep guns? WHO decides if we get to keep them. Most people say the second ammendment. (i said this to allow my self to argue it in the rebbuttals) I disagree with the second ammendment. (i will not expound becuase my opponent hasn't said anything on this topic) My opponent still hasn’t attacked my bill, and if he does not, then I win the round. He has to take away my bill, no question. He has to show one of three things: my bill will not stop the harms. my bill isn’t topical to the debate my bill is morally unacceptable. If my opponent doesn’t respond to this bill in the next argument, then he cannot talk about it AT ALL in the rebuttals. AND if he doesn't show why my bill is mortally flawed, then I win. :)\n\nEvidence Pro: UM, I NEVER SAID THAT POLICE OFFICERS CANT HAVE GUNS!Do you even read my arguemnts?In my second mandate I say this-\"Guns will only be able to be obtained by police officers or other law enforcement branches with consent from either the chief of police or the head body of that organization. \"This says the police officers get their guns, but the unstable ones or the ones that can't do their job will not be allowed to keep their guns.So in other words, every police officer gets a gun. Only those that can no longer do their job will not keep their guns.Today, police offficers are dissmised if they cannot do their job.So there goes pretty much all of your arguments...U still haven't covered ANY of my argumets or my CLEARLY stated two main assumptions.I don't need to back up any of my arguemts because you haven't torn them down.\n\nEvidence Con: Okay, what is the 4 and 5 round for?\n\nEvidence Con: First of all, id like to say that in the fourth&fifth round is when i will try and disprove his bill. For now i will simply give my argument. I disagree with the bill. I will state facts why. in 2013, 33,804 people died from motor vehicle traffic accidents \" and 33, 636 died from firearms. With your way of thinking, should we not then try to ban cars? They are dangerous and can easily kill us. Guns may be used as a form of offensive strikes. But they are mainly used as a form of defence. People also use guns as tools to hunt, without guns, how would that happen? Our food rates may even go down. I propose a diffrent bill. Every person that ownes a gun should get a card, much like a credit card. But the diffrences is that everyone time someone buys a gun or bullets, he swipes his card. The card registers the gun and how many bullets one person buys. Every single person is only allowed to buy so many bullets a month. The card would register it. So whenever someone is in question of their guns and bullets, their card may be swiped by the police. It also holds ones gun permit. If the police find a gun on someone, they can scan the type of gun and the guns serial number, and find who owned it. Then they can investigate. Along with that, every year a gun owner must do a stress test.(a stress test, as it says, tests ones stress, allowing them to tell if the person gets angry easier.) If ones stress test it too high, their guns can get suspended for a time until the pass the test.\n\nEvidence Con: okay, i think i get it now. I do see some things wrong with your bill. Your bill takes away guns from people, as well as lower class police officers,(unless consented from a higher up source grants them)but their have been many cases where a smaller amount of police officers have come across a much bigger amount of thugs. Guns give the police a big advantage, but if you take away the guns, the police lose a lot of protection. And though the bill will create a unit to confinscate guns, their will always be illegal sales of guns. So police will not only be going against unarmed people, but also people armed with guns, while they have close to nothing. For example, around last year uprising in baltimore had a huge problem with riots and uprisings. They called in about 1,000-3,000 police officers to help. Thousands of people were rioting, and some people and police were hospitalized. ~ If the police didnt have guns, they would have probably been beaten and killed. Their have also been many terrorist bombings from ISIS and some unknown groups. Police would have a extremely hard time keeping control and diminishing these types if things without guns. The bombings and killings would also become more likely.\n","DiscussionID":"00000037","Title":"People should not have the right to carry, buy, or keep guns.","CrawlDate":"2016/09/29 03:48:18","URL":"http://www.debate.org/debates/People-should-not-have-the-right-to-carry-buy-or-keep-guns./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":147,"ConclusionEndPos":208,"nextID":"00000002","PremiseStartPos":[260],"prevID":"00000000","Premise":["This is a policy debate between PhantomEXO and I. Round 1- Acceptance (No Argumentation) Round 2- Arguments Round 3- Arguments Round 4- Rebuttals (no new arguments) Round 5- Rebuttals (no new arguments)"],"PremiseEndPos":[463],"ArgumentID":"00000001","Conclusion":"People should not have the right to carry, buy, or keep guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":147,"ConclusionEndPos":208,"nextID":"00000003","PremiseStartPos":[478],"prevID":"00000001","Premise":["Alright, I want to start off by reminding my opponent that this debate is a policy debate, and as you will soon find out, I will be pushing to get legislation passed. This is just a heads up. Thank you so much for taking time to read this debate. This is a prevalent issue that may soon become a reality for you. We value life. Keeping your life is your main priority. If you ask the regular man what he values most in life, they will tell you that it is their life. People are inherently selfish when it comes to protecting themselves. Yet, how do we keep our lives? We abolish or try to take away those things that set themselves up against what is threatening our lives. This is the view I shall apply today. Whether it is people, guns, or knives. ANYTHING that sets itself up against our lives and the lives of those around us must be stopped. Harms When guns are used recreationally, it results in a higher death toll. 1. Murder There were 464,033 total gun deaths between 1999 and 2013: 270,237 suicides (58.2% of total deaths); 174,773 homicides (37.7%); and 9,983 unintentional deaths (2.2%). Guns were the leading cause of death by homicide (66.6% of all homicides) and by suicide (52.2% of all suicides). Firearms were the 12th leading cause of all deaths, representing 1.3% of total deaths topping liver disease, hypertension, and Parkinson’s disease, as well as deaths from fires, drowning, and machinery accidents (1) 2. Domestic Violence Five women are murdered with guns every day in the United States. (2) A woman's risk of being murdered increases 500% if a gun is present during a domestic dispute (3) The numbers say it all. When guns are in a circulation, it results in death. If the problems exist, then the due course of action is to take away the cause, whether it is the guns or the murderers. The plan to stop the murderers is already in action. The next course of action is to take away weapons. How will we achieve this? I propose we attempt to pass a bill. Included in this bill will be one statement and three mandates. Create A Bill It will make the possession and or use of guns illegal. Guns will only be able to be obtained by police officers or other law enforcement branches with consent from either the chief of police or the head body of that organization. If this bill is passed, then the government will create a due date for all guns to be turned over. A new branch of law enforcement will be created with the following ideals. They will be in charge of collecting the guns and turning them over for use for the government. They will do so by a process called the Letters Of Confiscation. These letters will be a notice for collecting with a return handout on the back that is to be sent back. The information slots will be able to be filled in to show that the individual has proof that he or she has no guns in their possession. They will be very clear and consice. They will only issue three letters. If they have reason to believe that people still own guns, they will obtain a search warrant and search for guns. If any are found, then they will be fined or sentenced up to three months in prison. This is a very fair and nice way of taking the guns. What are some advantages to these mandates over the current system? Create A Bill No guns This bill will go through the legislative process which includes many debates and discussion by congress. It also includes the president's option to veto it within ten days. If the President doesn’t veto it, then the bill becomes law. This is a very fair process. If it does become a bill, it makes it unlawful to own guns, which in turn makes it easier to take them away. Guns will only be given to police officers by consent of the chief of police. This process allows for us to still be able to have protection. Even If we can’t protect ourselves, we still need protection. This will come from the police who are already doing a fine job. New branch of law enforcement. It creates more job oppertunities. It is under the IRS which allows them to track any serial numbers on guns from all the way back to 1968 They will have two jobs. Find who has guns Take those guns and turn them over to the government. All of this comes together in a grand solution. We take away the guns in a very realistic, fair manner. We seek protection. As my opponent will probably tell you, we should be able to protect ourselves. We already have protection! Police officers are doing a fine job of stopping crime. We see that guns are an issue. Guns are the leading cause for murder, domestic violence killing, and suicide. There is no doubt that a decrease in the guns will bring all three of these numbers down. If that is the case, then we need to do something. I have proposed a bill that should be passed. If my opponent disagrees with the bill, he must attack it. The bill that I am pushing to be passed is based off two main assumptions. First, that guns causes an increase in the risk of death in murder, suicide, and domestic violence. And that taking away the guns will diminish this risk. Second, That the bill is correct and realistic. My opponent has to destroy both of these internal links if he hopes to succeed. If he destroys them, then I have lost, but if he fails, then it stands to reason that the bill should be passed and I have won. Those are his two burdens of proof. I ask those who are reading this to contemplate them and to stay vigilant as to whether or not he disproves them. If he fails to do so, then you should vote for me. Bibliography 1. CDC, \"Data & Statistics (WISQARS),\" wisqars.cdc.gov (accessed Oct. 21, 2014 2. Arkadi Gerney and Chelsea Parsons, \"Women under the Gun: How Gun Violence Affects Women and 4 Policy Solutions to Better Protect Them,\" www.americanprogress.org, June 2014 3.Mayors against Illegal Guns, \"The Connection between Domestic Violence and Weak Gun Laws,\" www.ncadv.org, Feb. 27, 2013"],"PremiseEndPos":[6392],"ArgumentID":"00000002","Conclusion":"People should not have the right to carry, buy, or keep guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":147,"ConclusionEndPos":208,"nextID":"00000004","PremiseStartPos":[6407],"prevID":"00000002","Premise":["Thank you so much for responding. I have to say, i wasn’t expecting that quick of a response. I want to say that the fourth and fifth round cannot be used to disprove my bill because you cannot bring up any new arguments in a rebuttal round. Just add some of your arguments in your next speech and then you can add evidence to support it. “in 2013, 33,804 people died from motor vehicle traffic accidents \" and 33, 636 died from firearms. With your way of thinking, should we not then try to ban cars? They are dangerous and can easily kill us.” First, I need to see your sources so I can thoroughly investigate your claims. Also without citing your sources, your evidence is counted as void and unreliable and will not be used. You did cite them in the comments but please include it in your next argument. I looked at the website and was surprised. The article was written by a doctor about his personal feelings about gun control. He is not defending that guns should be saved, in fact he does quite the opposite. “We would think it was absurd if someone said that it was their right to drive faster than the speed limit, drive the wrong way on a one-way street or not put their kid in a car seat. I can’t imagine someone framing motor vehicle safety as a personal freedom issue. We get that cars are dangerous. But somehow gun safety discussions end up being about rights — instead of safety.”- He isn’t defending gun rights, he is saying that we should respect guns and try to keep people safe. In theory, this article supports my claim! He does say that he thinks that we shouldn’t take away guns but he does acknowledge that guns are not safe. Also, I would add that you should try to make your sources credible. Your evidence came from a doctor. Unless this doctor has some degree that helps him with statistics, he isn’t a credible source. I get what you are trying to say, but please give me the original source of that evidence. Don’t give me a source to a doctor summarizing his feelings about the gun issue, give me the source to his evidence. Thank you. I also did some extra digging and I found this source, which he cited. It is very interesting, as you will see when you visit it, that the death toll for poisoning is 48,545 deaths total or 15.4 out of 100,000 people, motor vehicle accidents is 33, 804 deaths total or 10.7 out of 100,000 people and firearms is 33,636 deaths total or 10.6 out of 100,000 people. This goes to show my main point, which is that we must attempt to stop the things that are being used to take lives. We try to stop poisoning, we try to stop car accidents, and now we are trying to take away guns. Second, if your evidence is credible, it still is a fair question. With my logic, shouldn’t we ban all things that take away life? Let’s go back to my logic, I said that “We should abolish or try to take away those things that set themselves up against what is threatening our lives.” I still will hold true to this, and I think you are misunderstanding me. There are different ways that we deal with preventing things that take away life. We try to lock murderers up. We try to get drunks off the road. We attempt to stop them. There are already gun control laws in the respect of how much ammo you can buy and such. I am proposing that we take the next step and take away the guns. See, we already are trying to lower accidents and death tolls. the solution to stop people dying in cars is to make the cars safer and upgrade our ability to see when drunk people are driving on the road. I hope that leads you back to what I am trying to say. As for your plan, I wish you would have organized it better and listed the advantages to your system over mine. Essentially you are running a counter plan on a plan already in existence. In a true policy debate you would be breaking the inherent barrier, but for the purposes of this debate, we will keep your counter plan. I will list the negative qualities of your plan. first off, your bill destroys the moral value of your argument. You said that guns can be used to hunt and are used as tools, yet your bill allows the possibility for the government to take away guns. Essentially, you can’t have your cake and eat it too. You can’t say guns are a good thing and still give the possibility for guns to be confiscated. Please expound on this point. Can the police officers confiscate guns? Second, you didn’t add any extra information about the cards. If you want to pass a bill in congress with a new card or license system, please give some information about what it will include and more about its purpose. If you are creating a card, won’t that create more work? and how will the computer systems read it? Won’t people just be able to use a regular credit card? I need more information in order to understand your bill. Third, about your stress test. You really need to give some backing to this. I need more information. How does it test for stress? There is one question in particular that you MUST answer if you wish to keep this argument: “What is the standard for the stress test? How much stress is too much?” Also, please define stress. Is it regular stress, or is it a psychological problem? Fourth, what is the purpose of this statement? “If the police find a gun on someone, they can scan the type of gun and the gun's serial number, and find who owned it. Then they can investigate.” What are they investigating? Why investigate it? And if they are investigating, under what situation can they take guns? I will now take this time to support my main assumption. Before I start, I want to note that my opponent made no attempt to destroy any of them. “guns cause an increase in the risk of death in murder, suicide, and domestic violence. And taking away the guns will diminish this risk.” Over 50,000 homicides and suicides occur each year in the United States (1), making them among the leading causes of death, particularly for young people. In 2001, homicide was the second leading cause of death and suicide the third for persons 15–24 years of age (2). Approximately 60 percent of all homicides and suicides in the United States are committed with a firearm - (1)(Arias E, Anderson RN, Kung HC, et al. Deaths: final data for 2001. Natl Vital Stat Rep 2003;52:1–116.) (2)(Centers for Disease Control and Prevention. Web-based Injury Statistics Query and Reporting System (WISQARS). Atlanta, GA: National Center for Injury Prevention and Control, 2004. (Available at the following Internet website: Kellermann et al. (13, 14) examined the relation between gun ownership and injury outcomes. After they controlled for a number of potentially confounding factors, the presence of a gun in the home was associated with a nearly fivefold risk of suicide (adjusted odds ratio = 4.8) (13) and an almost threefold risk of homicide (adjusted odds ratio = 2.7) (14). - (13) Kellermann AL, Rivara FP, Somes G, et al. Suicide in relation to gun ownership. N Engl J Med 1992;327:467–72. (14)Kellermann AL, Rivara FP, Rushforth NB, et al. Gun ownership as a risk factor for homicide in the home. N Engl J Med 1993;329:1084–91. Both of these studies indicate one thing. There is a higher risk for death when a gun is in the home than if it is not. That is indisputable. We know that guns cause death, and when a gun is in a home then it increases the probability of death. We know that it causes death, so what should we do about it? My plan will take away the main cause of homicide and suicide. My plan is a fair, logical, and benefitial way of confiscating guns. If we don't pass my bill, then what happens? We keep the guns and the homicide and suicide rates stay the same. If we do pass my bill, then what happens? We lose our guns, the homicide and suicide rates go down AND we still have protection from criminals who still have guns! I prefer the second option. What about you? you are reading this and are going to make a desicion. Please think carefully. Which is more important? gun rights? or life? That really is what the debate will rest on. I also want to ask my opponent to please give some backing to his arguemnts. WHERE do we find the right to keep guns? WHO decides if we get to keep them. Most people say the second ammendment. (i said this to allow my self to argue it in the rebbuttals) I disagree with the second ammendment. (i will not expound becuase my opponent hasn't said anything on this topic) My opponent still hasn’t attacked my bill, and if he does not, then I win the round. He has to take away my bill, no question. He has to show one of three things: my bill will not stop the harms. my bill isn’t topical to the debate my bill is morally unacceptable. If my opponent doesn’t respond to this bill in the next argument, then he cannot talk about it AT ALL in the rebuttals. AND if he doesn't show why my bill is mortally flawed, then I win. :)"],"PremiseEndPos":[15284],"ArgumentID":"00000003","Conclusion":"People should not have the right to carry, buy, or keep guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":147,"ConclusionEndPos":208,"nextID":"00000005","PremiseStartPos":[15299],"prevID":"00000003","Premise":["UM, I NEVER SAID THAT POLICE OFFICERS CANT HAVE GUNS!Do you even read my arguemnts?In my second mandate I say this-\"Guns will only be able to be obtained by police officers or other law enforcement branches with consent from either the chief of police or the head body of that organization. \"This says the police officers get their guns, but the unstable ones or the ones that can't do their job will not be allowed to keep their guns.So in other words, every police officer gets a gun. Only those that can no longer do their job will not keep their guns.Today, police offficers are dissmised if they cannot do their job.So there goes pretty much all of your arguments...U still haven't covered ANY of my argumets or my CLEARLY stated two main assumptions.I don't need to back up any of my arguemts because you haven't torn them down."],"PremiseEndPos":[16134],"ArgumentID":"00000004","Conclusion":"People should not have the right to carry, buy, or keep guns.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":147,"ConclusionEndPos":208,"nextID":"00000006","PremiseStartPos":[16149],"prevID":"00000004","Premise":["Okay, what is the 4 and 5 round for?"],"PremiseEndPos":[16186],"ArgumentID":"00000005","Conclusion":"People should not have the right to carry, buy, or keep guns.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":147,"ConclusionEndPos":208,"nextID":"00000007","PremiseStartPos":[16201],"prevID":"00000005","Premise":["First of all, id like to say that in the fourth&fifth round is when i will try and disprove his bill. For now i will simply give my argument. I disagree with the bill. I will state facts why. in 2013, 33,804 people died from motor vehicle traffic accidents \" and 33, 636 died from firearms. With your way of thinking, should we not then try to ban cars? They are dangerous and can easily kill us. Guns may be used as a form of offensive strikes. But they are mainly used as a form of defence. People also use guns as tools to hunt, without guns, how would that happen? Our food rates may even go down. I propose a diffrent bill. Every person that ownes a gun should get a card, much like a credit card. But the diffrences is that everyone time someone buys a gun or bullets, he swipes his card. The card registers the gun and how many bullets one person buys. Every single person is only allowed to buy so many bullets a month. The card would register it. So whenever someone is in question of their guns and bullets, their card may be swiped by the police. It also holds ones gun permit. If the police find a gun on someone, they can scan the type of gun and the guns serial number, and find who owned it. Then they can investigate. Along with that, every year a gun owner must do a stress test.(a stress test, as it says, tests ones stress, allowing them to tell if the person gets angry easier.) If ones stress test it too high, their guns can get suspended for a time until the pass the test."],"PremiseEndPos":[17698],"ArgumentID":"00000006","Conclusion":"People should not have the right to carry, buy, or keep guns.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":147,"ConclusionEndPos":208,"nextID":"00000000","PremiseStartPos":[17713],"prevID":"00000006","Premise":["okay, i think i get it now. I do see some things wrong with your bill. Your bill takes away guns from people, as well as lower class police officers,(unless consented from a higher up source grants them)but their have been many cases where a smaller amount of police officers have come across a much bigger amount of thugs. Guns give the police a big advantage, but if you take away the guns, the police lose a lot of protection. And though the bill will create a unit to confinscate guns, their will always be illegal sales of guns. So police will not only be going against unarmed people, but also people armed with guns, while they have close to nothing. For example, around last year uprising in baltimore had a huge problem with riots and uprisings. They called in about 1,000-3,000 police officers to help. Thousands of people were rioting, and some people and police were hospitalized. ~ If the police didnt have guns, they would have probably been beaten and killed. Their have also been many terrorist bombings from ISIS and some unknown groups. Police would have a extremely hard time keeping control and diminishing these types if things without guns. The bombings and killings would also become more likely."],"PremiseEndPos":[18933],"ArgumentID":"00000007","Conclusion":"People should not have the right to carry, buy, or keep guns.","PremiseStance":["Con"]}}]}