{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-Unwinnable-Debate/1/\nCrawl date: 2016/09/29 06:54:04\nDebate Argument: The Unwinnable Debate | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: Hello, Debate.org. Today, I propose an unwinnable argument. This argument is around various facets of the nature of the universe. 1. Do we exist? There is no real proof that we exist. We could, at the moment, be a figment of imagination. Since we sleep, this could be when we no longer truly exist. Since we don't know how we exist, this point is impossible to disprove. 2. Does the universe extend infinitely? Since nothing practical in usage by humanity is infinte, and the universe contains everything known to be practical, then the universe itself must be finite. 3. Is there even a universe? Much like Point 1, the existence of the universe is not unprovable to be in existence. -The God Hand\n\nEvidence Pro: Thank you, CON, for accepting this debate. 1. Do WE truly exist while we are asleep? Mentally, this could simply be metaphysical regeneration of our existence. It is possible that the only physical existence is that of another being, who may, in turn, be the dream of a higher being. 2. Considering the fact that the universe started some 15 billion years ago, then it could only be around 15 billion light years in each dimension. This is not considering warped dimensions or alternate realities or other such things that could theoretically lead to infinite sizes but have not been proven. 3. We may exist, but only to ourselves. We may, in fact, not exist simply because we are, in fact, the thoughts of someone else. Perhaps we are even the thoughts of each other, but that is not provable because we exist, but perhaps only to ourselves.\n\nEvidence Pro: 1. \"Our World?\" Does our world exist? We may think it does because we are in it, but that is assuming we exist. Our reality has yet to be proved by the CON. 2. Cyclic? That would require and infinite number of cycles, once again unprovable. 3. How do you know that we think? How do we know our thoughts aren't already written for us? Prove we don't walk into daylight, our actions and paths prewritten for us.\n\nEvidence Con: Hi The God Hand, and good luck! 1. As far as proving we all actually exist, that is impossible. However, our physical bodies still exist to other points of view while we are asleep. 2. Infinity is currently nothing more than an imaginary figure, as we've found nothing yet that is truly infinite. However, we can't assume that the universe is NOT infinite because we haven't found where it ends. 3. \"Reality\" is the consensus of all beings' perceptions. By that definition, we exist.\n\nEvidence Con: 1. This is possible, but we have no perception of that being. We cannot assert such a claim based on our current view of our world. 2. If the universe began, this would be true. However, if the universe is cyclic, it is theoretically infinite. Infinity is at least very plausible. 3. Does our ability to think about such things not affirm our existence in what we designate \"reality\"? \"Cogito ergo sum\" - Descartes [1] [1]\n\nEvidence Con: 1. The only opposing position is to assume we do not exist, which is just as much unproven. 2. Conservation of energy; energy cannot be created or destroyed, it can only change from one form to another. 3. I cannot prove our paths are prewritten, but you cannot prove we do not have complete free will in a linear timeline. Conclusion: Con's assertions rely on doubt of the opposing position, not affirmation of his own. Is not the universe just as much a mystery as when we began? :)\n","DiscussionID":"00000055","Title":"The Unwinnable Debate","CrawlDate":"2016/09/29 06:54:04","URL":"http://www.debate.org/debates/The-Unwinnable-Debate/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":109,"ConclusionEndPos":130,"nextID":"00000002","PremiseStartPos":[182],"prevID":"00000000","Premise":["Hello, Debate.org. Today, I propose an unwinnable argument. This argument is around various facets of the nature of the universe. 1. Do we exist? There is no real proof that we exist. We could, at the moment, be a figment of imagination. Since we sleep, this could be when we no longer truly exist. Since we don't know how we exist, this point is impossible to disprove. 2. Does the universe extend infinitely? Since nothing practical in usage by humanity is infinte, and the universe contains everything known to be practical, then the universe itself must be finite. 3. Is there even a universe? Much like Point 1, the existence of the universe is not unprovable to be in existence. -The God Hand"],"PremiseEndPos":[881],"ArgumentID":"00000001","Conclusion":"The Unwinnable Debate","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":109,"ConclusionEndPos":130,"nextID":"00000003","PremiseStartPos":[896],"prevID":"00000001","Premise":["Thank you, CON, for accepting this debate. 1. Do WE truly exist while we are asleep? Mentally, this could simply be metaphysical regeneration of our existence. It is possible that the only physical existence is that of another being, who may, in turn, be the dream of a higher being. 2. Considering the fact that the universe started some 15 billion years ago, then it could only be around 15 billion light years in each dimension. This is not considering warped dimensions or alternate realities or other such things that could theoretically lead to infinite sizes but have not been proven. 3. We may exist, but only to ourselves. We may, in fact, not exist simply because we are, in fact, the thoughts of someone else. Perhaps we are even the thoughts of each other, but that is not provable because we exist, but perhaps only to ourselves."],"PremiseEndPos":[1739],"ArgumentID":"00000002","Conclusion":"The Unwinnable Debate","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":109,"ConclusionEndPos":130,"nextID":"00000004","PremiseStartPos":[1754],"prevID":"00000002","Premise":["1. \"Our World?\" Does our world exist? We may think it does because we are in it, but that is assuming we exist. Our reality has yet to be proved by the CON. 2. Cyclic? That would require and infinite number of cycles, once again unprovable. 3. How do you know that we think? How do we know our thoughts aren't already written for us? Prove we don't walk into daylight, our actions and paths prewritten for us."],"PremiseEndPos":[2164],"ArgumentID":"00000003","Conclusion":"The Unwinnable Debate","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":109,"ConclusionEndPos":130,"nextID":"00000005","PremiseStartPos":[2179],"prevID":"00000003","Premise":["Hi The God Hand, and good luck! 1. As far as proving we all actually exist, that is impossible. However, our physical bodies still exist to other points of view while we are asleep. 2. Infinity is currently nothing more than an imaginary figure, as we've found nothing yet that is truly infinite. However, we can't assume that the universe is NOT infinite because we haven't found where it ends. 3. \"Reality\" is the consensus of all beings' perceptions. By that definition, we exist."],"PremiseEndPos":[2663],"ArgumentID":"00000004","Conclusion":"The Unwinnable Debate","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":109,"ConclusionEndPos":130,"nextID":"00000006","PremiseStartPos":[2678],"prevID":"00000004","Premise":["1. This is possible, but we have no perception of that being. We cannot assert such a claim based on our current view of our world. 2. If the universe began, this would be true. However, if the universe is cyclic, it is theoretically infinite. Infinity is at least very plausible. 3. Does our ability to think about such things not affirm our existence in what we designate \"reality\"? \"Cogito ergo sum\" - Descartes [1] [1]"],"PremiseEndPos":[3101],"ArgumentID":"00000005","Conclusion":"The Unwinnable Debate","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":109,"ConclusionEndPos":130,"nextID":"00000000","PremiseStartPos":[3116],"prevID":"00000005","Premise":["1. The only opposing position is to assume we do not exist, which is just as much unproven. 2. Conservation of energy; energy cannot be created or destroyed, it can only change from one form to another. 3. I cannot prove our paths are prewritten, but you cannot prove we do not have complete free will in a linear timeline. Conclusion: Con's assertions rely on doubt of the opposing position, not affirmation of his own. Is not the universe just as much a mystery as when we began? :)"],"PremiseEndPos":[3601],"ArgumentID":"00000006","Conclusion":"The Unwinnable Debate","PremiseStance":["Con"]}}]}