{"MetaData":{"Context":"URL: http://www.debate.org/debates/Rebeldixie01-and-Iamaconfederate-are-terrible-people./1/\nCrawl date: 2016/09/29 03:22:50\nDebate: Rebeldixie01 and Iamaconfederate are terrible people. | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: I will attempt to do 3 things in this debate. The stakes are high, as the loser has to leave DDO for 2 weeks. I will prove that... - America would be led to chaos if they ever came to power. - They are bigots, even if they don't realize it. - They are uneducated on politics, and how the world works. If the audience can think of anything else I should argue them on, I will most likely add it. My opponents goal is to disprove all three statements I made. If even one of these points is left standing, then my opponent, rebel or confederate, have to leave DDO for 2 weeks. So I remind them that by accepting this debate, they are aware of the consequences. Additional Items of Information -------------------------------------------------- - I will have the BOP. - Debate.org can be used as a source. - Voters must have completed 6 debates to vote. Defintions that might come up -------------------------------------------------- Neo confederates neo-confederate Web definitions Neo-Confederate is a term used by some academics and political activists to describe the views of various groups and individuals who have a positive belief system concerning the historical experience of the Confederate States of America, the Southern secession, and the Southern United States. Bigot big·ot noun \\G2;bi-gət\\ : a person who strongly and unfairly dislikes other people, ideas, etc. : a bigoted person; especially : a person who hates or refuses to accept the members of a particular group (such as a racial or religious group) Politics pol·i·tics noun plural but singular or plural in construction \\G2;pä-lə-G6;tiks\\ : activities that relate to influencing the actions and policies of a government or getting and keeping power in a government : the work or job of people (such as elected officials) who are part of a government : the opinions that someone has about what should be done by governments : a person's political thoughts and opinions\n\nEvidence Pro: I just want to remind the audience, that the title of the debate is different then the resolution. The resolution are the 3 points I outlined, which for Rebel to win, he must defuse all three. Case 1: Rebel Dixie and ImaConfederate would lead America to chaos. Views Expressed by the two parties IamAConfederate ----------------------- - Believes that the southern states should secede from America, as the liberal north is too far gone. href=\" target=\"blank\"> Will ban gay-straight alliances from schools, even though they are a innocent support group that help homosexual and confused individuals become accepted. supress the rights of LGBT's. Evident by him saying gays will never be socially or politically accepted. deport all non-white people from the United States. He actually outright said this. Keep that in mind for case 2. It can be assumed he would kick out all muslims from America, evident by hi stating Islam is evil It can be assumed he would enact anti-gay policies. Pretty much evident by every thing he's ever wrote on this site. He is indecisive, evident by him often contradicting himself. He claims to be Jewish, Atheist, and Christian. href=\" target=\"blank\"> He would support North Korea He would ban tobbaco, as he claims to be anti drug, and considers tobbaco a drug. It can be assumed that he would force religon on the masses, evident by this poll. He would abolish gay marriage. style=\"font-size: x-large;\">Case 2: RebelDixie and IamAConfederate are Bigots Bigot big·ot noun \\G2;bi-gət\\ : a person who strongly and unfairly dislikes other people, ideas, etc. : a bigoted person; especially : a person who hates or refuses to accept the members of a particular group (such as a racial or religious group) Evident by the definition, a bigot is anyone who refuses to accept members of an individual group, or hates them. Iamaconfederate: Currently, I have deducted that he is 1. Anti Black 2. Anti LGBT 3. Anti Mexican 4. Anti Atheist Argument 1: Anti Black and Mexican - In this debate, Iamaconfederate argued against racial diversity style=\"font-family: 'trebuchet ms', geneva;\">He said something offensive over the course of the debate.... \"I could possibly agree with interbreeding on a small scale. That is how the Mexicans got started...\" Now, he also said some pretty racist things towards blacks... Here he makes a racial stereotype regarding blacks, pointed out by two members. Yes on occasion. \"I would say that you are black, becuase white people don't say represent a lot. Not a racist or anything, I've just noticed that black people tend to say things like represent, yo, wassup,swag or swagger, and other stuff like that. I would say its a cultural thing. It's what makes people unique.\" style=\"font-size: large;\">Neo Confederalist Iamaconfederate claims to be a neo-confederate on his profile, which the southern poverty league considers a, \"hate ideology\". They also say it overlaps with white supremacy, and that members will often deny being racist, which he says after every racist thing. style=\"font-family: 'trebuchet ms', geneva;\">Anti LGBT ============ A common pattern among denial bigots, is that they will back up their racism with false statistics or facts. Here are a few anti LGBT examples.... I will restate my original quote by him \"Being gay is not morally, spiritually, socially, or politically acceptable, and it never will be.\" Just by saying that, he proves that he hates and refuses to accept a group. Therefore, a bigot. Also.... \"Well, homosexuals don't deserve respect, they go against natural laws and defy the bible and God, they don't need to treat them with respect, they need to treat them with the exact opposite of respect, Leviticus 20:13,\" style=\"font-family: 'trebuchet ms', geneva;\">Once again, he fits the definition of bigotry. RebelRebelDixieDixie01: Alright, now there is no doubt this guy is bigoted. \"I'm interested to see what the world would be like without religion, chaos, evil, same sex marriage laws being passed, the world would be a sucky place to live in, and you know it.\" style=\"font-family: 'trebuchet ms', geneva;\">On this poll, he choose \"keep the mexicans out\" style=\"font-family: 'trebuchet ms', geneva;\">This poll really ticked me off. Which president would you rather have, and he choose White. 5 people started bashing him in the comments. style=\"font-family: 'trebuchet ms', geneva;\">And this one.... style=\"font-family: 'trebuchet ms', geneva;\">I will move to case 3 next round. At the moment, I wish to refute a few of my opponents arguments. 1. I'm awesome According to the rules, I must prove he would lead America to destruction to win. He's not helping his case. 2. In real life, I help people all the time. Ok, but also not helping his case. 4. I can only be so bad considering I am 12 years old. Terrible Argument, read this... style=\"font-weight: bold; font-family: 'trebuchet ms', geneva;\">Ok, that is all for this round, and I would like to remind the audience the rules. If rebel fails to disprove all three points I set in the first round, he loses the debate.\n\nEvidence Pro: I have to forfeit this round, even though I will continue debating. My opponent can drop the debate if he wishes though, and we'll keep it tied\n\nEvidence Pro: Extend all arguments. I am personally unimpressed with my opponents lack of will to debate this. He didn't respond to a single argument I made, and \"I'm not anti-black\" seems to be a rather weak rebuttal. Also, I would like to point out, that the rules state if one of the arguments is left standing, then I win the argument points. My opponent has admitted to being a bigot by stating he is anti-homosexual. Which means all points should be forfeited in the argument category.\n\nEvidence Con: I accept. Here are my reasons for why I am not a terrible person. 1. I'm awesome 2. In real life, I help people all the time. 3. I'm a boy scout. 4. I can only be so bad considering I am 12 years old. Those are just a couple of reasons. I await my opponents srfuments\n\nEvidence Con: None of those things makes me or my brother terrible. It's actually terrible for you to challenge me to a debate like this. All of those things you put were our opinions. Just because we would lead America to chaos (which is our goal) wouldn't make us terrible people, due to the fact that america is evil, well, at least the USA. If we are bigots, that doesn't make us terrible. Im not anti black. Racial diversity is so we can keep our cultures separate (a good thing) You make this gay (homosexual, sorry, didnt want to be offensive) debate and expect to prove we are terrible, but you just point out our opinions, yes, we're confederates, well, were pro south, yes, we hate the US, and yes, we're anti homosexual, but that makes us patriots for our culture, not terrible people.\n\nEvidence Con: RebelRebelDixieDixie01 forfeited this round. Pro Extend all arguments. I am personally unimpressed with my opponents lack of will to debate this. He didn't respond to a single argument I made, and \"I'm not anti-black\" seems to be a rather weak rebuttal. Also, I would like to point out, that the rules state if one of the arguments is left standing, then I win the argument points. My opponent has admitted to being a bigot by stating he is anti-homosexual. Which means all points should be forfeited in the argument category.\n","DiscussionID":"00000112","Title":"Rebeldixie01 and Iamaconfederate are terrible people.","CrawlDate":"2016/09/29 03:22:50","URL":"http://www.debate.org/debates/Rebeldixie01-and-Iamaconfederate-are-terrible-people./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":185,"nextID":"00000002","PremiseStartPos":[237],"prevID":"00000000","Premise":["I will attempt to do 3 things in this debate. The stakes are high, as the loser has to leave DDO for 2 weeks. I will prove that... - America would be led to chaos if they ever came to power. - They are bigots, even if they don't realize it. - They are uneducated on politics, and how the world works. If the audience can think of anything else I should argue them on, I will most likely add it. My opponents goal is to disprove all three statements I made. If even one of these points is left standing, then my opponent, rebel or confederate, have to leave DDO for 2 weeks. So I remind them that by accepting this debate, they are aware of the consequences. Additional Items of Information -------------------------------------------------- - I will have the BOP. - Debate.org can be used as a source. - Voters must have completed 6 debates to vote. Defintions that might come up -------------------------------------------------- Neo confederates neo-confederate Web definitions Neo-Confederate is a term used by some academics and political activists to describe the views of various groups and individuals who have a positive belief system concerning the historical experience of the Confederate States of America, the Southern secession, and the Southern United States. Bigot big·ot noun \\G2;bi-gət\\ : a person who strongly and unfairly dislikes other people, ideas, etc. : a bigoted person; especially : a person who hates or refuses to accept the members of a particular group (such as a racial or religious group) Politics pol·i·tics noun plural but singular or plural in construction \\G2;pä-lə-G6;tiks\\ : activities that relate to influencing the actions and policies of a government or getting and keeping power in a government : the work or job of people (such as elected officials) who are part of a government : the opinions that someone has about what should be done by governments : a person's political thoughts and opinions"],"PremiseEndPos":[2177],"ArgumentID":"00000001","Conclusion":"Rebeldixie01 and Iamaconfederate are terrible people.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":185,"nextID":"00000003","PremiseStartPos":[2192],"prevID":"00000001","Premise":["I just want to remind the audience, that the title of the debate is different then the resolution. The resolution are the 3 points I outlined, which for Rebel to win, he must defuse all three. Case 1: Rebel Dixie and ImaConfederate would lead America to chaos. Views Expressed by the two parties IamAConfederate ----------------------- - Believes that the southern states should secede from America, as the liberal north is too far gone. href=\" target=\"blank\"> Will ban gay-straight alliances from schools, even though they are a innocent support group that help homosexual and confused individuals become accepted. supress the rights of LGBT's. Evident by him saying gays will never be socially or politically accepted. deport all non-white people from the United States. He actually outright said this. Keep that in mind for case 2. It can be assumed he would kick out all muslims from America, evident by hi stating Islam is evil It can be assumed he would enact anti-gay policies. Pretty much evident by every thing he's ever wrote on this site. He is indecisive, evident by him often contradicting himself. He claims to be Jewish, Atheist, and Christian. href=\" target=\"blank\"> He would support North Korea He would ban tobbaco, as he claims to be anti drug, and considers tobbaco a drug. It can be assumed that he would force religon on the masses, evident by this poll. He would abolish gay marriage. style=\"font-size: x-large;\">Case 2: RebelDixie and IamAConfederate are Bigots Bigot big·ot noun \\G2;bi-gət\\ : a person who strongly and unfairly dislikes other people, ideas, etc. : a bigoted person; especially : a person who hates or refuses to accept the members of a particular group (such as a racial or religious group) Evident by the definition, a bigot is anyone who refuses to accept members of an individual group, or hates them. Iamaconfederate: Currently, I have deducted that he is 1. Anti Black 2. Anti LGBT 3. Anti Mexican 4. Anti Atheist Argument 1: Anti Black and Mexican - In this debate, Iamaconfederate argued against racial diversity style=\"font-family: 'trebuchet ms', geneva;\">He said something offensive over the course of the debate.... \"I could possibly agree with interbreeding on a small scale. That is how the Mexicans got started...\" Now, he also said some pretty racist things towards blacks... Here he makes a racial stereotype regarding blacks, pointed out by two members. Yes on occasion. \"I would say that you are black, becuase white people don't say represent a lot. Not a racist or anything, I've just noticed that black people tend to say things like represent, yo, wassup,swag or swagger, and other stuff like that. I would say its a cultural thing. It's what makes people unique.\" style=\"font-size: large;\">Neo Confederalist Iamaconfederate claims to be a neo-confederate on his profile, which the southern poverty league considers a, \"hate ideology\". They also say it overlaps with white supremacy, and that members will often deny being racist, which he says after every racist thing. style=\"font-family: 'trebuchet ms', geneva;\">Anti LGBT ============ A common pattern among denial bigots, is that they will back up their racism with false statistics or facts. Here are a few anti LGBT examples.... I will restate my original quote by him \"Being gay is not morally, spiritually, socially, or politically acceptable, and it never will be.\" Just by saying that, he proves that he hates and refuses to accept a group. Therefore, a bigot. Also.... \"Well, homosexuals don't deserve respect, they go against natural laws and defy the bible and God, they don't need to treat them with respect, they need to treat them with the exact opposite of respect, Leviticus 20:13,\" style=\"font-family: 'trebuchet ms', geneva;\">Once again, he fits the definition of bigotry. RebelRebelDixieDixie01: Alright, now there is no doubt this guy is bigoted. \"I'm interested to see what the world would be like without religion, chaos, evil, same sex marriage laws being passed, the world would be a sucky place to live in, and you know it.\" style=\"font-family: 'trebuchet ms', geneva;\">On this poll, he choose \"keep the mexicans out\" style=\"font-family: 'trebuchet ms', geneva;\">This poll really ticked me off. Which president would you rather have, and he choose White. 5 people started bashing him in the comments. style=\"font-family: 'trebuchet ms', geneva;\">And this one.... style=\"font-family: 'trebuchet ms', geneva;\">I will move to case 3 next round. At the moment, I wish to refute a few of my opponents arguments. 1. I'm awesome According to the rules, I must prove he would lead America to destruction to win. He's not helping his case. 2. In real life, I help people all the time. Ok, but also not helping his case. 4. I can only be so bad considering I am 12 years old. Terrible Argument, read this... style=\"font-weight: bold; font-family: 'trebuchet ms', geneva;\">Ok, that is all for this round, and I would like to remind the audience the rules. If rebel fails to disprove all three points I set in the first round, he loses the debate."],"PremiseEndPos":[7270],"ArgumentID":"00000002","Conclusion":"Rebeldixie01 and Iamaconfederate are terrible people.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":185,"nextID":"00000004","PremiseStartPos":[7285],"prevID":"00000002","Premise":["I have to forfeit this round, even though I will continue debating. My opponent can drop the debate if he wishes though, and we'll keep it tied"],"PremiseEndPos":[7429],"ArgumentID":"00000003","Conclusion":"Rebeldixie01 and Iamaconfederate are terrible people.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":185,"nextID":"00000005","PremiseStartPos":[7444],"prevID":"00000003","Premise":["Extend all arguments. I am personally unimpressed with my opponents lack of will to debate this. He didn't respond to a single argument I made, and \"I'm not anti-black\" seems to be a rather weak rebuttal. Also, I would like to point out, that the rules state if one of the arguments is left standing, then I win the argument points. My opponent has admitted to being a bigot by stating he is anti-homosexual. Which means all points should be forfeited in the argument category."],"PremiseEndPos":[7922],"ArgumentID":"00000004","Conclusion":"Rebeldixie01 and Iamaconfederate are terrible people.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":185,"nextID":"00000006","PremiseStartPos":[7937],"prevID":"00000004","Premise":["I accept. Here are my reasons for why I am not a terrible person. 1. I'm awesome 2. In real life, I help people all the time. 3. I'm a boy scout. 4. I can only be so bad considering I am 12 years old. Those are just a couple of reasons. I await my opponents srfuments"],"PremiseEndPos":[8205],"ArgumentID":"00000005","Conclusion":"Rebeldixie01 and Iamaconfederate are terrible people.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":185,"nextID":"00000007","PremiseStartPos":[8220],"prevID":"00000005","Premise":["None of those things makes me or my brother terrible. It's actually terrible for you to challenge me to a debate like this. All of those things you put were our opinions. Just because we would lead America to chaos (which is our goal) wouldn't make us terrible people, due to the fact that america is evil, well, at least the USA. If we are bigots, that doesn't make us terrible. Im not anti black. Racial diversity is so we can keep our cultures separate (a good thing) You make this gay (homosexual, sorry, didnt want to be offensive) debate and expect to prove we are terrible, but you just point out our opinions, yes, we're confederates, well, were pro south, yes, we hate the US, and yes, we're anti homosexual, but that makes us patriots for our culture, not terrible people."],"PremiseEndPos":[9003],"ArgumentID":"00000006","Conclusion":"Rebeldixie01 and Iamaconfederate are terrible people.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":132,"ConclusionEndPos":185,"nextID":"00000000","PremiseStartPos":[9018],"prevID":"00000006","Premise":["RebelRebelDixieDixie01 forfeited this round. Pro Extend all arguments. I am personally unimpressed with my opponents lack of will to debate this. He didn't respond to a single argument I made, and \"I'm not anti-black\" seems to be a rather weak rebuttal. Also, I would like to point out, that the rules state if one of the arguments is left standing, then I win the argument points. My opponent has admitted to being a bigot by stating he is anti-homosexual. Which means all points should be forfeited in the argument category."],"PremiseEndPos":[9545],"ArgumentID":"00000007","Conclusion":"Rebeldixie01 and Iamaconfederate are terrible people.","PremiseStance":["Con"]}}]}