{"MetaData":{"Context":"URL: http://www.debate.org/debates/Bruce-Arians-is-a-bad-offensive-coordinator-for-the-Pittsburgh-Steelers./1/\nCrawl date: 2016/09/29 06:28:05\nDebate Issue: Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers. | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: You are backed up in your own 1 yard line. Trailing in the 4th quartedown the firer by 3 points: Do you A) play it safe and run the ball to gain yardage, prevent getting a safety, and pound away hoping to gain the minimum 15 yards for your punter and possibly if a whole opens up and you pick up a first down start driving, or do you spread out the wide-reciever, go out of shot gun and pass down the field in order to start driving and assume the risk that a sack/hold/intentional grounding will result in a safety? Niether if you are Bruce. Instead you call a shot gun-4 wide-single back, and ‘psyc' the defense into think you are going to pass and hand the ball of to the running back out of a draw. Great idea, except a)you brought in your 3rd down back, by far your worst running back b)you ran him horizontally on the goaline so he had no shot of ever getting out of the endzone c) you had no-one to block him because you went 4-wide so you pull the left tackle right (which leaves the DE un-blocked into the backfield to talk the running back for a safety cause its not like anyone in that situation would try to apply pressure). This play, in and of itself, is enough to say he's an idiot (the Steelers ended up losing by five points after two incompletion from the 10 yard line with :09 seconds left. Had the safety not occurced, they could have kicked a Field goal and went to overtime). But if that play isn't enough for you, let me convince you with some nice points: Contention 1: He won't use a Full Back Ok, so techniqually Johnson is our \"FB\" but only because you have to list on as your starter. He is truly a third string tight-end. And its not like we didn't have a FB in camp, we did. But we cut him. Because why would you want a full back? You're right, its not like it could possibly help the running back by taking a lead blocker or anything. Especially since the Steelers have an offensive-line with so many gapping holes as-is its amazing that Mendehall has been able to run on anyone this season. Furthermore, Bruce this season has come up with a number of ‘schemes' to cover for his failure on the part of not having a FB on the roster. The season started with Mendhall and Redman in the back field out of strong formations, not a terrible concept considering Redman is a power back and handing the ball to either back could throw defensive off if the Steelers where ever actually commited to the run. Oh, and Redman proved ineffective at throwing blocks inside, and why should he? He wants to be the runback, that's what he went to camp for not throwing blocks in the trenches every play for the guy ahead of him on the depth chart. The next fix involved placing Heath Miller in ‘protection' packages where Ben came out of the shot gun, FB can block the leading block which also means pass rusher in most cases. Any idea why Ben takes so many sacks? Noone stays in the backfield to protect him, he gets hit and breaks takles, if you had a full back to take the lead blocker you would have to have the FB beat before Ben ever gets hit (or waste Millers talent by keeping him in to block). Most recently, in the Play-offs the use of Legursky as a FB in goal line situations has proved effective, but this is situational football, and by the looks of the Week17 Steelers through Play-offs I wouldn't be surprised if Tomlin had a say in the situational play calling in the Red Zone. Since the 10 day lay off against Carolina (and going 1-for-5) the Steelers a 50% TD team in the read zone all season have suddenly spiked to almost 70% over the last 3 games. This increase has come from running the ball inside, and adverting the 5-Wide sets in the Red Zone (Bruce's favorite goal line play). Finally, in the AFC Championship the ‘Wishbone' formation the Packers used to run all over the Falcons was seen by the Steelers using multiple TE (and Johnson actually lining up at FB for like the 1st time all season). Watching other games and using their formations hardly counts as coaching. Anyone can steal other teams plays. Contention 2: Failure to call the right plays at the right time, and calling the right plays when they don't matter. Lets look at the Ravens (1st match up) w/ just over two minutes left in the game the Steelers get the ball back on downs at there 2 yard line needing 1 first down to ice the game. After a run for a minimual gain, a false start moves the Steelers deeper into there own endzon, then another minimual run, then another false start. Now its 3rd and long back up in your own endzone (again you don't have a FB) and what do you call? Yes exactly, a run play and get stuffed. Despite not having the 5 yards for your punter who gets of a terrible kick, w/ a minor runback and a penalty gives them the ball at the 40 with a minute left. So you run when you need to pass….and like wise in the AFC championship game on third down just across mid field Bruce passed, where an incompletion stops the clock and would give the Jets 40 extra seconds to run a potential game winning TD drive had the pass been incomplete. Some call this guts, I call it a stupid gamble, but then again we couldn't run on the Jets in the second half? Why…see contention 4. Or, look back to last season when Dixon had to play against the Raven's after injury to Ben and Batch. After Dixon played exceptional, and the game went into overtime, the thrown in at the last minute started had no idea what to do. I'm positive the coaching staff didn't come up with a statedgy for overtime, because well they probably never thought they'd get that far. But, in over time the Steelers get the ball and Bruce comes out passing. Dixon, misses several open receives and throws the ball away and into poor choices of covered receivers but escapes to punt. Then the defense holds the Ravens. Upon getting the ball back and having an entire Balitimore drive to understand that Dixon miss completely open receiver on multiple pass attempts on the first OT drive what does Bruce call? Exactly a pass, not only that but he calls a play where he send the wide receivers deeps, keeps two backs to block for protection, and send the TE on a curl. The TE is the only receiver Dixon sees because he's not examining the field. 3 separate Balitimore players converage on the ball and the pass in intercepted and game over. Ok, lets look at the Rand El passing TD in the Cincy Monday night game when you are up big. Or the fake spike in the 1st half against the Jets (the play failed) but couldn't be used latter in the 2nd half (when you need to score). Or the multiple lateral reverse Bruce likes to run that always fail. His trick plays are like practice in game, they never serve a point or help us win. They just work when we don't need them to at all (and that's probably why they work, who runs a trick play when you have a huge lead?) Contention 3: He sucks in the Red Zone Bruce repeatively goes 5 wide in the Red Zone, year in and year out. It wasn't until the last 3 games as mentioned above we've shown any life inside the twenty. On the season we were 50 percent on scoring TD's and that is consistent with Bruce's numbers over his tenor as Offensive Cordinator. Most noteable, an instance when we recovered the ball on the 1 and failed to punch it in in 4 attempts. And we went 2 for 5 on TD against Carolina….(and blew them out despite that). Contention 4: We can't do something if they know we are gonna do it Ok, here is where Bruce takes the cake. Instead of any reasonable mind person that has a ‘game plan' or a formation or a play that works and decide ‘ok we can keep using that until someone can stop us' when something works Bruce stops using it to ‘mix things up'. You need look no further than the AFC Championship, the induction of stealing the Packers wishbone formation in the first half work great, it did not reappear in the 2nd half. Why? Because it work. On a Sunday night game last year again the Broncos Mendenhall ran out of Trips-Bunch Single Back and ran right side, he had over 100 yards by halftime. He ran it so effectively that the announcers even explained the play to the viewing audience in the 2nd half because the rought was on. But, after pulling to 6-2 and looking like a legitiment team to repeat, Mendenhall right Tackle out of Trips Bunch Single Back disappeared from the play book for the remained of the season (and this season). Why? Because, Bruce said ‘Well they know we are gonna do that, so we have to do something different'. No one ever beat us at it. No one ever figured it out. Bruce effectively beat ourselves by never running out of it again. Contention 5: Big Ben Ok, so he has the fortune of a great running back who can get 1,000 yards despite not having a FB on the roster, but Bruce has a job because he has a QB who can win games DESPITE him. In the '08 Super Bowl run, the Steelers won almost all of their games coming from behind in the final two minutes on a game winning drive. The offense, dorminant all day, suddenly cam to life and scored in the clutch. Again, and again, and again. So much so that when the Cardinals actually beat the Steelers D in the Super Bowl the Steelers just marched down the field and scored like they had all season. Why? Because, Ben runs the two minute drill out of the no huddle. Which mean guess who calls the Plays? Hint: not Bruce. Yep, Its Ben himself. Look at the Raven's game. That huge 3rd and 19 where Brown makes that catch, Ben himself is quoted saying \"I told Bruce we should throw it deep….'cause if they intercepted it, it would be just like a punt\" So we can thank Ben for his genioious to constently over come an inept offensive coordinator. For further evidence of this, look at our offense when Ben doesn't play. We had the 30st offense in the league after week four (With Dixon and Batch at QB). Why? Because Bruce was calling all the plays.\n\nEvidence Pro: Turn opening point on Tomlin: Entirely non-unique to resolution. Tomlin valuing the ideology that games should be kept close has no barring on if Bruce is a good offensive coordinator for the Steelers are not. Unless you are making the point that he calls plays sooo bad that it prevents the Steelers from ever breaking away in games and always keeps games close. Which, is stupid. You mine as well fire him and not use an offensive coordinator if his only job is to limit the offense as you argue. And as I stated in my 1AC, Ben calls the plays in the No-huddle and 2 minute drill. So in-essence you say it's a good thing Bruce is so bad he limits the offense, except when they tell Ben to call the plays. That doesn't make him a good offensive coordinator, that makes him beyond terrible. Though, I'll concede close games have a benefit in the long term, that doesn't mean that Bruce is a good offensive coordinator because he can't blow teams out and lucks out on nurmerous occasion because his defense/Ben is so good that he can't stop them even though he trys. Turn your argument about Bruce's numbers: Bruce has a good winning percentage because the Team has a good winning percentage. Most notably, his defense and Quarterback (running out of a two-minute drill calling his own plays) win games for him time and time again. He has a good winning percentage despite his inept play calling. Roethlisberger posting career numbers is evident of Bruce's ‘pass first' philosophy, where before the Steelers ran the ball giving Ben fewer oppurtunities to throw. However, it was ineffective in the whole Resulting in lower overall points for the season (the best way to judge an offenses production): [insert cite] Well, take a look at these stats. \"In 2009 the Steelers ranked 21st in the NFL by scoring touchdowns in the redzone only 48.2 percent of the time. Behind teams such as Washington, Tampa Bay, Jacksonville, Kansas City, and Carolina. In 2009 the Steelers ranked 22nd in the NFL in rushing yards per game while averaging 22.5 points per game. In 2008 the Steelers ranked 23rd in the NFL in rushing yards per game while averaging 21.7 points per game. In 2007 the Steelers ranked third in the NFL in rushing yards per game while averaging 24.6 yards per game.\" ( Being a ‘inconsitent' play caller, and randomly doing stupid stuff does not make you a ‘good' offensive coridinator. It only makes you unpredictible. Again, since his only success comes out of the 2-minute Ben called plays I fail to see how this works. Show me evidence or examples of when, without either a)A QB other than Ben or b)When Ben was not running the No-Huddle the Steelers have been successful, consistently on offense. It won't happen cause Bruce switches everything up all the time and starts over. A lack of consistency on offense hurts production. Even in this years play-offs our offense was mostly sparked by Short Fields against Baltimore, and stealing the Packers run formation against the Jets/Ben making big plays and escaping the pocket (again, not designed plays called by Bruce so you can't use any of these either) On your it would take a year transition: This debate is merely concerned with if Bruce is good/bad offensive coordinator, there is no implication to the action, and thus any fear on his replacement resides outside the resolution. Though, he should be fired. If nothing else, Ben can call the plays. (Response to Specific Responses) With regards to the safety in the Jets game: 1) Bruce's unconventional style keeps defenses confused; Formation makes the defense think pass (see above that Tomlin respects this). Randomly calling plays my keep a defense confused, but it also keeps the offense confused and lacking consistence. 2) Turn – The Steelers still had a chance to win the game, but Ben and the offense did not capitalize at the end of the game. Having a chance to win and winning are different. Besides, Bruce doesn't call the 2 minute no huddle plays anyways, so BEN had a chance to win the game for Bruce. Had Bruce been a valuable asset to the team, he should have had us in a position to win the game, not all on BEN (like it is every week) 3) Turn – [Tomlin's Post Game Press Conference] \"We didn't cut off the backside three technique… it's unfortunate, and part of the description that I came in with saying that they made significant play down the stretch and we didn't.\" – Champions would make the play regardless of the call. But, ‘champions' shouldn't have to overcome bad play calling and an opponents defense. There offensive coordinator should work with the team, not against it. 4) Turn – Don't blame Bruce because the offense didn't lose the game; a 4th and goal touchdown and a kick off return by the Jets cost the Steelers the game, not poor play calling against one of the better defenses in the league. Yes, the defense allowed a score, and a special teams return, but offense respond by scoring more points. Bruce's inept play calling allowed for lower points which makes it harder to win games. The offense can't be blameless in not winning games, in fact if the offense just puts up lots of points; how can it be to blame? C1: I agree that this is a legitimate complaint; however your argument indicates that Bruce saved the most functional formations for running for the playoffs, and Mendenhal had some of his best runs in the first half against the Jets. Stealing a formation from another team doesn't make you good. It makes you a copy-cat. Anyone could have done that, its non-unique to saying he has any talent. C2: 1) Turn: The Coaches ask their players to make plays to win games. The Head Coach, the Offensive coridnator is responsible getting his team in a position to win the game (and that includes taking a big lead which Bruce is to inept to do) C3: [Bruce Arian's response to Red Zone problems, Nov. 2010:] \"Yeah, dropped balls. We haven't run it very good inside the 10-yard line. We've had like first and goal at the seven or eight and we haven't run the ball for 3 (yards), run the ball for 3 (yards) and gotten it down there where you have two things to do. We've thrown it into the end zone and it's come right back to second and 7. We need to pick that up.\" Mendehall has the must rushing TD inside the 5 in the NFL this year, and we still had a 50% redzone efficency on the season. This is terrible, we should have been blowing oppents out, instead of just skweaking by every week because Bruce is to inept to call plays in the red-zone or use a Full Back C4: 1) T/ Not being stop on a play allows the team to go back to it when they need it to win a championship latter, and keeps the defense guessing. No warrant to claim, they don't ever go back to the plays. And when you stop Mendenhall off right tackle on Trips-Bunch and loss 5 in a row and miss the play-offs…you're an idiot. C5: 1) Turn: Ben's stats increased under Bruce; he helps Ben at Quarterback. Overall offensive Stats down, only because of Pass happy nature of game. And lack of taking leads early which forces to pass late in games. 2) Turn: Bruce developed Peyton Manning and is capable of developing great quarterbacks. Only beneficial as a QB coach, not an offensive cordintor which is a more diverse position and requires more then being able to coach a QB (you have to call plays too….which Bruce can't) 3) Turn: Tomlin likes close games. Non-Unique to Bruce as a good offensive coordinator 4) Turn: Close games make Ben a better Quarterback. Non-Unique to Bruce as a good offensive coordinator 5) Turn: Close games are the key to winning a championship. Non-Unique to Bruce as a good offensive coordinator 6) Turn: Team must trust each other in key games; play like champions. Non-Unique to Bruce as a good offensive coordinator 7) Turn: My opponent concedes this strategy won us a Super Bowl. Non-Unique to Bruce as a good offensive coordinator 8) Turn: Steelers focus on our defense first; Steelers still won without Ben, including a blow out in Tampa Ba Steelers won with a 30+ ranked total offense in those first four games this year. The blow out in Tampa Bay was luck, where verteran QB Charlie Batch made 3 deep throws and barely thread CB to score long TD (combined with a defense that almost posted a shutout and a TD INT return). The results of the Tampa Game (a road win against a 10-6 team) should have been the norm-not the exception. The win against Alanta was luck, we scored 9 points in regulations (6 on a 50+ yard run by Mendehall in OT). That was all Defense to win your opener without scoring a TD in regulation. Also, our domination @ Ten resulted in still giving them a change to win that game at the end because of our failure as on offense to pull away despite a defense that was completely dominant for 55:00 minutes of the game. Also, the offense has a responsibility to win games. And the offensive coordinator is the individual who bears that burden. When teams win ‘despite' poor offensive production, the Offensive coordinator did not do his job. Especially, when the offense (such as the Steelers) is extremely talented.\n\nEvidence Pro: Your any idiot. Counter Plan: Don't use an offensive coridanator. Benefits: 1)You save money 2)Ben can call the plays all the time (which you never responded to the fact he does in 2-minute drills) and can get really really good at it so he can be use to calling plays all the time 3)You don't have an idiot who calls plays and losses use games, like against the Jets this year or how many times last year (try 8+times, there was games we should have lost and squeaked them out in the end because of who…Ben) Your frame work is abusive as hell. My CP meets all the criteria, and guess what Bruce is gone. In fact his position is vacant. The only reason you are saying he is good is because your framework says he doesn't have to do anything and rely on everyone else around him to do good and win for him. That is the most abusive frame work ever. Why don't you just concede and admit he sucks at life? Your entire ideology that he can suck to improve the team is stupid. What happens when you have big leads in games and suddently aren't use to them? You crumble and almost loss. AKA the AFC Championship. Why not just pull ahead and win big, rest your players, move on to the next week. You yourself said less tape is a good thing, if you only have to play 2-3 quarters a week, less game film. Your analogy to the Jets/Patroits blow out doesn't link 3 fold 1)They antagonized a rival, which is dumb, and then where unprepared for them in the post season 2)The Patriots core group of guys (manly on defense) was too young for success in the play-offs 3) Teams that do well, historically, can have success in the play-off, but not always; it is a case by case situation and you can't make a generalization about it. Take the Saints and Colts last season. They beat everyone jumped out to 13-0 starts and played each other in the super bowl. Again, your framework is abusive, you say Bruce has to do nothing around him to be ‘good' at his job. Saying he's been able to coach a QB, as I stated in my previous speech, does not qualify him to be an offensive coordinator because Offenses is more than just the QB position. There are multiple facites to the game my opponent is ignoring. Again, the numbers are not specific to Bruce's talent because you are quoting winning, which you yourself said he puts on the defense anyway. So that should be thrown out. And the offensive production decline, and red zone efficency, and there over all comparision to league rank are objective material. They are simply facts, and have no bais. The statistics indicate that his pass first approach has reduced offensive production. And have bein 50% in the Red Zone (which my oppent has yet to respond to) is attrosious for an offensive coordinator. It simply means is offense is in position to put games away and can't do. Time and time again. That's not how teams win championships (unless they're backed with a defense that is sooooo good you can kick 3 field goals and miss 2 more and still beat the best team in the NFC) The offensive coordinator is responsible for the production and all elements of his offensense. The corrrolation is implied. Its like being the manager of a store, and the success of the store are directly correlated. Are there outside factors? Sure, but as the manager you are responsible to account for those outside factors. Why? Because its your freakin job. Bruce's play calling/running of the offense has correlated to a decrease in production and an abbismel red zone percentage. You brought up the 1st half of the Bills game. Lets, see…oh year we won in overtime because we scored 0 points in the second half and almost lost. Now you fall apart and do nothing in the second half offensively…this sounds exactly like, no it can't be, the AFC championship? And why? Because we got a lead and Bruce didn't know what to do anymore so he just got confused and messed around and blew the lead to get the game close so he'd be comfortable again. And the minimium time's of position and drives and be attributed to our defense that force 3-and-outs on such a consitent basis. C1: Both I and my opponent agree that Bruce saved his most functional formations for the playoffs. Regardless of if this is ‘stealing', Bruce was smart enough to implement it. I could of stole that formation. Doesn't make me a ‘good' offensive coordinator. Either give me an offensive coordinator job and a million dollar pay check because I can watch other teams and steal there plays, or get off the man for stealing someone else play and just admit he has no talent. C2: Steelers' Coaches ask their players to make plays to win games. My opponent fails to understand this argument. Tomlin seeks to teach players that they have to step up in every game, every week (not blow out opponents). Abusive framework, you are saying Bruce has to do nothing to prove he is ‘good'. Why? Because he sucks, just admit it. He's not a good offensive coordinator, stop trying to cover it up with ‘well, everyone else just has to compensate for me'/ C3: Mendehall has the most rushing TD inside the 5 in the NFL this year – yet my opponent is complaining about the Steelers' red zone production? Bruce recognizes that Ben passes the ball too much and receivers drop balls. Defensively, apply my argument that not blowing opponents out does not qualify as ‘bad'. No, but when you can blow out oppents. You should. At least from the offensive minded perspective. You talk about numbers? If we had a good red zone percentage, say 70-80%, or offensive numbers would be threw the roof and we would look like a dominant force offensively and defensively. But its not. Stop making excuse, and just understand he sucks and can't do it. I wouldn't be surprised if Tomlin's started calling the plays in the red zone….or Dick Labuie C4: Not being stop on a play allows the team to go back to it when they need it to win a championship latter, and keeps the defense guessing. Evidence they every return to plays. Or how going 8-8 wins championships. Fail. C5: 4) Bruce improves Ben's performance, which my opponent agrees occurs, which definitely doesn't make Bruce ‘bad' at his job. Not his full aspect of his job, he's not a QB coach. He's a freaking offensive coordinator. Name 1 other QB coach in the league? Exactly, they are anonmious people, not one rides the offensive line coach when the o-line sucks, they go after the guy calling the plays: The offensive coordinator. 5) Close games key to winning a championship. (Framework) So how does going 8-8 do this? 6) Close game build trust. Bruce allows for players to understand each other which is critical coaching for late game situations or the playoffs where success must occur with the coach being able to directly intervene. Building trust among players creates an excellent coach. 9-7 7) Bruce's performance at offensive coordinate won the Steelers a Super Bowl. They won a super bowl, despite Bruce (Ben executed a Two Minute drive remember? 8) My opponent fails to understand Tomlin's focus on Defense first. Under Tomlin, the Steelers have had the 2nd, 1, 15, 1 ranked defenses, and Tomlin's whole coaching and game planning strategy resides in his defense making plays and securing a victory. My opponent's arguments for offense reside outside of Tomlin's framework, and thus should not be used when evaluating Bruce's ability as Offensive Coordinator of the Steelers. Frame work abusive. You say Bruce should do anything. Ok, here's the deal Mr. Close games help us. Explain how going 9-7 wins you a championship? You've completely dropped that. Completely. You go on and on about how we build trust and skill and blab la bla, but we lost an entire season because Bruce threw our offensive production out the window last least and we lost all those games. The entire season is completely Bruces fault. We had all the talent in the world on offense (Ben, Ward, Holmes, Wallace, Miller, Mendenhal) The numbers weren't there, Bruce lost us those games. Bruce didn't have an offense capable of excuting, and we lost game after game in close margins (Clevland, Oakland, Kansas City, Balitmore) all of those games were close games we could have one (you know, like you punch in one of those 50% of red zone try's you didn't convert?) That is why you don't play close football, because you don't always win. And when we do win, its not on Bruce, its on a guy named Ben running two minute drills. This is all I ask of you in your final speech: Please prove to me that Bruce is capable of leading a team to win games when a)Ben isn't the quarter back or B)When Ben doesn't have to lead a 2 minute drill at the end of games (ie-Bruce isn't calling the plays) or C) The defense plays so dominantly that minimal offensive production is necessary to win anyways (ie- Week one Alanta). Now, averaging out for flucks (ie-Players making big plays for themselves) We would figure that a good offensive coordinator (or head coach) should be about .500+. Right? Let's examine the last 3 Seasons (these season can be significant because we have 1 team that one the super bowl, 1 who missed the play-offs and 1 who will play in the super bowl): By my counts '08 8-4-7; '09 5-8-3; '10 5-4-8. Don't be fooled ladies and gentlemen. Let me explain. I calculated it was so: The first number represents wins where the Steelers won handly, and offensive productions can obviously be the contributing factor, the second column represents loss which regardless of loss where attributed to the inability of the offense to score points (Note: only three games in the 3 season stretch were ‘blowouts' or losses where the Steelers lost by more then 8 points, uniquely all of these losses can be attributed to a failure of offensive production aswell as a team loss; all 3 losses game from seasons the Steelers made the super bowl). The final column is games where the Steelers won, despite Bruce. Factors used here, in order starting with '08: Ravens1- W/OT; Jaugars- Win on FG inside 2 minutes; Chargers- Win inside 2 minutes; Cowboys- Defensive return inside 2 min; Ravens2- TD drive inside 2 min; Ravens3- Defensive TD return to seal game; Cardinals- Last Sec TD. '09: Titans- OT/Win; Packers- Last Second TD; Ravens- Win on late FG//Defensive stand. '10- Alanta- OT/W; Titans- Defensive stand; Miami- FG inside 2 min; Bengals-Defensive stand; Bills- OT/W; Ravens2- Big Defensive play; Baltimore3-TD inside 2 min; Jets- Hang on after lack of 2nd half offensive production. Through this explination for games, a few may be up for contest, but over all the numbers are pretty clear: Over the past three seasons Bruce is 18-16-15. Or in three seasons offense (not including late rallys from Ben) have accounted for 18 wins in 49 contests or a value percentage of 36.7%. (Keep in mind, this includes two teams that reached the superbowl, with one win and one result pending). The Defense/Ben on the other hand have attributed to a 15 wins or a value of winning 30.6% of all games. Before anyone claims Bruce's number his higher, lets remember my assumption that a ‘good' offensive coordinator needs to mine 50% of his games of be .500. In this breakdown of wins senerio Bruce is only contributing in 54.5% of Wins. Let's keep in mind again, I am being overly generous. To say that those 18 wins where all on Bruce is an overstatement to the extreme, but statistically the offense scored enough points to allow the game to be taken solidly in hand. Lets keep in mind though, that a team as talented over the last three years has the Steelers should have some ‘blow out' wins in this stretch; 5 of those wins came against Clevland, and then 1 against the Panthers this year, Lions last year, 3 Wins against the Bengals of '08 & ‘10) Shows at least 9 victories came against significantly inferior opponents. If one was to factor these 9 games out as that anyone could have one them w or w/o an offensive coridinator the remainder is Bruce and his offense contributed to 9 wins in 49 games or 18.3% of games he won. More over, 9 games against inferior opponents plus 15 defense/Ben victories is 24 wins in 49 tries of 49% of victories. Meaning, any given victory is 50% on the defense/Ben/the other team just sucks anyways. Meaning, .673 win percentage can be halved to account for the actual ‘value' of Bruce as an offensive coordinator .336 ‘value' percentage, or a 4-12 record in season play. This number is a fair assessment of Bruce's ability as a good/bad offensive coordinator because 1)my opponent dropped my argument that Ben/the defense win games, and when Ben wins games Bruce doesn't call the plays and 2) the assessment curves the data from simply using a more talented team to beat opponents, which envolves on coaching skills. Inconclusion, I challenge my opponent to express that Bruce can 1)valuably contribute in over .500+ of games 2)Explain how missing the play-offs was a)not Bruces fault b)how Bruce as a ‘good' offensive coordinator did everything right help us win (especially during that 5 game losing streak) c)Where the mendenhall single back right tackle trips bunch formations went after the Denver game in the '09 season 3) Expalin the Value of Bruce over any other offensive coordinator in the league (or as I proposed a vacant position, which I could attribute the Steelers to still winning .489 percent of there games over the last three years; which means the team it self almost good enough to qualify its self as a good offensive coordinator, for Bruce to keep his job he barely had to win 5 games….or ok 9 at 3 a year) To bad you can't prove any of this. We forget how incredibily bad Bruce is because our offense wins despite him.\n\nEvidence Pro: Arians argues: \"No one sits at home and calls defense. I enjoy listening to sports talk shows myself and I think ‘We really did have a run called, Ben just threw the damn thing\" [Feb. 1, 2011, NBC Sports].- Wrong, I call defense. Turn, he's an idiot. Empirically, I kept explaining the use of the 2-5 defense by the Steelers in early parts of this year, particularly when injuries plagued the defensive line (and you'll probably see it in the super bowl to when they go 4/5 wide). Again, my opponent framework is abusive because he won't separate Bruce's inefficency from ‘Tomlin's' Philosphy. Perhaps, the ‘Tomlin' philosophy as developed because of Bruce, after Tomlin's never had another offensive coordinator. On statistics: I looked at games won, season finishes, and how usefull the ‘man-who-called-the-plays-to-win-the-game' was (which as noted in Steelers case was often Ben not Bruce) My opponent claims statements by the Steelers organization are superior in all ways, however, politically they won't make bad press about there own staff unless they fired them. Meaning your evidence is in no way superior, and often lacks substance as it is simply quotes supporting him for doing a good job. The Steelers win, but not because of Bruce, in-spite of Bruce. Again, my opponents framework is abusive, because his claim of ‘fitting in Tomlin's coaching strategy' is basically saying Bruce has to do nothing at all and can take credit for winning anyways. Prefer my framework. C1 proves that Bruce is good enough at his job to save \"his most functional formations for the playoffs.\" He makes valid points about Bruce's failure to use a full back. However, the Steelers under Bruce posted 2160 [2007], 1690, 1793, and 1924 rushing yards a season, with a 1,000 yard rusher every season except the 2008 Super-Bowl run. Any valid points here are mere opinions of dissatisfaction. –Bruce fails to fully use his team to the maximum potential. With the amount of talent he is given he doesn't use it to the full potential because of a lack of understand of the offense as a whole, this example is to explain the lack of dimension in his play calling and to explain raw talent, not his actions, win games. C3 argues that Bruce fails in the Red Zone, but he fails to compare this evidence of 50% (The 14-4 2010 Steelers in the Super Bowl) to other offenses this season and/or to other successful OC. Although Bruce recognizes failures (particularly dropped pass which are players not making plays), and Mendehall has the most rushing TD inside the 5 in the NFL, Bruce's mediocrity in the Red-zone could be a problem. When you pass the ball on 5 wide from in side the ten, no one was dropping pass, noone was open and Ben has to force balls into places they shouldn't be. When you run out of space to run routes for wide receivers (ie-the Red Zone) a more running/less passing needs to take over. However, we are still only near 50% over the last 2 season, mediocre by most standards, and this failure results from the packages and personal used in these situations (which rests on the offensive coordinator). Again, his failure to understand you can't go 5-wide in the red zone is his problem because he's stupid. C4. However, my arguments lack some evidence compared to my opponents, and it is viable that Bruce has refused to run possibly successful formations. –Thank you for conceding this point, which again effectively demonstrates Bruce's inabiality as a whole to understand all the demensions of offense. His C5 argues that Big Ben wins games despite his offensive coordinator. I argue here that close games build trust and a championship quality team, as proven by Arians leading two teams to the Super Bowl, including a victory. My opponent negates Ben's increase in statistics and ability on the field as having no correlation to Bruce's ability – I believe they strongly do. –Ok, sure. Ben running a 2 minute drive at the end of every game because he has to, and calling his own plays to boot, is because Bruce is suuuuuccccchhhhh a talented Offensive Cordinator. If he was, Bruce would call the plays (and you know why we don't? Cause in '07 when he did we lost, a lot, and Ben was like ‘hey I can do this better' and he does) AT: Counter-plan 1) To meet his burden, the CP would have to prove why Bruce is a bad offensive coordinator, not that Ben would be a better one, or that Ben even dislikes Bruce enough to want to replace him. –Look at my breakdown of games at the end of my third speech where I explain how Ben, not Bruce, wins us games. 4) Bruce argues: \"I'm an idiot anyway. They're gonna say that anyway. Ain't going to change.\" [ Specifically, he's addressing the 5 wide pass play where Ben threw the ball to Brown instead of continuing the designed roll out to end the AFC championship. Ben is viewed as successful when his gambles work, and Bruce is blamed when Ben's gambles fail: this is an unfair standard for determine whether or not Bruce is a ‘bad' coach. –Its unfair to not place any blame on the coach, when you simply get ‘luck' that takes not skill. When you gamble and lose, you should take the blame. That's why as a coach you win, and win big, if you want to stick around. That's just the way it is. Wasting a season with talented players is stupid, especially since you completely dropped my point about kicking a formation that worked when you were 6-2 and dropping 5 straight games (almost six but Ben pulled out a miracle). If you want to look at the '09 Season and how we beat good teams, we did. But why is your ‘great' offensive coordinator losing to the likes of the Chiefs, Raiders, Browns, insucession. Its abusive to claim ‘oh, we were building for next season'. No, Bruce sucked it up. Plain and simple, don't make excuses for him. He lost us 5 games in a row were we lost to teams that were 4-12, 3-13. That's terrible, especially when you sandwhich that between teams that went to Super Bowls. He took a team with talent and wasted it. You have to look at each season individually, and in '09 Bruce wasn't worth a damn and should have been fired for having a offense that failed to produce key points to win games (IE- scoring in the red zone, using Mendehall right tackle single back trips bunch which you completely dropped so I win that argument) Finally, my opponent failed address my claim that you need to be .500+ as an offensive coordinator to be good. I never gave the assertion or proof that Wisenhunt was a ‘good' offensive coordinator, though I would say without statistical anylisis he did fairely good job over his tenor with the Steelers. However, please recall that after winning a Superbowl, one season remover Wisenhunt/Cohwer left and handed over the team to Tomlin/Bruce (Even the 8-8 season prior to there arrival can be like to problems on Ben's end and a lack of drive from the head coach). Given a golden team of talent, anyone to fail with such star players desirves to be run out of the league. Ben is a seasoned, verteran QB in the NFL the likes of Peyton Manning, or Tom Brady. These guys can run teams w/o coaches. Note: After Dungy retired, and most of the Colts coaching staffed switched over the Colts went 14-0 (rested Manning) and lost the Super Bowl off 1 pick six. This can't be attributed to Calldwells talent as a coach, but merely he was handed a team that was ready to explode. Even this season, it was more injures that prevented the team from excelling then anything else. Consicuently, Bruce's numbers should be imaculent, however his team shouldn't have to be winning by the thread of a needle every weekend and if they do he cannot possible take credit. Furthermore, as all 5 of my contentions which have never been effectively over turned by my opponent prove, Bruce does not understand the complexities and dimenshes of running an offense. He simple understands saying ‘Hey, Ben wanna go win this game for me?' Anyone could do that, that is mine as well by our six year old brother. In conclusion, you failed to prove anything except an abusive framework where you say that Bruce plays to Tomlins coaching strategy. I provide 5 distinct examples explain how Bruce does not effectively understand the offense, and under utilize the talent he has. And furthermore explained how most of his wins came from a strong defense/Ben winning games in the clutch witch again has nothing to do with Bruce's ability as an offensive coordinator. Clearly he is not good, benefically, or in anyway usefull to the Steelers organization and he might as well be fired (say today?) before he does anything stupid. (LIKE LOSS USE THE SUPER BOWL!!!!!!!!!!!!!!) To anyone who actually read this: I'm sorry you wasted so much time on two boy squabbling, but you have to admit Bruce sucks? No? HE sucks open your Damn eyes!\n\nEvidence Con: As I am playing the devil's advocate in this debate among my family, I will let my opponent present the arguements with which I will refute -- however, I will state that Bruce Arians (currently before the Super Bowl on Sunday) has won a Super Bowl as an offensive coordinator, two AFC championships, and was the wide recievers coach for the Steelers when they won Super Bowl XL in 2005 with Cowher, and thus Arians has proven himself, at the very least, that he is capable of preforming well at his current position as offensive coordinator of the Pittsburgh Steelers. I am looking forward to seeing the arguements against Bruce Arians -- and I hope that this will be a fun debate.\n\nEvidence Con: Mike Tomlin in his four years as the Pittsburgh Steelers head coach has created a system within Pittsburgh that wholistically plays football. Tomlin's coaching philosophy reflects his repetitive use of clich� phrases: \"People aren't very good listeners, by nature. Part of being a good communicator is recognizing and understanding that and trying to make the complex simple. I try to capture a concept, an idea or a moment in a few words. If they remember it, job done\" [Mike Tomlin, interview before Super Bowl XLIII]. Tomlin captures concepts through out the whole season that he implements within his team. Tomlin has asserted that his coaching philosophy is to keep games close and win them in the end. Why? Why would anyone want to have close victories (and close losses such as the Steelers' 2009 campaign)? Tomlin understands that losses are inevitable in a season, but that the regular season is ‘practice'. He explained in an interview before the Divisional Round this year that: his team was experienced in playing close games, so they never felt flustered at any point within a game. Similarly, before playing the defending Super Bowl champions in New Orleans on Halloween, Tomlin respond to a report's question about his teams' preparedness for the game with, \"I hope my team is ready to play like champions because that is how we have to play if we want to win this game.\" The implication – \"This game is going to be decided by those who play it on the field\" [Tomlin, about Super Bowl XLIII]. Tomlin plays a holistic game planning strategy where he asks his players to win games during the regular season instead of coaching for domination. One of Mike Tomlin's famous quoted sayings is: \"I'll tolerate you until I can replace you.\" The question, among many Steelers fans, is why does Mike Tomlin tolerate Bruce Arians? The Steelers' official website sings Arians praise for his first two seasons with the organization (2007 and 2008): \"[Bruce Arians has] 51 career wins, including a 22-9 mark during Arians' first two seasons as offensive coordinator, Roethlisberger has a .718 winning percentage, trailing only Tom Brady among active quarterbacks… Arians helped All-Pro wide receiver Hines Ward become one of the best wide-outs in the NFL over the past five seasons [as receiver coach and offensive coordinator]…. In his first year as offensive coordinator in 2007, Arians helped Roethlisberger get elected to his first Pro Bowl as he broke Terry Bradshaw's longstanding team record for most TD passes in a season with 32. Roethlisberger also finished with a career-best and team-record QB rating of 104.1.\" Also included on Arians' resume is his time spent in Indianapolis as Peyton Manning's Quarterback Coach (1998-2000). However, this success does not stop uproars from Steeler Nation against Bruce, including him reportedly being fired at the end of the 2009 season. The question for the Steelers is whether mediocre to good offense is ‘good enough', and for the Rooneys whether or not the Steelers will continue to be a run-first team. Tomlin is a defensive minded coach, and trusts his defense tremendously through game decisions that he makes (see responses to C2); Tomlin needs somebody who knows more then him on offense, and Bruce does. Firing Bruce would require at least a year of transition on offense which would cost wins for the Steelers organization [Timothy Kessler, Jan 14, 2010 \"Considering the Cause of Mike Tomlin's Decision To Keep Bruce Arians\"]. Furthermore, Bruce's inability to mobilize tremendous offensive talent to blow out opponents is not a problem for Tomlin – his game- and season-planning strategies rest in keeping games close, and not blowing out opponents, not showing how his team will demolish another team, and getting his players comfortable in uncomfortable situations. Bruce's poor play-calling, at times, forces players to make talented plays which is exactly what Tomlin believes is required to win a championship. Bruce's style of play calling, which seems to be him either being stupid or over estimating and over-thinking the defense that he is going up against, causes him to constantly shift the Steelers focus from game to game – one game will be run-heavy, one game will be pass-heavy, other games will merely have plays called at stupid or random times, especially trick plays which are hardly ever preformed at useful times within the game. Bruce's play calling almost resembles that the Steelers are ‘practicing during games'; Mike Tomlin's holistic approach allows for the whole regular season to be practice to condition the team for the playoffs. Tomlin respects Bruce's ability to mix up the offense, and from a defensive stand point, it keeps the defense guessing because the play call could be anything (no matter how stupid). (Specific Responses) With regards to the safety in the Jets game: 1) Turn – Bruce's unconventional style keeps defenses confused; Formation makes the defense think pass (see above that Tomlin respects this). 2) Turn – The Steelers still had a chance to win the game, but Ben and the offense did not capitalize at the end of the game. 3) Turn – [Tomlin's Post Game Press Conference] \"We didn't cut off the backside three technique… it's unfortunate, and part of the description that I came in with saying that they made significant play down the stretch and we didn't.\" – Champions would make the play regardless of the call. 4) Turn – Don't blame Bruce because the offense didn't lose the game; a 4th and goal touchdown and a kick off return by the Jets cost the Steelers the game, not poor play calling against one of the better defenses in the league. C1: I agree that this is a legitimate complaint; however your argument indicates that Bruce saved the most functional formations for running for the playoffs, and Mendenhal had some of his best runs in the first half against the Jets. C2: 1) Turn: The Coaches ask their players to make plays to win games. 2) Turn: Tomlin passes on 3rd down to seal games because he trusts his defense to hold (They called passing plays in both the 1st Ravens game, I believe - despite my opponent's claims, and the AFC championship); this is consistent with Tomlin and the Steelers kicking a field goal at the end of the 1st half of the Raven's playoff game, and going for Fourth down early in the Jets game – Tomlin trusts that his defense will hold the opposition regardless of what the offense does. 3) Turn: ‘practice in game' is good (see above) 4) Turn: On MNF Cincy game, we need all points to win. C3: [Bruce Arian's response to Red Zone problems, Nov. 2010:] \"Yeah, dropped balls. We haven't run it very good inside the 10-yard line. We've had like first and goal at the seven or eight and we haven't run the ball for 3 (yards), run the ball for 3 (yards) and gotten it down there where you have two things to do. We've thrown it into the end zone and it's come right back to second and 7. We need to pick that up.\" C4: 1) T/ Not being stop on a play allows the team to go back to it when they need it to win a championship latter, and keeps the defense guessing. 2) T/ Less film footage is available for best plays. 3) T/ Team trusts the defense to win. 4) T/ Diversity in play calling allows the coaching staff to see what works and what doesn't offensively. 5) T/ Tomlin respects Bruce trying to out-smart defense (see above) C5: 1) Turn: Ben's stats increased under Bruce; he helps Ben at Quarterback. 2) Turn: Bruce developed Peyton Manning and is capable of developing great quarterbacks. 3) Turn: Tomlin likes close games. 4) Turn: Close games make Ben a better Quarterback. 5) Turn: Close games are the key to winning a championship. 6) Turn: Team must trust each other in key games; play like champions. 7) Turn: My opponent concedes this strategy won us a Super Bowl. 8) Turn: Steelers focus on our defense first; Steelers still won without Ben, including a blow out in Tampa Ba\n\nEvidence Con: I have established that Mike Tomlin (which my opponent concedes) has established a wholistic system within the Pittsburgh Steelers where he works on getting players to perform on the field, trusts his players to perform, and creates situations where the players either win or loss games (not the coaches), specifically through close games. The focus is on creating performance that translates into winning championships; not in blowing opponents out or looking like the best time. Within this philosophy, blowing out an opponent) can create determination within other teams to play extra hard (such as the Patriots did to the Jets before the playoffs) and/or cause the Steelers to become over confident in their abilities instead of remaining humble (another key component of Tomlin's philosophy). I have then explained how Bruce's style as offensive coordinator, which is my opponent's chief complaint, fits into Tomlin's style perfectly [Again, besides being ‘irrelevant,' my opponent does not argue against this]. The framework that I am presenting for this debate, which my opponent has presented none so far except that we should judge Bruce's ‘bad/goodness' by his ability to call plays, is that an offensive coordinator who can work within the head coach's philosophy is a good offensive coordinator for that organization (regardless of record and on the field performance) – being able to win Championships while being in tuned with the Head Coach's philosophy makes an excellent fit for the organization. Since the topic asks us to evaluate whether or not Bruce Arians is a bad offensive coordinator for the Steelers, it implies that we must determine whether or not he is ‘bad' for the organization. My case proves (especially since my opponent does not argue against me on this point) that Bruce Arians' philosophies and performance compliments Mike Tomlin's coaching philosophy. If Tomlin's philosophy is upheld by the offensive coordinator, then he cannot be bad for the organization (unless the head coach is, which is not what we are debating). I gain defense against your arguments that his play calling is poor through establishing a framework that makes your central arguments rather irrelevant because it does not harm the Steelers – they still win championships. Then, I generate offense off explaining how the poor offensive production (what ever the source, I believe my opponent claim is Bruce's poor play calling) helps prepare the Steelers for the playoffs and Championship games. My opponent even concedes that close games are beneficial. His defends this concession – that a team should not depend on defense and player talent to win games – is precisely contradictory to Tomlin's and the Steelers' (current) coaching philosophy. The Steelers won and will continue to win under Tomlin through a defense-first approach that asks players to make plays – not coaches to make plays. Furthermore, Bruce is smart enough to know when to let his quarterback call plays, and when to call them himself. His career shows success in improve Ben's passing statistics as well as setting the foundation for Peyton Manning's career, and developing a terrific wide receiver core in Pittsburgh. Bruce, like Tomlin, develops players who can play for him – which wins championships. It's not ‘my argument' about Bruce's numbers; the argument (as quoted) is from the Pittsburgh Steelers Organization (website), themselves, whom, since the debate is on what is good for them, should be valued as superior evidence because I would trust that the Steelers know more about their well being then two fans debating the issues – or at least the strengths of their coaching. The statistics on rush rank compared to points per game show limited correlation with success as the worst season (2008) the Steelers won the Super Bowl, and improved in both of these ‘pivotal' stats the next season (although very slightly in each). My opponent presents no evidence linking a correlation with the offensive coordinator's specific play calls (his framework?) and a decrease in scoring. Furthermore, show no correlation to championship success. Turnovers, game planning, field position, clock management (look at the 3 possessions the Steelers gave the Bills in the first half to showcase Bruce's ability) are all important contributions that offenses can make to a team. Specifically, under Tomlin and Bruce the Steelers are 12th [2007], 11, 20, 2 in turn-over differential (with a correlation to playoff/season success), and 9th [2007], 20, 12, 12 in offensive points (under Bruce's predecessor, Ken Wisenhunt, the Steelers ranked 11th, 9[2005], and 12; Bruce shows no decrease in offensive points). More specifically on turnovers, Bruce's offense's total turnovers a season: 22, 25, 29, 26 [Int 9, 13, 17, 11]; comparatively, Wisenhunt's offense accounted for 25, 27, 37 [Int 13, 14, 23] [ Wisenhunt was a ‘good' offensive coordinator for the Steelers, and Bruce's offense is no less productive in points (except the SBXLIII Champions), or weaker in any other meaningful statistic. Jets game: 1) Tomlin respects a changing offense by viewing the game from a defensive perspective. The offense should be – an is under Bruce, considering 3 playoff appearances and 2 Super Bowl appearances - able to adapt with greater knowledge then the defense; confusion is player responsibility, and no evidence is presented that Bruce makes players confused. 2) + 4) Regardless of my opponents claims, the Steelers as a team had a chance to win the Jets game, but \"didn't make the plays\" down the stretch that the Jets made. Even if Bruce made bad decisions, they ultimately did not cost the Steelers the game [note the opening kick off returned for a TD, and the fourth and goal converted for a TD]. C1: Both I and my opponent agree that Bruce saved his most functional formations for the playoffs. Regardless of if this is ‘stealing', Bruce was smart enough to implement it. C2: Steelers' Coaches ask their players to make plays to win games. My opponent fails to understand this argument. Tomlin seeks to teach players that they have to step up in every game, every week (not blow out opponents). C3: Mendehall has the most rushing TD inside the 5 in the NFL this year – yet my opponent is complaining about the Steelers' red zone production? Bruce recognizes that Ben passes the ball too much and receivers drop balls. Defensively, apply my argument that not blowing opponents out does not qualify as ‘bad'. C4: Not being stop on a play allows the team to go back to it when they need it to win a championship latter, and keeps the defense guessing. C5: 1) I would like to see the evidence for my opponents claims; otherwise I will just go by the Steelers' position. 2) My opponent concedes that Bruce is a good QB coach. 3) (framework) 4) Bruce improves Ben's performance, which my opponent agrees occurs, which definitely doesn't make Bruce ‘bad' at his job. 5) Close games key to winning a championship. (Framework) 6) Close game build trust. Bruce allows for players to understand each other which is critical coaching for late game situations or the playoffs where success must occur with the coach being able to directly intervene. Building trust among players creates an excellent coach. 7) Bruce's performance at offensive coordinate won the Steelers a Super Bowl. 8) My opponent fails to understand Tomlin's focus on Defense first. Under Tomlin, the Steelers have had the 2nd, 1, 15, 1 ranked defenses, and Tomlin's whole coaching and game planning strategy resides in his defense making plays and securing a victory. My opponent's arguments for offense reside outside of Tomlin's framework, and thus should not be used when evaluating Bruce's ability as Offensive Coordinator of the Steelers.\n\nEvidence Con: Arians argues: \"No one sits at home and calls defense. I enjoy listening to sports talk shows myself and I think ‘We really did have a run called, Ben just threw the damn thing\" [Feb. 1, 2011, NBC Sports]. Bruce Arians is not a bad offensive coordinator for the Pittsburgh Steelers because any flaws in his play calling and ‘low' offensive production of points (his 23 PPG compared to Wisenhunt's 23.2) correlates with Mike Tomlin's coaching philosophy: \"The time's coming when we're going to have to ante up and kick in like men\" [Mike Tomlin clich�]. Bruce's style may keep games close, but this forces players to play like \"champions\" in most games of the season - which makes players prepared to play and to win come January and February. Furthermore, he has many statistical consistencies that prove his success, as well as excellent players that he has developed into terrific offensive players (including a Pro-Bowl rookie Center). On statistics: I would like to assert that I am quoting the Steelers website about the merits of Bruce, which can explain how he is beneficial to the organization better then either of us (the Steelers credit him with franchise record offensive statistics in 2007, developing Ben at QB, developing Hines Ward at receiver, as well as developing Peyton Manning for the Colts). My opponent presents no consistency on which offensive statistics prove a OC as \"good\" or \"bad\" – we cannot merely pick and choose without any reason. I have present substantial evidence, and in many causes compared the evidence to theory or another OC (Wisenhunt) that was not ‘bad' as a control case to verify my claims. Most of my opponent's statistics are lacking anytime of comparison analysis. Similarly, I have presented clear evidence through out the debate showing the coaching philosophy of Mike Tomlin, the benefits that Bruce has made to the Steelers Organization, comparing Bruce to Wisenhunt, and showing how most of my opponent's evidence supports my case or at least does not clearly support his case. Without proper warrants for his evidence, most of my opponent's arguments are merely opinionated claims that reside in dissatisfaction with Bruce as the Steelers offensive coordinator, not why he is bad at his job. Furthermore, as the Pro side of the debate, my opponent must prove clearly that Bruce is a ‘bad' offensive coordinator. The framework I present within the round is that he has to prove Bruce is not consistent with Tomlin's coaching philosophy (which he has never argued). If I win my framework as viable, I clearly should win this debate. Although, my opponent has not presented a clear framework for his side, however, I will assume that it involves measuring Bruce's performance off of ‘substantial wins' and ‘effective' play calling. Both of these measures have no true bright-line, as they are based off of personal opinion, but I will now analysis how my opponent may win this round: C1 proves that Bruce is good enough at his job to save \"his most functional formations for the playoffs.\" He makes valid points about Bruce's failure to use a full back. However, the Steelers under Bruce posted 2160 [2007], 1690, 1793, and 1924 rushing yards a season, with a 1,000 yard rusher every season except the 2008 Super-Bowl run. Any valid points here are mere opinions of dissatisfaction. C2 argues that Bruce fails to call the \"right play at the right times\". Again, this is merely opinion based on observations and shows no evidence except isolated examples. My framework directly argues that this does not make Bruce a bad offensive coordinator within Tomlin's opinion. C3 argues that Bruce fails in the Red Zone, but he fails to compare this evidence of 50% (The 14-4 2010 Steelers in the Super Bowl) to other offenses this season and/or to other successful OC. Although Bruce recognizes failures (particularly dropped pass which are players not making plays), and Mendehall has the most rushing TD inside the 5 in the NFL, Bruce's mediocrity in the Red-zone could be a problem. C4 argues that Bruce quits using formations and plays that work before someone stops his offense. I have argued that this keeps defenses confused, that Tomlin respects Bruce's ability to try to out-smart opponents, that players need to be responsible for making plays, and that this allows the plays to be saved for the playoffs. However, my arguments lack some evidence compared to my opponents, and it is viable that Bruce has refused to run possibly successful formations. His C5 argues that Big Ben wins games despite his offensive coordinator. I argue here that close games build trust and a championship quality team, as proven by Arians leading two teams to the Super Bowl, including a victory. My opponent negates Ben's increase in statistics and ability on the field as having no correlation to Bruce's ability – I believe they strongly do. Thus, if one buys my opponent's arguments that Bruce makes mediocre play calls (based on the success of plays, not the actual coaching strategy involved in calling such plays) which diminish from team success (despite 1,000 yard rushers, PPG similar to Wisenhunt's, franchise offensive records) specifically because Bruce fails to continue running successful formations (even though we both agree Bruce uses his best formations in the playoffs), my opponent could win the round. However, this would have to be weighed against my framework argument, usually superior evidence, bright-lines for comparing evidence, and how successfully the pro side proves the topic. AT: Counter-plan 1) To meet his burden, the CP would have to prove why Bruce is a bad offensive coordinator, not that Ben would be a better one, or that Ben even dislikes Bruce enough to want to replace him. 2) \"This debate is merely concerned with if Bruce is good/bad offensive coordinator, there is no implication to the action, and thus any fear on his replacement resides outside the resolution. Though, he should be fired\" [Opponent, round 2]. This means that CPs cannot be evaluated within our debate. 3) CP not viable: coaching as a player is illegal in the NFL. 4) Bruce argues: \"I'm an idiot anyway. They're gonna say that anyway. Ain't going to change.\" [ Specifically, he's addressing the 5 wide pass play where Ben threw the ball to Brown instead of continuing the designed roll out to end the AFC championship. Ben is viewed as successful when his gambles work, and Bruce is blamed when Ben's gambles fail: this is an unfair standard for determine whether or not Bruce is a ‘bad' coach. Tomlin believes in developing a culture of humility and confidence; this can only be created through continually playing close games. Losses are inevitable in a season – Tomlin seeks to make the most of them. Going 9-7 wins you championships by demanding that your players perform at the highest level or realize that (with all their talent), they finished 9-7 and missed the playoffs. After learning from their mistakes, the Steelers are in the Super Bowl – Championships take coaching, not victories. Numbers: your own Total Rushing Yards/PPG show an increase from 2008(Championship) to 2009(9-7). Relative points scored increased from 20th to 12th [22.5] in the league; offensive yards per game jumped from 311.94 to 371.31. (Wizenhunt averaged 334 yards per game in Pittsburgh – 357.8 in his best season). Bruce's offense in 2009 put up 37 points and no turnovers against a Packers team allowing 18.6 ppg, and 2.5 TO pg; 38 points and 1 TO against San Diego: 20ppg and 1.5 TO pg. Wisenhunt: (9-2-7)(13-5-3)(6-8-2)[28-15-12] (10 blowouts; 2 SO)(.726 win%; .509 win off; .327 without counting blowouts] compared to Bruce's [18-15-16](.667 win%; .394 win off). Wisenhunt had 6 blowout losses to Bruce's 3. Wisenhunt was shutout twice; Bruce never got shutout. No evidence shows \"the numbers weren't there.\"\n","DiscussionID":"00000028","Title":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","CrawlDate":"2016/09/29 06:28:05","URL":"http://www.debate.org/debates/Bruce-Arians-is-a-bad-offensive-coordinator-for-the-Pittsburgh-Steelers./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":157,"ConclusionEndPos":229,"nextID":"00000002","PremiseStartPos":[281],"prevID":"00000000","Premise":["You are backed up in your own 1 yard line. Trailing in the 4th quartedown the firer by 3 points: Do you A) play it safe and run the ball to gain yardage, prevent getting a safety, and pound away hoping to gain the minimum 15 yards for your punter and possibly if a whole opens up and you pick up a first down start driving, or do you spread out the wide-reciever, go out of shot gun and pass down the field in order to start driving and assume the risk that a sack/hold/intentional grounding will result in a safety? Niether if you are Bruce. Instead you call a shot gun-4 wide-single back, and ‘psyc' the defense into think you are going to pass and hand the ball of to the running back out of a draw. Great idea, except a)you brought in your 3rd down back, by far your worst running back b)you ran him horizontally on the goaline so he had no shot of ever getting out of the endzone c) you had no-one to block him because you went 4-wide so you pull the left tackle right (which leaves the DE un-blocked into the backfield to talk the running back for a safety cause its not like anyone in that situation would try to apply pressure). This play, in and of itself, is enough to say he's an idiot (the Steelers ended up losing by five points after two incompletion from the 10 yard line with :09 seconds left. Had the safety not occurced, they could have kicked a Field goal and went to overtime). But if that play isn't enough for you, let me convince you with some nice points: Contention 1: He won't use a Full Back Ok, so techniqually Johnson is our \"FB\" but only because you have to list on as your starter. He is truly a third string tight-end. And its not like we didn't have a FB in camp, we did. But we cut him. Because why would you want a full back? You're right, its not like it could possibly help the running back by taking a lead blocker or anything. Especially since the Steelers have an offensive-line with so many gapping holes as-is its amazing that Mendehall has been able to run on anyone this season. Furthermore, Bruce this season has come up with a number of ‘schemes' to cover for his failure on the part of not having a FB on the roster. The season started with Mendhall and Redman in the back field out of strong formations, not a terrible concept considering Redman is a power back and handing the ball to either back could throw defensive off if the Steelers where ever actually commited to the run. Oh, and Redman proved ineffective at throwing blocks inside, and why should he? He wants to be the runback, that's what he went to camp for not throwing blocks in the trenches every play for the guy ahead of him on the depth chart. The next fix involved placing Heath Miller in ‘protection' packages where Ben came out of the shot gun, FB can block the leading block which also means pass rusher in most cases. Any idea why Ben takes so many sacks? Noone stays in the backfield to protect him, he gets hit and breaks takles, if you had a full back to take the lead blocker you would have to have the FB beat before Ben ever gets hit (or waste Millers talent by keeping him in to block). Most recently, in the Play-offs the use of Legursky as a FB in goal line situations has proved effective, but this is situational football, and by the looks of the Week17 Steelers through Play-offs I wouldn't be surprised if Tomlin had a say in the situational play calling in the Red Zone. Since the 10 day lay off against Carolina (and going 1-for-5) the Steelers a 50% TD team in the read zone all season have suddenly spiked to almost 70% over the last 3 games. This increase has come from running the ball inside, and adverting the 5-Wide sets in the Red Zone (Bruce's favorite goal line play). Finally, in the AFC Championship the ‘Wishbone' formation the Packers used to run all over the Falcons was seen by the Steelers using multiple TE (and Johnson actually lining up at FB for like the 1st time all season). Watching other games and using their formations hardly counts as coaching. Anyone can steal other teams plays. Contention 2: Failure to call the right plays at the right time, and calling the right plays when they don't matter. Lets look at the Ravens (1st match up) w/ just over two minutes left in the game the Steelers get the ball back on downs at there 2 yard line needing 1 first down to ice the game. After a run for a minimual gain, a false start moves the Steelers deeper into there own endzon, then another minimual run, then another false start. Now its 3rd and long back up in your own endzone (again you don't have a FB) and what do you call? Yes exactly, a run play and get stuffed. Despite not having the 5 yards for your punter who gets of a terrible kick, w/ a minor runback and a penalty gives them the ball at the 40 with a minute left. So you run when you need to pass….and like wise in the AFC championship game on third down just across mid field Bruce passed, where an incompletion stops the clock and would give the Jets 40 extra seconds to run a potential game winning TD drive had the pass been incomplete. Some call this guts, I call it a stupid gamble, but then again we couldn't run on the Jets in the second half? Why…see contention 4. Or, look back to last season when Dixon had to play against the Raven's after injury to Ben and Batch. After Dixon played exceptional, and the game went into overtime, the thrown in at the last minute started had no idea what to do. I'm positive the coaching staff didn't come up with a statedgy for overtime, because well they probably never thought they'd get that far. But, in over time the Steelers get the ball and Bruce comes out passing. Dixon, misses several open receives and throws the ball away and into poor choices of covered receivers but escapes to punt. Then the defense holds the Ravens. Upon getting the ball back and having an entire Balitimore drive to understand that Dixon miss completely open receiver on multiple pass attempts on the first OT drive what does Bruce call? Exactly a pass, not only that but he calls a play where he send the wide receivers deeps, keeps two backs to block for protection, and send the TE on a curl. The TE is the only receiver Dixon sees because he's not examining the field. 3 separate Balitimore players converage on the ball and the pass in intercepted and game over. Ok, lets look at the Rand El passing TD in the Cincy Monday night game when you are up big. Or the fake spike in the 1st half against the Jets (the play failed) but couldn't be used latter in the 2nd half (when you need to score). Or the multiple lateral reverse Bruce likes to run that always fail. His trick plays are like practice in game, they never serve a point or help us win. They just work when we don't need them to at all (and that's probably why they work, who runs a trick play when you have a huge lead?) Contention 3: He sucks in the Red Zone Bruce repeatively goes 5 wide in the Red Zone, year in and year out. It wasn't until the last 3 games as mentioned above we've shown any life inside the twenty. On the season we were 50 percent on scoring TD's and that is consistent with Bruce's numbers over his tenor as Offensive Cordinator. Most noteable, an instance when we recovered the ball on the 1 and failed to punch it in in 4 attempts. And we went 2 for 5 on TD against Carolina….(and blew them out despite that). Contention 4: We can't do something if they know we are gonna do it Ok, here is where Bruce takes the cake. Instead of any reasonable mind person that has a ‘game plan' or a formation or a play that works and decide ‘ok we can keep using that until someone can stop us' when something works Bruce stops using it to ‘mix things up'. You need look no further than the AFC Championship, the induction of stealing the Packers wishbone formation in the first half work great, it did not reappear in the 2nd half. Why? Because it work. On a Sunday night game last year again the Broncos Mendenhall ran out of Trips-Bunch Single Back and ran right side, he had over 100 yards by halftime. He ran it so effectively that the announcers even explained the play to the viewing audience in the 2nd half because the rought was on. But, after pulling to 6-2 and looking like a legitiment team to repeat, Mendenhall right Tackle out of Trips Bunch Single Back disappeared from the play book for the remained of the season (and this season). Why? Because, Bruce said ‘Well they know we are gonna do that, so we have to do something different'. No one ever beat us at it. No one ever figured it out. Bruce effectively beat ourselves by never running out of it again. Contention 5: Big Ben Ok, so he has the fortune of a great running back who can get 1,000 yards despite not having a FB on the roster, but Bruce has a job because he has a QB who can win games DESPITE him. In the '08 Super Bowl run, the Steelers won almost all of their games coming from behind in the final two minutes on a game winning drive. The offense, dorminant all day, suddenly cam to life and scored in the clutch. Again, and again, and again. So much so that when the Cardinals actually beat the Steelers D in the Super Bowl the Steelers just marched down the field and scored like they had all season. Why? Because, Ben runs the two minute drill out of the no huddle. Which mean guess who calls the Plays? Hint: not Bruce. Yep, Its Ben himself. Look at the Raven's game. That huge 3rd and 19 where Brown makes that catch, Ben himself is quoted saying \"I told Bruce we should throw it deep….'cause if they intercepted it, it would be just like a punt\" So we can thank Ben for his genioious to constently over come an inept offensive coordinator. For further evidence of this, look at our offense when Ben doesn't play. We had the 30st offense in the league after week four (With Dixon and Batch at QB). Why? Because Bruce was calling all the plays."],"PremiseEndPos":[10150],"ArgumentID":"00000001","Conclusion":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":157,"ConclusionEndPos":229,"nextID":"00000003","PremiseStartPos":[10165],"prevID":"00000001","Premise":["Turn opening point on Tomlin: Entirely non-unique to resolution. Tomlin valuing the ideology that games should be kept close has no barring on if Bruce is a good offensive coordinator for the Steelers are not. Unless you are making the point that he calls plays sooo bad that it prevents the Steelers from ever breaking away in games and always keeps games close. Which, is stupid. You mine as well fire him and not use an offensive coordinator if his only job is to limit the offense as you argue. And as I stated in my 1AC, Ben calls the plays in the No-huddle and 2 minute drill. So in-essence you say it's a good thing Bruce is so bad he limits the offense, except when they tell Ben to call the plays. That doesn't make him a good offensive coordinator, that makes him beyond terrible. Though, I'll concede close games have a benefit in the long term, that doesn't mean that Bruce is a good offensive coordinator because he can't blow teams out and lucks out on nurmerous occasion because his defense/Ben is so good that he can't stop them even though he trys. Turn your argument about Bruce's numbers: Bruce has a good winning percentage because the Team has a good winning percentage. Most notably, his defense and Quarterback (running out of a two-minute drill calling his own plays) win games for him time and time again. He has a good winning percentage despite his inept play calling. Roethlisberger posting career numbers is evident of Bruce's ‘pass first' philosophy, where before the Steelers ran the ball giving Ben fewer oppurtunities to throw. However, it was ineffective in the whole Resulting in lower overall points for the season (the best way to judge an offenses production): [insert cite] Well, take a look at these stats. \"In 2009 the Steelers ranked 21st in the NFL by scoring touchdowns in the redzone only 48.2 percent of the time. Behind teams such as Washington, Tampa Bay, Jacksonville, Kansas City, and Carolina. In 2009 the Steelers ranked 22nd in the NFL in rushing yards per game while averaging 22.5 points per game. In 2008 the Steelers ranked 23rd in the NFL in rushing yards per game while averaging 21.7 points per game. In 2007 the Steelers ranked third in the NFL in rushing yards per game while averaging 24.6 yards per game.\" ( Being a ‘inconsitent' play caller, and randomly doing stupid stuff does not make you a ‘good' offensive coridinator. It only makes you unpredictible. Again, since his only success comes out of the 2-minute Ben called plays I fail to see how this works. Show me evidence or examples of when, without either a)A QB other than Ben or b)When Ben was not running the No-Huddle the Steelers have been successful, consistently on offense. It won't happen cause Bruce switches everything up all the time and starts over. A lack of consistency on offense hurts production. Even in this years play-offs our offense was mostly sparked by Short Fields against Baltimore, and stealing the Packers run formation against the Jets/Ben making big plays and escaping the pocket (again, not designed plays called by Bruce so you can't use any of these either) On your it would take a year transition: This debate is merely concerned with if Bruce is good/bad offensive coordinator, there is no implication to the action, and thus any fear on his replacement resides outside the resolution. Though, he should be fired. If nothing else, Ben can call the plays. (Response to Specific Responses) With regards to the safety in the Jets game: 1) Bruce's unconventional style keeps defenses confused; Formation makes the defense think pass (see above that Tomlin respects this). Randomly calling plays my keep a defense confused, but it also keeps the offense confused and lacking consistence. 2) Turn – The Steelers still had a chance to win the game, but Ben and the offense did not capitalize at the end of the game. Having a chance to win and winning are different. Besides, Bruce doesn't call the 2 minute no huddle plays anyways, so BEN had a chance to win the game for Bruce. Had Bruce been a valuable asset to the team, he should have had us in a position to win the game, not all on BEN (like it is every week) 3) Turn – [Tomlin's Post Game Press Conference] \"We didn't cut off the backside three technique… it's unfortunate, and part of the description that I came in with saying that they made significant play down the stretch and we didn't.\" – Champions would make the play regardless of the call. But, ‘champions' shouldn't have to overcome bad play calling and an opponents defense. There offensive coordinator should work with the team, not against it. 4) Turn – Don't blame Bruce because the offense didn't lose the game; a 4th and goal touchdown and a kick off return by the Jets cost the Steelers the game, not poor play calling against one of the better defenses in the league. Yes, the defense allowed a score, and a special teams return, but offense respond by scoring more points. Bruce's inept play calling allowed for lower points which makes it harder to win games. The offense can't be blameless in not winning games, in fact if the offense just puts up lots of points; how can it be to blame? C1: I agree that this is a legitimate complaint; however your argument indicates that Bruce saved the most functional formations for running for the playoffs, and Mendenhal had some of his best runs in the first half against the Jets. Stealing a formation from another team doesn't make you good. It makes you a copy-cat. Anyone could have done that, its non-unique to saying he has any talent. C2: 1) Turn: The Coaches ask their players to make plays to win games. The Head Coach, the Offensive coridnator is responsible getting his team in a position to win the game (and that includes taking a big lead which Bruce is to inept to do) C3: [Bruce Arian's response to Red Zone problems, Nov. 2010:] \"Yeah, dropped balls. We haven't run it very good inside the 10-yard line. We've had like first and goal at the seven or eight and we haven't run the ball for 3 (yards), run the ball for 3 (yards) and gotten it down there where you have two things to do. We've thrown it into the end zone and it's come right back to second and 7. We need to pick that up.\" Mendehall has the must rushing TD inside the 5 in the NFL this year, and we still had a 50% redzone efficency on the season. This is terrible, we should have been blowing oppents out, instead of just skweaking by every week because Bruce is to inept to call plays in the red-zone or use a Full Back C4: 1) T/ Not being stop on a play allows the team to go back to it when they need it to win a championship latter, and keeps the defense guessing. No warrant to claim, they don't ever go back to the plays. And when you stop Mendenhall off right tackle on Trips-Bunch and loss 5 in a row and miss the play-offs…you're an idiot. C5: 1) Turn: Ben's stats increased under Bruce; he helps Ben at Quarterback. Overall offensive Stats down, only because of Pass happy nature of game. And lack of taking leads early which forces to pass late in games. 2) Turn: Bruce developed Peyton Manning and is capable of developing great quarterbacks. Only beneficial as a QB coach, not an offensive cordintor which is a more diverse position and requires more then being able to coach a QB (you have to call plays too….which Bruce can't) 3) Turn: Tomlin likes close games. Non-Unique to Bruce as a good offensive coordinator 4) Turn: Close games make Ben a better Quarterback. Non-Unique to Bruce as a good offensive coordinator 5) Turn: Close games are the key to winning a championship. Non-Unique to Bruce as a good offensive coordinator 6) Turn: Team must trust each other in key games; play like champions. Non-Unique to Bruce as a good offensive coordinator 7) Turn: My opponent concedes this strategy won us a Super Bowl. Non-Unique to Bruce as a good offensive coordinator 8) Turn: Steelers focus on our defense first; Steelers still won without Ben, including a blow out in Tampa Ba Steelers won with a 30+ ranked total offense in those first four games this year. The blow out in Tampa Bay was luck, where verteran QB Charlie Batch made 3 deep throws and barely thread CB to score long TD (combined with a defense that almost posted a shutout and a TD INT return). The results of the Tampa Game (a road win against a 10-6 team) should have been the norm-not the exception. The win against Alanta was luck, we scored 9 points in regulations (6 on a 50+ yard run by Mendehall in OT). That was all Defense to win your opener without scoring a TD in regulation. Also, our domination @ Ten resulted in still giving them a change to win that game at the end because of our failure as on offense to pull away despite a defense that was completely dominant for 55:00 minutes of the game. Also, the offense has a responsibility to win games. And the offensive coordinator is the individual who bears that burden. When teams win ‘despite' poor offensive production, the Offensive coordinator did not do his job. Especially, when the offense (such as the Steelers) is extremely talented."],"PremiseEndPos":[19257],"ArgumentID":"00000002","Conclusion":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":157,"ConclusionEndPos":229,"nextID":"00000004","PremiseStartPos":[19272],"prevID":"00000002","Premise":["Your any idiot. Counter Plan: Don't use an offensive coridanator. Benefits: 1)You save money 2)Ben can call the plays all the time (which you never responded to the fact he does in 2-minute drills) and can get really really good at it so he can be use to calling plays all the time 3)You don't have an idiot who calls plays and losses use games, like against the Jets this year or how many times last year (try 8+times, there was games we should have lost and squeaked them out in the end because of who…Ben) Your frame work is abusive as hell. My CP meets all the criteria, and guess what Bruce is gone. In fact his position is vacant. The only reason you are saying he is good is because your framework says he doesn't have to do anything and rely on everyone else around him to do good and win for him. That is the most abusive frame work ever. Why don't you just concede and admit he sucks at life? Your entire ideology that he can suck to improve the team is stupid. What happens when you have big leads in games and suddently aren't use to them? You crumble and almost loss. AKA the AFC Championship. Why not just pull ahead and win big, rest your players, move on to the next week. You yourself said less tape is a good thing, if you only have to play 2-3 quarters a week, less game film. Your analogy to the Jets/Patroits blow out doesn't link 3 fold 1)They antagonized a rival, which is dumb, and then where unprepared for them in the post season 2)The Patriots core group of guys (manly on defense) was too young for success in the play-offs 3) Teams that do well, historically, can have success in the play-off, but not always; it is a case by case situation and you can't make a generalization about it. Take the Saints and Colts last season. They beat everyone jumped out to 13-0 starts and played each other in the super bowl. Again, your framework is abusive, you say Bruce has to do nothing around him to be ‘good' at his job. Saying he's been able to coach a QB, as I stated in my previous speech, does not qualify him to be an offensive coordinator because Offenses is more than just the QB position. There are multiple facites to the game my opponent is ignoring. Again, the numbers are not specific to Bruce's talent because you are quoting winning, which you yourself said he puts on the defense anyway. So that should be thrown out. And the offensive production decline, and red zone efficency, and there over all comparision to league rank are objective material. They are simply facts, and have no bais. The statistics indicate that his pass first approach has reduced offensive production. And have bein 50% in the Red Zone (which my oppent has yet to respond to) is attrosious for an offensive coordinator. It simply means is offense is in position to put games away and can't do. Time and time again. That's not how teams win championships (unless they're backed with a defense that is sooooo good you can kick 3 field goals and miss 2 more and still beat the best team in the NFC) The offensive coordinator is responsible for the production and all elements of his offensense. The corrrolation is implied. Its like being the manager of a store, and the success of the store are directly correlated. Are there outside factors? Sure, but as the manager you are responsible to account for those outside factors. Why? Because its your freakin job. Bruce's play calling/running of the offense has correlated to a decrease in production and an abbismel red zone percentage. You brought up the 1st half of the Bills game. Lets, see…oh year we won in overtime because we scored 0 points in the second half and almost lost. Now you fall apart and do nothing in the second half offensively…this sounds exactly like, no it can't be, the AFC championship? And why? Because we got a lead and Bruce didn't know what to do anymore so he just got confused and messed around and blew the lead to get the game close so he'd be comfortable again. And the minimium time's of position and drives and be attributed to our defense that force 3-and-outs on such a consitent basis. C1: Both I and my opponent agree that Bruce saved his most functional formations for the playoffs. Regardless of if this is ‘stealing', Bruce was smart enough to implement it. I could of stole that formation. Doesn't make me a ‘good' offensive coordinator. Either give me an offensive coordinator job and a million dollar pay check because I can watch other teams and steal there plays, or get off the man for stealing someone else play and just admit he has no talent. C2: Steelers' Coaches ask their players to make plays to win games. My opponent fails to understand this argument. Tomlin seeks to teach players that they have to step up in every game, every week (not blow out opponents). Abusive framework, you are saying Bruce has to do nothing to prove he is ‘good'. Why? Because he sucks, just admit it. He's not a good offensive coordinator, stop trying to cover it up with ‘well, everyone else just has to compensate for me'/ C3: Mendehall has the most rushing TD inside the 5 in the NFL this year – yet my opponent is complaining about the Steelers' red zone production? Bruce recognizes that Ben passes the ball too much and receivers drop balls. Defensively, apply my argument that not blowing opponents out does not qualify as ‘bad'. No, but when you can blow out oppents. You should. At least from the offensive minded perspective. You talk about numbers? If we had a good red zone percentage, say 70-80%, or offensive numbers would be threw the roof and we would look like a dominant force offensively and defensively. But its not. Stop making excuse, and just understand he sucks and can't do it. I wouldn't be surprised if Tomlin's started calling the plays in the red zone….or Dick Labuie C4: Not being stop on a play allows the team to go back to it when they need it to win a championship latter, and keeps the defense guessing. Evidence they every return to plays. Or how going 8-8 wins championships. Fail. C5: 4) Bruce improves Ben's performance, which my opponent agrees occurs, which definitely doesn't make Bruce ‘bad' at his job. Not his full aspect of his job, he's not a QB coach. He's a freaking offensive coordinator. Name 1 other QB coach in the league? Exactly, they are anonmious people, not one rides the offensive line coach when the o-line sucks, they go after the guy calling the plays: The offensive coordinator. 5) Close games key to winning a championship. (Framework) So how does going 8-8 do this? 6) Close game build trust. Bruce allows for players to understand each other which is critical coaching for late game situations or the playoffs where success must occur with the coach being able to directly intervene. Building trust among players creates an excellent coach. 9-7 7) Bruce's performance at offensive coordinate won the Steelers a Super Bowl. They won a super bowl, despite Bruce (Ben executed a Two Minute drive remember? 8) My opponent fails to understand Tomlin's focus on Defense first. Under Tomlin, the Steelers have had the 2nd, 1, 15, 1 ranked defenses, and Tomlin's whole coaching and game planning strategy resides in his defense making plays and securing a victory. My opponent's arguments for offense reside outside of Tomlin's framework, and thus should not be used when evaluating Bruce's ability as Offensive Coordinator of the Steelers. Frame work abusive. You say Bruce should do anything. Ok, here's the deal Mr. Close games help us. Explain how going 9-7 wins you a championship? You've completely dropped that. Completely. You go on and on about how we build trust and skill and blab la bla, but we lost an entire season because Bruce threw our offensive production out the window last least and we lost all those games. The entire season is completely Bruces fault. We had all the talent in the world on offense (Ben, Ward, Holmes, Wallace, Miller, Mendenhal) The numbers weren't there, Bruce lost us those games. Bruce didn't have an offense capable of excuting, and we lost game after game in close margins (Clevland, Oakland, Kansas City, Balitmore) all of those games were close games we could have one (you know, like you punch in one of those 50% of red zone try's you didn't convert?) That is why you don't play close football, because you don't always win. And when we do win, its not on Bruce, its on a guy named Ben running two minute drills. This is all I ask of you in your final speech: Please prove to me that Bruce is capable of leading a team to win games when a)Ben isn't the quarter back or B)When Ben doesn't have to lead a 2 minute drill at the end of games (ie-Bruce isn't calling the plays) or C) The defense plays so dominantly that minimal offensive production is necessary to win anyways (ie- Week one Alanta). Now, averaging out for flucks (ie-Players making big plays for themselves) We would figure that a good offensive coordinator (or head coach) should be about .500+. Right? Let's examine the last 3 Seasons (these season can be significant because we have 1 team that one the super bowl, 1 who missed the play-offs and 1 who will play in the super bowl): By my counts '08 8-4-7; '09 5-8-3; '10 5-4-8. Don't be fooled ladies and gentlemen. Let me explain. I calculated it was so: The first number represents wins where the Steelers won handly, and offensive productions can obviously be the contributing factor, the second column represents loss which regardless of loss where attributed to the inability of the offense to score points (Note: only three games in the 3 season stretch were ‘blowouts' or losses where the Steelers lost by more then 8 points, uniquely all of these losses can be attributed to a failure of offensive production aswell as a team loss; all 3 losses game from seasons the Steelers made the super bowl). The final column is games where the Steelers won, despite Bruce. Factors used here, in order starting with '08: Ravens1- W/OT; Jaugars- Win on FG inside 2 minutes; Chargers- Win inside 2 minutes; Cowboys- Defensive return inside 2 min; Ravens2- TD drive inside 2 min; Ravens3- Defensive TD return to seal game; Cardinals- Last Sec TD. '09: Titans- OT/Win; Packers- Last Second TD; Ravens- Win on late FG//Defensive stand. '10- Alanta- OT/W; Titans- Defensive stand; Miami- FG inside 2 min; Bengals-Defensive stand; Bills- OT/W; Ravens2- Big Defensive play; Baltimore3-TD inside 2 min; Jets- Hang on after lack of 2nd half offensive production. Through this explination for games, a few may be up for contest, but over all the numbers are pretty clear: Over the past three seasons Bruce is 18-16-15. Or in three seasons offense (not including late rallys from Ben) have accounted for 18 wins in 49 contests or a value percentage of 36.7%. (Keep in mind, this includes two teams that reached the superbowl, with one win and one result pending). The Defense/Ben on the other hand have attributed to a 15 wins or a value of winning 30.6% of all games. Before anyone claims Bruce's number his higher, lets remember my assumption that a ‘good' offensive coordinator needs to mine 50% of his games of be .500. In this breakdown of wins senerio Bruce is only contributing in 54.5% of Wins. Let's keep in mind again, I am being overly generous. To say that those 18 wins where all on Bruce is an overstatement to the extreme, but statistically the offense scored enough points to allow the game to be taken solidly in hand. Lets keep in mind though, that a team as talented over the last three years has the Steelers should have some ‘blow out' wins in this stretch; 5 of those wins came against Clevland, and then 1 against the Panthers this year, Lions last year, 3 Wins against the Bengals of '08 & ‘10) Shows at least 9 victories came against significantly inferior opponents. If one was to factor these 9 games out as that anyone could have one them w or w/o an offensive coridinator the remainder is Bruce and his offense contributed to 9 wins in 49 games or 18.3% of games he won. More over, 9 games against inferior opponents plus 15 defense/Ben victories is 24 wins in 49 tries of 49% of victories. Meaning, any given victory is 50% on the defense/Ben/the other team just sucks anyways. Meaning, .673 win percentage can be halved to account for the actual ‘value' of Bruce as an offensive coordinator .336 ‘value' percentage, or a 4-12 record in season play. This number is a fair assessment of Bruce's ability as a good/bad offensive coordinator because 1)my opponent dropped my argument that Ben/the defense win games, and when Ben wins games Bruce doesn't call the plays and 2) the assessment curves the data from simply using a more talented team to beat opponents, which envolves on coaching skills. Inconclusion, I challenge my opponent to express that Bruce can 1)valuably contribute in over .500+ of games 2)Explain how missing the play-offs was a)not Bruces fault b)how Bruce as a ‘good' offensive coordinator did everything right help us win (especially during that 5 game losing streak) c)Where the mendenhall single back right tackle trips bunch formations went after the Denver game in the '09 season 3) Expalin the Value of Bruce over any other offensive coordinator in the league (or as I proposed a vacant position, which I could attribute the Steelers to still winning .489 percent of there games over the last three years; which means the team it self almost good enough to qualify its self as a good offensive coordinator, for Bruce to keep his job he barely had to win 5 games….or ok 9 at 3 a year) To bad you can't prove any of this. We forget how incredibily bad Bruce is because our offense wins despite him."],"PremiseEndPos":[32929],"ArgumentID":"00000003","Conclusion":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":157,"ConclusionEndPos":229,"nextID":"00000005","PremiseStartPos":[32944],"prevID":"00000003","Premise":["Arians argues: \"No one sits at home and calls defense. I enjoy listening to sports talk shows myself and I think ‘We really did have a run called, Ben just threw the damn thing\" [Feb. 1, 2011, NBC Sports].- Wrong, I call defense. Turn, he's an idiot. Empirically, I kept explaining the use of the 2-5 defense by the Steelers in early parts of this year, particularly when injuries plagued the defensive line (and you'll probably see it in the super bowl to when they go 4/5 wide). Again, my opponent framework is abusive because he won't separate Bruce's inefficency from ‘Tomlin's' Philosphy. Perhaps, the ‘Tomlin' philosophy as developed because of Bruce, after Tomlin's never had another offensive coordinator. On statistics: I looked at games won, season finishes, and how usefull the ‘man-who-called-the-plays-to-win-the-game' was (which as noted in Steelers case was often Ben not Bruce) My opponent claims statements by the Steelers organization are superior in all ways, however, politically they won't make bad press about there own staff unless they fired them. Meaning your evidence is in no way superior, and often lacks substance as it is simply quotes supporting him for doing a good job. The Steelers win, but not because of Bruce, in-spite of Bruce. Again, my opponents framework is abusive, because his claim of ‘fitting in Tomlin's coaching strategy' is basically saying Bruce has to do nothing at all and can take credit for winning anyways. Prefer my framework. C1 proves that Bruce is good enough at his job to save \"his most functional formations for the playoffs.\" He makes valid points about Bruce's failure to use a full back. However, the Steelers under Bruce posted 2160 [2007], 1690, 1793, and 1924 rushing yards a season, with a 1,000 yard rusher every season except the 2008 Super-Bowl run. Any valid points here are mere opinions of dissatisfaction. –Bruce fails to fully use his team to the maximum potential. With the amount of talent he is given he doesn't use it to the full potential because of a lack of understand of the offense as a whole, this example is to explain the lack of dimension in his play calling and to explain raw talent, not his actions, win games. C3 argues that Bruce fails in the Red Zone, but he fails to compare this evidence of 50% (The 14-4 2010 Steelers in the Super Bowl) to other offenses this season and/or to other successful OC. Although Bruce recognizes failures (particularly dropped pass which are players not making plays), and Mendehall has the most rushing TD inside the 5 in the NFL, Bruce's mediocrity in the Red-zone could be a problem. When you pass the ball on 5 wide from in side the ten, no one was dropping pass, noone was open and Ben has to force balls into places they shouldn't be. When you run out of space to run routes for wide receivers (ie-the Red Zone) a more running/less passing needs to take over. However, we are still only near 50% over the last 2 season, mediocre by most standards, and this failure results from the packages and personal used in these situations (which rests on the offensive coordinator). Again, his failure to understand you can't go 5-wide in the red zone is his problem because he's stupid. C4. However, my arguments lack some evidence compared to my opponents, and it is viable that Bruce has refused to run possibly successful formations. –Thank you for conceding this point, which again effectively demonstrates Bruce's inabiality as a whole to understand all the demensions of offense. His C5 argues that Big Ben wins games despite his offensive coordinator. I argue here that close games build trust and a championship quality team, as proven by Arians leading two teams to the Super Bowl, including a victory. My opponent negates Ben's increase in statistics and ability on the field as having no correlation to Bruce's ability – I believe they strongly do. –Ok, sure. Ben running a 2 minute drive at the end of every game because he has to, and calling his own plays to boot, is because Bruce is suuuuuccccchhhhh a talented Offensive Cordinator. If he was, Bruce would call the plays (and you know why we don't? Cause in '07 when he did we lost, a lot, and Ben was like ‘hey I can do this better' and he does) AT: Counter-plan 1) To meet his burden, the CP would have to prove why Bruce is a bad offensive coordinator, not that Ben would be a better one, or that Ben even dislikes Bruce enough to want to replace him. –Look at my breakdown of games at the end of my third speech where I explain how Ben, not Bruce, wins us games. 4) Bruce argues: \"I'm an idiot anyway. They're gonna say that anyway. Ain't going to change.\" [ Specifically, he's addressing the 5 wide pass play where Ben threw the ball to Brown instead of continuing the designed roll out to end the AFC championship. Ben is viewed as successful when his gambles work, and Bruce is blamed when Ben's gambles fail: this is an unfair standard for determine whether or not Bruce is a ‘bad' coach. –Its unfair to not place any blame on the coach, when you simply get ‘luck' that takes not skill. When you gamble and lose, you should take the blame. That's why as a coach you win, and win big, if you want to stick around. That's just the way it is. Wasting a season with talented players is stupid, especially since you completely dropped my point about kicking a formation that worked when you were 6-2 and dropping 5 straight games (almost six but Ben pulled out a miracle). If you want to look at the '09 Season and how we beat good teams, we did. But why is your ‘great' offensive coordinator losing to the likes of the Chiefs, Raiders, Browns, insucession. Its abusive to claim ‘oh, we were building for next season'. No, Bruce sucked it up. Plain and simple, don't make excuses for him. He lost us 5 games in a row were we lost to teams that were 4-12, 3-13. That's terrible, especially when you sandwhich that between teams that went to Super Bowls. He took a team with talent and wasted it. You have to look at each season individually, and in '09 Bruce wasn't worth a damn and should have been fired for having a offense that failed to produce key points to win games (IE- scoring in the red zone, using Mendehall right tackle single back trips bunch which you completely dropped so I win that argument) Finally, my opponent failed address my claim that you need to be .500+ as an offensive coordinator to be good. I never gave the assertion or proof that Wisenhunt was a ‘good' offensive coordinator, though I would say without statistical anylisis he did fairely good job over his tenor with the Steelers. However, please recall that after winning a Superbowl, one season remover Wisenhunt/Cohwer left and handed over the team to Tomlin/Bruce (Even the 8-8 season prior to there arrival can be like to problems on Ben's end and a lack of drive from the head coach). Given a golden team of talent, anyone to fail with such star players desirves to be run out of the league. Ben is a seasoned, verteran QB in the NFL the likes of Peyton Manning, or Tom Brady. These guys can run teams w/o coaches. Note: After Dungy retired, and most of the Colts coaching staffed switched over the Colts went 14-0 (rested Manning) and lost the Super Bowl off 1 pick six. This can't be attributed to Calldwells talent as a coach, but merely he was handed a team that was ready to explode. Even this season, it was more injures that prevented the team from excelling then anything else. Consicuently, Bruce's numbers should be imaculent, however his team shouldn't have to be winning by the thread of a needle every weekend and if they do he cannot possible take credit. Furthermore, as all 5 of my contentions which have never been effectively over turned by my opponent prove, Bruce does not understand the complexities and dimenshes of running an offense. He simple understands saying ‘Hey, Ben wanna go win this game for me?' Anyone could do that, that is mine as well by our six year old brother. In conclusion, you failed to prove anything except an abusive framework where you say that Bruce plays to Tomlins coaching strategy. I provide 5 distinct examples explain how Bruce does not effectively understand the offense, and under utilize the talent he has. And furthermore explained how most of his wins came from a strong defense/Ben winning games in the clutch witch again has nothing to do with Bruce's ability as an offensive coordinator. Clearly he is not good, benefically, or in anyway usefull to the Steelers organization and he might as well be fired (say today?) before he does anything stupid. (LIKE LOSS USE THE SUPER BOWL!!!!!!!!!!!!!!) To anyone who actually read this: I'm sorry you wasted so much time on two boy squabbling, but you have to admit Bruce sucks? No? HE sucks open your Damn eyes!"],"PremiseEndPos":[41741],"ArgumentID":"00000004","Conclusion":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":157,"ConclusionEndPos":229,"nextID":"00000006","PremiseStartPos":[41756],"prevID":"00000004","Premise":["As I am playing the devil's advocate in this debate among my family, I will let my opponent present the arguements with which I will refute -- however, I will state that Bruce Arians (currently before the Super Bowl on Sunday) has won a Super Bowl as an offensive coordinator, two AFC championships, and was the wide recievers coach for the Steelers when they won Super Bowl XL in 2005 with Cowher, and thus Arians has proven himself, at the very least, that he is capable of preforming well at his current position as offensive coordinator of the Pittsburgh Steelers. I am looking forward to seeing the arguements against Bruce Arians -- and I hope that this will be a fun debate."],"PremiseEndPos":[42438],"ArgumentID":"00000005","Conclusion":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":157,"ConclusionEndPos":229,"nextID":"00000007","PremiseStartPos":[42453],"prevID":"00000005","Premise":["Mike Tomlin in his four years as the Pittsburgh Steelers head coach has created a system within Pittsburgh that wholistically plays football. Tomlin's coaching philosophy reflects his repetitive use of clich� phrases: \"People aren't very good listeners, by nature. Part of being a good communicator is recognizing and understanding that and trying to make the complex simple. I try to capture a concept, an idea or a moment in a few words. If they remember it, job done\" [Mike Tomlin, interview before Super Bowl XLIII]. Tomlin captures concepts through out the whole season that he implements within his team. Tomlin has asserted that his coaching philosophy is to keep games close and win them in the end. Why? Why would anyone want to have close victories (and close losses such as the Steelers' 2009 campaign)? Tomlin understands that losses are inevitable in a season, but that the regular season is ‘practice'. He explained in an interview before the Divisional Round this year that: his team was experienced in playing close games, so they never felt flustered at any point within a game. Similarly, before playing the defending Super Bowl champions in New Orleans on Halloween, Tomlin respond to a report's question about his teams' preparedness for the game with, \"I hope my team is ready to play like champions because that is how we have to play if we want to win this game.\" The implication – \"This game is going to be decided by those who play it on the field\" [Tomlin, about Super Bowl XLIII]. Tomlin plays a holistic game planning strategy where he asks his players to win games during the regular season instead of coaching for domination. One of Mike Tomlin's famous quoted sayings is: \"I'll tolerate you until I can replace you.\" The question, among many Steelers fans, is why does Mike Tomlin tolerate Bruce Arians? The Steelers' official website sings Arians praise for his first two seasons with the organization (2007 and 2008): \"[Bruce Arians has] 51 career wins, including a 22-9 mark during Arians' first two seasons as offensive coordinator, Roethlisberger has a .718 winning percentage, trailing only Tom Brady among active quarterbacks… Arians helped All-Pro wide receiver Hines Ward become one of the best wide-outs in the NFL over the past five seasons [as receiver coach and offensive coordinator]…. In his first year as offensive coordinator in 2007, Arians helped Roethlisberger get elected to his first Pro Bowl as he broke Terry Bradshaw's longstanding team record for most TD passes in a season with 32. Roethlisberger also finished with a career-best and team-record QB rating of 104.1.\" Also included on Arians' resume is his time spent in Indianapolis as Peyton Manning's Quarterback Coach (1998-2000). However, this success does not stop uproars from Steeler Nation against Bruce, including him reportedly being fired at the end of the 2009 season. The question for the Steelers is whether mediocre to good offense is ‘good enough', and for the Rooneys whether or not the Steelers will continue to be a run-first team. Tomlin is a defensive minded coach, and trusts his defense tremendously through game decisions that he makes (see responses to C2); Tomlin needs somebody who knows more then him on offense, and Bruce does. Firing Bruce would require at least a year of transition on offense which would cost wins for the Steelers organization [Timothy Kessler, Jan 14, 2010 \"Considering the Cause of Mike Tomlin's Decision To Keep Bruce Arians\"]. Furthermore, Bruce's inability to mobilize tremendous offensive talent to blow out opponents is not a problem for Tomlin – his game- and season-planning strategies rest in keeping games close, and not blowing out opponents, not showing how his team will demolish another team, and getting his players comfortable in uncomfortable situations. Bruce's poor play-calling, at times, forces players to make talented plays which is exactly what Tomlin believes is required to win a championship. Bruce's style of play calling, which seems to be him either being stupid or over estimating and over-thinking the defense that he is going up against, causes him to constantly shift the Steelers focus from game to game – one game will be run-heavy, one game will be pass-heavy, other games will merely have plays called at stupid or random times, especially trick plays which are hardly ever preformed at useful times within the game. Bruce's play calling almost resembles that the Steelers are ‘practicing during games'; Mike Tomlin's holistic approach allows for the whole regular season to be practice to condition the team for the playoffs. Tomlin respects Bruce's ability to mix up the offense, and from a defensive stand point, it keeps the defense guessing because the play call could be anything (no matter how stupid). (Specific Responses) With regards to the safety in the Jets game: 1) Turn – Bruce's unconventional style keeps defenses confused; Formation makes the defense think pass (see above that Tomlin respects this). 2) Turn – The Steelers still had a chance to win the game, but Ben and the offense did not capitalize at the end of the game. 3) Turn – [Tomlin's Post Game Press Conference] \"We didn't cut off the backside three technique… it's unfortunate, and part of the description that I came in with saying that they made significant play down the stretch and we didn't.\" – Champions would make the play regardless of the call. 4) Turn – Don't blame Bruce because the offense didn't lose the game; a 4th and goal touchdown and a kick off return by the Jets cost the Steelers the game, not poor play calling against one of the better defenses in the league. C1: I agree that this is a legitimate complaint; however your argument indicates that Bruce saved the most functional formations for running for the playoffs, and Mendenhal had some of his best runs in the first half against the Jets. C2: 1) Turn: The Coaches ask their players to make plays to win games. 2) Turn: Tomlin passes on 3rd down to seal games because he trusts his defense to hold (They called passing plays in both the 1st Ravens game, I believe - despite my opponent's claims, and the AFC championship); this is consistent with Tomlin and the Steelers kicking a field goal at the end of the 1st half of the Raven's playoff game, and going for Fourth down early in the Jets game – Tomlin trusts that his defense will hold the opposition regardless of what the offense does. 3) Turn: ‘practice in game' is good (see above) 4) Turn: On MNF Cincy game, we need all points to win. C3: [Bruce Arian's response to Red Zone problems, Nov. 2010:] \"Yeah, dropped balls. We haven't run it very good inside the 10-yard line. We've had like first and goal at the seven or eight and we haven't run the ball for 3 (yards), run the ball for 3 (yards) and gotten it down there where you have two things to do. We've thrown it into the end zone and it's come right back to second and 7. We need to pick that up.\" C4: 1) T/ Not being stop on a play allows the team to go back to it when they need it to win a championship latter, and keeps the defense guessing. 2) T/ Less film footage is available for best plays. 3) T/ Team trusts the defense to win. 4) T/ Diversity in play calling allows the coaching staff to see what works and what doesn't offensively. 5) T/ Tomlin respects Bruce trying to out-smart defense (see above) C5: 1) Turn: Ben's stats increased under Bruce; he helps Ben at Quarterback. 2) Turn: Bruce developed Peyton Manning and is capable of developing great quarterbacks. 3) Turn: Tomlin likes close games. 4) Turn: Close games make Ben a better Quarterback. 5) Turn: Close games are the key to winning a championship. 6) Turn: Team must trust each other in key games; play like champions. 7) Turn: My opponent concedes this strategy won us a Super Bowl. 8) Turn: Steelers focus on our defense first; Steelers still won without Ben, including a blow out in Tampa Ba"],"PremiseEndPos":[50398],"ArgumentID":"00000006","Conclusion":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":157,"ConclusionEndPos":229,"nextID":"00000008","PremiseStartPos":[50413],"prevID":"00000006","Premise":["I have established that Mike Tomlin (which my opponent concedes) has established a wholistic system within the Pittsburgh Steelers where he works on getting players to perform on the field, trusts his players to perform, and creates situations where the players either win or loss games (not the coaches), specifically through close games. The focus is on creating performance that translates into winning championships; not in blowing opponents out or looking like the best time. Within this philosophy, blowing out an opponent) can create determination within other teams to play extra hard (such as the Patriots did to the Jets before the playoffs) and/or cause the Steelers to become over confident in their abilities instead of remaining humble (another key component of Tomlin's philosophy). I have then explained how Bruce's style as offensive coordinator, which is my opponent's chief complaint, fits into Tomlin's style perfectly [Again, besides being ‘irrelevant,' my opponent does not argue against this]. The framework that I am presenting for this debate, which my opponent has presented none so far except that we should judge Bruce's ‘bad/goodness' by his ability to call plays, is that an offensive coordinator who can work within the head coach's philosophy is a good offensive coordinator for that organization (regardless of record and on the field performance) – being able to win Championships while being in tuned with the Head Coach's philosophy makes an excellent fit for the organization. Since the topic asks us to evaluate whether or not Bruce Arians is a bad offensive coordinator for the Steelers, it implies that we must determine whether or not he is ‘bad' for the organization. My case proves (especially since my opponent does not argue against me on this point) that Bruce Arians' philosophies and performance compliments Mike Tomlin's coaching philosophy. If Tomlin's philosophy is upheld by the offensive coordinator, then he cannot be bad for the organization (unless the head coach is, which is not what we are debating). I gain defense against your arguments that his play calling is poor through establishing a framework that makes your central arguments rather irrelevant because it does not harm the Steelers – they still win championships. Then, I generate offense off explaining how the poor offensive production (what ever the source, I believe my opponent claim is Bruce's poor play calling) helps prepare the Steelers for the playoffs and Championship games. My opponent even concedes that close games are beneficial. His defends this concession – that a team should not depend on defense and player talent to win games – is precisely contradictory to Tomlin's and the Steelers' (current) coaching philosophy. The Steelers won and will continue to win under Tomlin through a defense-first approach that asks players to make plays – not coaches to make plays. Furthermore, Bruce is smart enough to know when to let his quarterback call plays, and when to call them himself. His career shows success in improve Ben's passing statistics as well as setting the foundation for Peyton Manning's career, and developing a terrific wide receiver core in Pittsburgh. Bruce, like Tomlin, develops players who can play for him – which wins championships. It's not ‘my argument' about Bruce's numbers; the argument (as quoted) is from the Pittsburgh Steelers Organization (website), themselves, whom, since the debate is on what is good for them, should be valued as superior evidence because I would trust that the Steelers know more about their well being then two fans debating the issues – or at least the strengths of their coaching. The statistics on rush rank compared to points per game show limited correlation with success as the worst season (2008) the Steelers won the Super Bowl, and improved in both of these ‘pivotal' stats the next season (although very slightly in each). My opponent presents no evidence linking a correlation with the offensive coordinator's specific play calls (his framework?) and a decrease in scoring. Furthermore, show no correlation to championship success. Turnovers, game planning, field position, clock management (look at the 3 possessions the Steelers gave the Bills in the first half to showcase Bruce's ability) are all important contributions that offenses can make to a team. Specifically, under Tomlin and Bruce the Steelers are 12th [2007], 11, 20, 2 in turn-over differential (with a correlation to playoff/season success), and 9th [2007], 20, 12, 12 in offensive points (under Bruce's predecessor, Ken Wisenhunt, the Steelers ranked 11th, 9[2005], and 12; Bruce shows no decrease in offensive points). More specifically on turnovers, Bruce's offense's total turnovers a season: 22, 25, 29, 26 [Int 9, 13, 17, 11]; comparatively, Wisenhunt's offense accounted for 25, 27, 37 [Int 13, 14, 23] [ Wisenhunt was a ‘good' offensive coordinator for the Steelers, and Bruce's offense is no less productive in points (except the SBXLIII Champions), or weaker in any other meaningful statistic. Jets game: 1) Tomlin respects a changing offense by viewing the game from a defensive perspective. The offense should be – an is under Bruce, considering 3 playoff appearances and 2 Super Bowl appearances - able to adapt with greater knowledge then the defense; confusion is player responsibility, and no evidence is presented that Bruce makes players confused. 2) + 4) Regardless of my opponents claims, the Steelers as a team had a chance to win the Jets game, but \"didn't make the plays\" down the stretch that the Jets made. Even if Bruce made bad decisions, they ultimately did not cost the Steelers the game [note the opening kick off returned for a TD, and the fourth and goal converted for a TD]. C1: Both I and my opponent agree that Bruce saved his most functional formations for the playoffs. Regardless of if this is ‘stealing', Bruce was smart enough to implement it. C2: Steelers' Coaches ask their players to make plays to win games. My opponent fails to understand this argument. Tomlin seeks to teach players that they have to step up in every game, every week (not blow out opponents). C3: Mendehall has the most rushing TD inside the 5 in the NFL this year – yet my opponent is complaining about the Steelers' red zone production? Bruce recognizes that Ben passes the ball too much and receivers drop balls. Defensively, apply my argument that not blowing opponents out does not qualify as ‘bad'. C4: Not being stop on a play allows the team to go back to it when they need it to win a championship latter, and keeps the defense guessing. C5: 1) I would like to see the evidence for my opponents claims; otherwise I will just go by the Steelers' position. 2) My opponent concedes that Bruce is a good QB coach. 3) (framework) 4) Bruce improves Ben's performance, which my opponent agrees occurs, which definitely doesn't make Bruce ‘bad' at his job. 5) Close games key to winning a championship. (Framework) 6) Close game build trust. Bruce allows for players to understand each other which is critical coaching for late game situations or the playoffs where success must occur with the coach being able to directly intervene. Building trust among players creates an excellent coach. 7) Bruce's performance at offensive coordinate won the Steelers a Super Bowl. 8) My opponent fails to understand Tomlin's focus on Defense first. Under Tomlin, the Steelers have had the 2nd, 1, 15, 1 ranked defenses, and Tomlin's whole coaching and game planning strategy resides in his defense making plays and securing a victory. My opponent's arguments for offense reside outside of Tomlin's framework, and thus should not be used when evaluating Bruce's ability as Offensive Coordinator of the Steelers."],"PremiseEndPos":[58196],"ArgumentID":"00000007","Conclusion":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":157,"ConclusionEndPos":229,"nextID":"00000000","PremiseStartPos":[58211],"prevID":"00000007","Premise":["Arians argues: \"No one sits at home and calls defense. I enjoy listening to sports talk shows myself and I think ‘We really did have a run called, Ben just threw the damn thing\" [Feb. 1, 2011, NBC Sports]. Bruce Arians is not a bad offensive coordinator for the Pittsburgh Steelers because any flaws in his play calling and ‘low' offensive production of points (his 23 PPG compared to Wisenhunt's 23.2) correlates with Mike Tomlin's coaching philosophy: \"The time's coming when we're going to have to ante up and kick in like men\" [Mike Tomlin clich�]. Bruce's style may keep games close, but this forces players to play like \"champions\" in most games of the season - which makes players prepared to play and to win come January and February. Furthermore, he has many statistical consistencies that prove his success, as well as excellent players that he has developed into terrific offensive players (including a Pro-Bowl rookie Center). On statistics: I would like to assert that I am quoting the Steelers website about the merits of Bruce, which can explain how he is beneficial to the organization better then either of us (the Steelers credit him with franchise record offensive statistics in 2007, developing Ben at QB, developing Hines Ward at receiver, as well as developing Peyton Manning for the Colts). My opponent presents no consistency on which offensive statistics prove a OC as \"good\" or \"bad\" – we cannot merely pick and choose without any reason. I have present substantial evidence, and in many causes compared the evidence to theory or another OC (Wisenhunt) that was not ‘bad' as a control case to verify my claims. Most of my opponent's statistics are lacking anytime of comparison analysis. Similarly, I have presented clear evidence through out the debate showing the coaching philosophy of Mike Tomlin, the benefits that Bruce has made to the Steelers Organization, comparing Bruce to Wisenhunt, and showing how most of my opponent's evidence supports my case or at least does not clearly support his case. Without proper warrants for his evidence, most of my opponent's arguments are merely opinionated claims that reside in dissatisfaction with Bruce as the Steelers offensive coordinator, not why he is bad at his job. Furthermore, as the Pro side of the debate, my opponent must prove clearly that Bruce is a ‘bad' offensive coordinator. The framework I present within the round is that he has to prove Bruce is not consistent with Tomlin's coaching philosophy (which he has never argued). If I win my framework as viable, I clearly should win this debate. Although, my opponent has not presented a clear framework for his side, however, I will assume that it involves measuring Bruce's performance off of ‘substantial wins' and ‘effective' play calling. Both of these measures have no true bright-line, as they are based off of personal opinion, but I will now analysis how my opponent may win this round: C1 proves that Bruce is good enough at his job to save \"his most functional formations for the playoffs.\" He makes valid points about Bruce's failure to use a full back. However, the Steelers under Bruce posted 2160 [2007], 1690, 1793, and 1924 rushing yards a season, with a 1,000 yard rusher every season except the 2008 Super-Bowl run. Any valid points here are mere opinions of dissatisfaction. C2 argues that Bruce fails to call the \"right play at the right times\". Again, this is merely opinion based on observations and shows no evidence except isolated examples. My framework directly argues that this does not make Bruce a bad offensive coordinator within Tomlin's opinion. C3 argues that Bruce fails in the Red Zone, but he fails to compare this evidence of 50% (The 14-4 2010 Steelers in the Super Bowl) to other offenses this season and/or to other successful OC. Although Bruce recognizes failures (particularly dropped pass which are players not making plays), and Mendehall has the most rushing TD inside the 5 in the NFL, Bruce's mediocrity in the Red-zone could be a problem. C4 argues that Bruce quits using formations and plays that work before someone stops his offense. I have argued that this keeps defenses confused, that Tomlin respects Bruce's ability to try to out-smart opponents, that players need to be responsible for making plays, and that this allows the plays to be saved for the playoffs. However, my arguments lack some evidence compared to my opponents, and it is viable that Bruce has refused to run possibly successful formations. His C5 argues that Big Ben wins games despite his offensive coordinator. I argue here that close games build trust and a championship quality team, as proven by Arians leading two teams to the Super Bowl, including a victory. My opponent negates Ben's increase in statistics and ability on the field as having no correlation to Bruce's ability – I believe they strongly do. Thus, if one buys my opponent's arguments that Bruce makes mediocre play calls (based on the success of plays, not the actual coaching strategy involved in calling such plays) which diminish from team success (despite 1,000 yard rushers, PPG similar to Wisenhunt's, franchise offensive records) specifically because Bruce fails to continue running successful formations (even though we both agree Bruce uses his best formations in the playoffs), my opponent could win the round. However, this would have to be weighed against my framework argument, usually superior evidence, bright-lines for comparing evidence, and how successfully the pro side proves the topic. AT: Counter-plan 1) To meet his burden, the CP would have to prove why Bruce is a bad offensive coordinator, not that Ben would be a better one, or that Ben even dislikes Bruce enough to want to replace him. 2) \"This debate is merely concerned with if Bruce is good/bad offensive coordinator, there is no implication to the action, and thus any fear on his replacement resides outside the resolution. Though, he should be fired\" [Opponent, round 2]. This means that CPs cannot be evaluated within our debate. 3) CP not viable: coaching as a player is illegal in the NFL. 4) Bruce argues: \"I'm an idiot anyway. They're gonna say that anyway. Ain't going to change.\" [ Specifically, he's addressing the 5 wide pass play where Ben threw the ball to Brown instead of continuing the designed roll out to end the AFC championship. Ben is viewed as successful when his gambles work, and Bruce is blamed when Ben's gambles fail: this is an unfair standard for determine whether or not Bruce is a ‘bad' coach. Tomlin believes in developing a culture of humility and confidence; this can only be created through continually playing close games. Losses are inevitable in a season – Tomlin seeks to make the most of them. Going 9-7 wins you championships by demanding that your players perform at the highest level or realize that (with all their talent), they finished 9-7 and missed the playoffs. After learning from their mistakes, the Steelers are in the Super Bowl – Championships take coaching, not victories. Numbers: your own Total Rushing Yards/PPG show an increase from 2008(Championship) to 2009(9-7). Relative points scored increased from 20th to 12th [22.5] in the league; offensive yards per game jumped from 311.94 to 371.31. (Wizenhunt averaged 334 yards per game in Pittsburgh – 357.8 in his best season). Bruce's offense in 2009 put up 37 points and no turnovers against a Packers team allowing 18.6 ppg, and 2.5 TO pg; 38 points and 1 TO against San Diego: 20ppg and 1.5 TO pg. Wisenhunt: (9-2-7)(13-5-3)(6-8-2)[28-15-12] (10 blowouts; 2 SO)(.726 win%; .509 win off; .327 without counting blowouts] compared to Bruce's [18-15-16](.667 win%; .394 win off). Wisenhunt had 6 blowout losses to Bruce's 3. Wisenhunt was shutout twice; Bruce never got shutout. No evidence shows \"the numbers weren't there.\""],"PremiseEndPos":[66066],"ArgumentID":"00000008","Conclusion":"Bruce Arians is a bad offensive coordinator for the Pittsburgh Steelers.","PremiseStance":["Con"]}}]}