{"MetaData":{"Context":"URL: http://www.debate.org/debates/rainbows-dont-exist-to-a-person-born-blind/7/\nCrawl date: 2016/09/29 02:57:20\nOnline Debate: rainbows dont exist to a person born blind | Debate.org\nNumber of arguments: 6\n\n\nEvidence Pro: a blind man once found the gold at the end of a rainbow, and yet he never lived to tell about it, because on his way home he was killed by a leprechaun, and only a single peace of gold was found on him.. guess leprechauns like gold\n\nEvidence Pro: well, rainbows might seam like neat stories to a blind man rainbows have no taste, what you on about :) so when is it true for a blind man to say, its true, there is a rainbow in the sky\n\nEvidence Pro: sight allows for revelations of pure light troll\n\nEvidence Con: The more likely scenario is that Santa killed the man, and framed the leprechauns for the man's death. Allowing him to enslave them and rebrand them as \"elves.\" This is nothing but a story to discriminate against leprechauns with no evidence to back it up. Granted, neither do I have evidence to back my claim up. But which seems truer? Leprechauns existing and killing people, or Santa enslaving the leprechauns to work in his factories as \"little helpers,\" (a derogatory term) as he swims in all their gold he was allowed to steal? Which might I add Santa uses to fund his devilish operations, which further pollutes and melts the North Pole? But I've digressed enough. So does a rainbow exist to a blind man? Of course. Because rainbows exist. We can see the rainbow and just because blind folks can't see them does not make them suddenly non-existent. For we all exist on the same planet, in the same physical world. Plus, they can still taste the rainbow.\n\nEvidence Con: Indeed, they are grand stories. But then again, isn't everything a neat story to a blind person? Aren't clouds, colors the sky and space all just stories to a blind man? You can taste and absorb the power of the rainbow via skittles. Even sour rainbows! Either way, they just taste alright. As for your question ... the only time it is \"accurate/true\" for a blind person to say there is a rainbow in the sky, is when there is a rainbow in the sky. If they say there is a rainbow in the sky, they risk being inaccurate/wrong. It simply depends if there is one or not where they stand at the time. Currently, only people who can see can tell them if there is truly a rainbow or not. But one day, it is said seeing eye dogs will be delivered by Santa to the blind, which will bark at rainbows so the blind may know whenever one is near.\n\nEvidence Con: No argument there. Except for the troll part. Troll?\n","DiscussionID":"00000059","Title":"rainbows dont exist to a person born blind","CrawlDate":"2016/09/29 02:57:20","URL":"http://www.debate.org/debates/rainbows-dont-exist-to-a-person-born-blind/7/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":170,"nextID":"00000002","PremiseStartPos":[222],"prevID":"00000000","Premise":["a blind man once found the gold at the end of a rainbow, and yet he never lived to tell about it, because on his way home he was killed by a leprechaun, and only a single peace of gold was found on him.. guess leprechauns like gold"],"PremiseEndPos":[454],"ArgumentID":"00000001","Conclusion":"rainbows dont exist to a person born blind","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":170,"nextID":"00000003","PremiseStartPos":[469],"prevID":"00000001","Premise":["well, rainbows might seam like neat stories to a blind man rainbows have no taste, what you on about :) so when is it true for a blind man to say, its true, there is a rainbow in the sky"],"PremiseEndPos":[656],"ArgumentID":"00000002","Conclusion":"rainbows dont exist to a person born blind","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":170,"nextID":"00000004","PremiseStartPos":[671],"prevID":"00000002","Premise":["sight allows for revelations of pure light troll"],"PremiseEndPos":[720],"ArgumentID":"00000003","Conclusion":"rainbows dont exist to a person born blind","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":170,"nextID":"00000005","PremiseStartPos":[735],"prevID":"00000003","Premise":["The more likely scenario is that Santa killed the man, and framed the leprechauns for the man's death. Allowing him to enslave them and rebrand them as \"elves.\" This is nothing but a story to discriminate against leprechauns with no evidence to back it up. Granted, neither do I have evidence to back my claim up. But which seems truer? Leprechauns existing and killing people, or Santa enslaving the leprechauns to work in his factories as \"little helpers,\" (a derogatory term) as he swims in all their gold he was allowed to steal? Which might I add Santa uses to fund his devilish operations, which further pollutes and melts the North Pole? But I've digressed enough. So does a rainbow exist to a blind man? Of course. Because rainbows exist. We can see the rainbow and just because blind folks can't see them does not make them suddenly non-existent. For we all exist on the same planet, in the same physical world. Plus, they can still taste the rainbow."],"PremiseEndPos":[1696],"ArgumentID":"00000004","Conclusion":"rainbows dont exist to a person born blind","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":170,"nextID":"00000006","PremiseStartPos":[1711],"prevID":"00000004","Premise":["Indeed, they are grand stories. But then again, isn't everything a neat story to a blind person? Aren't clouds, colors the sky and space all just stories to a blind man? You can taste and absorb the power of the rainbow via skittles. Even sour rainbows! Either way, they just taste alright. As for your question ... the only time it is \"accurate/true\" for a blind person to say there is a rainbow in the sky, is when there is a rainbow in the sky. If they say there is a rainbow in the sky, they risk being inaccurate/wrong. It simply depends if there is one or not where they stand at the time. Currently, only people who can see can tell them if there is truly a rainbow or not. But one day, it is said seeing eye dogs will be delivered by Santa to the blind, which will bark at rainbows so the blind may know whenever one is near."],"PremiseEndPos":[2545],"ArgumentID":"00000005","Conclusion":"rainbows dont exist to a person born blind","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":128,"ConclusionEndPos":170,"nextID":"00000000","PremiseStartPos":[2560],"prevID":"00000005","Premise":["No argument there. Except for the troll part. Troll?"],"PremiseEndPos":[2613],"ArgumentID":"00000006","Conclusion":"rainbows dont exist to a person born blind","PremiseStance":["Con"]}}]}