{"MetaData":{"Context":"URL: http://idebate.org/debatabase/debates/culture/house-believes-all-arts-should-be-released-creative-commons-licenses\nCrawl date: 2016/10/12 13:28:46\nTitle: This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses | idebate.org\nIntro: Greece’s economic woes have been at the forefront of the Eurozone debt crisis over the last few years. It has received bailout packages in the form of emergency low interest rate loans in excess of €200 billion and has written off a portion of the existing public debt. Greece’s public debt rose to dangerous highs of 165% of its GDP in 2010 and its Budget Deficit reached a record high of 16% in 2009. Putting these figures into context, the membership criteria for the Eurozone under the Maastricht Treaty dictates that governments must maintain a budget deficit below 3% and total debt must not exceed 60% of GDP. Although it is true that most other European nations do not conform to these criteria, Greece tops the charts comfortably in terms of debt % GDP and only Ireland has a larger budget deficit. ‘Today’s crisis in Greece is mainly the result of short-sighted policies from the part of 1980s PASOK [main leftist party] governments, in two important respects: (a) PASOK’s economic policies created  a deadly mix of a bloated and inefficient welfare state with stifling intervention and overregulation of the private sector. (b) The political legacy of PASOK was even more devastating in the long-term, since its political success transformed Greece’s conservative party (“New Democracy”) into a poor photocopy of PASOK. From 1981 to 2009 both parties mainly of offered welfare populism, cronyism, statism, nepotism, protectionism, and paternalism.’[1] Subsequently, the nation’s public sector grew and now employs one fifth of the total Greek workforce. Crucially, however, PASOK’s legacy was to create a welfare state riddled with inefficiencies and corruption causing it to leak from all directions. Tax evasion has been a huge problem in the country and is estimated to cost the Greek Government €20-30 billion (i.e. two thirds of the budget deficit) every year. [2] Indeed, the unreported (untaxed) proportion of the Greek economy is thought to amount 25% GDP [3]. What’s more, the gravity and unsustainability of Greece’s debt only became apparent in 2008-9 because the Greek Government employed Wall Street firms including Goldman Sachs to help them fudge the numbers and deceive lenders. [4] Two bailout packages later, and the Greek economy shows limited signs of recovery. The severe austerity measures enforced on the Greek Government by the “troika” constituting the International Monetary Fund (IMF), the European Central Bank (ECB) and the European Commission, have done little more than keep the country afloat and prevent it from defaulting (although the budget deficit has dropped to below 10%)[5]. The austerity measures have largely have largely taken the form of drastic increases in income tax, corporate tax and VAT and reduction of the minimum wage (in an attempt to make the private sector more competitive). Thus far, the results have been hard felt: Greece is in its fourth consecutive year of recession and the economy is shrinking at an unparalleled rate (7% so far in 2012). Unemployment in Greece is second highest in Europe (after Spain), at over 20%, while youth unemployment is at 36%. [6] The theory behind harsh austerity measures is that short term pain will eventually lead to a more efficient and competitive economy and, hopefully, a budget surplus that would start eroding at the total debt. Such targets certainly seem unattainable for Greece in the near future. The Greek coalition Government headed by Antonis Samaras unilaterally seeks to remain in the Eurozone, but has been trying to persuade the ECB, IMF and European Commission to reduce the severity of the austerity measures, primarily by demanding more time with which to implement the measures. Such demands have so far been outright rejected. An alternative to austerity measures that many call for, could be for Greece to undergo an orderly default and leave the Eurozone. Such a scheme would most likely be undertaken overnight so as to lessen the impact of speculation about a possible default.  Although it is true that a Greek Government default does not necessarily lead to them exiting the Eurozone, most believe it would follow, and for the purposes of this debate it will be assumed that that would be the case. Exiting the Eurozone would mean Greece would have to adopt a national currency – in most likelihood their pre-Euro Drachma. ‘Briefly put: the return to the drachma should be sudden, accompanied by a short bank holiday and immediate imposition of capital controls’ [7] to prevent mass outflow of capital from the country. It would also most likely be accompanied by an ECB and European Commission backed bailout package to support the Greek banking system. [8] [1]  Hatzis, Aristides: “Greece as a Precautionary Tale of the Welfare State” in After the Welfare State edited by Tom G. Palmer, Atlas Economic Research Foundation, Washington, DC, 2012 http://users.uoa.gr/~ahatzis/Hatzis_2012_09.pdf [2] ibid [3] ibid [4] ibid [5] BBC Eurozone Crisis Statistics (5/9/2012) http://www.bbc.co.uk/news/business-13366011 [6] ibid [7] Lapavitsas, Costas: “Eurozone crisis: what if … Greece leaves the single currency” 14 May 2012, The Guardian, http://www.guardian.co.uk/world/2012/may/14/greece-euro-single-currency-expert-view. [8] Ruparel, Raoul and Persson, Mats: “Better off Out? The short-term options for Greece inside and outside of the euro”, June 2012, Open Europe, 2012 http://www.openeurope.org.uk/Content/Documents/Pdfs/Greece_better_off_out.pdf\nNumber of arguments: 8\n\n\nClaim For: Intellectual property is a legal fiction created for convenience in some instances, but copyright should cease to be protected under this doctrine\n\nEvidence Pro: An individual’s idea only truly belongs solely to them so long as it rests in their mind alone. When they disseminate their ideas to the world they put them in the public domain, and should become the purview of everyone to use. Artists and creators more generally, should not expect some sort of ownership to inhere in an idea they happen to have, since no such ownership right exists in reality.[1] No one can own an idea. Thus recognizing something like a property right over intangible assets is contrary to reason, since doing so gives monopoly power to individuals who may not make efficient or equitable use of their inventions or products. Physical property is a tangible asset, and thus can be protected by tangible safeguards. Ideas do not share the same order of protection even now because they exist in a different order to physical reality. However, some intellectual property is useful in encouraging investment and invention, allowing people to engage their profit motives to the betterment of society as a whole. To an extent one can also sympathize with the notion that creators deserve to accrue some additional profit for the labour of the creative process, but this can be catered for through Creative Commons non-commercial licenses which reserve commercial rights.[2] These protections should not extend to non-commercial use of the various forms of arts. This is because art is a social good of a unique order, with its purpose not purely functional, but creative. It only has value in being experienced, and thus releasing these works through creative commons licenses allows the process of artistic experience and sharing proceeds unhindered by outmoded notions of copyright. The right to reap some financial gain still remains for the artists, as their rights still hold over all commercial use of their work. This seems like a fair compromise of the artist’s right to profit from their work and society right to experience and grow from those works. [1] Fitzgerald, Brian and Anne Fitzgerald. Intellectual Property: In Principle. Melbourne: Lawbook Company. 2004. [2] Walsh, K., “Commercial Rights Reserved proposal outcome: no change”, Creative Commons, 14 February 2013, http://creativecommons.org/weblog/entry/36725  \n\nEvidence Con: Although ideas are not tangible intellectual property generally, and copyright in particular, is far from a fiction. Rather it is a realization of the hard work and demiurgic force that sparks the generation and fulfilment of artistic endeavour. The property right assigned over these things to their creators is a very real one that recognizes their fundamental right over these works as owners, and the right to profit from them. The artist must have the right to prevent even non-commercial use of the idea if it is to maintain its value and so retain for the creator the ability to commercialise it. These protections are critical to the moral understanding of all property and must be rigorously protected, not eroded for the benefit of some nebulous notion of social good.\n\n\nClaim For: The default of total copyright is harmful to the spreading of information and experience\n\nEvidence Pro: Current copyright law assigns too many rights, automatically, to the creator. Law gives the generator of a work full copyright protection that is extremely restrictive of that works reuse, except when strictly agreed in contracts and agreements. Making Creative Commons licenses the standard for publicly-funded works generates a powerful normalizing force toward a general alteration of people’s defaults on what copyright and creator protections should actually be like. The creative commons guarantees attribution to the creator and they retain the power to set up other for-profit deals with distributors.[1] At base the default setting of somehow having absolute control means creators of work often do not even consider the reuse by others in the commons. The result is creation and then stagnation, as others do not expend the time and energy to seek special permissions from the creator. Mandating that art in all its forms be released under a creative commons licensing scheme means greater access to more works, for the enrichment of all. This is particular true in the case of “orphan works”, works of unknown ownership. Fears over copyright infringement has led these works, which by some estimates account for 40% of all books, have led to huge amounts of knowledge and creative output languishing beyond anyone’s reach. A mix of confusion over copyright ownership and unwillingness of owners to release their works, often because it would not be commercially viable to do so, means that only 2% of all works currently protected by copyright are commercially available.[2] Releasing these works under creative commons licenses will spawn a deluge of enriching knowledge and creative output spilling onto the market of ideas. It would mark a critical advancement in the democratization and globalization of knowledge akin to the invention of the printing press. [1] Creative Commons. “About the Licenses”. 2010. http://creativecommons.org/licenses/ [2] Keegan, V. “Shorter Copyright Would Free Creativity”. The Guardian. 7 October 2009. http://www.guardian.co.uk/technology/2009/oct/07/shorter-copyright-term  \n\nEvidence Con: There are many ways to correct for the dearth of some works on the market such as orphan works. By simplifying copyright law, reducing lengths of copyright and more robust searches for legal provenance can all help correct for the shortfalls without eroding an important part of law and material rights. Or indeed the law might be revised simply to free works that have unclear ownership from copyright by default. Creators should retain, no matter how annoying it may be to would-be enjoyers of their work, control over their artistic output. Artists’ creations are fundamentally their own, not the property of the state or society.\n\n\nClaim For: The creative commons is a more effective means for artists to build and expand their reach and markets than traditional copyright licensing arrangements\n\nEvidence Pro: The nature of the internet and mass media on the 21st century is such that many artists can benefit from the freedom and flexibility that creative commons licenses furnish to them. Wider use by other artists and laymen alike helps artistic works “go viral” and to gain major impact that allow the artist to generate a name for his or herself and to attain the levels of earnings conventional copyrights are meant to help artists generate but that ultimately hamstring them. A major example of this is the band Nine Inch Nails, which opted in 2008 to begin releasing its albums through the creative commons.[1] Creative commons licenses are so remarkable because they can be deployed by artists to expand their markets, and to profit even more from their greater recognition. After all, the artists still retain control of the commercial uses of their work and are guaranteed under creative commons licensing regulations to be credited by users of their content.[2] Giving undue artistic and distribution control to the artists through constricting and outmoded copyright may mean less significant reach and impact of the work. The state should thus facilitate the sharing by mandating the distribution of art of all kinds under creative commons licenses. [1] Anderson, N., “Free Nine Inch Nails albums top 2008 Amazon MP3 sales charts”, arstechnica, 7 January 2009, http://arstechnica.com/business/2009/01/free-nine-inch-nails-albums-top-2008-amazon-mp3-sales-charts/ [2] Creative Commons. “About the Licenses”. 2010. http://creativecommons.org/licenses/  \n\nEvidence Con: Choosing to release one’s work into the viral market may be a shrewd business and artistic move, or it might not. All of this depends on the individual artist and the individual work. Nine Inch Nails both has the money that they can afford to take the risk and the name recognition that means they can be sure some fans will purchase the music, this is not the case with most artists. Thus the decision can really only be made effectively and fairly by the artists themselves. Trying to usurp that choice through a state mandate only serves to undermine the artist’s creative vision of how he or she wishes to portray and distribute their work to the world. \n\n\nClaim For: The costs of monitoring copyright by states, artists, and lawyers far outweigh the benefits, and is often simply ineffective\n\nEvidence Pro: The state incurs huge costs in monitoring for copyright infringement, in arresting suspected perpetrators, in imprisonment of those found guilty, even though in reality nothing was stolen but an idea that, once released to it, belonged to the public domain more or less.[1] Furthermore, the deterrent effect to copyright piracy generated by all the efforts of the state and firms has proven generally minimal. In fact, the level of internet piracy of books, music, and films has increased dramatically year on year for several years, increasing by 30% in 2011 alone.[2] This is because in many cases copyright laws are next to unenforceable, as the music and movie industries have learned to their annoyance in recent years, for example ninety percent of DVDs sold in China are bootlegs while even western consumers are increasingly bypassing copyright by using peer to peer networks.[3] Only a tiny fraction of perpetrators are ever caught, and though they are often punished severely in an attempt to deter future crime, it has done little to stop their incidence. Copyright, in many cases, does not work in practice plain and simple. Releasing works under a creative commons licensing scheme does a great deal to cope with these pressures. In the first instance it is a less draconian regime, so individuals are more willing to buy into it as a legitimate claim by artists rather than an onerous stranglehold on work. This increases compliance with the relaxed law. Secondly, the compliance means that artists are given the vocal crediting under the license rules that gives them more public exposure than clandestine copying could not. Ultimately this adaptation of current copyright law would benefit the artist and the consumer mutually. [1] World Intellectual Property Organization. “Emerging Issues in Intellectual Property”. 2011 http://www.wipo.int/about-ip/en/studies/ [2] Hartopo, A. “The Past, Present and Future of Internet Piracy”. Jakarta Globe. 26 July 2011. http://www.thejakartaglobe.com/bytethis/the-past-present-and-future-of-internet-piracy/455291 [3] Quirk, M., “The Movie Pirates”, The Atlantic, 19 November 2009, http://www.theatlantic.com/magazine/archive/2007/06/the-movie-pirates/305886/  \n\nEvidence Con: It may be costly and sometimes ineffective to police copyright, but that does not make them any less of a right worth protecting. If artists or firms feel that they might benefit from fighting infringers of their rights, they should have the right to do so, not simply be expected to roll over and give in to the pirates and law breakers. The state likewise, has an obligation to protect the rights, physical and intangible, of its citizens and cannot give up on them simply because they prove difficult and costly to enforce. Furthermore, the ensuring health of the economy is a primary duty of the state and this means aiding its domestic businesses and one of the ways it does that is by acting to enforce copyright both internally and if possible externally.\n\n\nClaim Against: Artists have a fundamental property right over their creative output\n\nEvidence Pro: Whatever the end product, be it music, film, sculpture, or painting, artistic works are the creations of individuals and a property right inheres within them belonging to their creators. An idea is just an idea so long as it remains locked in someone’s mind or is left as an unfinished sketch, etc. But when the art is allowed to bloom in full, it is due to the artist and the artist only. The obsession, the time, the raw talent needed to truly create art is an incredible business, requiring huge investment in energy, time, and effort. It is a matter of the most basic, and one would have hoped self-evident, principle that the person who sacrificed so much to bring forth a piece of art should retain all the rights to it and in particular have the right to profit from it.[1] To argue otherwise would be to condone outright theft. The ethereal work of the artist is every bit as real as the hard work of a machine. Mandating that all forms of art be released under a creative commons license is an absolute slap in the face to artists and to the artistic endeavour as a whole. It implies that somehow the work is not entirely the artist’s own, that because it is art it is somehow so different as to be worthy of being shunted into the public sphere without the real consent of the artist. This is a gross robbing of the artist’s right over his or her own work. If property rights are to have any meaning, they must have a universal protection. This policy represents a fundamental erosion of the right to property, and attacks one sector of productive life that is essential for the giving of colour to the human experience. This policy serves only to devalue that contribution. [1] Greenberg, M. “Reason or Madness: A Defense of Copyright’s Growing Pains”. John Marshall Review of Intellectual Property Law. 2007. http://www.jmripl.com/Publications/Vol7/Issue1/Greenberg.pdf  \n\nEvidence Con: People deserve recompense for their work, but the stifling force of current copyright prevents the proper sharing and expansion of the artistic canon, to the intellectual and spiritual impoverishment of all. Creative commons licenses strike an important balance, by leaving artists with the power over commercial uses of their work, including selling it themselves, while permitting it to permeate the public sphere through non-commercial channels. This is the best way to weigh these competing needs in a complex society. It is not preventing the creator from profiting from his work. It is not a total abrogation of people’s rights, but a giving over of some rights for the benefit of all.\n\n\nClaim Against: Artists should retain the right to control their work’s interaction with the public space even if their work is publicly funded\n\nEvidence Pro: Art is the expression of its creator’s sense of understanding of the world, and thus that expression will always have special meaning to him or her that no amount of reinterpretation or external appreciation can override. How a work is used once released into the public sphere, whether expanded, revised, responded to, or simply shown without their direct consent, thus remains an active issue for the artist, because those alternative experiences are all using a piece of the artist in its efforts. Artists deserve to have that piece of them treated in a way they see as reasonable. It is a simple matter of justice that artists be permitted to maintain the level of control they desire, and it is a justice that is best furnished through the conventional copyright mechanism that provides for the maximum protection of works for their creators, and allows them to contract away uses and rights to those works on their own terms. Many artists care about their legacies and the future of their artistic works, and should thus have this protection furnished by the state through the protection of copyright, not cast aside by the unwashed users of the creative commons. Samuel Beckett is a great example of this need. Beckett had exacting standards about the fashion in which in his plays could be performed.[1] For him the meaning of the art demanded an appreciation for the strict performance without the adulteration of reinterpretation. He would lack that power under this policy, meaning either the world would have been impoverished for want of his plays, or he would have been impoverished for want of his rights to his work. These rights are best balanced through the aegis of copyright as it is, not under the free-for-all of the creative commons license. [1] Catron, L. “Copyright Laws for Theatre People”. 2003. http://lecatr.people.wm.edu/copy.htm  \n\nEvidence Con: Upon entering the public arena works of art take on characters of their own, often far different than their original creators did, or could have, imagined. The art is consumed, absorbed, and reimagined and takes on its own identity that the artist cannot claim full ownership over. It is important that art as a whole be able to thrive in society, but this is only possible when artists are able to make use of, and actively reinterpret and utilize existing works. That art does, due to its origination belong more to the people, who should have access, even if the artist, like Beckett has bizarrely rigorous feelings about the work.\n\n\nClaim Against: The lack of control over, and profit from, art will serve as a serious disincentive to artistic output\n\nEvidence Pro: Profit is as much a factor in artists’ decision to produce work, if not more so, than the primordial urge to create. Without the guarantee of ownership over one’s artistic work, the incentive to invest in its creation is certainly diminished. Within a strong copyright system, individuals feel free to invest time in their pursuits because they have full knowledge that the final product of their labours will be theirs to enjoy.[1] Without copyright protections the marginal cases, like people afraid to put time into actually building an installation art piece rather than doing more hours at their job, will not opt to create. If their work were to immediately leave their control, they would most certainly be less inclined to do so. Furthermore, the inability of others to simply duplicate existing works as their own means they too will be galvanized to break ground on new ideas, rather than simply re-tread over current ideas and to adapt existing works to markets. Art thrives by being new and original. Copyright protections shield against artistic laziness and drive the creative urges of the artistically inclined to ever more interesting fields. [1] Greenberg, M. “Reason or Madness: A Defense of Copyright’s Growing Pains”. John Marshall Review of Intellectual Property Law. 2007. http://www.jmripl.com/Publications/Vol7/Issue1/Greenberg.pdf  \n\nEvidence Con: Few artists ever see much profit from their work anyway, many choosing the life of bohemian squalor in order to keep producing art rather than taking up more profitable pursuits. Vincent van Gogh sold almost nothing, but his drive to create never abated. No doubt the true artists will continue to feel the urge to create under this policy, and the loss of a few marginal cases must be weighed against the massive losses to art in general, such as the huge curtailment of exploration of and response to existing works, which are often artistically meritorious in their own right, and also the rendering unavailable of much of the artistic output of the world. \n\n\nClaim Against: Artists often rely on copyright protection to financially support themselves and their families\n\nEvidence Pro: Artists as they are often not paid for anything else may rely on their creative output to support themselves. This is certainly no crime, and existing copyright laws recognize this fact. Artists often rely wholly on their ability to sell and profit from their work. This policy serves to drain them of that potential revenue, as their work is shunted into creative commons, and available to all. Artists often also have families to support, and putting the added financial burden on them of stripping them of their copyright only serves to further those problems as they exist. A robust system of copyright is a much better protection to struggling and successful artists alike who like all talented individuals seek to assuage their material wants. Artists cannot live on appreciation alone. With much less secure copyright many would have to find other work. \n\nEvidence Con: Artists rarely make all that much money in the first place, and a great many only work as an artist part time. More importantly, they can still profit from their art, since they retain exclusive commercial rights to their work. Oftentimes they will actually benefit from operation under a creative commons license because it provides wider dispersal of their work, which builds a broader name and market for their work.\n","DiscussionID":"00000103","Title":"all literature, art, photography, film and music should be released under Creative Commons licenses","CrawlDate":"2016/10/12 13:28:46","URL":"http://idebate.org/debatabase/debates/culture/house-believes-all-arts-should-be-released-creative-commons-licenses"},"ArgumentList":[{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":283,"nextID":"00000002","PremiseStartPos":[25028],"prevID":"00000000","Premise":["Artists often rely on copyright protection to financially support themselves and their families"],"PremiseEndPos":[25125],"ArgumentID":"00000001","Conclusion":"This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":283,"nextID":"00000003","PremiseStartPos":[22859],"prevID":"00000001","Premise":["The lack of control over, and profit from, art will serve as a serious disincentive to artistic output"],"PremiseEndPos":[22963],"ArgumentID":"00000002","Conclusion":"This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":283,"nextID":"00000004","PremiseStartPos":[20187],"prevID":"00000002","Premise":["Artists should retain the right to control their work’s interaction with the public space even if their work is publicly funded"],"PremiseEndPos":[20316],"ArgumentID":"00000003","Conclusion":"This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":283,"nextID":"00000005","PremiseStartPos":[17495],"prevID":"00000003","Premise":["Artists have a fundamental property right over their creative output"],"PremiseEndPos":[17565],"ArgumentID":"00000004","Conclusion":"This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":283,"nextID":"00000006","PremiseStartPos":[14342],"prevID":"00000004","Premise":["The costs of monitoring copyright by states, artists, and lawyers far outweigh the benefits, and is often simply ineffective"],"PremiseEndPos":[14468],"ArgumentID":"00000005","Conclusion":"This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":283,"nextID":"00000007","PremiseStartPos":[11930],"prevID":"00000005","Premise":["The creative commons is a more effective means for artists to build and expand their reach and markets than traditional copyright licensing arrangements"],"PremiseEndPos":[12084],"ArgumentID":"00000006","Conclusion":"This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":283,"nextID":"00000008","PremiseStartPos":[9041],"prevID":"00000006","Premise":["The default of total copyright is harmful to the spreading of information and experience"],"PremiseEndPos":[9131],"ArgumentID":"00000007","Conclusion":"This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":158,"ConclusionEndPos":283,"nextID":"00000009","PremiseStartPos":[5823],"prevID":"00000007","Premise":["Intellectual property is a legal fiction created for convenience in some instances, but copyright should cease to be protected under this doctrine"],"PremiseEndPos":[5971],"ArgumentID":"00000008","Conclusion":"This House believes that all literature, art, photography, film and music should be released under Creative Commons licenses","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":5823,"ConclusionEndPos":5971,"nextID":"00000010","PremiseStartPos":[8249],"prevID":"00000008","Premise":["Although ideas are not tangible intellectual property generally, and copyright in particular, is far from a fiction. Rather it is a realization of the hard work and demiurgic force that sparks the generation and fulfilment of artistic endeavour. The property right assigned over these things to their creators is a very real one that recognizes their fundamental right over these works as owners, and the right to profit from them. The artist must have the right to prevent even non-commercial use of the idea if it is to maintain its value and so retain for the creator the ability to commercialise it. These protections are critical to the moral understanding of all property and must be rigorously protected, not eroded for the benefit of some nebulous notion of social good."],"PremiseEndPos":[9028],"ArgumentID":"00000009","Conclusion":"Intellectual property is a legal fiction created for convenience in some instances, but copyright should cease to be protected under this doctrine","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":5823,"ConclusionEndPos":5971,"nextID":"00000011","PremiseStartPos":[5985],"prevID":"00000009","Premise":["An individual’s idea only truly belongs solely to them so long as it rests in their mind alone. When they disseminate their ideas to the world they put them in the public domain, and should become the purview of everyone to use. Artists and creators more generally, should not expect some sort of ownership to inhere in an idea they happen to have, since no such ownership right exists in reality.[1] No one can own an idea. Thus recognizing something like a property right over intangible assets is contrary to reason, since doing so gives monopoly power to individuals who may not make efficient or equitable use of their inventions or products. Physical property is a tangible asset, and thus can be protected by tangible safeguards. Ideas do not share the same order of protection even now because they exist in a different order to physical reality. However, some intellectual property is useful in encouraging investment and invention, allowing people to engage their profit motives to the betterment of society as a whole. To an extent one can also sympathize with the notion that creators deserve to accrue some additional profit for the labour of the creative process, but this can be catered for through Creative Commons non-commercial licenses which reserve commercial rights.[2] These protections should not extend to non-commercial use of the various forms of arts. This is because art is a social good of a unique order, with its purpose not purely functional, but creative. It only has value in being experienced, and thus releasing these works through creative commons licenses allows the process of artistic experience and sharing proceeds unhindered by outmoded notions of copyright. The right to reap some financial gain still remains for the artists, as their rights still hold over all commercial use of their work. This seems like a fair compromise of the artist’s right to profit from their work and society right to experience and grow from those works. [1] Fitzgerald, Brian and Anne Fitzgerald. Intellectual Property: In Principle. Melbourne: Lawbook Company. 2004. [2] Walsh, K., “Commercial Rights Reserved proposal outcome: no change”, Creative Commons, 14 February 2013, http://creativecommons.org/weblog/entry/36725  "],"PremiseEndPos":[8234],"ArgumentID":"00000010","Conclusion":"Intellectual property is a legal fiction created for convenience in some instances, but copyright should cease to be protected under this doctrine","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":9041,"ConclusionEndPos":9131,"nextID":"00000012","PremiseStartPos":[11283],"prevID":"00000010","Premise":["There are many ways to correct for the dearth of some works on the market such as orphan works. By simplifying copyright law, reducing lengths of copyright and more robust searches for legal provenance can all help correct for the shortfalls without eroding an important part of law and material rights. Or indeed the law might be revised simply to free works that have unclear ownership from copyright by default. Creators should retain, no matter how annoying it may be to would-be enjoyers of their work, control over their artistic output. Artists’ creations are fundamentally their own, not the property of the state or society."],"PremiseEndPos":[11917],"ArgumentID":"00000011","Conclusion":"The default of total copyright is harmful to the spreading of information and experience","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":9041,"ConclusionEndPos":9131,"nextID":"00000013","PremiseStartPos":[9145],"prevID":"00000011","Premise":["Current copyright law assigns too many rights, automatically, to the creator. Law gives the generator of a work full copyright protection that is extremely restrictive of that works reuse, except when strictly agreed in contracts and agreements. Making Creative Commons licenses the standard for publicly-funded works generates a powerful normalizing force toward a general alteration of people’s defaults on what copyright and creator protections should actually be like. The creative commons guarantees attribution to the creator and they retain the power to set up other for-profit deals with distributors.[1] At base the default setting of somehow having absolute control means creators of work often do not even consider the reuse by others in the commons. The result is creation and then stagnation, as others do not expend the time and energy to seek special permissions from the creator. Mandating that art in all its forms be released under a creative commons licensing scheme means greater access to more works, for the enrichment of all. This is particular true in the case of “orphan works”, works of unknown ownership. Fears over copyright infringement has led these works, which by some estimates account for 40% of all books, have led to huge amounts of knowledge and creative output languishing beyond anyone’s reach. A mix of confusion over copyright ownership and unwillingness of owners to release their works, often because it would not be commercially viable to do so, means that only 2% of all works currently protected by copyright are commercially available.[2] Releasing these works under creative commons licenses will spawn a deluge of enriching knowledge and creative output spilling onto the market of ideas. It would mark a critical advancement in the democratization and globalization of knowledge akin to the invention of the printing press. [1] Creative Commons. “About the Licenses”. 2010. http://creativecommons.org/licenses/ [2] Keegan, V. “Shorter Copyright Would Free Creativity”. The Guardian. 7 October 2009. http://www.guardian.co.uk/technology/2009/oct/07/shorter-copyright-term  "],"PremiseEndPos":[11268],"ArgumentID":"00000012","Conclusion":"The default of total copyright is harmful to the spreading of information and experience","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":11930,"ConclusionEndPos":12084,"nextID":"00000014","PremiseStartPos":[13670],"prevID":"00000012","Premise":["Choosing to release one’s work into the viral market may be a shrewd business and artistic move, or it might not. All of this depends on the individual artist and the individual work. Nine Inch Nails both has the money that they can afford to take the risk and the name recognition that means they can be sure some fans will purchase the music, this is not the case with most artists. Thus the decision can really only be made effectively and fairly by the artists themselves. Trying to usurp that choice through a state mandate only serves to undermine the artist’s creative vision of how he or she wishes to portray and distribute their work to the world. "],"PremiseEndPos":[14329],"ArgumentID":"00000013","Conclusion":"The creative commons is a more effective means for artists to build and expand their reach and markets than traditional copyright licensing arrangements","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":11930,"ConclusionEndPos":12084,"nextID":"00000015","PremiseStartPos":[12098],"prevID":"00000013","Premise":["The nature of the internet and mass media on the 21st century is such that many artists can benefit from the freedom and flexibility that creative commons licenses furnish to them. Wider use by other artists and laymen alike helps artistic works “go viral” and to gain major impact that allow the artist to generate a name for his or herself and to attain the levels of earnings conventional copyrights are meant to help artists generate but that ultimately hamstring them. A major example of this is the band Nine Inch Nails, which opted in 2008 to begin releasing its albums through the creative commons.[1] Creative commons licenses are so remarkable because they can be deployed by artists to expand their markets, and to profit even more from their greater recognition. After all, the artists still retain control of the commercial uses of their work and are guaranteed under creative commons licensing regulations to be credited by users of their content.[2] Giving undue artistic and distribution control to the artists through constricting and outmoded copyright may mean less significant reach and impact of the work. The state should thus facilitate the sharing by mandating the distribution of art of all kinds under creative commons licenses. [1] Anderson, N., “Free Nine Inch Nails albums top 2008 Amazon MP3 sales charts”, arstechnica, 7 January 2009, http://arstechnica.com/business/2009/01/free-nine-inch-nails-albums-top-2008-amazon-mp3-sales-charts/ [2] Creative Commons. “About the Licenses”. 2010. http://creativecommons.org/licenses/  "],"PremiseEndPos":[13655],"ArgumentID":"00000014","Conclusion":"The creative commons is a more effective means for artists to build and expand their reach and markets than traditional copyright licensing arrangements","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":14342,"ConclusionEndPos":14468,"nextID":"00000016","PremiseStartPos":[16715],"prevID":"00000014","Premise":["It may be costly and sometimes ineffective to police copyright, but that does not make them any less of a right worth protecting. If artists or firms feel that they might benefit from fighting infringers of their rights, they should have the right to do so, not simply be expected to roll over and give in to the pirates and law breakers. The state likewise, has an obligation to protect the rights, physical and intangible, of its citizens and cannot give up on them simply because they prove difficult and costly to enforce. Furthermore, the ensuring health of the economy is a primary duty of the state and this means aiding its domestic businesses and one of the ways it does that is by acting to enforce copyright both internally and if possible externally."],"PremiseEndPos":[17478],"ArgumentID":"00000015","Conclusion":"The costs of monitoring copyright by states, artists, and lawyers far outweigh the benefits, and is often simply ineffective","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":14342,"ConclusionEndPos":14468,"nextID":"00000017","PremiseStartPos":[14482],"prevID":"00000015","Premise":["The state incurs huge costs in monitoring for copyright infringement, in arresting suspected perpetrators, in imprisonment of those found guilty, even though in reality nothing was stolen but an idea that, once released to it, belonged to the public domain more or less.[1] Furthermore, the deterrent effect to copyright piracy generated by all the efforts of the state and firms has proven generally minimal. In fact, the level of internet piracy of books, music, and films has increased dramatically year on year for several years, increasing by 30% in 2011 alone.[2] This is because in many cases copyright laws are next to unenforceable, as the music and movie industries have learned to their annoyance in recent years, for example ninety percent of DVDs sold in China are bootlegs while even western consumers are increasingly bypassing copyright by using peer to peer networks.[3] Only a tiny fraction of perpetrators are ever caught, and though they are often punished severely in an attempt to deter future crime, it has done little to stop their incidence. Copyright, in many cases, does not work in practice plain and simple. Releasing works under a creative commons licensing scheme does a great deal to cope with these pressures. In the first instance it is a less draconian regime, so individuals are more willing to buy into it as a legitimate claim by artists rather than an onerous stranglehold on work. This increases compliance with the relaxed law. Secondly, the compliance means that artists are given the vocal crediting under the license rules that gives them more public exposure than clandestine copying could not. Ultimately this adaptation of current copyright law would benefit the artist and the consumer mutually. [1] World Intellectual Property Organization. “Emerging Issues in Intellectual Property”. 2011 http://www.wipo.int/about-ip/en/studies/ [2] Hartopo, A. “The Past, Present and Future of Internet Piracy”. Jakarta Globe. 26 July 2011. http://www.thejakartaglobe.com/bytethis/the-past-present-and-future-of-internet-piracy/455291 [3] Quirk, M., “The Movie Pirates”, The Atlantic, 19 November 2009, http://www.theatlantic.com/magazine/archive/2007/06/the-movie-pirates/305886/  "],"PremiseEndPos":[16700],"ArgumentID":"00000016","Conclusion":"The costs of monitoring copyright by states, artists, and lawyers far outweigh the benefits, and is often simply ineffective","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":17495,"ConclusionEndPos":17565,"nextID":"00000018","PremiseStartPos":[19478],"prevID":"00000016","Premise":["People deserve recompense for their work, but the stifling force of current copyright prevents the proper sharing and expansion of the artistic canon, to the intellectual and spiritual impoverishment of all. Creative commons licenses strike an important balance, by leaving artists with the power over commercial uses of their work, including selling it themselves, while permitting it to permeate the public sphere through non-commercial channels. This is the best way to weigh these competing needs in a complex society. It is not preventing the creator from profiting from his work. It is not a total abrogation of people’s rights, but a giving over of some rights for the benefit of all."],"PremiseEndPos":[20170],"ArgumentID":"00000017","Conclusion":"Artists have a fundamental property right over their creative output","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":17495,"ConclusionEndPos":17565,"nextID":"00000019","PremiseStartPos":[17579],"prevID":"00000017","Premise":["Whatever the end product, be it music, film, sculpture, or painting, artistic works are the creations of individuals and a property right inheres within them belonging to their creators. An idea is just an idea so long as it remains locked in someone’s mind or is left as an unfinished sketch, etc. But when the art is allowed to bloom in full, it is due to the artist and the artist only. The obsession, the time, the raw talent needed to truly create art is an incredible business, requiring huge investment in energy, time, and effort. It is a matter of the most basic, and one would have hoped self-evident, principle that the person who sacrificed so much to bring forth a piece of art should retain all the rights to it and in particular have the right to profit from it.[1] To argue otherwise would be to condone outright theft. The ethereal work of the artist is every bit as real as the hard work of a machine. Mandating that all forms of art be released under a creative commons license is an absolute slap in the face to artists and to the artistic endeavour as a whole. It implies that somehow the work is not entirely the artist’s own, that because it is art it is somehow so different as to be worthy of being shunted into the public sphere without the real consent of the artist. This is a gross robbing of the artist’s right over his or her own work. If property rights are to have any meaning, they must have a universal protection. This policy represents a fundamental erosion of the right to property, and attacks one sector of productive life that is essential for the giving of colour to the human experience. This policy serves only to devalue that contribution. [1] Greenberg, M. “Reason or Madness: A Defense of Copyright’s Growing Pains”. John Marshall Review of Intellectual Property Law. 2007. http://www.jmripl.com/Publications/Vol7/Issue1/Greenberg.pdf  "],"PremiseEndPos":[19463],"ArgumentID":"00000018","Conclusion":"Artists have a fundamental property right over their creative output","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":20187,"ConclusionEndPos":20316,"nextID":"00000020","PremiseStartPos":[22207],"prevID":"00000018","Premise":["Upon entering the public arena works of art take on characters of their own, often far different than their original creators did, or could have, imagined. The art is consumed, absorbed, and reimagined and takes on its own identity that the artist cannot claim full ownership over. It is important that art as a whole be able to thrive in society, but this is only possible when artists are able to make use of, and actively reinterpret and utilize existing works. That art does, due to its origination belong more to the people, who should have access, even if the artist, like Beckett has bizarrely rigorous feelings about the work."],"PremiseEndPos":[22842],"ArgumentID":"00000019","Conclusion":"Artists should retain the right to control their work’s interaction with the public space even if their work is publicly funded","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":20187,"ConclusionEndPos":20316,"nextID":"00000021","PremiseStartPos":[20330],"prevID":"00000019","Premise":["Art is the expression of its creator’s sense of understanding of the world, and thus that expression will always have special meaning to him or her that no amount of reinterpretation or external appreciation can override. How a work is used once released into the public sphere, whether expanded, revised, responded to, or simply shown without their direct consent, thus remains an active issue for the artist, because those alternative experiences are all using a piece of the artist in its efforts. Artists deserve to have that piece of them treated in a way they see as reasonable. It is a simple matter of justice that artists be permitted to maintain the level of control they desire, and it is a justice that is best furnished through the conventional copyright mechanism that provides for the maximum protection of works for their creators, and allows them to contract away uses and rights to those works on their own terms. Many artists care about their legacies and the future of their artistic works, and should thus have this protection furnished by the state through the protection of copyright, not cast aside by the unwashed users of the creative commons. Samuel Beckett is a great example of this need. Beckett had exacting standards about the fashion in which in his plays could be performed.[1] For him the meaning of the art demanded an appreciation for the strict performance without the adulteration of reinterpretation. He would lack that power under this policy, meaning either the world would have been impoverished for want of his plays, or he would have been impoverished for want of his rights to his work. These rights are best balanced through the aegis of copyright as it is, not under the free-for-all of the creative commons license. [1] Catron, L. “Copyright Laws for Theatre People”. 2003. http://lecatr.people.wm.edu/copy.htm  "],"PremiseEndPos":[22192],"ArgumentID":"00000020","Conclusion":"Artists should retain the right to control their work’s interaction with the public space even if their work is publicly funded","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":22859,"ConclusionEndPos":22963,"nextID":"00000022","PremiseStartPos":[24350],"prevID":"00000020","Premise":["Few artists ever see much profit from their work anyway, many choosing the life of bohemian squalor in order to keep producing art rather than taking up more profitable pursuits. Vincent van Gogh sold almost nothing, but his drive to create never abated. No doubt the true artists will continue to feel the urge to create under this policy, and the loss of a few marginal cases must be weighed against the massive losses to art in general, such as the huge curtailment of exploration of and response to existing works, which are often artistically meritorious in their own right, and also the rendering unavailable of much of the artistic output of the world. "],"PremiseEndPos":[25011],"ArgumentID":"00000021","Conclusion":"The lack of control over, and profit from, art will serve as a serious disincentive to artistic output","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":22859,"ConclusionEndPos":22963,"nextID":"00000023","PremiseStartPos":[22977],"prevID":"00000021","Premise":["Profit is as much a factor in artists’ decision to produce work, if not more so, than the primordial urge to create. Without the guarantee of ownership over one’s artistic work, the incentive to invest in its creation is certainly diminished. Within a strong copyright system, individuals feel free to invest time in their pursuits because they have full knowledge that the final product of their labours will be theirs to enjoy.[1] Without copyright protections the marginal cases, like people afraid to put time into actually building an installation art piece rather than doing more hours at their job, will not opt to create. If their work were to immediately leave their control, they would most certainly be less inclined to do so. Furthermore, the inability of others to simply duplicate existing works as their own means they too will be galvanized to break ground on new ideas, rather than simply re-tread over current ideas and to adapt existing works to markets. Art thrives by being new and original. Copyright protections shield against artistic laziness and drive the creative urges of the artistically inclined to ever more interesting fields. [1] Greenberg, M. “Reason or Madness: A Defense of Copyright’s Growing Pains”. John Marshall Review of Intellectual Property Law. 2007. http://www.jmripl.com/Publications/Vol7/Issue1/Greenberg.pdf  "],"PremiseEndPos":[24335],"ArgumentID":"00000022","Conclusion":"The lack of control over, and profit from, art will serve as a serious disincentive to artistic output","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":25028,"ConclusionEndPos":25125,"nextID":"00000024","PremiseStartPos":[26016],"prevID":"00000022","Premise":["Artists rarely make all that much money in the first place, and a great many only work as an artist part time. More importantly, they can still profit from their art, since they retain exclusive commercial rights to their work. Oftentimes they will actually benefit from operation under a creative commons license because it provides wider dispersal of their work, which builds a broader name and market for their work."],"PremiseEndPos":[26436],"ArgumentID":"00000023","Conclusion":"Artists often rely on copyright protection to financially support themselves and their families","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":25028,"ConclusionEndPos":25125,"nextID":"00000000","PremiseStartPos":[25139],"prevID":"00000023","Premise":["Artists as they are often not paid for anything else may rely on their creative output to support themselves. This is certainly no crime, and existing copyright laws recognize this fact. Artists often rely wholly on their ability to sell and profit from their work. This policy serves to drain them of that potential revenue, as their work is shunted into creative commons, and available to all. Artists often also have families to support, and putting the added financial burden on them of stripping them of their copyright only serves to further those problems as they exist. A robust system of copyright is a much better protection to struggling and successful artists alike who like all talented individuals seek to assuage their material wants. Artists cannot live on appreciation alone. With much less secure copyright many would have to find other work. "],"PremiseEndPos":[26001],"ArgumentID":"00000024","Conclusion":"Artists often rely on copyright protection to financially support themselves and their families","PremiseStance":["Pro"]}}]}