{"MetaData":{"Context":"URL: http://www.debate.org/debates/NSA-Domestic-Surveillance/1/\nCrawl date: 2016/09/29 04:27:42\nDebate Argument: NSA Domestic Surveillance | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: In this round I will present my own stance. I will rebut the Con in the next round. Thank you. PRO's CASE: Liberty and security go hand-in-hand; one cannot exist without the other. Domestic surveillance, while a behavior that ought to be closely monitored, is nevertheless vital to maintaining a secure domestic environment. Because of this, I steadfastly Affirm that the benefits of domestic surveillance outweigh the harms. I will now briefly take time to define some key terms from the resolution in order to bring clarity to the round. All Definitions are from Merriam-Webster dictionary. \"Domestic\" means \"of or relating to one\"s own country.\" \"Surveillance\" denotes \"the act of carefully watching someone or something especially in order to prevent or detect a crime.\" Thus the resolution is not asking us to examine surveillance as a general activity or to explore the NSA\"s actions as a whole. Rather, the resolution requires us to focus on a very narrow aspect of what goes on at the NSA\"domestic surveillance. \"Outweigh\" means \"greater than in value or importance.\" Furthermore, \"benefit\" is a \"good result,\" whereas a \"harm\" is \"something that causes someone or something to be hurt, broken, made less valuable or successful.\" Because the resolution is asking us to directly compare benefits and harms, we should evaluate this topic from a cost-benefit perspective. Whichever path is most beneficial is the one we should prefer. Therefore, it is my Thesis that domestic surveillance has net benefit when compared to its potential harms. Contention One: Surveillance is useful in combating domestic terror. Fernando Reinares, a Professor of Sociology and Politics, writes, \"Given the clandestine and unpredictable nature of terrorism\"resources may not be effective unless they are accompanied by mechanisms for detecting and preventing future threats. Reliable intelligence is an essential tool. Experience shows that, as long as the other components function as they should, success in the state\"s counter-terrorism campaign is directly proportional to the emphasis placed on the gathering and analyzing of reliable information\"when intelligence is insufficient or inadequate, the terrorist group\"will not hesitate to exploit this advantage by escalating its campaign of insurgent violence. In 1976\"the Italian Government decided to dismantle the special anti-terrorist units it had created only a few years earlier\"Terrorist attacks, which until then had been diminishing in frequency, immediately began to pick up and did not ease again until the early 1980s.\" John Carafano of the Heritage foundation adds, \"At least 60 Islamist-inspired terrorist plots have been aimed at the U.S. since the 9/11 attacks. The overwhelming majority have been thwarted thanks to timely, operational intelligence about the threats. Congress should not go back to a pre-9/11 set of rules just to appeal to populist sentiment. Congress and the White House have an obligation to protect our liberties and to safeguard our security\"in equal measure.\" Domestic surveillance therefore has real impacts on preventing terrorist attacks within a nation like the U.S. Contention Two: The threat to privacy posed by domestic surveillance is incredibly small. The U.K.\"s Daily Mail reports, \"the Internet carries 1,826 Petabytes of information per day. In its foreign intelligence mission, NSA touches about 1.6% of that\"However, of the 1.6% of the data, only 0.025% is actually selected for review. The net effect is that NSA analysts look at 0.00004% of the world's traffic in conducting their mission\"that\"s less than one part in a million. Put another way, if a standard basketball court represented the global communications environment, NSA's total collection would be represented by an area smaller than a dime on that basketball court.\" As Security expert Sir David Osmund notes, what the U.S. and other states need \"is the possibility of accessing the communications of the terrorists\"But those communications are all mixed up with everyone else's communications\"So you have to have a powerful capability to find the small amount that you are looking for. But it doesn't mean that the state is reading everyone's emails, nor would that conceivably be feasible.\" Furthermore, there is oversight of the NSA designed to prevent egregious oversteps of authority. The Las Vegas Sun Newspaper states, the NSA \"is subject to oversight by both Congress and the Foreign Intelligence Surveillance Court. If the effort were being operated without due regard for privacy, the other branches of government could push back. For the most part, they apparently have approved of what's gone on.\" U.S. Deputy Attorney-General James Cole testified that domestic surveillance is not \"a program that has been hidden away or off the books. In fact, all three branches of government play a significant role in the oversight\"the judiciary, through the Foreign Intelligence Surveillance Court plays a role\"The executive branch conducts extensive internal reviews to ensure compliance. And Congress passes the laws, oversees our implementation of those laws, and determines whether or not the current laws should be reauthorized and in what form.\" Thus, because the benefits of the NSA\"s domestic surveillance outweigh the harms, I strongly affirm. Sources: Carafano: (Vice President for Defense and Foreign Policy Studies at The Heritage Foundation think-tank) 2013. Cole: (U.S. Deputy Attorney-General) 2013. Daily Mail: 2013. Las Vegas Sun: 2013. Osmund: (Former Head of GCHQ, Britain\"s Equivalent of NSA.) 2013. Reinares: (Senior Analyst on International Terrorism, Elcano Royal Institute, and Professor of Political Science, King Juan Carlos University, Madrid) 2004.\n\nEvidence Pro: Con forfeits, meaning he drops my entire case. Extend my arguments. I will still take the time to rebut his points in the hopes that he will rejoin the debate. CON's CASE: Cons first point falls apart insofar as people know we are being listened to, but yet we're still buying phones and computers. They are conveniences we want badly enough that the risks of NSA eavesdropping aren't enough to stop us. Moreover, Con claims that there is a disadvantage to affirming--but yet he gives us no quantifiable impacts of the economic costs of keeping the NSA running. Without concrete numbers, we can't evaluate the impacts of Con's assertions under a cost-benefit framework. Con's second point is not warranted at all. He makes the claims but does not back them up. I would argue that the oversight mechanisms outlined in my case are sufficient checks upon surveillance. Also, Obamacare as literally nothing to do with a debate on the NSA... Thanks. Vote Pro.\n\nEvidence Pro: Sadly, my opponent does not rejoin the debate. Extend my arguments; they go unchallenged. Than you--please vote Pro!\n\nEvidence Con: Resolved: The benefits of domestic surveillance by the NSA outweigh the harms. I negate this resolution for two main contentions. First, the NSA harms through an economic cost or social costs. Second, the US government doesn't play by its own rules. To start, the NSA harms the American people both economically and socially. Economically, the cost of data collection centers, such as the one in Nevada, comes out of the average man's taxes, raising them. With the taxes rising fewer people will trust the economy, which means, socially, they will not favor the government. To put that into perspective, if I don't like the idea of the NSA listening to my phone calls, I won't buy a phone, which puts the company out of business eventually. Socially, people will start to fear and mistrust the government, causing tension between the government and the people. Next, the government doesn't even play by its own rules. Take the top secret court for example. This court can only be accessed with a warrant. Well, at first the government did use these warrants, but after a while, they stopped and haven't used the REQUIRED warrants. What if they stop using search warrants on citizens and put cameras in our domestic areas, such as our homes. This is unconstitutional. But the government wouldn't stray as far as to admit that it is unconstitutional. Take Obamacare. Technically, this is an unconstitutional thing that the government has anyway. Therefore, the government does not play by its own rules. For these reasons, the con will win this debate.\n\nEvidence Con: Jessie_Debate14 forfeited this round. Pro Con forfeits, meaning he drops my entire case. Extend my arguments. I will still take the time to rebut his points in the hopes that he will rejoin the debate. CON's CASE: Cons first point falls apart insofar as people know we are being listened to, but yet we're still buying phones and computers. They are conveniences we want badly enough that the risks of NSA eavesdropping aren't enough to stop us. Moreover, Con claims that there is a disadvantage to affirming--but yet he gives us no quantifiable impacts of the economic costs of keeping the NSA running. Without concrete numbers, we can't evaluate the impacts of Con's assertions under a cost-benefit framework. Con's second point is not warranted at all. He makes the claims but does not back them up. I would argue that the oversight mechanisms outlined in my case are sufficient checks upon surveillance. Also, Obamacare as literally nothing to do with a debate on the NSA... Thanks. Vote Pro.\n\nEvidence Con: Jessie_Debate14 forfeited this round. Pro Sadly, my opponent does not rejoin the debate. Extend my arguments; they go unchallenged. Than you--please vote Pro!\n","DiscussionID":"00000084","Title":"NSA Domestic Surveillance","CrawlDate":"2016/09/29 04:27:42","URL":"http://www.debate.org/debates/NSA-Domestic-Surveillance/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":113,"ConclusionEndPos":138,"nextID":"00000002","PremiseStartPos":[190],"prevID":"00000000","Premise":["In this round I will present my own stance. I will rebut the Con in the next round. Thank you. PRO's CASE: Liberty and security go hand-in-hand; one cannot exist without the other. Domestic surveillance, while a behavior that ought to be closely monitored, is nevertheless vital to maintaining a secure domestic environment. Because of this, I steadfastly Affirm that the benefits of domestic surveillance outweigh the harms. I will now briefly take time to define some key terms from the resolution in order to bring clarity to the round. All Definitions are from Merriam-Webster dictionary. \"Domestic\" means \"of or relating to one\"s own country.\" \"Surveillance\" denotes \"the act of carefully watching someone or something especially in order to prevent or detect a crime.\" Thus the resolution is not asking us to examine surveillance as a general activity or to explore the NSA\"s actions as a whole. Rather, the resolution requires us to focus on a very narrow aspect of what goes on at the NSA\"domestic surveillance. \"Outweigh\" means \"greater than in value or importance.\" Furthermore, \"benefit\" is a \"good result,\" whereas a \"harm\" is \"something that causes someone or something to be hurt, broken, made less valuable or successful.\" Because the resolution is asking us to directly compare benefits and harms, we should evaluate this topic from a cost-benefit perspective. Whichever path is most beneficial is the one we should prefer. Therefore, it is my Thesis that domestic surveillance has net benefit when compared to its potential harms. Contention One: Surveillance is useful in combating domestic terror. Fernando Reinares, a Professor of Sociology and Politics, writes, \"Given the clandestine and unpredictable nature of terrorism\"resources may not be effective unless they are accompanied by mechanisms for detecting and preventing future threats. Reliable intelligence is an essential tool. Experience shows that, as long as the other components function as they should, success in the state\"s counter-terrorism campaign is directly proportional to the emphasis placed on the gathering and analyzing of reliable information\"when intelligence is insufficient or inadequate, the terrorist group\"will not hesitate to exploit this advantage by escalating its campaign of insurgent violence. In 1976\"the Italian Government decided to dismantle the special anti-terrorist units it had created only a few years earlier\"Terrorist attacks, which until then had been diminishing in frequency, immediately began to pick up and did not ease again until the early 1980s.\" John Carafano of the Heritage foundation adds, \"At least 60 Islamist-inspired terrorist plots have been aimed at the U.S. since the 9/11 attacks. The overwhelming majority have been thwarted thanks to timely, operational intelligence about the threats. Congress should not go back to a pre-9/11 set of rules just to appeal to populist sentiment. Congress and the White House have an obligation to protect our liberties and to safeguard our security\"in equal measure.\" Domestic surveillance therefore has real impacts on preventing terrorist attacks within a nation like the U.S. Contention Two: The threat to privacy posed by domestic surveillance is incredibly small. The U.K.\"s Daily Mail reports, \"the Internet carries 1,826 Petabytes of information per day. In its foreign intelligence mission, NSA touches about 1.6% of that\"However, of the 1.6% of the data, only 0.025% is actually selected for review. The net effect is that NSA analysts look at 0.00004% of the world's traffic in conducting their mission\"that\"s less than one part in a million. Put another way, if a standard basketball court represented the global communications environment, NSA's total collection would be represented by an area smaller than a dime on that basketball court.\" As Security expert Sir David Osmund notes, what the U.S. and other states need \"is the possibility of accessing the communications of the terrorists\"But those communications are all mixed up with everyone else's communications\"So you have to have a powerful capability to find the small amount that you are looking for. But it doesn't mean that the state is reading everyone's emails, nor would that conceivably be feasible.\" Furthermore, there is oversight of the NSA designed to prevent egregious oversteps of authority. The Las Vegas Sun Newspaper states, the NSA \"is subject to oversight by both Congress and the Foreign Intelligence Surveillance Court. If the effort were being operated without due regard for privacy, the other branches of government could push back. For the most part, they apparently have approved of what's gone on.\" U.S. Deputy Attorney-General James Cole testified that domestic surveillance is not \"a program that has been hidden away or off the books. In fact, all three branches of government play a significant role in the oversight\"the judiciary, through the Foreign Intelligence Surveillance Court plays a role\"The executive branch conducts extensive internal reviews to ensure compliance. And Congress passes the laws, oversees our implementation of those laws, and determines whether or not the current laws should be reauthorized and in what form.\" Thus, because the benefits of the NSA\"s domestic surveillance outweigh the harms, I strongly affirm. Sources: Carafano: (Vice President for Defense and Foreign Policy Studies at The Heritage Foundation think-tank) 2013. Cole: (U.S. Deputy Attorney-General) 2013. Daily Mail: 2013. Las Vegas Sun: 2013. Osmund: (Former Head of GCHQ, Britain\"s Equivalent of NSA.) 2013. Reinares: (Senior Analyst on International Terrorism, Elcano Royal Institute, and Professor of Political Science, King Juan Carlos University, Madrid) 2004."],"PremiseEndPos":[5929],"ArgumentID":"00000001","Conclusion":"NSA Domestic Surveillance","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":113,"ConclusionEndPos":138,"nextID":"00000003","PremiseStartPos":[5944],"prevID":"00000001","Premise":["Con forfeits, meaning he drops my entire case. Extend my arguments. I will still take the time to rebut his points in the hopes that he will rejoin the debate. CON's CASE: Cons first point falls apart insofar as people know we are being listened to, but yet we're still buying phones and computers. They are conveniences we want badly enough that the risks of NSA eavesdropping aren't enough to stop us. Moreover, Con claims that there is a disadvantage to affirming--but yet he gives us no quantifiable impacts of the economic costs of keeping the NSA running. Without concrete numbers, we can't evaluate the impacts of Con's assertions under a cost-benefit framework. Con's second point is not warranted at all. He makes the claims but does not back them up. I would argue that the oversight mechanisms outlined in my case are sufficient checks upon surveillance. Also, Obamacare as literally nothing to do with a debate on the NSA... Thanks. Vote Pro."],"PremiseEndPos":[6899],"ArgumentID":"00000002","Conclusion":"NSA Domestic Surveillance","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":113,"ConclusionEndPos":138,"nextID":"00000004","PremiseStartPos":[6914],"prevID":"00000002","Premise":["Sadly, my opponent does not rejoin the debate. Extend my arguments; they go unchallenged. Than you--please vote Pro!"],"PremiseEndPos":[7031],"ArgumentID":"00000003","Conclusion":"NSA Domestic Surveillance","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":113,"ConclusionEndPos":138,"nextID":"00000005","PremiseStartPos":[7046],"prevID":"00000003","Premise":["Resolved: The benefits of domestic surveillance by the NSA outweigh the harms. I negate this resolution for two main contentions. First, the NSA harms through an economic cost or social costs. Second, the US government doesn't play by its own rules. To start, the NSA harms the American people both economically and socially. Economically, the cost of data collection centers, such as the one in Nevada, comes out of the average man's taxes, raising them. With the taxes rising fewer people will trust the economy, which means, socially, they will not favor the government. To put that into perspective, if I don't like the idea of the NSA listening to my phone calls, I won't buy a phone, which puts the company out of business eventually. Socially, people will start to fear and mistrust the government, causing tension between the government and the people. Next, the government doesn't even play by its own rules. Take the top secret court for example. This court can only be accessed with a warrant. Well, at first the government did use these warrants, but after a while, they stopped and haven't used the REQUIRED warrants. What if they stop using search warrants on citizens and put cameras in our domestic areas, such as our homes. This is unconstitutional. But the government wouldn't stray as far as to admit that it is unconstitutional. Take Obamacare. Technically, this is an unconstitutional thing that the government has anyway. Therefore, the government does not play by its own rules. For these reasons, the con will win this debate."],"PremiseEndPos":[8597],"ArgumentID":"00000004","Conclusion":"NSA Domestic Surveillance","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":113,"ConclusionEndPos":138,"nextID":"00000006","PremiseStartPos":[8612],"prevID":"00000004","Premise":["Jessie_Debate14 forfeited this round. Pro Con forfeits, meaning he drops my entire case. Extend my arguments. I will still take the time to rebut his points in the hopes that he will rejoin the debate. CON's CASE: Cons first point falls apart insofar as people know we are being listened to, but yet we're still buying phones and computers. They are conveniences we want badly enough that the risks of NSA eavesdropping aren't enough to stop us. Moreover, Con claims that there is a disadvantage to affirming--but yet he gives us no quantifiable impacts of the economic costs of keeping the NSA running. Without concrete numbers, we can't evaluate the impacts of Con's assertions under a cost-benefit framework. Con's second point is not warranted at all. He makes the claims but does not back them up. I would argue that the oversight mechanisms outlined in my case are sufficient checks upon surveillance. Also, Obamacare as literally nothing to do with a debate on the NSA... Thanks. Vote Pro."],"PremiseEndPos":[9609],"ArgumentID":"00000005","Conclusion":"NSA Domestic Surveillance","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":113,"ConclusionEndPos":138,"nextID":"00000000","PremiseStartPos":[9624],"prevID":"00000005","Premise":["Jessie_Debate14 forfeited this round. Pro Sadly, my opponent does not rejoin the debate. Extend my arguments; they go unchallenged. Than you--please vote Pro!"],"PremiseEndPos":[9783],"ArgumentID":"00000006","Conclusion":"NSA Domestic Surveillance","PremiseStance":["Con"]}}]}