{"MetaData":{"Context":"URL: http://www.debate.org/debates/Plato-Dualism-Caused-the-Holocaust/1/\nCrawl date: 2016/09/29 03:50:00\nOnline Debate: Plato & Dualism Caused the Holocaust | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: First round for acceptance.\n\nEvidence Pro: Here you go.\n\nEvidence Pro: My opponent's arguments stand only if the real/unreal distinction is valid. The burden of proof is on Con to prove this distinction. Back to Con.\n\nEvidence Pro: My opponent is begging the question by assuming that concepts such as \"BOP\", \"arguments\", and \"justification\" have any validity. Watch him squirm whilst trying to non-circularly define these concepts. If he cannot, I win the debate, for my arguments cannot be contested. Keep in mind that I am merely using Cartesian terminology for convenience. One must recognize my case as nonsense to transcend the faulty metadichotomy of dichotomy and immanence, of metatranscendental and subliminal, of the burrowed and the burrowing.\n\nEvidence Con: Accepted\n\nEvidence Con: Pro has put together a very eloquent critique of Platonism, but unfortunately, none of that is really relevant to the resolution. The only part of it where Pro even attempts to affirm the resolution is here: \"Oh, and all immoral things come from faulty conceptions of reality, and Hitler was a Christian, so he believed in transcendence as influenced by Plato, so the Holocaust was directly caused by Platonism. QED.\" Needless to say, this argument is unsound. To see why, let's reformat Pro's argument syllogistically: P1: All immoral things are caused by misconceptions of reality P2: The Holocaust was immoral C1: The Holocaust was caused by a misconception of reality P3: Platonism is a misconception of reality C2: The Holocaust was caused by Platonism This is a blatant non-sequitur. C2 doesn't follow from its preceding premises at all -- Platonism has not been shown to be the misconception of reality which caused the Holocaust. There are an infinite number of misconceptions which could have served as the Holocaust's cause, and burden of proof is on Pro to definitively prove that it's Platonism. The only time he even attempts to fulfill that burden is when he mentions Christianity, but his reasoning is absurd... Firstly, it isn't clear that Hitler's Christian beliefs played much of a role in his motives for starting the Holocaust -- that's a pretty controversial subject on its own, so Pro is gonna have to provide a lot more evidence here. Futhermore, even if Christianity did play a role in Hitler's motives, that has no bearing whatsoever on Platonism. The role that Platonism plays in Christian doctrine is completely distinct from the part of Christian doctrine which was used to justify anti-semitism -- the former deals with God's ontological relationship with reality, whereas the latter deals with the history surrounding Jesus's crucifixion. In conclusion, Pro's argument is entirely insufficient. The resolution is negated.\n\nEvidence Con: My opponent has not defined what the hell the \"real/unreal distinction\" is, nor has he explained how my argument assumes its validity. Back to Pro.\n\nEvidence Con: lmao stfu vote con\n","DiscussionID":"00000078","Title":"Plato & Dualism Caused the Holocaust","CrawlDate":"2016/09/29 03:50:00","URL":"http://www.debate.org/debates/Plato-Dualism-Caused-the-Holocaust/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":156,"nextID":"00000002","PremiseStartPos":[208],"prevID":"00000000","Premise":["First round for acceptance."],"PremiseEndPos":[236],"ArgumentID":"00000001","Conclusion":"Plato & Dualism Caused the Holocaust","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":156,"nextID":"00000003","PremiseStartPos":[251],"prevID":"00000001","Premise":["Here you go."],"PremiseEndPos":[264],"ArgumentID":"00000002","Conclusion":"Plato & Dualism Caused the Holocaust","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":156,"nextID":"00000004","PremiseStartPos":[279],"prevID":"00000002","Premise":["My opponent's arguments stand only if the real/unreal distinction is valid. The burden of proof is on Con to prove this distinction. Back to Con."],"PremiseEndPos":[425],"ArgumentID":"00000003","Conclusion":"Plato & Dualism Caused the Holocaust","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":156,"nextID":"00000005","PremiseStartPos":[440],"prevID":"00000003","Premise":["My opponent is begging the question by assuming that concepts such as \"BOP\", \"arguments\", and \"justification\" have any validity. Watch him squirm whilst trying to non-circularly define these concepts. If he cannot, I win the debate, for my arguments cannot be contested. Keep in mind that I am merely using Cartesian terminology for convenience. One must recognize my case as nonsense to transcend the faulty metadichotomy of dichotomy and immanence, of metatranscendental and subliminal, of the burrowed and the burrowing."],"PremiseEndPos":[964],"ArgumentID":"00000004","Conclusion":"Plato & Dualism Caused the Holocaust","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":156,"nextID":"00000006","PremiseStartPos":[979],"prevID":"00000004","Premise":["Accepted"],"PremiseEndPos":[988],"ArgumentID":"00000005","Conclusion":"Plato & Dualism Caused the Holocaust","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":156,"nextID":"00000007","PremiseStartPos":[1003],"prevID":"00000005","Premise":["Pro has put together a very eloquent critique of Platonism, but unfortunately, none of that is really relevant to the resolution. The only part of it where Pro even attempts to affirm the resolution is here: \"Oh, and all immoral things come from faulty conceptions of reality, and Hitler was a Christian, so he believed in transcendence as influenced by Plato, so the Holocaust was directly caused by Platonism. QED.\" Needless to say, this argument is unsound. To see why, let's reformat Pro's argument syllogistically: P1: All immoral things are caused by misconceptions of reality P2: The Holocaust was immoral C1: The Holocaust was caused by a misconception of reality P3: Platonism is a misconception of reality C2: The Holocaust was caused by Platonism This is a blatant non-sequitur. C2 doesn't follow from its preceding premises at all -- Platonism has not been shown to be the misconception of reality which caused the Holocaust. There are an infinite number of misconceptions which could have served as the Holocaust's cause, and burden of proof is on Pro to definitively prove that it's Platonism. The only time he even attempts to fulfill that burden is when he mentions Christianity, but his reasoning is absurd... Firstly, it isn't clear that Hitler's Christian beliefs played much of a role in his motives for starting the Holocaust -- that's a pretty controversial subject on its own, so Pro is gonna have to provide a lot more evidence here. Futhermore, even if Christianity did play a role in Hitler's motives, that has no bearing whatsoever on Platonism. The role that Platonism plays in Christian doctrine is completely distinct from the part of Christian doctrine which was used to justify anti-semitism -- the former deals with God's ontological relationship with reality, whereas the latter deals with the history surrounding Jesus's crucifixion. In conclusion, Pro's argument is entirely insufficient. The resolution is negated."],"PremiseEndPos":[2955],"ArgumentID":"00000006","Conclusion":"Plato & Dualism Caused the Holocaust","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":156,"nextID":"00000008","PremiseStartPos":[2970],"prevID":"00000006","Premise":["My opponent has not defined what the hell the \"real/unreal distinction\" is, nor has he explained how my argument assumes its validity. Back to Pro."],"PremiseEndPos":[3118],"ArgumentID":"00000007","Conclusion":"Plato & Dualism Caused the Holocaust","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":156,"nextID":"00000000","PremiseStartPos":[3133],"prevID":"00000007","Premise":["lmao stfu vote con"],"PremiseEndPos":[3152],"ArgumentID":"00000008","Conclusion":"Plato & Dualism Caused the Holocaust","PremiseStance":["Con"]}}]}