{"MetaData":{"Context":"URL: http://www.forandagainst.com/Amir_Khan_Should_Be_Praised_For_Flying_Both_Flags\nCrawl date: 2016/09/28 05:29:41\nTitle: Amir Khan Should Be Praised For Flying Both Flags. - For & Against\nNumber of arguments: 5\n\nClaim: Amir Khan Should Be Praised For Flying Both Flags. - For & Against\nFor: Yes, he is a good role model all round\nFor: If it was just the Pakistani flag held up I think I'd have a problem, both flags held up is a message to all. Peace to all, you can be proud of your roots and should be,\nFor: Amir Khan's use of the Pakistani flag, in addition to the Union Jack, is a perfectly harmless expression of his dual identity. It is not at all uncommon for children of immigrants to have multiple national or cultural identities. Interestingly, second generation Britons are often more likely to publicly demonstrate a certain affinity with their ethnocultural identity than their parents, who were usually too busy establishing a new existence in their host country to have extra time to engage in such luxuries. I am quite sure that Khan's primary loyalty is to the UK and not to Pakistan, even if he uses this country's flag as a way to cling to his roots. This became evident after he was criticized by a small handful of entirely unsavoury imams, such as Omar Bakri Mohammad, for displaying the Union Jack. I would, however, venture to make a prediction in terms of Khan's use of the Pakistani flag. I think that as he grows older and matures, he will move away from public displays of his heritage. Khan will continue to be proud of his origins, but he will likely be more subtle in expressing this pride.\nAgainst: I'm not sure on this one but i definitely think that he should get praised for it!\nAgainst: I don't strongly object to it but I don't see why he should be praised for flying the Pakistani flag. Why not just fly the British flag if he has never lived in Pakistan? If immigrants are going to assimilate successfully, their loyalties to the countries they or their ancestors came from need to fade away; not necessarily completely, but substantially. Nor do I see what's so great about him saying he is Muslim and British. Who cares what his religion is really? You don't usually hear star sports performers saying things like \"I'm Catholic and British\", \"I'm a Buddhist and British\", \"I'm a druid and I'm British\". For people to even raise the topic of their religion as if it mattered debases our secular society and civilisation in my opinion. We've moved beyond that and now these people are trying to pull us back into it.\n","DiscussionID":"00000062","Title":"Amir Khan Should Be Praised For Flying Both Flags.","CrawlDate":"2016/09/28 05:29:41","URL":"http://www.forandagainst.com/Amir_Khan_Should_Be_Praised_For_Flying_Both_Flags"},"ArgumentList":[{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":173,"nextID":"00000002","PremiseStartPos":[1724],"prevID":"00000000","Premise":["I don't strongly object to it but I don't see why he should be praised for flying the Pakistani flag. Why not just fly the British flag if he has never lived in Pakistan? If immigrants are going to assimilate successfully, their loyalties to the countries they or their ancestors came from need to fade away; not necessarily completely, but substantially. Nor do I see what's so great about him saying he is Muslim and British. Who cares what his religion is really? You don't usually hear star sports performers saying things like \"I'm Catholic and British\", \"I'm a Buddhist and British\", \"I'm a druid and I'm British\". For people to even raise the topic of their religion as if it mattered debases our secular society and civilisation in my opinion. We've moved beyond that and now these people are trying to pull us back into it."],"PremiseEndPos":[2557],"ArgumentID":"00000001","Conclusion":"Amir Khan Should Be Praised For Flying Both Flags.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":173,"nextID":"00000003","PremiseStartPos":[1632],"prevID":"00000001","Premise":["I'm not sure on this one but i definitely think that he should get praised for it!"],"PremiseEndPos":[1715],"ArgumentID":"00000002","Conclusion":"Amir Khan Should Be Praised For Flying Both Flags.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":173,"nextID":"00000004","PremiseStartPos":[511],"prevID":"00000002","Premise":["Amir Khan's use of the Pakistani flag, in addition to the Union Jack, is a perfectly harmless expression of his dual identity. It is not at all uncommon for children of immigrants to have multiple national or cultural identities. Interestingly, second generation Britons are often more likely to publicly demonstrate a certain affinity with their ethnocultural identity than their parents, who were usually too busy establishing a new existence in their host country to have extra time to engage in such luxuries. I am quite sure that Khan's primary loyalty is to the UK and not to Pakistan, even if he uses this country's flag as a way to cling to his roots. This became evident after he was criticized by a small handful of entirely unsavoury imams, such as Omar Bakri Mohammad, for displaying the Union Jack. I would, however, venture to make a prediction in terms of Khan's use of the Pakistani flag. I think that as he grows older and matures, he will move away from public displays of his heritage. Khan will continue to be proud of his origins, but he will likely be more subtle in expressing this pride."],"PremiseEndPos":[1623],"ArgumentID":"00000003","Conclusion":"Amir Khan Should Be Praised For Flying Both Flags.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":173,"nextID":"00000005","PremiseStartPos":[336],"prevID":"00000003","Premise":["If it was just the Pakistani flag held up I think I'd have a problem, both flags held up is a message to all. Peace to all, you can be proud of your roots and should be,"],"PremiseEndPos":[506],"ArgumentID":"00000004","Conclusion":"Amir Khan Should Be Praised For Flying Both Flags.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":122,"ConclusionEndPos":173,"nextID":"00000000","PremiseStartPos":[292],"prevID":"00000004","Premise":["Yes, he is a good role model all round"],"PremiseEndPos":[331],"ArgumentID":"00000005","Conclusion":"Amir Khan Should Be Praised For Flying Both Flags.","PremiseStance":["Pro"]}}]}