{"MetaData":{"Context":"URL: http://www.debate.org/debates/More-of-the-world-is-flat-will-occur/1/\nCrawl date: 2016/09/29 05:53:14\nDebate Issue: More of the \"world is flat\" will occur | Debate.org\nNumber of arguments: 7\n\n\nEvidence Pro: People have been wrong about a majority of a lot. The world is flat isn't the only wrong we will come across. We could be wrong about many topics: global warming, hunting overpopulation, animals are more intelligent than we think, humans are unintelligent, livestock, honesty within our hearts if we have one, and more! The debater is welcome to come up with more topics, but disagree with \"world is flat\" like theories.\n\nEvidence Pro: Not just nature a lot of common beliefs majority has can be wrong. By the way, what do you mean about objective reality?\n\nEvidence Pro: People put there think they are always right though. Think everyone has their perception on the world such as \"jumping dogs\".\n\nEvidence Pro: Equalityman forfeited this round. Con I forfeit.\n\nEvidence Con: So your argument is that humans have been wrong about the facts of nature in the past, popular opinion now may be wrong, and we in the future will continue to be wrong. The other side of this argument is sort of a stretch but unavoidable; that is, that everyone's own perceptions are real for them, and there is no objective reality.. so, nothing to be wrong about. How could that be? Well, our consciousness constructs our world based on sensory information. However, who can say that our experiences aren't just that - unique blocks of data sent to whatever constitutes our awareness, with no basis in a static world? You could successfully argue human fallibility will continue in the world that you experience. But, speaking with regard to overall truth, reality, or existence, it is impossible to prove anyone fully right or wrong.\n\nEvidence Con: I mean that arguing about whether people will ever be right or wrong is pointless. 1) Error is part of human nature as we know it 2) We won't ever know what's really \"wrong\" or inaccurate because we know of our world based on our experiences, meaning that it's entirely possible that the Earth, the universe, everyday life as we know it, is just a conscious sensation which is not based on an underlying permanence. = if everyone has different sensations, everyone's perception of the world is different; in relation to other people's perceptions, none can be true, none can be false\n\nEvidence Con: So? When someone claims they're right it means they're right in their perspective, but in your point of view, maybe not.\n\nEvidence Con: I forfeit.\n","DiscussionID":"00000054","Title":"More of the \"world is flat\" will occur","CrawlDate":"2016/09/29 05:53:14","URL":"http://www.debate.org/debates/More-of-the-world-is-flat-will-occur/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":121,"ConclusionEndPos":159,"nextID":"00000002","PremiseStartPos":[211],"prevID":"00000000","Premise":["People have been wrong about a majority of a lot. The world is flat isn't the only wrong we will come across. We could be wrong about many topics: global warming, hunting overpopulation, animals are more intelligent than we think, humans are unintelligent, livestock, honesty within our hearts if we have one, and more! The debater is welcome to come up with more topics, but disagree with \"world is flat\" like theories."],"PremiseEndPos":[632],"ArgumentID":"00000001","Conclusion":"More of the \"world is flat\" will occur","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":121,"ConclusionEndPos":159,"nextID":"00000003","PremiseStartPos":[647],"prevID":"00000001","Premise":["Not just nature a lot of common beliefs majority has can be wrong. By the way, what do you mean about objective reality?"],"PremiseEndPos":[768],"ArgumentID":"00000002","Conclusion":"More of the \"world is flat\" will occur","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":121,"ConclusionEndPos":159,"nextID":"00000004","PremiseStartPos":[783],"prevID":"00000002","Premise":["People put there think they are always right though. Think everyone has their perception on the world such as \"jumping dogs\"."],"PremiseEndPos":[909],"ArgumentID":"00000003","Conclusion":"More of the \"world is flat\" will occur","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":121,"ConclusionEndPos":159,"nextID":"00000005","PremiseStartPos":[924],"prevID":"00000003","Premise":["Equalityman forfeited this round. Con I forfeit."],"PremiseEndPos":[973],"ArgumentID":"00000004","Conclusion":"More of the \"world is flat\" will occur","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":121,"ConclusionEndPos":159,"nextID":"00000006","PremiseStartPos":[988],"prevID":"00000004","Premise":["So your argument is that humans have been wrong about the facts of nature in the past, popular opinion now may be wrong, and we in the future will continue to be wrong. The other side of this argument is sort of a stretch but unavoidable; that is, that everyone's own perceptions are real for them, and there is no objective reality.. so, nothing to be wrong about. How could that be? Well, our consciousness constructs our world based on sensory information. However, who can say that our experiences aren't just that - unique blocks of data sent to whatever constitutes our awareness, with no basis in a static world? You could successfully argue human fallibility will continue in the world that you experience. But, speaking with regard to overall truth, reality, or existence, it is impossible to prove anyone fully right or wrong."],"PremiseEndPos":[1825],"ArgumentID":"00000005","Conclusion":"More of the \"world is flat\" will occur","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":121,"ConclusionEndPos":159,"nextID":"00000007","PremiseStartPos":[1840],"prevID":"00000005","Premise":["I mean that arguing about whether people will ever be right or wrong is pointless. 1) Error is part of human nature as we know it 2) We won't ever know what's really \"wrong\" or inaccurate because we know of our world based on our experiences, meaning that it's entirely possible that the Earth, the universe, everyday life as we know it, is just a conscious sensation which is not based on an underlying permanence. = if everyone has different sensations, everyone's perception of the world is different; in relation to other people's perceptions, none can be true, none can be false"],"PremiseEndPos":[2424],"ArgumentID":"00000006","Conclusion":"More of the \"world is flat\" will occur","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":121,"ConclusionEndPos":159,"nextID":"00000008","PremiseStartPos":[2439],"prevID":"00000006","Premise":["So? When someone claims they're right it means they're right in their perspective, but in your point of view, maybe not."],"PremiseEndPos":[2560],"ArgumentID":"00000007","Conclusion":"More of the \"world is flat\" will occur","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":121,"ConclusionEndPos":159,"nextID":"00000000","PremiseStartPos":[2575],"prevID":"00000007","Premise":["I forfeit."],"PremiseEndPos":[2586],"ArgumentID":"00000008","Conclusion":"More of the \"world is flat\" will occur","PremiseStance":["Con"]}}]}