{"MetaData":{"Context":"URL: http://www.debate.org/debates/YEC-is-unlikely/1/\nCrawl date: 2016/09/29 06:00:27\nDebate: YEC is unlikely | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: Hello everyone. I will accept the burden of proof in this debate since I am Pro and the Instigator. Note that I'm not arguing that YEC is impossible, or didn't even occur. I'm just arguing that it is unlikely. YEC - Young Earth Creationism : The belief that the earth is around 6000 years old unlikely - not likely : improbable Although the burden of proof is on me and my opponent needs to only rebut my arguments, I would like to clarify a few things. When I provide empirical evidence, my opponent find flaws in my evidence WITH evidence. They can't make up hypothetical scenarios stating what COULD have happened, because even though it could have likelihood favors the side with more accurate evidence. I would prefer if my opponent dedicated the first round to making sure we both agree with definitions and procedure, rather then debating. :) Thank you\n\nEvidence Pro: Thank you DATCMOTO for accepting this debate. Good thing we agree on everything. As far as things being hypothetical, I mean unwarranted or unconfimed situations that have no evidence for them. One thing that puzzles me though, I said for YEC to be AROUND 6000 years old. Yet, you say that the earth can't be ANY older than 6000 years. Well, what if it was 6001? Why would it be so unlikely for it to be a year older? Or even a day? Just a thought. Now on to my arguments. 1. Formation of the Grand Canyon. The Grand Canyon was developed from water erosion. There is currently not a known way by water erosion where the Grand Canyon could have formed in 6000 years or less. If water erosion were to work that quickly, there'd be canyons all over the place, and we would see them develop within our lifetimes. Actually, it takes at least 7000 years for the area drained by the Mississippi River to lose only 1 FOOT (12 inches) of altitude. It took the Grand Canyon ATLEAST 5 million years to develop. 2. Impact Craters. Scientists have discovered almost 200 impact craters on Earth. The only natural cause of these craters is a meteor hitting the planet. If all of these craters were to hit the planet within a 6000 year timeline, there is little chance that life would be able to survive because a) the heat and fallout from these meteors would wipe out virtually all life that isn't microscopic . b) the environment would take an extremely long time to clear and we would still see the effects of these bombardments. c) we would have to be able to inhale and see through fallout as the whole planet would be covered in it. d) the planet would be uninhabitable to most lifeforms, especially humans. e) I doubt earth would be a planet, since the force from the meteors could potentially shatter the planet to pieces The Chicxulub Crater (Yucutan Peninsula) alone is 2 million times more powerful than the strongest tested nuclear warhead. Here's the Chicxulub Crater. Heres the nuclear bomb. 3. Vast amount of species. Many species have been confirmed to have roamed the earth. Mammoths alone have been confirmed to be at least 10,000 years old. Also, scientists have confirmed that at least 99% of all species to ever roam the earth are currently extinct. This includes the early marine organisms and eventually dinosaurs. So many questions are set off by this. a) Now, how exactly can you first of all explain the existence and extinction of all of these organisms within a 6000 year period? b) How is there even enough space all of these species to survive? c) Here's what is really interesting: how can man emerge from all of this chaos? d) How come all of these dangerously equipt species suddenly died out, but we didn't? We all know that when man first emerged, there wasn't a lot of technology; we just had sticks and stones. In a way, we were just like any other species. e) How can we compete with, let's say, a raptor? f) Why aren't animals that survived as equipt as dinosaurs? g) Also, how can we survive all of these diseases? The list of questions go on and on. I urge my opponent to answer all of these questions. I also urge a PRO ballot. Thank you. :)\n\nEvidence Pro: Before I start I would like to point out that evolution, carbon dating, and the big bang theory aren't things that have no evidence for them. Also, I would like to point out that since this debate is centered around YEC, it doesn't matter if I think the world is a million or a billion years old. What matters if it was as young as 6000. ARGUMENTS ---------------- 1. Formation of the Grand Canyon You agree it developed from water erosion. I have explained to you that if water erosion worked at a rate to form the Grand Canyon in 6000 years or less, there would be canyons all over the place. The Mississippi River would be thousands of times deeper then it is now. As far as your 'omission argument' goes, you're right that what isn't known isn't evidence. So if there's no known way for the Grand Canyon to form in 6000 years or less, you can't argue that it can with evidence. You say our propositions are only hypotheses and NOT facts. That statement in itself is not fact, because you don't know whether or not our propositions are factual or not. Even if we take your attitude and apply it, it all comes down to evidence. Evidence tells us which is more LIKELY, which is what we are debating. You propose a biblical flood. I'm not saying a flood didn't happen. Though my argument had evidence (many canyons and Mississippi River analogy), what evidence is there to support a flood FORMING the Grand Canyon? My question is how would a flood carve a canyon ( also one that deep?) Also, why wouldn't it create a bunch of canyons besides the grand canyon? 2.. Impact Craters. There are two different types of craters, volcanic and impact. Volcanic craters are caused by the explosion or collapse of a volcano and impact craters are caused by meteors hitting the planet. There are several ways to tell them apart: a) The walls of the site. A volcanic crater would have volcanic rock around it. b) Shape of the site. A lot of volcanic craters don't take the perfect bowl shape of the impact craters and are moreso irregular. c) Impact craters sometimes have remains from the meteor. Now, the 200 craters I mentioned have been recognized as impact craters. Your argument implies that these craters are just as likely to be caused by volcanic activity. However, I have an answer to this. Near a lot of impact craters, tektite glass is found. Tektite is extremely rare, and is so 'dry' that the only known way for it to be formed is from the high temperatures caused by a meteor impact or nuclear bomb (volcanoes aren't hot enough) Yet again I ask for you to answer my previous questions. 3. Vast amount of species. Mammoths have been confirmed to have existed. There have been completely frozen, perfect mammoth specimens. Many other species have been confirmed For my previous questions, please answer a, c, and d. b) What evidence do you have of this? e) Are you saying man was that technologically equipt? Also, I mean compete for resources and survival. f) So we slayed the thousands of different types of confirmed dinousaurs? g) What evidence do you have that we were around when these diseases were? 4. Supervolcanoes (New contention) If all of the confirmed supervolcano eruptions happened within 6000 years, we would still see the effects. Also, consider the likelihood of ALL of this evidence being faulty. I await my opponent's evidence for YEC (supportive, not counterevidence). The resolution is affirmed. Thank you. :)\n\nEvidence Pro: Ok then. I will show you evidence for the following: 1. Evolution Read \"Natural Selection in Populations\", \"Origins of New Species\", and \"How scientists study evolution.\" Take a look at my evolution evidence. Fruit flies, bacteria, viruses, and the peppered tree moth have all been seen to evolve within our lifetimes. We've witnessed it. The acceptance of the evolutionary theory is not a mere assuption, it is well evidenced. 2. Carbon Dating 3. Big Bang All of these theories are well evidenced. ARGUMENTS 1. Grand Canyon My source shows that the grand canyon was developed from 2 sides. a) How could a flood make a DEEP CANYON in a matter of WEEKS. b) Why didn't the flood put canyons everywhere? As far as noah's flood goes, there is no evidence of that event. Only negative evidence, attacking other theories and pressuming validity as the only standing hypothesis. Even if it happened, I don't understand why it would create the grand canyon. Also, if the Bible is a valid source of evidence, why isn't the Greek, Egyptian, or Native American accounts of earths creation? 2. Impact Craters This contention is legit. If those craters were volcanic, they would be composed of volcanic rock. Although a minority of scientists have alternative theories for the formation of tektite, they don't argue against them being formed by impact craters. It is silly to argue that if you haven't seen a meteor hit the earth it didn't happen. While I provide evidence you play the 'you can't be 100% sure' card. Well, when it comes to likelihood the most developed/evidenced theory is the victor. 3. Vast amount of species a) Even if you deny evolution, you can't deny the fossil record and the fact that extinct species existed. Why did they suddenly disappear but we survived? I ask you question 'a' once again. b) It is not that simple. Empty space alone cannot support life; there needs to be resources. My extinction statistic has nothing to do with evolution. If you multiplied the current species that exists by 99, resources would deplete rapidly. c) What are the odds of man defeating it's current competitors times 99 from scratch? You say I assume evolution when you assume YEC. d) This doesn't assume evolution. I ask again, why would dangerously equipt species die out but we survive. e) If we had that technology at the VERY beginning, we should've also had cellphones and computers. Knowledge is not a force; it is developed. f) Rediculous. g) If we were around when 99 times the diseases were around, we would be dead. 4. Supervolcanoes. How is that unscientific? Counterevidence please. BOTTOM LINE The YEC community has been known to blame it's lack of recognition in the scientific community because of discrimination. However, if you go under 'Attitude towards science,' you will see how many scientific fields YEC denies. Also, under 'Criticism' you will see that in a poll, only 5% of professional scientists take a sincere YEC view. However, 40% of them think god guided humans through millions of years of evolvution, while 55% think god took no part. All of the science that disagrees with YEC does not contradict itself. YEC treats it as if it is all assumed and/or, coincidential and counters, but provides no evidence on it's behalf. This is a negative argument and therefore can't be considered valid. All of my opponent's sources were biased from creation science, which is mostly psuedoscience. When it's all said and done, the odds don't stack in YEC's favor. Please vote PRO. Thank you. :)\n\nEvidence Con: I fully accept the terms and definitions etc. ALTHOUGH I will only be restricted by a word such as 'hypothetical' as far as my opponent allows himself to be restricted by it. My position is that, not only is the Earth 6000 years old , it is highly unlikely for it to be ANY older. May the best man win.\n\nEvidence Con: \"Thank you DATCMOTO for accepting this debate. Good thing we agree on everything. As far as things being hypothetical, I mean unwarranted or unconfimed situations that have no evidence for them.\" >Such as evolution, carbon dating, big bang theory etc do you mean? \"One thing that puzzles me though, I said for YEC to be AROUND 6000 years old. Yet, you say that the earth can't be ANY older than 6000 years. Well, what if it was 6001? Why would it be so unlikely for it to be a year older? Or even a day? Just a thought.\" >Well, as big bang/evolutionists etc work in billions of years, I took it for granted that you'd give me a few hundred years grace either side. 1. Formation of the Grand Canyon. \"The Grand Canyon was developed from water erosion.\" >True, an observable fact. \"There is currently not a known way by water erosion where the Grand Canyon could have formed in 6000 years or less.\" >False. An 'omission argument':What is not known is in no way evidence. The Biblical flood is another, equally valid hypothesis. \"It took the Grand Canyon ATLEAST 5 million years to develop.\" >A hypothesis, NOT fact. >ALSO, The ground level where the canyon ends is HIGHER than where it begins. Do rivers run uphill? 2. Impact Craters. \"Scientists have discovered almost 200 impact craters on Earth. The only natural cause of these craters is a meteor hitting the planet. If all of these craters were to hit the planet within a 6000 year timeline, there is little chance that life would be able to survive because etc etc\" >Again, this is simply another HYPOTHESIS: Fact: Crater like structures exist. Hypothesis (a) They were created by meteorites. Hypothesis (b) They were created by underground eruptions etc: 3. Vast amount of species. \"Many species have been confirmed to have roamed the earth. Mammoths alone have been confirmed to be at least 10,000 years old. Also, scientists have confirmed that at least 99% of all species to ever roam the earth are currently extinct. This includes the early marine organisms and eventually dinosaurs. So many questions are set off by this.\" >None of these things are 'confirmed'.. they are hypothesises. \"a) Now, how exactly can you first of all explain the existence and extinction of all of these organisms within a 6000 year period?\" >This question is non-sensical to me.. you'll have to elaborate. \"b) How is there even enough space all of these species to survive?\" >There is still LOTS of space on this planet, there was a whole Lot MORE before the flood \"c) Here's what is really interesting: how can man emerge from all of this chaos?\" >Now you are assuming an evolutionary perspective (a hypothetical doctrine, another would be that God created man 6000 years ago) \"d) How come all of these dangerously equipt species suddenly died out, but we didn't? We all know that when man first emerged, there wasn't a lot of technology; we just had sticks and stones. In a way, we were just like any other species.\" >Again, you are assuming an evolutionary perspective. \"e) How can we compete with, let's say, a raptor?\" >EASILY. A raptors brain is the size of a walnut. Personally I'd dig a pit with stakes in it and bait it with food. \"f) Why aren't animals that survived as equipt as dinosaurs?\" >Do you know HOW many myths and legends there are about heroes killing dragons? \"g) Also, how can we survive all of these diseases? The list of questions go on and on.\" >We have survived them, whatever your worldview. NEGATED.\n\nEvidence Con: \"Before I start I would like to point out that evolution, carbon dating, and the big bang theory aren't things that have no evidence for them.\" >Then why not produce some evidence? These things are THEORIES, nothing else. \"Also, I would like to point out that since this debate is centered around YEC, it doesn't matter if I think the world is a million or a billion years old. What matters if it was as young as 6000.\" >No, it matters whether YEC is LIKELY or not. Showing your arguments to be without foundation greatly advances those chances. ARGUMENTS \"You agree it developed from water erosion. I have explained to you that if water erosion worked at a rate to form the Grand Canyon in 6000 years or less, there would be canyons all over the place. The Mississippi River would be thousands of times deeper then it is now.\" >Explaining is not proving. Omission (\"there would be canyons\") is NOT an argument. I believe the grand canyon was created in a matter of weeks, not years or millenia. \"As far as your 'omission argument' goes, you're right that what isn't known isn't evidence. So if there's no known way for the Grand Canyon to form in 6000 years or less, you can't argue that it can with evidence.\" >Noah's flood is the known way it occurred. \"You say our propositions are only hypotheses and NOT facts. That statement in itself is not fact, because you don't know whether or not our propositions are factual or not. Even if we take your attitude and apply it, it all comes down to evidence. Evidence tells us which is more LIKELY, which is what we are debating.\" >Sure, and I am waiting for some evidence to refute. You saw fit to post some links to Internet sites so I did the same. But we are no further along are we? \"You propose a biblical flood. I'm not saying a flood didn't happen. Though my argument had evidence (many canyons and Mississippi River analogy), what evidence is there to support a flood FORMING the Grand Canyon? My question is how would a flood carve a canyon ( also one that deep?) Also, why wouldn't it create a bunch of canyons besides the grand canyon?\" >Again, more omission arguments. You have not refuted the one solid argument so far: That the ground at the end of the canyon is 40000feet higher than at it's source Therefore it is impossible for the Colorado river (rivers always run down hill) to have carved that canyon. 2.. Impact Craters. WIKIPEDIA: \"Tektites (from Greek tektos, molten) are natural glass rocks up to a few centimeters in size, which MOST scientists argue were formed by the impact of large meteorites on Earth's surface.\" > \"which MOST scientists\" So there is dissension even within the scientific community? Even if you were to prove these were impact craters (you haven't) then you still have all your work a head of you: No one has ever observed a meteorite impact (this is what science is, observation) of the size you are talking about so, again, it is only a theory that they would be unsurvivable etc. 3. Vast amount of species. \"Mammoths have been confirmed to have existed. There have been completely frozen, perfect mammoth specimens.\" >Yes, and? They are only a variation (the only observable 'evolution') within a KIND of animal.. the common ancestor of both elephants and mammoths. >I cannot answer questions which ASSUME evolution to be true when there is ZERO evidence that any one KIND of animal has become another. \"b) What evidence do you have of this?\" >Been in a plane lately? look out of the window:the planet is very sparsely populated. e) Are you saying man was that technologically equipt? Also, I mean compete for resources and survival. >Absolutely. f) So we slayed the thousands of different types of confirmed dinousaurs? Sure, good food source as well. g) What evidence do you have that we were around when these diseases were? >What evidence do YOU have we were not? 4. Supervolcanoes (New contention) >UNSCIENTIFIC.\n\nEvidence Con: Evolution. >All of your examples show 'micro evolution', (a horrible and deceptive term) which only means: A certain variation within one kind of animal, proving more successful under certain environmental conditions, survives. This is how the breeding of cattle or pigeons works: Certain attributes (larger, fatter pigs or slimmer , taller pigeons etc) are selected and bred. But, (and here is the crux of the matter) there are limits. No one kind of animal can become another kind. Moreover, there is not a shred of evidence that one kind of animal has ever become another kind. *Please note I am not using the word 'species' but 'kind'. \"Take a look at my evolution evidence. \" >That's the trouble isn't it? It's not yours. You have seen fit to continue to post links rather than show you actually understand the arguments, I will reciprocate BUT it is not strictly debate: \"Natural selections in populations\" >\"micro evolution\" Already refuted. \"Origins of new species\" >Specieation is simply variation within one KIND of animal. \"How scientists study evolution\" >They can only ever study variation within a kind because that is all they have ANY evidence for. \"Take a look at my evolution evidence. Fruit flies, bacteria, viruses, and the peppered tree moth have all been seen to evolve within our lifetimes. We've witnessed it. The acceptance of the evolutionary theory is not a mere assuption, it is well evidenced.\" >Again, you are simply stating that there is variation within KINDS of animals. In order for Evolution (*note capital E: meaning all life forms have developed from a single cell amoeba) There would have to be evidence (and Darwin wrongly predicted there would be) that certain kinds of animals (dogs, cats, bears, horses, lizards etc etc) have become another kind. There is not. Carbon dating. > Big Bang Think about this for a second. You are asking me to believe that NOTHING exploded into the known universe? That time, space and matter instantaneously appeared out of nowhere and that then this matter began arranging ITSELF into complex chemicals etc? Anyone who believes this nonsense has a whole lot more faith than I. \"All of these theories are well evidenced.\" >Science is the study of observable and repeatable (through experimentation) phenomena. Who, pray tell, observed the big bang? ARGUMENTS Grand Canyon \"My source shows that the grand canyon was developed from 2 sides.\" >No, your source assumes that the canyon was created by the water that STILL runs into it from two sides. This is a circular argument. \"How could a flood make a DEEP CANYON in a matter of WEEKS.\" The flood left a gigantic lake above where the canyon now is: As more and more water poured into it, it finally spilled over creating the canyon. The ground would obviously have been very soft. \"Why didn't the flood put canyons everywhere?\" There are many canyons, hence the 'Grand' in the canyon in question. (or what would it be called 'Grand' compared to?) \"As far as noah's flood goes, there is no evidence of that event. Only negative evidence, attacking other theories and pressuming validity as the only standing hypothesis. Even if it happened, I don't understand why it would create the grand canyon. Also, if the Bible is a valid source of evidence, why isn't the Greek, Egyptian, or Native American accounts of earths creation?\" >There are the FACTS: Geological observations. Then there is interpretation of these facts. You have made the mistake of assuming (because the scientific establishment of the day has) that these observations are now part of the facts. They are not. And I have not used or quoted the Bible once. (out of space) I wish to thank my opponent for this debate and all his hard work.\n","DiscussionID":"00000087","Title":"YEC is unlikely","CrawlDate":"2016/09/29 06:00:27","URL":"http://www.debate.org/debates/YEC-is-unlikely/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":109,"nextID":"00000002","PremiseStartPos":[161],"prevID":"00000000","Premise":["Hello everyone. I will accept the burden of proof in this debate since I am Pro and the Instigator. Note that I'm not arguing that YEC is impossible, or didn't even occur. I'm just arguing that it is unlikely. YEC - Young Earth Creationism : The belief that the earth is around 6000 years old unlikely - not likely : improbable Although the burden of proof is on me and my opponent needs to only rebut my arguments, I would like to clarify a few things. When I provide empirical evidence, my opponent find flaws in my evidence WITH evidence. They can't make up hypothetical scenarios stating what COULD have happened, because even though it could have likelihood favors the side with more accurate evidence. I would prefer if my opponent dedicated the first round to making sure we both agree with definitions and procedure, rather then debating. :) Thank you"],"PremiseEndPos":[1021],"ArgumentID":"00000001","Conclusion":"YEC is unlikely","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":109,"nextID":"00000003","PremiseStartPos":[1036],"prevID":"00000001","Premise":["Thank you DATCMOTO for accepting this debate. Good thing we agree on everything. As far as things being hypothetical, I mean unwarranted or unconfimed situations that have no evidence for them. One thing that puzzles me though, I said for YEC to be AROUND 6000 years old. Yet, you say that the earth can't be ANY older than 6000 years. Well, what if it was 6001? Why would it be so unlikely for it to be a year older? Or even a day? Just a thought. Now on to my arguments. 1. Formation of the Grand Canyon. The Grand Canyon was developed from water erosion. There is currently not a known way by water erosion where the Grand Canyon could have formed in 6000 years or less. If water erosion were to work that quickly, there'd be canyons all over the place, and we would see them develop within our lifetimes. Actually, it takes at least 7000 years for the area drained by the Mississippi River to lose only 1 FOOT (12 inches) of altitude. It took the Grand Canyon ATLEAST 5 million years to develop. 2. Impact Craters. Scientists have discovered almost 200 impact craters on Earth. The only natural cause of these craters is a meteor hitting the planet. If all of these craters were to hit the planet within a 6000 year timeline, there is little chance that life would be able to survive because a) the heat and fallout from these meteors would wipe out virtually all life that isn't microscopic . b) the environment would take an extremely long time to clear and we would still see the effects of these bombardments. c) we would have to be able to inhale and see through fallout as the whole planet would be covered in it. d) the planet would be uninhabitable to most lifeforms, especially humans. e) I doubt earth would be a planet, since the force from the meteors could potentially shatter the planet to pieces The Chicxulub Crater (Yucutan Peninsula) alone is 2 million times more powerful than the strongest tested nuclear warhead. Here's the Chicxulub Crater. Heres the nuclear bomb. 3. Vast amount of species. Many species have been confirmed to have roamed the earth. Mammoths alone have been confirmed to be at least 10,000 years old. Also, scientists have confirmed that at least 99% of all species to ever roam the earth are currently extinct. This includes the early marine organisms and eventually dinosaurs. So many questions are set off by this. a) Now, how exactly can you first of all explain the existence and extinction of all of these organisms within a 6000 year period? b) How is there even enough space all of these species to survive? c) Here's what is really interesting: how can man emerge from all of this chaos? d) How come all of these dangerously equipt species suddenly died out, but we didn't? We all know that when man first emerged, there wasn't a lot of technology; we just had sticks and stones. In a way, we were just like any other species. e) How can we compete with, let's say, a raptor? f) Why aren't animals that survived as equipt as dinosaurs? g) Also, how can we survive all of these diseases? The list of questions go on and on. I urge my opponent to answer all of these questions. I also urge a PRO ballot. Thank you. :)"],"PremiseEndPos":[4205],"ArgumentID":"00000002","Conclusion":"YEC is unlikely","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":109,"nextID":"00000004","PremiseStartPos":[4220],"prevID":"00000002","Premise":["Before I start I would like to point out that evolution, carbon dating, and the big bang theory aren't things that have no evidence for them. Also, I would like to point out that since this debate is centered around YEC, it doesn't matter if I think the world is a million or a billion years old. What matters if it was as young as 6000. ARGUMENTS ---------------- 1. Formation of the Grand Canyon You agree it developed from water erosion. I have explained to you that if water erosion worked at a rate to form the Grand Canyon in 6000 years or less, there would be canyons all over the place. The Mississippi River would be thousands of times deeper then it is now. As far as your 'omission argument' goes, you're right that what isn't known isn't evidence. So if there's no known way for the Grand Canyon to form in 6000 years or less, you can't argue that it can with evidence. You say our propositions are only hypotheses and NOT facts. That statement in itself is not fact, because you don't know whether or not our propositions are factual or not. Even if we take your attitude and apply it, it all comes down to evidence. Evidence tells us which is more LIKELY, which is what we are debating. You propose a biblical flood. I'm not saying a flood didn't happen. Though my argument had evidence (many canyons and Mississippi River analogy), what evidence is there to support a flood FORMING the Grand Canyon? My question is how would a flood carve a canyon ( also one that deep?) Also, why wouldn't it create a bunch of canyons besides the grand canyon? 2.. Impact Craters. There are two different types of craters, volcanic and impact. Volcanic craters are caused by the explosion or collapse of a volcano and impact craters are caused by meteors hitting the planet. There are several ways to tell them apart: a) The walls of the site. A volcanic crater would have volcanic rock around it. b) Shape of the site. A lot of volcanic craters don't take the perfect bowl shape of the impact craters and are moreso irregular. c) Impact craters sometimes have remains from the meteor. Now, the 200 craters I mentioned have been recognized as impact craters. Your argument implies that these craters are just as likely to be caused by volcanic activity. However, I have an answer to this. Near a lot of impact craters, tektite glass is found. Tektite is extremely rare, and is so 'dry' that the only known way for it to be formed is from the high temperatures caused by a meteor impact or nuclear bomb (volcanoes aren't hot enough) Yet again I ask for you to answer my previous questions. 3. Vast amount of species. Mammoths have been confirmed to have existed. There have been completely frozen, perfect mammoth specimens. Many other species have been confirmed For my previous questions, please answer a, c, and d. b) What evidence do you have of this? e) Are you saying man was that technologically equipt? Also, I mean compete for resources and survival. f) So we slayed the thousands of different types of confirmed dinousaurs? g) What evidence do you have that we were around when these diseases were? 4. Supervolcanoes (New contention) If all of the confirmed supervolcano eruptions happened within 6000 years, we would still see the effects. Also, consider the likelihood of ALL of this evidence being faulty. I await my opponent's evidence for YEC (supportive, not counterevidence). The resolution is affirmed. Thank you. :)"],"PremiseEndPos":[7653],"ArgumentID":"00000003","Conclusion":"YEC is unlikely","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":109,"nextID":"00000005","PremiseStartPos":[7668],"prevID":"00000003","Premise":["Ok then. I will show you evidence for the following: 1. Evolution Read \"Natural Selection in Populations\", \"Origins of New Species\", and \"How scientists study evolution.\" Take a look at my evolution evidence. Fruit flies, bacteria, viruses, and the peppered tree moth have all been seen to evolve within our lifetimes. We've witnessed it. The acceptance of the evolutionary theory is not a mere assuption, it is well evidenced. 2. Carbon Dating 3. Big Bang All of these theories are well evidenced. ARGUMENTS 1. Grand Canyon My source shows that the grand canyon was developed from 2 sides. a) How could a flood make a DEEP CANYON in a matter of WEEKS. b) Why didn't the flood put canyons everywhere? As far as noah's flood goes, there is no evidence of that event. Only negative evidence, attacking other theories and pressuming validity as the only standing hypothesis. Even if it happened, I don't understand why it would create the grand canyon. Also, if the Bible is a valid source of evidence, why isn't the Greek, Egyptian, or Native American accounts of earths creation? 2. Impact Craters This contention is legit. If those craters were volcanic, they would be composed of volcanic rock. Although a minority of scientists have alternative theories for the formation of tektite, they don't argue against them being formed by impact craters. It is silly to argue that if you haven't seen a meteor hit the earth it didn't happen. While I provide evidence you play the 'you can't be 100% sure' card. Well, when it comes to likelihood the most developed/evidenced theory is the victor. 3. Vast amount of species a) Even if you deny evolution, you can't deny the fossil record and the fact that extinct species existed. Why did they suddenly disappear but we survived? I ask you question 'a' once again. b) It is not that simple. Empty space alone cannot support life; there needs to be resources. My extinction statistic has nothing to do with evolution. If you multiplied the current species that exists by 99, resources would deplete rapidly. c) What are the odds of man defeating it's current competitors times 99 from scratch? You say I assume evolution when you assume YEC. d) This doesn't assume evolution. I ask again, why would dangerously equipt species die out but we survive. e) If we had that technology at the VERY beginning, we should've also had cellphones and computers. Knowledge is not a force; it is developed. f) Rediculous. g) If we were around when 99 times the diseases were around, we would be dead. 4. Supervolcanoes. How is that unscientific? Counterevidence please. BOTTOM LINE The YEC community has been known to blame it's lack of recognition in the scientific community because of discrimination. However, if you go under 'Attitude towards science,' you will see how many scientific fields YEC denies. Also, under 'Criticism' you will see that in a poll, only 5% of professional scientists take a sincere YEC view. However, 40% of them think god guided humans through millions of years of evolvution, while 55% think god took no part. All of the science that disagrees with YEC does not contradict itself. YEC treats it as if it is all assumed and/or, coincidential and counters, but provides no evidence on it's behalf. This is a negative argument and therefore can't be considered valid. All of my opponent's sources were biased from creation science, which is mostly psuedoscience. When it's all said and done, the odds don't stack in YEC's favor. Please vote PRO. Thank you. :)"],"PremiseEndPos":[11183],"ArgumentID":"00000004","Conclusion":"YEC is unlikely","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":109,"nextID":"00000006","PremiseStartPos":[11198],"prevID":"00000004","Premise":["I fully accept the terms and definitions etc. ALTHOUGH I will only be restricted by a word such as 'hypothetical' as far as my opponent allows himself to be restricted by it. My position is that, not only is the Earth 6000 years old , it is highly unlikely for it to be ANY older. May the best man win."],"PremiseEndPos":[11501],"ArgumentID":"00000005","Conclusion":"YEC is unlikely","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":109,"nextID":"00000007","PremiseStartPos":[11516],"prevID":"00000005","Premise":["\"Thank you DATCMOTO for accepting this debate. Good thing we agree on everything. As far as things being hypothetical, I mean unwarranted or unconfimed situations that have no evidence for them.\" >Such as evolution, carbon dating, big bang theory etc do you mean? \"One thing that puzzles me though, I said for YEC to be AROUND 6000 years old. Yet, you say that the earth can't be ANY older than 6000 years. Well, what if it was 6001? Why would it be so unlikely for it to be a year older? Or even a day? Just a thought.\" >Well, as big bang/evolutionists etc work in billions of years, I took it for granted that you'd give me a few hundred years grace either side. 1. Formation of the Grand Canyon. \"The Grand Canyon was developed from water erosion.\" >True, an observable fact. \"There is currently not a known way by water erosion where the Grand Canyon could have formed in 6000 years or less.\" >False. An 'omission argument':What is not known is in no way evidence. The Biblical flood is another, equally valid hypothesis. \"It took the Grand Canyon ATLEAST 5 million years to develop.\" >A hypothesis, NOT fact. >ALSO, The ground level where the canyon ends is HIGHER than where it begins. Do rivers run uphill? 2. Impact Craters. \"Scientists have discovered almost 200 impact craters on Earth. The only natural cause of these craters is a meteor hitting the planet. If all of these craters were to hit the planet within a 6000 year timeline, there is little chance that life would be able to survive because etc etc\" >Again, this is simply another HYPOTHESIS: Fact: Crater like structures exist. Hypothesis (a) They were created by meteorites. Hypothesis (b) They were created by underground eruptions etc: 3. Vast amount of species. \"Many species have been confirmed to have roamed the earth. Mammoths alone have been confirmed to be at least 10,000 years old. Also, scientists have confirmed that at least 99% of all species to ever roam the earth are currently extinct. This includes the early marine organisms and eventually dinosaurs. So many questions are set off by this.\" >None of these things are 'confirmed'.. they are hypothesises. \"a) Now, how exactly can you first of all explain the existence and extinction of all of these organisms within a 6000 year period?\" >This question is non-sensical to me.. you'll have to elaborate. \"b) How is there even enough space all of these species to survive?\" >There is still LOTS of space on this planet, there was a whole Lot MORE before the flood \"c) Here's what is really interesting: how can man emerge from all of this chaos?\" >Now you are assuming an evolutionary perspective (a hypothetical doctrine, another would be that God created man 6000 years ago) \"d) How come all of these dangerously equipt species suddenly died out, but we didn't? We all know that when man first emerged, there wasn't a lot of technology; we just had sticks and stones. In a way, we were just like any other species.\" >Again, you are assuming an evolutionary perspective. \"e) How can we compete with, let's say, a raptor?\" >EASILY. A raptors brain is the size of a walnut. Personally I'd dig a pit with stakes in it and bait it with food. \"f) Why aren't animals that survived as equipt as dinosaurs?\" >Do you know HOW many myths and legends there are about heroes killing dragons? \"g) Also, how can we survive all of these diseases? The list of questions go on and on.\" >We have survived them, whatever your worldview. NEGATED."],"PremiseEndPos":[14983],"ArgumentID":"00000006","Conclusion":"YEC is unlikely","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":109,"nextID":"00000008","PremiseStartPos":[14998],"prevID":"00000006","Premise":["\"Before I start I would like to point out that evolution, carbon dating, and the big bang theory aren't things that have no evidence for them.\" >Then why not produce some evidence? These things are THEORIES, nothing else. \"Also, I would like to point out that since this debate is centered around YEC, it doesn't matter if I think the world is a million or a billion years old. What matters if it was as young as 6000.\" >No, it matters whether YEC is LIKELY or not. Showing your arguments to be without foundation greatly advances those chances. ARGUMENTS \"You agree it developed from water erosion. I have explained to you that if water erosion worked at a rate to form the Grand Canyon in 6000 years or less, there would be canyons all over the place. The Mississippi River would be thousands of times deeper then it is now.\" >Explaining is not proving. Omission (\"there would be canyons\") is NOT an argument. I believe the grand canyon was created in a matter of weeks, not years or millenia. \"As far as your 'omission argument' goes, you're right that what isn't known isn't evidence. So if there's no known way for the Grand Canyon to form in 6000 years or less, you can't argue that it can with evidence.\" >Noah's flood is the known way it occurred. \"You say our propositions are only hypotheses and NOT facts. That statement in itself is not fact, because you don't know whether or not our propositions are factual or not. Even if we take your attitude and apply it, it all comes down to evidence. Evidence tells us which is more LIKELY, which is what we are debating.\" >Sure, and I am waiting for some evidence to refute. You saw fit to post some links to Internet sites so I did the same. But we are no further along are we? \"You propose a biblical flood. I'm not saying a flood didn't happen. Though my argument had evidence (many canyons and Mississippi River analogy), what evidence is there to support a flood FORMING the Grand Canyon? My question is how would a flood carve a canyon ( also one that deep?) Also, why wouldn't it create a bunch of canyons besides the grand canyon?\" >Again, more omission arguments. You have not refuted the one solid argument so far: That the ground at the end of the canyon is 40000feet higher than at it's source Therefore it is impossible for the Colorado river (rivers always run down hill) to have carved that canyon. 2.. Impact Craters. WIKIPEDIA: \"Tektites (from Greek tektos, molten) are natural glass rocks up to a few centimeters in size, which MOST scientists argue were formed by the impact of large meteorites on Earth's surface.\" > \"which MOST scientists\" So there is dissension even within the scientific community? Even if you were to prove these were impact craters (you haven't) then you still have all your work a head of you: No one has ever observed a meteorite impact (this is what science is, observation) of the size you are talking about so, again, it is only a theory that they would be unsurvivable etc. 3. Vast amount of species. \"Mammoths have been confirmed to have existed. There have been completely frozen, perfect mammoth specimens.\" >Yes, and? They are only a variation (the only observable 'evolution') within a KIND of animal.. the common ancestor of both elephants and mammoths. >I cannot answer questions which ASSUME evolution to be true when there is ZERO evidence that any one KIND of animal has become another. \"b) What evidence do you have of this?\" >Been in a plane lately? look out of the window:the planet is very sparsely populated. e) Are you saying man was that technologically equipt? Also, I mean compete for resources and survival. >Absolutely. f) So we slayed the thousands of different types of confirmed dinousaurs? Sure, good food source as well. g) What evidence do you have that we were around when these diseases were? >What evidence do YOU have we were not? 4. Supervolcanoes (New contention) >UNSCIENTIFIC."],"PremiseEndPos":[18913],"ArgumentID":"00000007","Conclusion":"YEC is unlikely","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":94,"ConclusionEndPos":109,"nextID":"00000000","PremiseStartPos":[18928],"prevID":"00000007","Premise":["Evolution. >All of your examples show 'micro evolution', (a horrible and deceptive term) which only means: A certain variation within one kind of animal, proving more successful under certain environmental conditions, survives. This is how the breeding of cattle or pigeons works: Certain attributes (larger, fatter pigs or slimmer , taller pigeons etc) are selected and bred. But, (and here is the crux of the matter) there are limits. No one kind of animal can become another kind. Moreover, there is not a shred of evidence that one kind of animal has ever become another kind. *Please note I am not using the word 'species' but 'kind'. \"Take a look at my evolution evidence. \" >That's the trouble isn't it? It's not yours. You have seen fit to continue to post links rather than show you actually understand the arguments, I will reciprocate BUT it is not strictly debate: \"Natural selections in populations\" >\"micro evolution\" Already refuted. \"Origins of new species\" >Specieation is simply variation within one KIND of animal. \"How scientists study evolution\" >They can only ever study variation within a kind because that is all they have ANY evidence for. \"Take a look at my evolution evidence. Fruit flies, bacteria, viruses, and the peppered tree moth have all been seen to evolve within our lifetimes. We've witnessed it. The acceptance of the evolutionary theory is not a mere assuption, it is well evidenced.\" >Again, you are simply stating that there is variation within KINDS of animals. In order for Evolution (*note capital E: meaning all life forms have developed from a single cell amoeba) There would have to be evidence (and Darwin wrongly predicted there would be) that certain kinds of animals (dogs, cats, bears, horses, lizards etc etc) have become another kind. There is not. Carbon dating. > Big Bang Think about this for a second. You are asking me to believe that NOTHING exploded into the known universe? That time, space and matter instantaneously appeared out of nowhere and that then this matter began arranging ITSELF into complex chemicals etc? Anyone who believes this nonsense has a whole lot more faith than I. \"All of these theories are well evidenced.\" >Science is the study of observable and repeatable (through experimentation) phenomena. Who, pray tell, observed the big bang? ARGUMENTS Grand Canyon \"My source shows that the grand canyon was developed from 2 sides.\" >No, your source assumes that the canyon was created by the water that STILL runs into it from two sides. This is a circular argument. \"How could a flood make a DEEP CANYON in a matter of WEEKS.\" The flood left a gigantic lake above where the canyon now is: As more and more water poured into it, it finally spilled over creating the canyon. The ground would obviously have been very soft. \"Why didn't the flood put canyons everywhere?\" There are many canyons, hence the 'Grand' in the canyon in question. (or what would it be called 'Grand' compared to?) \"As far as noah's flood goes, there is no evidence of that event. Only negative evidence, attacking other theories and pressuming validity as the only standing hypothesis. Even if it happened, I don't understand why it would create the grand canyon. Also, if the Bible is a valid source of evidence, why isn't the Greek, Egyptian, or Native American accounts of earths creation?\" >There are the FACTS: Geological observations. Then there is interpretation of these facts. You have made the mistake of assuming (because the scientific establishment of the day has) that these observations are now part of the facts. They are not. And I have not used or quoted the Bible once. (out of space) I wish to thank my opponent for this debate and all his hard work."],"PremiseEndPos":[22653],"ArgumentID":"00000008","Conclusion":"YEC is unlikely","PremiseStance":["Con"]}}]}