{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-Federal-Reserve-Bank-of-the-United-States-ought-to-be-abolished/1/\nCrawl date: 2016/09/29 06:10:28\nDebate Argument: The Federal Reserve Bank of the United States ought to be abolished | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: I would like to ask my opponent what his definition of price stability is. It seems like all the Federal Reserve does is increase the money supply, which in turn causes inflation, and then makes the prices of goods appear to go up. Inflation and the Federal Reserve The Federal Reserve is the main cause for inflation in the United States. Inflation comes from growths in the money supply. Economists generally agree that high rates of inflation and hyperinflation are caused by an excessive growth of the money supply.[6] –Wikipedia \"The U.S. government has a technology, called a printing press (or, today, its electronic equivalent), that allows it to produce as many U.S. dollars as it wishes.\" So spoke Federal Reserve Governor Benjamin Bernanke in 2002, prior to becoming the central bank's presiding chairman during the credit crisis and stock market crash of 2008. They do this by creating money from nothing. This money is then pumped into the economy and dilutes the currency. This causes prices to appear to go up. Prices don’t really go up because the ways goods are produced stay the same. It just takes more money to produce the goods because of inflation. Inflation is also a tax. It is our most unfair tax. I really hate explaining this because its time consuming, so I'm just going to let Ron Paul do it for me. It’s a quick video, don’t worry. The Federal Reserve maintaining the economy “The Federal Reserve Bank can provide economically useful counter-cyclical policies that could not happen under a gold standard or free banking system. Sudden reductions in the quantity or velocity of money due to various events in an economy can, without justification, cause output to fall, unemployment to rise, and consequently overall happiness to decrease. By expanding the monetary base through the printing press, the Federal reserve can offset the contractionary effects of such events.” Can it? I don’t think I have ever heard of that happening. One of the things that my opponent describes is bank runs. Bank runs are a self-fulfilling prophecy of a bank going out of business because people believe it will go out of business. This was the main cause of the Great Depression. And in fact, the Federal Reserve was created before the Great Depression. It did not maintain the economy. And there have been countless other recessions and depressions since then. Many of them were caused by similar problems. My point is that the Federal Reserve does not maintain stability in the economy. Its main function it seems, is to dilute the value of the dollar. It taxes us beyond our control and it actually destabilizes the economy.\n\nEvidence Pro: I want to give credit to my opponent for arguing many sides to the argument. There is not always one side to every story which my opponent takes into account. My opponents statements about the different types of prices are completely true. And yes, on that last sentence, I did not word it properly, but that's what I meant. On Inflation \" However, how does the Federal Reserve buying securities from banks, who then simply hoard the cash in their vaults because of the market interest rate (I will explain the zero lower-bound if challenged) cause consumers to be unable to buy as much output?\" Your argument is false. Only recently has the FED started to keep its money in reserves. This has only been in effect since the new QE2 has gone into effect. And that also has major problems with running up the nations debt. Also this has not decreased the nations money supply. in fact, it is still increasing. So no, inflation is still a tax because the government receives the lost purchasing power of the people, and it is still happening. style=\"font-size: small;\">And, no that is false. Inflation is a regressive tax. This isn't the first time this has happened. This started in Europe with their central banks hundreds of years ago. They realized they could only tax the people so much until they had a revolt on their hands. They figured out that the natural tax ceiling was about 44-48% They then created a central bank and were able to take in, at some points in time, up to 80% in taxes. And about a 3-4% inflation rate helping the poor. I really don't know where you got this information. If you could cite resources, it would be very helpful. And I had not heard of the FED coming in to help in 1986. But, even still, these kind of economic crashes are natural in every government. My main argument, is that the FED does more harm than good, not to mention the corruption that occurs within it. It still dilutes the worth of our dollar. Sources style=\"font-size: small;\"> href=\" target=\"blank\">\n\nEvidence Pro: \"It was more an honest question. How DOES Quantitative easing increase inflation when such money, we know, does not create aggregate demand?\" I see. Well, this is how. If the nominal interest rate is at or very near zero, the central bank cannot lower it further. Such a situation, called a liquidity trap,[20] can occur, for example, during deflation or when inflation is very low.[21] In such a situation, the central bank may perform quantitative easing by purchasing a pre-determined amount of bonds or other assets from financial institutions without reference to the interest rate.[5][22] The goal of this policy is to increase the money supply rather than to decrease the interest rate, which cannot be decreased further.[23] This is often considered a \"last resort\" to stimulate the economy.[24][25] -Wikipedia And it is not a good idea to stimulate the economy by just throwing more money into it. It never works. Which is a major flaw in Keynesian economics. \"Once again, the overwhelming vast majority of our government's spending comes from either taxes or borrowing through the bond markets. Seigniorage can be calculated by taking the amount of money that the government borrows over a certain amount of time and reducing it by the inflation rate over that period of time. Inflation, because it has been incredibly low, and actually negative when you look at the period of 2009-2012, has not reduced real bond yields on treasury bills. \" Well, actually, inflation is not low, and its definitely not negative. The government says it is at 3.1%. But the formula they use to calculate it is by using products that people rarely buy, like cars, and houses. This formula is called the CPI (Consumer Price Index), and its basically a load of crap. The real inflation rate is actually above a whopping 8%. This includes all products that you buy everyday like milk and cereal. This formula is called the EPI (Everyday Price Index) I’m sure you and I agree that the government always has a way of making things look better than they are… And, there’s really no way of telling whether Congress taxes more than the FED because there’s no real straight story on how much the FED creates a year, and there’s also not a straight story on how much the government receives in taxes per year. Also the FED creates money depending on the economy. In 2008, the FED gave the government 7.7 trillion dollars for the bailout. And that was in secret. That is way more than the government takes in with taxes, which from what I’ve seen, averages around 2 trillion a year. There is really no way of telling how much money they pump into the economy. But another problem is that the government spends way more than it takes in. The Federal Reserve creates most of its money from debt. This means that our money is basically backed by debt. This creates a false prosperity from government. It might seem good at some points, but that’s only because all of this money is just credit. Bad credit. I'm sorry but where are you getting this information from? Nothing that involves debt with our government is negative, because then we not be able to produce any money whatsoever. And the reason that Austrian economics sometimes use examples from hundreds and hundreds of thousands of years ago, is because, there’s only so many variations of government. Throughout time, governments have functioned pretty much the exact same way. And its not like Austrians are the only one to do this. Every school of thought has to base its knowledge from somewhere, and most of the time, its from hundreds of years ago. Sources\n\nEvidence Pro: Okay, well it seems we are getting off topic here and I really don't want to go into Keynesian or Austrian economics. That's for another time. Lets stick to the FED. \"1: The Federal Reserve bank is necessary to maintaining price stability. I will explain further if challenged, but prices convey vital information to producers, consumers, workers, and investors in an economy. Sudden and/or unexpected changes in the overall level of prices can have adverse effects on national output by changing the terms of trade. A central, independent monetary authority, like the Federal Reserve, can help to maintain price stability that cannot happen either under a Gold Standard or under a free-banking system. \" This was your main point. The problem with this statement is that Gold Standard economies don't require the need to be stabilized. Gold's price has pretty much stayed the same since Roman times (that's mostly where Austrian economics brings in ancient times; this subject) Up until 1914, (the time of the elastic currency's creation) the price of gold had stayed effectively the same price since Isaac Newton, as master of the UK Mint, set the price of it in 1717. And no, it couldn't happen in a free market because that doesn't happen at all. Businesses go under, and then a better business takes its place. Certain businesses aren't supposed to stay in existence forever because they're \"too big to fail.\" Obviously they failed, so they were doing something wrong. Take General Motors for example. People weren't buying cars from General Motors. Mostly because people had been buying Asian cars like Nissan, Honda ect. For years, General Motors had been reducing the quality on their vehicles. People started buying Asian cars because of their quality and price. So when General Motors goes under, the government decides to try and prop them up by pumping money into the economy and giving General Motors bailout money. People weren't buying the cars before, so even if they had more money to buy them, they're still not going to go buy them. In the free market, that company would have gone out of business, and something better would have taken its place. And the economy would go on happily ever after. But for some reason, the government believes they know what's best for us. These brains up their in Congress know more than everyone else, so regular citizens can't be trusted with freedom. Yeah, that's pretty much it. Now that I have explained that, let me explain that the FED does more harm than good. The FED creates money from buying up our debt. This is basically counterfeiting! I know, its crazy, right!? No other business can counterfeit money, but the government can. The government is a monopoly on force. The FED buys treasury bonds (basically IOU's) and creates money from it. It also has other assets, like buying up debt of other countries. (The Federal Reserve Act has been amended 200 times, they can do create money from anything) So, excluding the fact that we counterfeit trillions of dollars and then let the government go wild with it, this new money causes inflation. So I will humor my opponent (and take out all those big words) and say that a little bit of inflation helps the poor. Oh but wait a minute, the poor don't really have enough money to spend in the first place, so somehow making the prices go up, allows them to spend more. Yeah, I don't know about that. Isn't that basically the same thing FDR did by forcing business to sell goods for a certain price? Oh yeah, it was, and the Great Depression lasted 11 years because of it. (Most depressions last 4) By the way, those IRS and FED balance sheets have a lot of stuff missing. And yeah, they pumped 7.77 trillion into the economy during the bailout, and they also shot some money over to Europe for awhile. You're right, I misspoke when I said they gave it to the government directly, but they gave it to banks. The banks now have 7.77 trillion dollars to give loans on. So now, they're receiving interest on money that comes from nothing and making inflation rise. Maybe Bernanke is just terrible with math. I don't know. And I said \"was\" in secret. Bernanke also can't keep his mouth shut. And my opponent argues that this EPI index is flawed, unlike the CPI because of outside factors with supply. So wouldn't things like cars and houses, which the CPI only takes into account, also be affected by supply factors? Everything has to be produced. Increases in the price of gas affects how machines that create cars are made. So, I don't see how this EPI could be too terribly flawed, only a more reliable source. High or unpredictable inflation rates are regarded as harmful to an overall economy. They add inefficiencies in the market, and make it difficult for companies to budget or plan long-term. Inflation can act as a drag on productivity as companies are forced to shift resources away from products and services in order to focus on profit and losses from currency inflation.[11] Uncertainty about the future purchasing power of money discourages investment and saving.[30] And inflation can impose hidden tax increases, as inflated earnings push taxpayers into higher income tax rates unless the tax brackets are indexed to inflation. -Wikipedia So apparently I'm not the only one who thinks inflation is a bad thing. It seems Wikipedia agrees with me. And since 1913, the value of our dollar has decreased and inflation has risen over 2000% But, gold stays the same for 200 years! Wow, that's crazy. And since its limited unlike paper, inflation barely even occurs. Plus our government really shouldn't be spending as much money as it does in the first place, seeing the ridiculous things our government pays for. And yeah, dude, REALLY! Keynes himself died in 1946. I don't think he was using data points from the 1970's. I'm thinking even he had to use some data points from a good number of years back, when many policies we have today were not around. The FED creates inflation through basically counterfeiting money and then either shoving it into the banks, or giving it to the government and letting them pump it into the economy somehow. Inflation, overall, is a negative factor in an economy. It destabilizes the economy. Also, when a recession occurs, pumping money into it doesn't always fix it. Even with money, people will still not buy from the businesses the government tries to prop up, such as General Motors. Businesses are not supposed to stay in existence forever because they're \"too big to fail\" In a free market, that business would go under, and a better business would take its place. So, main points. The FED destabilizes the economy through inflation. The FED disrupts the market by propping up businesses that, in a free market, would normally go out of business and something else would replace it. The FED creates our most unfair tax through inflation. Prices rise, and people have to pay for those increased prices. The lost purchasing power is received by the government. (Bernanke even said it was a tax.) The FED rarely prevents economic crashes. (I say this because my opponent did bring up one incident where the FED supposedly did this. I really don't know if this is true or not. The FED dilutes our currency and the decreases the value of the dollar.\n\nEvidence Con: I have 2 main contentions against the proposition that the Federal Reserve should be abolished 1: The Federal Reserve bank is necessary to maintaining price stability. I will explain further if challenged, but prices convey vital information to producers, consumers, workers, and investors in an economy. Sudden and/or unexpected changes in the overall level of prices can have adverse effects on national output by changing the terms of trade. A central, independent monetary authority, like the Federal Reserve, can help to maintain price stability that cannot happen either under a Gold Standard or under a free-banking system. 2: The Federal Reserve Bank can provide economically useful counter-cyclical policies that could not happen under a gold standard or free banking system. Sudden reductions in the quantity or velocity of money due to various events in an economy can, without justification, cause output to fall, unemployment to rise, and consequently overall happiness to decrease. By expanding the monetary base through the printing press, the Federal reserve can offset the contractionary effects of such events.\n\nEvidence Con: In responding, point by point, to the criticisms by my opponent, I shall expound further upon my contentions as well. Let's begin \"I would like to ask my opponent what his definition of price stability is.\" Price stability describes a long-run trend in prices throughout an economy to not experience unexpected, or volatile, inflation or deflation. Price stability absolutely does not necessarily imply that prices do not change at all. The allocative effects of a monetary regime where prices do not change at all are not different from the effects of a monetary regime where prices constantly rise by 2% every year. \"It seems like all the Federal Reserve does is increase the money supply, which in turn causes inflation, and then makes the prices of goods appear to go up.\" There are two kinds of prices in economics, and I think that my opponent deserves some credit for keeping this in mind. There are nominal prices, which are the actual dollar figure that appear on goods and services at the point of sale, and there are relative prices, which are the real prices, or the prices relative to other goods and services. The price of, say, cars has skyrocketed since 1924, but relative to most other goods and services, such as the labor he or I sell to our employers, the prices of cars have fallen, assuming quality parity (A car that you could get 75,000 miles out of at most today before junking it is much better than a new car in 1924, which could never get 75,000 miles before junking) This is the importance of prices. They convey certain vital information to producers, consumers, workers, and investors, and that information is a quick assessment of the economic cost, which is the cost of the next-best alternative use of that resource. Imagine I have a choice of two mutual funds, one to build a hydroelectric dam, and another to build a computer factory, and the one building a hydroelectric dam promises to offer a 5% return on my investment over the next 10 years. That information isn't useful unless I know the price of hte next-best foregone alternative, which is the computer factory investment. Similarly, I don't know how much my labor is actually worth at McDonalds if I don't know the price my labor can fetch at the next best alternative workplace. This information, conveyed in prices, allows everyone to make economic decisions which maximize their welfare. \"They do this by creating money from nothing. This money is then pumped into the economy and dilutes the currency. This causes prices to appear to go up. Prices don’t really go up because the ways goods are produced stay the same. It just takes more money to produce the goods because of inflation.\" Having informed his readers of the classical dichotomy between real and nominal factors, my opponent appears to confuse the two in the last sentence. Inflation does not make it more difficult to produce goods by making nominal prices rise. A layperson might forgivably think that, since a brand new car cost roughly 500$ in 1929, but almost $20,000 today, that it is therefore 40 times harder to buy that car today than in 1929. An economist would say, however, that the price of the good that the layperson sells in order to buy that car, his labour, has risen by an even higher amount than the price that the car has risen. One could say that had prices not risen, it would still be easier, but if overall prices throughout the economy had not risen, then the price of the labor that he sells in order to pay for the car would not have risen either, and it would be no easier to buy that car. \"Inflation is also a tax. It is our most unfair tax. I really hate explaining this because its time consuming, so I'm just going to let Ron Paul do it for me. It’s a quick video, don’t worry.\" This is probably one of the most misunderstood concepts in macroeconomics, and I assign every ounce of blame for that to Ron Paul. Inflation is only a tax if said inflation actually takes away output that can be purchased by consumers and gives that ability to investors and the government. Now it is true that some of our government spending is, effectively, funded by seigniorage, or the printing of money in place of taxes, but this is peanuts compared to the actual tax take of the United States Government. However, how does the Federal Reserve buying securities from banks, who then simply hoard the cash in their vaults because of the market interest rate (I will explain the zero lower-bound if challenged) cause consumers to be unable to buy as much output? Ron Paul never explains this, and for that reason alone this argument does not carry. However, there are good reasons to think that, rather than a tax on the poor, a moderate (3-4%) inflation target would help the poor. I hesitate to argue this because there is contradictory evidence on the distribution of income between wages and yields to capital. However, for now, I will say this, Some evidence indicates that the ratio of labor incomes to capital incomes has remained steady at about .7 for hte past 40 years, which indicates that inflation has not created a \"regressive tax.\" There is, however, some evidence, based on the possibly-widening gap between labour productivity and total labor compensation that the low-inflation regime created by Paul Volcker has redistributed income from workers to investors. This gap, however, only appeared after Paul Volcker, and did not occur when the Federal Reserve had a high inflation target between the 1950s and the 1970s. Once again, I hesitate to argue this because, depending on what source you use, or even when you use one source (Paul Krugman now thinks that the gap between worker productivity and wage income has grown in the past 40 years today, however in his 1996 paper \"Ricardo's Difficult Idea\", when he was still a neo-liberal defending NAFTA against cooks and cranks like Ross Perot, he showed that the evidence which indicates such a gap is very poorly used.), you will get different answers. \"Can it? I don’t think I have ever heard of that happening.\" Sure it can. In 1986 there was a massive plunge in the stock market amid the savings and loan crisis. Ordinarily this would have caused a massive decline in investment spending and, consequently, a recession, but the Federal Reserve turned on the printing presses and flooded the market with liquidity, ensuring that the 1980s economic expansion would continue on. \"And in fact, the Federal Reserve was created before the Great Depression. It did not maintain the economy.\" Notice that my contention was \"can provide economically useful counter-cyclical policy\", not that it always does. There are examples, for instance in 1921 and 1933, of the Federal Reserve reneging on its authority to act as a lender of last resort in the event of a downturn in the economy, but that simply does not mean that these crises would not have happened if we didn't have a Federal Reserve.\n\nEvidence Con: \" Your argument is false.\" It was more an honest question. How DOES Quantitative easing increase inflation when such money, we know, does not create aggregate demand? \"And that also has major problems with running up the nations debt.\" What exactly are those problems? We've seen, in the case of Japan and Britain, that despite far larger debt/GDP ratios, they were and are still able to borrow at record low costs. In fact, despite our current debt/GDP ratio being over 100%, short-term borrowing costs for the United States Federal Government are negative. \"So no, inflation is still a tax because the government receives the lost purchasing power of the people, and it is still happening.\" Once again, the overwhelming vast majority of our government's spending comes from either taxes or borrowing through the bond markets. Seigniorage can be calculated by taking the amount of money that the government borrows over a certain amount of time and reducing it by the inflation rate over that period of time. Inflation, because it has been incredibly low, and actually negative when you look at the period of 2009-2012, has not reduced real bond yields on treasury bills. \"Inflation is a regressive tax.\" Once again, how? The simple fact is, with the exception of people who are living on pension funds and zero-interest cash, poor people and people on fixed incomes live on incomes which are indexed to inflation. The former groups comprise a tiny minority. The overwhelming majority of people in our nation are debtors, and unexpected inflation redistributes wealth to them from creditors. Because prices do not adjust in the short run, this gives money from people who have a low propensity to consume (they are savers, after all) to people who have a high propensity to consume (that's why they're in debt in the first place). This increases national income in the short run. \"This started in Europe with their central banks hundreds of years ago.\" Why is it that opponents of Keynesian economics, like Austrians, and other heterodox economists and economic historians usually resort to data points which are hundreds, in the case of Ron Paul, thousands of years old? Economists and Econometricians use recent data (the last 40 years) in building their models and telling their stories because we actually have data on important macroeconomic variables from the very recent past. We have no data on the monetary base, real rates of interest, inflation rates, trade volumes, capital markets, etc. from the time of the Romans, so it's useless to actually use that data to build an economic model. \"And about a 3-4% inflation rate helping the poor. I really don't know where you got this information. If you could cite resources, it would be very helpful. \" Economist and former chairman of the Council of Economic Advisers under George W. Bush N. Gregory Mankiw explains, on pg. 106, that moderate inflation can help to reduce unemployment in the labour markets by making workers more likely to accept real wage cuts. If workers are in a field that is the only one to make use of their skills, and if said field is dying, then workers are less likely to quit their jobs. This increases national income and reduces unemployment, which, unarguably, hurts the poor more than the rich or middle class. \"My main argument, is that the FED does more harm than good\" We have not seen this demonstrated.\n\nEvidence Con: \"And it is not a good idea to stimulate the economy by just throwing more money into it. It never works. Which is a major flaw in Keynesian economics.\" That is an incredibly broad and sweeping claim. You're not going to convince anyone here, no matter how fanatically-devoted to Ron Paul they are, that Keynesian economics is wrong by dismissing out of hand their monetary prescriptions. The empirical evidence (unemployment in all sectors and yet very little change in nominal wages shows that sticky prices and wages, combined with a fall in investment and consumption spending are responsible for our woes) shows, strongly, that the recession was caused by a fall in aggregate demand, which was caused by a fall in investment spending thanks to the financial sector. Now it is true that short-term interest rates are close to zero, but long-term interest rates are not. 10-year treasury bonds currently 2%, which means that monetary stimulus, if the Fed can convince the bond markets that it will aim for a larger inflation target (say 4% instead of the usual 2%) can work even when short-term quantitative easing can't. \"The government says it is at 3.1%.\" There are several measures of inflation, the CPI being one among many. There's the GDP deflator, which shows strong deflation since 2008, there's the employment cost index, the fisher index, the billion price index, etc. which show that, since 2008, prices have fallen. \"But the formula they use to calculate it is by using products that people rarely buy, like cars, and houses.\" And so what if an individual does not buy cars or houses very often? Millions are being sold every year, and the quantity and velocity of money will be reflected in the prices that are charged for such services. \"The real inflation rate is actually above a whopping 8%. This includes all products that you buy everyday like milk and cereal. This formula is called the EPI (Everyday Price Index)\" The so-called EPI is fatally flawed, especially when using it to judge monetary policy, because the factors which are responsible for the increases in the price of gas (and, thus, food) are real supply side factors, not demand-side factors in America. \"And, there’s really no way of telling whether Congress taxes more than the FED because there’s no real straight story on how much the FED creates a year\" You can check the Fed balance sheet any time. \"and there’s also not a straight story on how much the government receives in taxes per year.\" The IRS publishes the amount it collects in taxes every year. \"Also the FED creates money depending on the economy. Of course it does. That's how the FOMC works. It sets a short-term interest rate target by buying or selling assets on the open market. When the interest rate is below the target rate, the FOMC sells assets, the most popular being short-term treasury bonds. If interest rates are too high, the federal reserve buys assets. \"In 2008, the FED gave the government 7.7 trillion dollars for the bailout.\" Eh, no. The Federal Reserve loaned several trillion dollars to private investment banks and other depository institutions and other central banks. It didn't give money to the federal government. \"And that was in secret.\" Then how do you know about it? \"That is way more than the government takes in with taxes, which from what I’ve seen, averages around 2 trillion a year. There is really no way of telling how much money they pump into the economy.\" Again, the Federal Reserve injects money into the economy by buying assets. Loans are last-resort by banks. \" But another problem is that the government spends way more than it takes in. The Federal Reserve creates most of its money from debt.\" Sure, most of the assets that the Federal Reserve buys are treasury bonds, but it has also bought other assets. \" This means that our money is basically backed by debt.\" We do not have a fixed exchange rate monetary policy, which means that our money isn't backed by anything. Money is just a convenient, universal medium of exchange. But treasury bills are an asset. You really can have treasury bills in your portfolio and then sell them and use the money to buy stuff, as in output. Money really does create output in the economy. \" It might seem good at some points, but that’s only because all of this money is just credit. Bad credit.\" That doesn't follow at all. \"And the reason that Austrian economics sometimes use examples from hundreds and hundreds of thousands of years ago, is because, there’s only so many variations of government.\" That definitely does not follow at all. Variations of government, therefore we need to use data points which are hundreds of years old and shrouded in obscurity? You're seriously going to tell me that inflation caused the downfall of the Roman Empire when we have absolutely no GDP figures with which to tell our stories? The Byzantines didn't have an IRS or Bureau of Labour Statistics. \"Every school of thought has to base its knowledge from somewhere, and most of the time, its from hundreds of years ago.\" Really? You're REALLY going to claim that every school, even the Neo-Keynesian school's models are based on data points which are hundreds of years old? You really think that Keynesian econometricians use data from the recent past?\n","DiscussionID":"00000117","Title":"The Federal Reserve Bank of the United States ought to be abolished","CrawlDate":"2016/09/29 06:10:28","URL":"http://www.debate.org/debates/The-Federal-Reserve-Bank-of-the-United-States-ought-to-be-abolished/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":222,"nextID":"00000002","PremiseStartPos":[274],"prevID":"00000000","Premise":["I would like to ask my opponent what his definition of price stability is. It seems like all the Federal Reserve does is increase the money supply, which in turn causes inflation, and then makes the prices of goods appear to go up. Inflation and the Federal Reserve The Federal Reserve is the main cause for inflation in the United States. Inflation comes from growths in the money supply. Economists generally agree that high rates of inflation and hyperinflation are caused by an excessive growth of the money supply.[6] –Wikipedia \"The U.S. government has a technology, called a printing press (or, today, its electronic equivalent), that allows it to produce as many U.S. dollars as it wishes.\" So spoke Federal Reserve Governor Benjamin Bernanke in 2002, prior to becoming the central bank's presiding chairman during the credit crisis and stock market crash of 2008. They do this by creating money from nothing. This money is then pumped into the economy and dilutes the currency. This causes prices to appear to go up. Prices don’t really go up because the ways goods are produced stay the same. It just takes more money to produce the goods because of inflation. Inflation is also a tax. It is our most unfair tax. I really hate explaining this because its time consuming, so I'm just going to let Ron Paul do it for me. It’s a quick video, don’t worry. The Federal Reserve maintaining the economy “The Federal Reserve Bank can provide economically useful counter-cyclical policies that could not happen under a gold standard or free banking system. Sudden reductions in the quantity or velocity of money due to various events in an economy can, without justification, cause output to fall, unemployment to rise, and consequently overall happiness to decrease. By expanding the monetary base through the printing press, the Federal reserve can offset the contractionary effects of such events.” Can it? I don’t think I have ever heard of that happening. One of the things that my opponent describes is bank runs. Bank runs are a self-fulfilling prophecy of a bank going out of business because people believe it will go out of business. This was the main cause of the Great Depression. And in fact, the Federal Reserve was created before the Great Depression. It did not maintain the economy. And there have been countless other recessions and depressions since then. Many of them were caused by similar problems. My point is that the Federal Reserve does not maintain stability in the economy. Its main function it seems, is to dilute the value of the dollar. It taxes us beyond our control and it actually destabilizes the economy."],"PremiseEndPos":[2916],"ArgumentID":"00000001","Conclusion":"The Federal Reserve Bank of the United States ought to be abolished","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":222,"nextID":"00000003","PremiseStartPos":[2931],"prevID":"00000001","Premise":["I want to give credit to my opponent for arguing many sides to the argument. There is not always one side to every story which my opponent takes into account. My opponents statements about the different types of prices are completely true. And yes, on that last sentence, I did not word it properly, but that's what I meant. On Inflation \" However, how does the Federal Reserve buying securities from banks, who then simply hoard the cash in their vaults because of the market interest rate (I will explain the zero lower-bound if challenged) cause consumers to be unable to buy as much output?\" Your argument is false. Only recently has the FED started to keep its money in reserves. This has only been in effect since the new QE2 has gone into effect. And that also has major problems with running up the nations debt. Also this has not decreased the nations money supply. in fact, it is still increasing. So no, inflation is still a tax because the government receives the lost purchasing power of the people, and it is still happening. style=\"font-size: small;\">And, no that is false. Inflation is a regressive tax. This isn't the first time this has happened. This started in Europe with their central banks hundreds of years ago. They realized they could only tax the people so much until they had a revolt on their hands. They figured out that the natural tax ceiling was about 44-48% They then created a central bank and were able to take in, at some points in time, up to 80% in taxes. And about a 3-4% inflation rate helping the poor. I really don't know where you got this information. If you could cite resources, it would be very helpful. And I had not heard of the FED coming in to help in 1986. But, even still, these kind of economic crashes are natural in every government. My main argument, is that the FED does more harm than good, not to mention the corruption that occurs within it. It still dilutes the worth of our dollar. Sources style=\"font-size: small;\"> href=\" target=\"blank\">"],"PremiseEndPos":[4935],"ArgumentID":"00000002","Conclusion":"The Federal Reserve Bank of the United States ought to be abolished","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":222,"nextID":"00000004","PremiseStartPos":[4950],"prevID":"00000002","Premise":["\"It was more an honest question. How DOES Quantitative easing increase inflation when such money, we know, does not create aggregate demand?\" I see. Well, this is how. If the nominal interest rate is at or very near zero, the central bank cannot lower it further. Such a situation, called a liquidity trap,[20] can occur, for example, during deflation or when inflation is very low.[21] In such a situation, the central bank may perform quantitative easing by purchasing a pre-determined amount of bonds or other assets from financial institutions without reference to the interest rate.[5][22] The goal of this policy is to increase the money supply rather than to decrease the interest rate, which cannot be decreased further.[23] This is often considered a \"last resort\" to stimulate the economy.[24][25] -Wikipedia And it is not a good idea to stimulate the economy by just throwing more money into it. It never works. Which is a major flaw in Keynesian economics. \"Once again, the overwhelming vast majority of our government's spending comes from either taxes or borrowing through the bond markets. Seigniorage can be calculated by taking the amount of money that the government borrows over a certain amount of time and reducing it by the inflation rate over that period of time. Inflation, because it has been incredibly low, and actually negative when you look at the period of 2009-2012, has not reduced real bond yields on treasury bills. \" Well, actually, inflation is not low, and its definitely not negative. The government says it is at 3.1%. But the formula they use to calculate it is by using products that people rarely buy, like cars, and houses. This formula is called the CPI (Consumer Price Index), and its basically a load of crap. The real inflation rate is actually above a whopping 8%. This includes all products that you buy everyday like milk and cereal. This formula is called the EPI (Everyday Price Index) I’m sure you and I agree that the government always has a way of making things look better than they are… And, there’s really no way of telling whether Congress taxes more than the FED because there’s no real straight story on how much the FED creates a year, and there’s also not a straight story on how much the government receives in taxes per year. Also the FED creates money depending on the economy. In 2008, the FED gave the government 7.7 trillion dollars for the bailout. And that was in secret. That is way more than the government takes in with taxes, which from what I’ve seen, averages around 2 trillion a year. There is really no way of telling how much money they pump into the economy. But another problem is that the government spends way more than it takes in. The Federal Reserve creates most of its money from debt. This means that our money is basically backed by debt. This creates a false prosperity from government. It might seem good at some points, but that’s only because all of this money is just credit. Bad credit. I'm sorry but where are you getting this information from? Nothing that involves debt with our government is negative, because then we not be able to produce any money whatsoever. And the reason that Austrian economics sometimes use examples from hundreds and hundreds of thousands of years ago, is because, there’s only so many variations of government. Throughout time, governments have functioned pretty much the exact same way. And its not like Austrians are the only one to do this. Every school of thought has to base its knowledge from somewhere, and most of the time, its from hundreds of years ago. Sources"],"PremiseEndPos":[8549],"ArgumentID":"00000003","Conclusion":"The Federal Reserve Bank of the United States ought to be abolished","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":222,"nextID":"00000005","PremiseStartPos":[8564],"prevID":"00000003","Premise":["Okay, well it seems we are getting off topic here and I really don't want to go into Keynesian or Austrian economics. That's for another time. Lets stick to the FED. \"1: The Federal Reserve bank is necessary to maintaining price stability. I will explain further if challenged, but prices convey vital information to producers, consumers, workers, and investors in an economy. Sudden and/or unexpected changes in the overall level of prices can have adverse effects on national output by changing the terms of trade. A central, independent monetary authority, like the Federal Reserve, can help to maintain price stability that cannot happen either under a Gold Standard or under a free-banking system. \" This was your main point. The problem with this statement is that Gold Standard economies don't require the need to be stabilized. Gold's price has pretty much stayed the same since Roman times (that's mostly where Austrian economics brings in ancient times; this subject) Up until 1914, (the time of the elastic currency's creation) the price of gold had stayed effectively the same price since Isaac Newton, as master of the UK Mint, set the price of it in 1717. And no, it couldn't happen in a free market because that doesn't happen at all. Businesses go under, and then a better business takes its place. Certain businesses aren't supposed to stay in existence forever because they're \"too big to fail.\" Obviously they failed, so they were doing something wrong. Take General Motors for example. People weren't buying cars from General Motors. Mostly because people had been buying Asian cars like Nissan, Honda ect. For years, General Motors had been reducing the quality on their vehicles. People started buying Asian cars because of their quality and price. So when General Motors goes under, the government decides to try and prop them up by pumping money into the economy and giving General Motors bailout money. People weren't buying the cars before, so even if they had more money to buy them, they're still not going to go buy them. In the free market, that company would have gone out of business, and something better would have taken its place. And the economy would go on happily ever after. But for some reason, the government believes they know what's best for us. These brains up their in Congress know more than everyone else, so regular citizens can't be trusted with freedom. Yeah, that's pretty much it. Now that I have explained that, let me explain that the FED does more harm than good. The FED creates money from buying up our debt. This is basically counterfeiting! I know, its crazy, right!? No other business can counterfeit money, but the government can. The government is a monopoly on force. The FED buys treasury bonds (basically IOU's) and creates money from it. It also has other assets, like buying up debt of other countries. (The Federal Reserve Act has been amended 200 times, they can do create money from anything) So, excluding the fact that we counterfeit trillions of dollars and then let the government go wild with it, this new money causes inflation. So I will humor my opponent (and take out all those big words) and say that a little bit of inflation helps the poor. Oh but wait a minute, the poor don't really have enough money to spend in the first place, so somehow making the prices go up, allows them to spend more. Yeah, I don't know about that. Isn't that basically the same thing FDR did by forcing business to sell goods for a certain price? Oh yeah, it was, and the Great Depression lasted 11 years because of it. (Most depressions last 4) By the way, those IRS and FED balance sheets have a lot of stuff missing. And yeah, they pumped 7.77 trillion into the economy during the bailout, and they also shot some money over to Europe for awhile. You're right, I misspoke when I said they gave it to the government directly, but they gave it to banks. The banks now have 7.77 trillion dollars to give loans on. So now, they're receiving interest on money that comes from nothing and making inflation rise. Maybe Bernanke is just terrible with math. I don't know. And I said \"was\" in secret. Bernanke also can't keep his mouth shut. And my opponent argues that this EPI index is flawed, unlike the CPI because of outside factors with supply. So wouldn't things like cars and houses, which the CPI only takes into account, also be affected by supply factors? Everything has to be produced. Increases in the price of gas affects how machines that create cars are made. So, I don't see how this EPI could be too terribly flawed, only a more reliable source. High or unpredictable inflation rates are regarded as harmful to an overall economy. They add inefficiencies in the market, and make it difficult for companies to budget or plan long-term. Inflation can act as a drag on productivity as companies are forced to shift resources away from products and services in order to focus on profit and losses from currency inflation.[11] Uncertainty about the future purchasing power of money discourages investment and saving.[30] And inflation can impose hidden tax increases, as inflated earnings push taxpayers into higher income tax rates unless the tax brackets are indexed to inflation. -Wikipedia So apparently I'm not the only one who thinks inflation is a bad thing. It seems Wikipedia agrees with me. And since 1913, the value of our dollar has decreased and inflation has risen over 2000% But, gold stays the same for 200 years! Wow, that's crazy. And since its limited unlike paper, inflation barely even occurs. Plus our government really shouldn't be spending as much money as it does in the first place, seeing the ridiculous things our government pays for. And yeah, dude, REALLY! Keynes himself died in 1946. I don't think he was using data points from the 1970's. I'm thinking even he had to use some data points from a good number of years back, when many policies we have today were not around. The FED creates inflation through basically counterfeiting money and then either shoving it into the banks, or giving it to the government and letting them pump it into the economy somehow. Inflation, overall, is a negative factor in an economy. It destabilizes the economy. Also, when a recession occurs, pumping money into it doesn't always fix it. Even with money, people will still not buy from the businesses the government tries to prop up, such as General Motors. Businesses are not supposed to stay in existence forever because they're \"too big to fail\" In a free market, that business would go under, and a better business would take its place. So, main points. The FED destabilizes the economy through inflation. The FED disrupts the market by propping up businesses that, in a free market, would normally go out of business and something else would replace it. The FED creates our most unfair tax through inflation. Prices rise, and people have to pay for those increased prices. The lost purchasing power is received by the government. (Bernanke even said it was a tax.) The FED rarely prevents economic crashes. (I say this because my opponent did bring up one incident where the FED supposedly did this. I really don't know if this is true or not. The FED dilutes our currency and the decreases the value of the dollar."],"PremiseEndPos":[15869],"ArgumentID":"00000004","Conclusion":"The Federal Reserve Bank of the United States ought to be abolished","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":222,"nextID":"00000006","PremiseStartPos":[15884],"prevID":"00000004","Premise":["I have 2 main contentions against the proposition that the Federal Reserve should be abolished 1: The Federal Reserve bank is necessary to maintaining price stability. I will explain further if challenged, but prices convey vital information to producers, consumers, workers, and investors in an economy. Sudden and/or unexpected changes in the overall level of prices can have adverse effects on national output by changing the terms of trade. A central, independent monetary authority, like the Federal Reserve, can help to maintain price stability that cannot happen either under a Gold Standard or under a free-banking system. 2: The Federal Reserve Bank can provide economically useful counter-cyclical policies that could not happen under a gold standard or free banking system. Sudden reductions in the quantity or velocity of money due to various events in an economy can, without justification, cause output to fall, unemployment to rise, and consequently overall happiness to decrease. By expanding the monetary base through the printing press, the Federal reserve can offset the contractionary effects of such events."],"PremiseEndPos":[17013],"ArgumentID":"00000005","Conclusion":"The Federal Reserve Bank of the United States ought to be abolished","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":222,"nextID":"00000007","PremiseStartPos":[17028],"prevID":"00000005","Premise":["In responding, point by point, to the criticisms by my opponent, I shall expound further upon my contentions as well. Let's begin \"I would like to ask my opponent what his definition of price stability is.\" Price stability describes a long-run trend in prices throughout an economy to not experience unexpected, or volatile, inflation or deflation. Price stability absolutely does not necessarily imply that prices do not change at all. The allocative effects of a monetary regime where prices do not change at all are not different from the effects of a monetary regime where prices constantly rise by 2% every year. \"It seems like all the Federal Reserve does is increase the money supply, which in turn causes inflation, and then makes the prices of goods appear to go up.\" There are two kinds of prices in economics, and I think that my opponent deserves some credit for keeping this in mind. There are nominal prices, which are the actual dollar figure that appear on goods and services at the point of sale, and there are relative prices, which are the real prices, or the prices relative to other goods and services. The price of, say, cars has skyrocketed since 1924, but relative to most other goods and services, such as the labor he or I sell to our employers, the prices of cars have fallen, assuming quality parity (A car that you could get 75,000 miles out of at most today before junking it is much better than a new car in 1924, which could never get 75,000 miles before junking) This is the importance of prices. They convey certain vital information to producers, consumers, workers, and investors, and that information is a quick assessment of the economic cost, which is the cost of the next-best alternative use of that resource. Imagine I have a choice of two mutual funds, one to build a hydroelectric dam, and another to build a computer factory, and the one building a hydroelectric dam promises to offer a 5% return on my investment over the next 10 years. That information isn't useful unless I know the price of hte next-best foregone alternative, which is the computer factory investment. Similarly, I don't know how much my labor is actually worth at McDonalds if I don't know the price my labor can fetch at the next best alternative workplace. This information, conveyed in prices, allows everyone to make economic decisions which maximize their welfare. \"They do this by creating money from nothing. This money is then pumped into the economy and dilutes the currency. This causes prices to appear to go up. Prices don’t really go up because the ways goods are produced stay the same. It just takes more money to produce the goods because of inflation.\" Having informed his readers of the classical dichotomy between real and nominal factors, my opponent appears to confuse the two in the last sentence. Inflation does not make it more difficult to produce goods by making nominal prices rise. A layperson might forgivably think that, since a brand new car cost roughly 500$ in 1929, but almost $20,000 today, that it is therefore 40 times harder to buy that car today than in 1929. An economist would say, however, that the price of the good that the layperson sells in order to buy that car, his labour, has risen by an even higher amount than the price that the car has risen. One could say that had prices not risen, it would still be easier, but if overall prices throughout the economy had not risen, then the price of the labor that he sells in order to pay for the car would not have risen either, and it would be no easier to buy that car. \"Inflation is also a tax. It is our most unfair tax. I really hate explaining this because its time consuming, so I'm just going to let Ron Paul do it for me. It’s a quick video, don’t worry.\" This is probably one of the most misunderstood concepts in macroeconomics, and I assign every ounce of blame for that to Ron Paul. Inflation is only a tax if said inflation actually takes away output that can be purchased by consumers and gives that ability to investors and the government. Now it is true that some of our government spending is, effectively, funded by seigniorage, or the printing of money in place of taxes, but this is peanuts compared to the actual tax take of the United States Government. However, how does the Federal Reserve buying securities from banks, who then simply hoard the cash in their vaults because of the market interest rate (I will explain the zero lower-bound if challenged) cause consumers to be unable to buy as much output? Ron Paul never explains this, and for that reason alone this argument does not carry. However, there are good reasons to think that, rather than a tax on the poor, a moderate (3-4%) inflation target would help the poor. I hesitate to argue this because there is contradictory evidence on the distribution of income between wages and yields to capital. However, for now, I will say this, Some evidence indicates that the ratio of labor incomes to capital incomes has remained steady at about .7 for hte past 40 years, which indicates that inflation has not created a \"regressive tax.\" There is, however, some evidence, based on the possibly-widening gap between labour productivity and total labor compensation that the low-inflation regime created by Paul Volcker has redistributed income from workers to investors. This gap, however, only appeared after Paul Volcker, and did not occur when the Federal Reserve had a high inflation target between the 1950s and the 1970s. Once again, I hesitate to argue this because, depending on what source you use, or even when you use one source (Paul Krugman now thinks that the gap between worker productivity and wage income has grown in the past 40 years today, however in his 1996 paper \"Ricardo's Difficult Idea\", when he was still a neo-liberal defending NAFTA against cooks and cranks like Ross Perot, he showed that the evidence which indicates such a gap is very poorly used.), you will get different answers. \"Can it? I don’t think I have ever heard of that happening.\" Sure it can. In 1986 there was a massive plunge in the stock market amid the savings and loan crisis. Ordinarily this would have caused a massive decline in investment spending and, consequently, a recession, but the Federal Reserve turned on the printing presses and flooded the market with liquidity, ensuring that the 1980s economic expansion would continue on. \"And in fact, the Federal Reserve was created before the Great Depression. It did not maintain the economy.\" Notice that my contention was \"can provide economically useful counter-cyclical policy\", not that it always does. There are examples, for instance in 1921 and 1933, of the Federal Reserve reneging on its authority to act as a lender of last resort in the event of a downturn in the economy, but that simply does not mean that these crises would not have happened if we didn't have a Federal Reserve."],"PremiseEndPos":[23964],"ArgumentID":"00000006","Conclusion":"The Federal Reserve Bank of the United States ought to be abolished","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":222,"nextID":"00000008","PremiseStartPos":[23979],"prevID":"00000006","Premise":["\" Your argument is false.\" It was more an honest question. How DOES Quantitative easing increase inflation when such money, we know, does not create aggregate demand? \"And that also has major problems with running up the nations debt.\" What exactly are those problems? We've seen, in the case of Japan and Britain, that despite far larger debt/GDP ratios, they were and are still able to borrow at record low costs. In fact, despite our current debt/GDP ratio being over 100%, short-term borrowing costs for the United States Federal Government are negative. \"So no, inflation is still a tax because the government receives the lost purchasing power of the people, and it is still happening.\" Once again, the overwhelming vast majority of our government's spending comes from either taxes or borrowing through the bond markets. Seigniorage can be calculated by taking the amount of money that the government borrows over a certain amount of time and reducing it by the inflation rate over that period of time. Inflation, because it has been incredibly low, and actually negative when you look at the period of 2009-2012, has not reduced real bond yields on treasury bills. \"Inflation is a regressive tax.\" Once again, how? The simple fact is, with the exception of people who are living on pension funds and zero-interest cash, poor people and people on fixed incomes live on incomes which are indexed to inflation. The former groups comprise a tiny minority. The overwhelming majority of people in our nation are debtors, and unexpected inflation redistributes wealth to them from creditors. Because prices do not adjust in the short run, this gives money from people who have a low propensity to consume (they are savers, after all) to people who have a high propensity to consume (that's why they're in debt in the first place). This increases national income in the short run. \"This started in Europe with their central banks hundreds of years ago.\" Why is it that opponents of Keynesian economics, like Austrians, and other heterodox economists and economic historians usually resort to data points which are hundreds, in the case of Ron Paul, thousands of years old? Economists and Econometricians use recent data (the last 40 years) in building their models and telling their stories because we actually have data on important macroeconomic variables from the very recent past. We have no data on the monetary base, real rates of interest, inflation rates, trade volumes, capital markets, etc. from the time of the Romans, so it's useless to actually use that data to build an economic model. \"And about a 3-4% inflation rate helping the poor. I really don't know where you got this information. If you could cite resources, it would be very helpful. \" Economist and former chairman of the Council of Economic Advisers under George W. Bush N. Gregory Mankiw explains, on pg. 106, that moderate inflation can help to reduce unemployment in the labour markets by making workers more likely to accept real wage cuts. If workers are in a field that is the only one to make use of their skills, and if said field is dying, then workers are less likely to quit their jobs. This increases national income and reduces unemployment, which, unarguably, hurts the poor more than the rich or middle class. \"My main argument, is that the FED does more harm than good\" We have not seen this demonstrated."],"PremiseEndPos":[27377],"ArgumentID":"00000007","Conclusion":"The Federal Reserve Bank of the United States ought to be abolished","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":155,"ConclusionEndPos":222,"nextID":"00000000","PremiseStartPos":[27392],"prevID":"00000007","Premise":["\"And it is not a good idea to stimulate the economy by just throwing more money into it. It never works. Which is a major flaw in Keynesian economics.\" That is an incredibly broad and sweeping claim. You're not going to convince anyone here, no matter how fanatically-devoted to Ron Paul they are, that Keynesian economics is wrong by dismissing out of hand their monetary prescriptions. The empirical evidence (unemployment in all sectors and yet very little change in nominal wages shows that sticky prices and wages, combined with a fall in investment and consumption spending are responsible for our woes) shows, strongly, that the recession was caused by a fall in aggregate demand, which was caused by a fall in investment spending thanks to the financial sector. Now it is true that short-term interest rates are close to zero, but long-term interest rates are not. 10-year treasury bonds currently 2%, which means that monetary stimulus, if the Fed can convince the bond markets that it will aim for a larger inflation target (say 4% instead of the usual 2%) can work even when short-term quantitative easing can't. \"The government says it is at 3.1%.\" There are several measures of inflation, the CPI being one among many. There's the GDP deflator, which shows strong deflation since 2008, there's the employment cost index, the fisher index, the billion price index, etc. which show that, since 2008, prices have fallen. \"But the formula they use to calculate it is by using products that people rarely buy, like cars, and houses.\" And so what if an individual does not buy cars or houses very often? Millions are being sold every year, and the quantity and velocity of money will be reflected in the prices that are charged for such services. \"The real inflation rate is actually above a whopping 8%. This includes all products that you buy everyday like milk and cereal. This formula is called the EPI (Everyday Price Index)\" The so-called EPI is fatally flawed, especially when using it to judge monetary policy, because the factors which are responsible for the increases in the price of gas (and, thus, food) are real supply side factors, not demand-side factors in America. \"And, there’s really no way of telling whether Congress taxes more than the FED because there’s no real straight story on how much the FED creates a year\" You can check the Fed balance sheet any time. \"and there’s also not a straight story on how much the government receives in taxes per year.\" The IRS publishes the amount it collects in taxes every year. \"Also the FED creates money depending on the economy. Of course it does. That's how the FOMC works. It sets a short-term interest rate target by buying or selling assets on the open market. When the interest rate is below the target rate, the FOMC sells assets, the most popular being short-term treasury bonds. If interest rates are too high, the federal reserve buys assets. \"In 2008, the FED gave the government 7.7 trillion dollars for the bailout.\" Eh, no. The Federal Reserve loaned several trillion dollars to private investment banks and other depository institutions and other central banks. It didn't give money to the federal government. \"And that was in secret.\" Then how do you know about it? \"That is way more than the government takes in with taxes, which from what I’ve seen, averages around 2 trillion a year. There is really no way of telling how much money they pump into the economy.\" Again, the Federal Reserve injects money into the economy by buying assets. Loans are last-resort by banks. \" But another problem is that the government spends way more than it takes in. The Federal Reserve creates most of its money from debt.\" Sure, most of the assets that the Federal Reserve buys are treasury bonds, but it has also bought other assets. \" This means that our money is basically backed by debt.\" We do not have a fixed exchange rate monetary policy, which means that our money isn't backed by anything. Money is just a convenient, universal medium of exchange. But treasury bills are an asset. You really can have treasury bills in your portfolio and then sell them and use the money to buy stuff, as in output. Money really does create output in the economy. \" It might seem good at some points, but that’s only because all of this money is just credit. Bad credit.\" That doesn't follow at all. \"And the reason that Austrian economics sometimes use examples from hundreds and hundreds of thousands of years ago, is because, there’s only so many variations of government.\" That definitely does not follow at all. Variations of government, therefore we need to use data points which are hundreds of years old and shrouded in obscurity? You're seriously going to tell me that inflation caused the downfall of the Roman Empire when we have absolutely no GDP figures with which to tell our stories? The Byzantines didn't have an IRS or Bureau of Labour Statistics. \"Every school of thought has to base its knowledge from somewhere, and most of the time, its from hundreds of years ago.\" Really? You're REALLY going to claim that every school, even the Neo-Keynesian school's models are based on data points which are hundreds of years old? You really think that Keynesian econometricians use data from the recent past?"],"PremiseEndPos":[32679],"ArgumentID":"00000008","Conclusion":"The Federal Reserve Bank of the United States ought to be abolished","PremiseStance":["Con"]}}]}