{"MetaData":{"Context":"URL: http://www.debate.org/debates/The-Lego-Movie-is-the-Best-Movie-Ever/1/\nCrawl date: 2016/09/29 03:13:30\nDebate: The Lego Movie is the Best Movie Ever | Debate.org\nNumber of arguments: 8\n\n\nEvidence Pro: The Lego Movie, my favorite movie, is the best movie ever because it is funny, has lots of action, suspense, romance, and the best cliff-hanger ending ever! Also, it has a funny catchy song \"Everything is Awesome\". However, it should be noted that it Barely beat my previous favorite, Frozen. Mainly because Let it Go is so catchy along with the other songs. SPECIAL PRIZE FOR WINNER (If con wins): I will watch the movie con says.\n\nEvidence Pro: I argue first of all that overall The Lego Movie has received nearly unanimous reviews, having a \"96% certified fresh\" from rotten tomatoes, and a high score of 82 on meta critic. it is true--the movie has a heart-warming solution, and I am not talking about the lame \"Believe in yourself\"--no, I am talking about the movie's very climax, the point in which The \"Special\", Emmet, is almost defeated by Lord Business, the villain. The solution actually make sense, because they reveal it's actually father vs son all along, and this creates a special relationship between Emmet and Lord Business, making the villain not really a villain but just an antagonist. This is the main reason why I love The Lego Movie: it has a great solution and lesson that teach the little kids bad people don't have to be bad people--and The Father, or, \"Man Upstairs\", really isn't evil. He's just an adult who likes perfection and looks down upon his son's crazy inventions. But when he really looks into it, and his son is brave enough to speak up, he really has a change of heart. In conclusion to this round--the climax/solution is awesome, making The Lego Movie have a deeper level of lesson than any average PG movie. You have not yet stated what movie you think is the best, so I cannot make the contradiction against yours. Nevertheless it will be hard to come up with a movie better than The Lego Movie. Good luck to you.\n\nEvidence Pro: Money means nothing. avatar (2010) is the most \"successful\" movie based on your opinion, but this is not true. avatar has only earned so much because of ticket inflation prices. therefore you cannot base a movie on how much money it has made. furthermore, you have yet to prove the point of which one movie truly IS the best. You have no ONE movie in particular to prove it better in plot, suspense, romance, comedy, and other genres of The Lego Movie. the Lego Movie only had one flaw as far as I could read from the audience reviews--some people did not like the animation. However, the animation does not really affect the movie overall. Its nice storyline and likable characters are really what makes the movie likable. Hating the Lego movie just because of its animation is saying not liking any animated movies at all because they are \"kid-like\" and not manly enough for the adults watching the movie. The movie is meant for kids but apparently all ages of audience like it, showing that the movie is truly popular! I would love to see what you think the best movie is and compare it to the Lego Movie. if there are really so much movies better than the Lego Movie, then please pick one and go with it!\n\nEvidence Pro: I argue that all movies have flaws, as quoted by CinemaSins. Even a \"100% fresh\" on rotten tomatoes--One example, \"The Rocket\", has a \"72\" on Metacritic. This shows that both sites are fluctuated--a movie might seem better than The Lego Movie by the standards of the audience from Rotten Tomatoes, but this same exact movie might receive a much lower score on Metacritic. However, everywhere I see, The Lego Movie has generally positive reviews that make it better than other movies. Every movie has better things than other movies, however, The Lego Movie is so good in every possible way that in general, it is better than every other movie--with nail-biting tension every second after the problem is posed, and great action-adventure combined with the perfect click of comedy within the movie, make the movie better than others that might have higher ratings. In addition, while the lego movie might have only earned $372,532,000 as said by wikipedia by far, its box office opening is incredible, earning a massive $69.1 million, surpassing Disney's impressive Frozen's box office opening, and the second highest weekend debut in February as well!! Other movies might have better animation, but is its plot better? Is its characters as developed and/or as well-liked as the ones in The Lego Movie? I doubt it. As of the Last Round, I make my overall conclusion: The Lego Movie, being well-liked by not only the critics but as well as the audience and suitable for all ages, is truly the best movie ever. Good debate. If I lose this debate, congrats to you, opponent. You are awesome! (Along with everything else. Because everything is awesome!!)\n\nEvidence Con: I accept and look forward to an interesting debate. Best of luck to my opponent!\n\nEvidence Con: I don't believe the Lego Movie was the best movie ever. First, some definitions for clarification purposes: The Lego Movie: \"The LEGO (R) Movie\" is the first-ever, full-length theatrical LEGO (R) adventure. The original 3D computer animated story follows Emmet (Chris Pratt) an ordinary, rules- following, perfectly average LEGO mini figure who is mistakenly identified as the most extraordinary person and the key to saving the world. He is drafted into a fellowship of strangers on an epic quest to stop an evil tyrant, a journey for which Emmet is hopelessly and hilariously under prepared. (c) Warner Bros [1] Best: Better than all others in quality or value. Most skillful, talented, or successful. [2] Ever: At any time. At all times. [3] [1] style=\"text-decoration: underline;\">I. The Lego Movie was not more successful than all others. For the purpose of this debate, I will be using the term successful as a means of describing the financial gain and/or profits made by this movie. If Lego Movie was the best movie of all time, then it would must be the most successful movie of all time. Has the Lego Movie been the most successful movie of all time? According to the website 'Rotten Tomatoes': \"The Warner Bros. release grossed an estimated $69.1M from 3,775 theaters for a sensational $18,307 average.\" [4] \"Overall, it was the second largest February opening in history trailing only the $83.8M of The Passion of the Christ from ten years ago. It was also the third best animated debut outside of summer following The Incredibles ($70.5M in November 2004) and The Lorax ($70.2M in March 2012).\" [4] While the movie was a hit amongst fans, the evidence speaks for itself - it was not nor is the most successful movie of all time considering at-least two other animated films have debuted with greater amounts of success. If my opponent chooses to refute this claim, I will gladly expand with further evidence to prove my point in later rounds. [4] style=\"text-decoration: underline;\">II. The Lego Movie is not the best movie of all time in terms of Ratings. More often than not, when someone debates which movie is better or which movie is the best, some valid empirical evidence is necessary to weed out the emotional aspect of this highly subjective debate topic. For my next point, I will refer to several well-respected lists of ratings that the movie has received. If it is really the best movie of all time, then surely there are no other movies in the world that have equal or higher ratings. 1) IMDb.com - gave the movie a rating of 8.3/10. [5] While this is a good rating, IMDb.com currently has 116 films with a rating of 8.3 or better. [6] 2) Rottentomatoes.com - gave the movie a rating of 96% while the audience rates it at 90%. [7] While this is a great rating, Rottentomatoes.com currently has over 100 movies with higher ratings. [8] 3) Metacritic.com - gave the movie a rating of 82, while the users gave it a 8.5/10. [9] While this is, again, a good rating, metacritic has at-least 150 movies with higher ratings than that. [10] In fact, the only site I saw that gave it a perfect 4/4 was rogerebert.com. [11] While this is impressive, that website has given out countless 4/4 scores, thus making it impossible to determine if it truly beats out any other 4/4 movies they have rated in the past. [5] style=\"text-decoration: underline;\">III. In Conclusion, I feel that I have provided valid evidence proving that The Lego Movie is not the best movie ever. I will wait until Round 3 to provide my rebuttals against my opponents initial argument.\n\nEvidence Con: I. Money is a valid gauge for determining the value of something. My opponent attempts to claim that money is not a valid gauge for determining the success of a movie because of ticket inflation prices. This is absurd. It takes an extremely basic mathematical formula to calculate the real worth of a certain amount of money. One can even Google 'inflation calculator' to find a free-to-use calculator for determining such things. To claim that using money isn't a valid form of comparing success because of inflation is a joke at best. The literal definition of success is: a person or thing that has had success, as measured by attainment of goals, wealth, etc. [1] In addition to that, the term best is defined as: Better than all others in quality or value. Most skillful, talented, or successful. [2] Clearly it can be seen that using money as a gauge for determining which movie is the most successful and in turn \"the best movie of all time\" then it is most certainly fair to use money as a determining factor. Especially when considering the subjective nature of what movie is \"the best of all time\", we cannot allow emotion and personal preference to control a topic worthy of objective analysis. [1] [2] II. It is not my duty to provide which movie is best or better. My opponent has attempted to claim that I must provide a movie which is better than the Lego Movie or what I think is the best movie of all time. My opponent has made the bold claim that The Lego Movie is the best movie of all time. All that I must do is provide valid evidence that proves that there are better movies that have been made throughout the history of film. In my previous round, I have done just that. I have proven that The Lego Movie is not the highest rated movie of all time, I have proven that The Lego Movie is not the highest grossing film of all time (financially speaking), and I have proven that not everyone agrees that The Lego Movie is the best movie of all time. If you consider the definition of the term best, The Lego Movie has not met each of those standards. We are not debating if one movie is better than the other, or if The Lego Movie is 'possibly' the best movie of all time. As I said earlier, my opponent has made a claim that is in essence an absolute claim. I have proven that his claim is inaccurate by using objective methods of comparison. III. My opponent has proven my point for me. In round 3, my opponent said the following: \"T he Lego Movie only had one flaw as far as I could read from the audience reviews--some people did not like the animation.\" This statement alone proves my case that The Lego Movie is not the best movie of all time. For someone to not like something, they are using their mental capability of passing judgement based on phenomenon in which someone compares something to another similar thing. I think it is safe to say that The Lego Movie was not the first animated film the critic has seen, especially if they are playing the role of critic. If this wasn't the best animation they've ever seen, then The Lego Movie could not possibly be the best movie of all time. No matter how my opponent wants to spin it - animation is part of the movie and thus is responsible for determining the success of the film. In Conclusion, I have presented arguments which remains unchallenged by my opponent. Such as the fact that literally hundreds of films have received higher ratings and success than The Lego Movie. Therefore, I extend all arguments while also presenting the rebuttals above against my opponent's claims.\n\nEvidence Con: I. My opponent fails to understand the ramifications of making an absolute claim. For the purpose of clarification, I will share what I mean by using the term 'absolute claim'. Absolute claims are unqualified claims that often include words such as: best, pure, vital, essential, every and all. These claims must always be accurate. If the claim is not always accurate, the claim will be misleading. [1] When my opponent made the absolute claim that The Lego Movie is the best movie ever, he took on the burden of proof to show that his statement must be accurate no matter what. By simply admitting that some people didn't like the movie himself, he immediately made his claim inaccurate. Furthermore, by sharing evidence that the movie is not considered the best movie of all time by several critics (who all favored other movies), ratings, reviews and sales I have shown that my opponents statement is inaccurate. [1] II. \"Generally positive reviews\" does not qualify something as the best movie of all time. As I said before, if something is to be considered the best movie of all time, it would logically need to be paired with the best reviews of all time. You cannot take something that is considered to have \"generally positive reviews\" and imply that is the best movie of all time. The term \"generally\" is defined as: usually; commonly; ordinarily. [2] Therefore, something of an \"ordinary\" sense could never be considered the \"best\" which is the term relevant to our discussion and one that I have defined earlier. Also, even IF generally positive reviews imply that it is better than other movies - it does not qualify it as the best movie of all time. The best movie of all time would have to have the best reviews a movie has ever received throughout the history of film. [2] Conclusion, I have already pointed out that in sales it was not the highest earning animated film in the history of film, even when opening box office sales are considered. My opponent made the ultimate mistake of claiming something was the best of all time without having adequate proof to prove the accuracy of such a statement. I, in turn, have presented evidence that proves that my opponent's statement was inaccurate on several different levels. I thank my opponent for the challenge and thought-provoking topic.\n","DiscussionID":"00000031","Title":"The Lego Movie is the Best Movie Ever","CrawlDate":"2016/09/29 03:13:30","URL":"http://www.debate.org/debates/The-Lego-Movie-is-the-Best-Movie-Ever/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":153,"nextID":"00000002","PremiseStartPos":[205],"prevID":"00000000","Premise":["The Lego Movie, my favorite movie, is the best movie ever because it is funny, has lots of action, suspense, romance, and the best cliff-hanger ending ever! Also, it has a funny catchy song \"Everything is Awesome\". However, it should be noted that it Barely beat my previous favorite, Frozen. Mainly because Let it Go is so catchy along with the other songs. SPECIAL PRIZE FOR WINNER (If con wins): I will watch the movie con says."],"PremiseEndPos":[637],"ArgumentID":"00000001","Conclusion":"The Lego Movie is the Best Movie Ever","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":153,"nextID":"00000003","PremiseStartPos":[652],"prevID":"00000001","Premise":["I argue first of all that overall The Lego Movie has received nearly unanimous reviews, having a \"96% certified fresh\" from rotten tomatoes, and a high score of 82 on meta critic. it is true--the movie has a heart-warming solution, and I am not talking about the lame \"Believe in yourself\"--no, I am talking about the movie's very climax, the point in which The \"Special\", Emmet, is almost defeated by Lord Business, the villain. The solution actually make sense, because they reveal it's actually father vs son all along, and this creates a special relationship between Emmet and Lord Business, making the villain not really a villain but just an antagonist. This is the main reason why I love The Lego Movie: it has a great solution and lesson that teach the little kids bad people don't have to be bad people--and The Father, or, \"Man Upstairs\", really isn't evil. He's just an adult who likes perfection and looks down upon his son's crazy inventions. But when he really looks into it, and his son is brave enough to speak up, he really has a change of heart. In conclusion to this round--the climax/solution is awesome, making The Lego Movie have a deeper level of lesson than any average PG movie. You have not yet stated what movie you think is the best, so I cannot make the contradiction against yours. Nevertheless it will be hard to come up with a movie better than The Lego Movie. Good luck to you."],"PremiseEndPos":[2063],"ArgumentID":"00000002","Conclusion":"The Lego Movie is the Best Movie Ever","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":153,"nextID":"00000004","PremiseStartPos":[2078],"prevID":"00000002","Premise":["Money means nothing. avatar (2010) is the most \"successful\" movie based on your opinion, but this is not true. avatar has only earned so much because of ticket inflation prices. therefore you cannot base a movie on how much money it has made. furthermore, you have yet to prove the point of which one movie truly IS the best. You have no ONE movie in particular to prove it better in plot, suspense, romance, comedy, and other genres of The Lego Movie. the Lego Movie only had one flaw as far as I could read from the audience reviews--some people did not like the animation. However, the animation does not really affect the movie overall. Its nice storyline and likable characters are really what makes the movie likable. Hating the Lego movie just because of its animation is saying not liking any animated movies at all because they are \"kid-like\" and not manly enough for the adults watching the movie. The movie is meant for kids but apparently all ages of audience like it, showing that the movie is truly popular! I would love to see what you think the best movie is and compare it to the Lego Movie. if there are really so much movies better than the Lego Movie, then please pick one and go with it!"],"PremiseEndPos":[3287],"ArgumentID":"00000003","Conclusion":"The Lego Movie is the Best Movie Ever","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":153,"nextID":"00000005","PremiseStartPos":[3302],"prevID":"00000003","Premise":["I argue that all movies have flaws, as quoted by CinemaSins. Even a \"100% fresh\" on rotten tomatoes--One example, \"The Rocket\", has a \"72\" on Metacritic. This shows that both sites are fluctuated--a movie might seem better than The Lego Movie by the standards of the audience from Rotten Tomatoes, but this same exact movie might receive a much lower score on Metacritic. However, everywhere I see, The Lego Movie has generally positive reviews that make it better than other movies. Every movie has better things than other movies, however, The Lego Movie is so good in every possible way that in general, it is better than every other movie--with nail-biting tension every second after the problem is posed, and great action-adventure combined with the perfect click of comedy within the movie, make the movie better than others that might have higher ratings. In addition, while the lego movie might have only earned $372,532,000 as said by wikipedia by far, its box office opening is incredible, earning a massive $69.1 million, surpassing Disney's impressive Frozen's box office opening, and the second highest weekend debut in February as well!! Other movies might have better animation, but is its plot better? Is its characters as developed and/or as well-liked as the ones in The Lego Movie? I doubt it. As of the Last Round, I make my overall conclusion: The Lego Movie, being well-liked by not only the critics but as well as the audience and suitable for all ages, is truly the best movie ever. Good debate. If I lose this debate, congrats to you, opponent. You are awesome! (Along with everything else. Because everything is awesome!!)"],"PremiseEndPos":[4951],"ArgumentID":"00000004","Conclusion":"The Lego Movie is the Best Movie Ever","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":153,"nextID":"00000006","PremiseStartPos":[4966],"prevID":"00000004","Premise":["I accept and look forward to an interesting debate. Best of luck to my opponent!"],"PremiseEndPos":[5047],"ArgumentID":"00000005","Conclusion":"The Lego Movie is the Best Movie Ever","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":153,"nextID":"00000007","PremiseStartPos":[5062],"prevID":"00000005","Premise":["I don't believe the Lego Movie was the best movie ever. First, some definitions for clarification purposes: The Lego Movie: \"The LEGO (R) Movie\" is the first-ever, full-length theatrical LEGO (R) adventure. The original 3D computer animated story follows Emmet (Chris Pratt) an ordinary, rules- following, perfectly average LEGO mini figure who is mistakenly identified as the most extraordinary person and the key to saving the world. He is drafted into a fellowship of strangers on an epic quest to stop an evil tyrant, a journey for which Emmet is hopelessly and hilariously under prepared. (c) Warner Bros [1] Best: Better than all others in quality or value. Most skillful, talented, or successful. [2] Ever: At any time. At all times. [3] [1] style=\"text-decoration: underline;\">I. The Lego Movie was not more successful than all others. For the purpose of this debate, I will be using the term successful as a means of describing the financial gain and/or profits made by this movie. If Lego Movie was the best movie of all time, then it would must be the most successful movie of all time. Has the Lego Movie been the most successful movie of all time? According to the website 'Rotten Tomatoes': \"The Warner Bros. release grossed an estimated $69.1M from 3,775 theaters for a sensational $18,307 average.\" [4] \"Overall, it was the second largest February opening in history trailing only the $83.8M of The Passion of the Christ from ten years ago. It was also the third best animated debut outside of summer following The Incredibles ($70.5M in November 2004) and The Lorax ($70.2M in March 2012).\" [4] While the movie was a hit amongst fans, the evidence speaks for itself - it was not nor is the most successful movie of all time considering at-least two other animated films have debuted with greater amounts of success. If my opponent chooses to refute this claim, I will gladly expand with further evidence to prove my point in later rounds. [4] style=\"text-decoration: underline;\">II. The Lego Movie is not the best movie of all time in terms of Ratings. More often than not, when someone debates which movie is better or which movie is the best, some valid empirical evidence is necessary to weed out the emotional aspect of this highly subjective debate topic. For my next point, I will refer to several well-respected lists of ratings that the movie has received. If it is really the best movie of all time, then surely there are no other movies in the world that have equal or higher ratings. 1) IMDb.com - gave the movie a rating of 8.3/10. [5] While this is a good rating, IMDb.com currently has 116 films with a rating of 8.3 or better. [6] 2) Rottentomatoes.com - gave the movie a rating of 96% while the audience rates it at 90%. [7] While this is a great rating, Rottentomatoes.com currently has over 100 movies with higher ratings. [8] 3) Metacritic.com - gave the movie a rating of 82, while the users gave it a 8.5/10. [9] While this is, again, a good rating, metacritic has at-least 150 movies with higher ratings than that. [10] In fact, the only site I saw that gave it a perfect 4/4 was rogerebert.com. [11] While this is impressive, that website has given out countless 4/4 scores, thus making it impossible to determine if it truly beats out any other 4/4 movies they have rated in the past. [5] style=\"text-decoration: underline;\">III. In Conclusion, I feel that I have provided valid evidence proving that The Lego Movie is not the best movie ever. I will wait until Round 3 to provide my rebuttals against my opponents initial argument."],"PremiseEndPos":[8636],"ArgumentID":"00000006","Conclusion":"The Lego Movie is the Best Movie Ever","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":153,"nextID":"00000008","PremiseStartPos":[8651],"prevID":"00000006","Premise":["I. Money is a valid gauge for determining the value of something. My opponent attempts to claim that money is not a valid gauge for determining the success of a movie because of ticket inflation prices. This is absurd. It takes an extremely basic mathematical formula to calculate the real worth of a certain amount of money. One can even Google 'inflation calculator' to find a free-to-use calculator for determining such things. To claim that using money isn't a valid form of comparing success because of inflation is a joke at best. The literal definition of success is: a person or thing that has had success, as measured by attainment of goals, wealth, etc. [1] In addition to that, the term best is defined as: Better than all others in quality or value. Most skillful, talented, or successful. [2] Clearly it can be seen that using money as a gauge for determining which movie is the most successful and in turn \"the best movie of all time\" then it is most certainly fair to use money as a determining factor. Especially when considering the subjective nature of what movie is \"the best of all time\", we cannot allow emotion and personal preference to control a topic worthy of objective analysis. [1] [2] II. It is not my duty to provide which movie is best or better. My opponent has attempted to claim that I must provide a movie which is better than the Lego Movie or what I think is the best movie of all time. My opponent has made the bold claim that The Lego Movie is the best movie of all time. All that I must do is provide valid evidence that proves that there are better movies that have been made throughout the history of film. In my previous round, I have done just that. I have proven that The Lego Movie is not the highest rated movie of all time, I have proven that The Lego Movie is not the highest grossing film of all time (financially speaking), and I have proven that not everyone agrees that The Lego Movie is the best movie of all time. If you consider the definition of the term best, The Lego Movie has not met each of those standards. We are not debating if one movie is better than the other, or if The Lego Movie is 'possibly' the best movie of all time. As I said earlier, my opponent has made a claim that is in essence an absolute claim. I have proven that his claim is inaccurate by using objective methods of comparison. III. My opponent has proven my point for me. In round 3, my opponent said the following: \"T he Lego Movie only had one flaw as far as I could read from the audience reviews--some people did not like the animation.\" This statement alone proves my case that The Lego Movie is not the best movie of all time. For someone to not like something, they are using their mental capability of passing judgement based on phenomenon in which someone compares something to another similar thing. I think it is safe to say that The Lego Movie was not the first animated film the critic has seen, especially if they are playing the role of critic. If this wasn't the best animation they've ever seen, then The Lego Movie could not possibly be the best movie of all time. No matter how my opponent wants to spin it - animation is part of the movie and thus is responsible for determining the success of the film. In Conclusion, I have presented arguments which remains unchallenged by my opponent. Such as the fact that literally hundreds of films have received higher ratings and success than The Lego Movie. Therefore, I extend all arguments while also presenting the rebuttals above against my opponent's claims."],"PremiseEndPos":[12214],"ArgumentID":"00000007","Conclusion":"The Lego Movie is the Best Movie Ever","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":116,"ConclusionEndPos":153,"nextID":"00000000","PremiseStartPos":[12229],"prevID":"00000007","Premise":["I. My opponent fails to understand the ramifications of making an absolute claim. For the purpose of clarification, I will share what I mean by using the term 'absolute claim'. Absolute claims are unqualified claims that often include words such as: best, pure, vital, essential, every and all. These claims must always be accurate. If the claim is not always accurate, the claim will be misleading. [1] When my opponent made the absolute claim that The Lego Movie is the best movie ever, he took on the burden of proof to show that his statement must be accurate no matter what. By simply admitting that some people didn't like the movie himself, he immediately made his claim inaccurate. Furthermore, by sharing evidence that the movie is not considered the best movie of all time by several critics (who all favored other movies), ratings, reviews and sales I have shown that my opponents statement is inaccurate. [1] II. \"Generally positive reviews\" does not qualify something as the best movie of all time. As I said before, if something is to be considered the best movie of all time, it would logically need to be paired with the best reviews of all time. You cannot take something that is considered to have \"generally positive reviews\" and imply that is the best movie of all time. The term \"generally\" is defined as: usually; commonly; ordinarily. [2] Therefore, something of an \"ordinary\" sense could never be considered the \"best\" which is the term relevant to our discussion and one that I have defined earlier. Also, even IF generally positive reviews imply that it is better than other movies - it does not qualify it as the best movie of all time. The best movie of all time would have to have the best reviews a movie has ever received throughout the history of film. [2] Conclusion, I have already pointed out that in sales it was not the highest earning animated film in the history of film, even when opening box office sales are considered. My opponent made the ultimate mistake of claiming something was the best of all time without having adequate proof to prove the accuracy of such a statement. I, in turn, have presented evidence that proves that my opponent's statement was inaccurate on several different levels. I thank my opponent for the challenge and thought-provoking topic."],"PremiseEndPos":[14537],"ArgumentID":"00000008","Conclusion":"The Lego Movie is the Best Movie Ever","PremiseStance":["Con"]}}]}