{"MetaData":{"Context":"URL: http://www.debate.org/debates/Competition-is-good-for-success./1/\nCrawl date: 2016/09/29 07:54:44\nDebate Argument: Competition is good for success. | Debate.org\nNumber of arguments: 4\n\n\nEvidence Pro: Success is about working hard to do your best. Competition helps people to learn about their abilities and to create a plan for improvement. These skills are very valuable in the world as well. People can't choose their career paths well without knowing their strengths and weaknesses. The same is true in the world beyond schools. When a company hires an employee, it wants to see that this new employee has the ambition and the drive to succeed. A company also wants new employees who can identify their weaknesses and create their own plans to overcome these weaknesses. All of these qualities can be learned in a place that uses competition in the that place. Thank you.\n\nEvidence Pro: ahro0703 forfeited this round. Con Pro has FF. Will wait to see if they respond to R3 before proceeding with a conclusion/potential rebuttals.\n\nEvidence Pro: ahro0703 forfeited this round. Con Pro has failed to Reply to any of the points listed, I have stated a resolution and added 2 arguments disproving his theory. he has failed to participate in the debate for round 2 and 3, I would ask that you consider this while voting. This could have been an interesting debate!\n\nEvidence Con: I accept this debate and look forward to Pro's arguments. I'll be arguing that Competition is not good for Sucess. infact competition ruins many buisnesses and the only benefactor from competition is whoever is the most successful at what they do. ================================================= Businesses suffer when they compete I will provide some information from a very well written source that I have found on the internet(I'll be sure to cite it at the end of my argument) There is a huge economical drain on competing businesses which suffer directly from competition Coffee Chains: Tim Hortons a chain of coffee houses, lost $43.4 million trying to “Break in” to the US market\" “It was just a highly saturated market of quick service restaurants,\" said Spokesman David Morelli. \"It was not just one competitor. There were several...\"(November 11th, cnbc.com) Airlines: Since 2001 airlines have lost $60 billion because of federal taxation and “market saturation”(January 8th, www.nytimes.com Car Manufactures: By confusing the essence of his business with numbers, Akio Toyoda has dug himself into a very large hole(Record-Breaking Recalls...) . By turning Toyota's obsession from quality and reliability to sales and profitability, he may have unwittingly destroyed the reputation -- the brand -- that took four decades to create. (www.coolmarketingstuff.com Feb 27th 2010) market saturation Web definitions In economics, market saturation is a situation in which a product has become diffused within a market; the actual level of saturation can depend on consumer purchasing power; as well as competition, prices, and technology. ... ================================== Competition creates stress and pressure. The competition mindset creates nothing but stress and anxiety for the business owner, and ultimately forces them to think about what the competition is doing rather than what the customer really wants and would be willing to pay anything for. Let’s face it, if business owners listened to their customers and focused on the quality of the experience instead of the quantity of deliverables, they would have more fun creating more value for the customer. ====================================================== Conclusion: I have begun my opening arguments. Arguing that Competition does not promote a successful enviroment, and also competition is the source of failure for many businesses. Sources: I have heavily based my arguments off of the following site that is almost completely arguing against this topic.\n\nEvidence Con: Pro has FF. Will wait to see if they respond to R3 before proceeding with a conclusion/potential rebuttals.\n\nEvidence Con: Pro has failed to Reply to any of the points listed, I have stated a resolution and added 2 arguments disproving his theory. he has failed to participate in the debate for round 2 and 3, I would ask that you consider this while voting. This could have been an interesting debate!\n","DiscussionID":"00000069","Title":"Competition is good for success.","CrawlDate":"2016/09/29 07:54:44","URL":"http://www.debate.org/debates/Competition-is-good-for-success./1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":152,"nextID":"00000002","PremiseStartPos":[204],"prevID":"00000000","Premise":["Success is about working hard to do your best. Competition helps people to learn about their abilities and to create a plan for improvement. These skills are very valuable in the world as well. People can't choose their career paths well without knowing their strengths and weaknesses. The same is true in the world beyond schools. When a company hires an employee, it wants to see that this new employee has the ambition and the drive to succeed. A company also wants new employees who can identify their weaknesses and create their own plans to overcome these weaknesses. All of these qualities can be learned in a place that uses competition in the that place. Thank you."],"PremiseEndPos":[879],"ArgumentID":"00000001","Conclusion":"Competition is good for success.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":152,"nextID":"00000003","PremiseStartPos":[894],"prevID":"00000001","Premise":["ahro0703 forfeited this round. Con Pro has FF. Will wait to see if they respond to R3 before proceeding with a conclusion/potential rebuttals."],"PremiseEndPos":[1037],"ArgumentID":"00000002","Conclusion":"Competition is good for success.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":152,"nextID":"00000004","PremiseStartPos":[1052],"prevID":"00000002","Premise":["ahro0703 forfeited this round. Con Pro has failed to Reply to any of the points listed, I have stated a resolution and added 2 arguments disproving his theory. he has failed to participate in the debate for round 2 and 3, I would ask that you consider this while voting. This could have been an interesting debate!"],"PremiseEndPos":[1367],"ArgumentID":"00000003","Conclusion":"Competition is good for success.","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":152,"nextID":"00000005","PremiseStartPos":[1382],"prevID":"00000003","Premise":["I accept this debate and look forward to Pro's arguments. I'll be arguing that Competition is not good for Sucess. infact competition ruins many buisnesses and the only benefactor from competition is whoever is the most successful at what they do. ================================================= Businesses suffer when they compete I will provide some information from a very well written source that I have found on the internet(I'll be sure to cite it at the end of my argument) There is a huge economical drain on competing businesses which suffer directly from competition Coffee Chains: Tim Hortons a chain of coffee houses, lost $43.4 million trying to “Break in” to the US market\" “It was just a highly saturated market of quick service restaurants,\" said Spokesman David Morelli. \"It was not just one competitor. There were several...\"(November 11th, cnbc.com) Airlines: Since 2001 airlines have lost $60 billion because of federal taxation and “market saturation”(January 8th, www.nytimes.com Car Manufactures: By confusing the essence of his business with numbers, Akio Toyoda has dug himself into a very large hole(Record-Breaking Recalls...) . By turning Toyota's obsession from quality and reliability to sales and profitability, he may have unwittingly destroyed the reputation -- the brand -- that took four decades to create. (www.coolmarketingstuff.com Feb 27th 2010) market saturation Web definitions In economics, market saturation is a situation in which a product has become diffused within a market; the actual level of saturation can depend on consumer purchasing power; as well as competition, prices, and technology. ... ================================== Competition creates stress and pressure. The competition mindset creates nothing but stress and anxiety for the business owner, and ultimately forces them to think about what the competition is doing rather than what the customer really wants and would be willing to pay anything for. Let’s face it, if business owners listened to their customers and focused on the quality of the experience instead of the quantity of deliverables, they would have more fun creating more value for the customer. ====================================================== Conclusion: I have begun my opening arguments. Arguing that Competition does not promote a successful enviroment, and also competition is the source of failure for many businesses. Sources: I have heavily based my arguments off of the following site that is almost completely arguing against this topic."],"PremiseEndPos":[3920],"ArgumentID":"00000004","Conclusion":"Competition is good for success.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":152,"nextID":"00000006","PremiseStartPos":[3935],"prevID":"00000004","Premise":["Pro has FF. Will wait to see if they respond to R3 before proceeding with a conclusion/potential rebuttals."],"PremiseEndPos":[4043],"ArgumentID":"00000005","Conclusion":"Competition is good for success.","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":120,"ConclusionEndPos":152,"nextID":"00000000","PremiseStartPos":[4058],"prevID":"00000005","Premise":["Pro has failed to Reply to any of the points listed, I have stated a resolution and added 2 arguments disproving his theory. he has failed to participate in the debate for round 2 and 3, I would ask that you consider this while voting. This could have been an interesting debate!"],"PremiseEndPos":[4338],"ArgumentID":"00000006","Conclusion":"Competition is good for success.","PremiseStance":["Con"]}}]}