{"MetaData":{"Context":"URL: http://www.debate.org/debates/beauty-discrimination/1/\nCrawl date: 2016/09/29 04:41:58\nDebate: beauty discrimination | Debate.org\nNumber of arguments: 9\n\n\nEvidence Pro: So if a restaurant only want to only hire attractive girls to get more customers, higher tips or just want the customers to have a better time then I think it's completely fine. The reason for this is because if having attractive females boosts your sales then it means the attractive women are more qualified then other less attractive females or men would be. This is almost like complaining about model jobs are mainly open for more attractive people. I honestly think it should be up to the owner who he hires and who he doesn't hire. If you think this is morally wrong that is up to you but I feel you hire the person that is best suitable for the job no matter what.\n\nEvidence Pro: I'm not too good with law but are you sure its illegal to only hire white people? If so I think that's somewhat of a stupid law. Also race and beauty are not very much connected, race is completely based on genes and beauty is partially genetic but also has a lot to do with how you treat your body, personality, your charm etc. Beauty or charm is a trait which is subjective and race is concrete.\n\nEvidence Pro: Beauty defines the person in some way race don't. A black person can be attractive a white person can be attractive an Asian can be attractive. Beauty for the most part lies in your body such as stomach, teeth, hair etc which are all changeable in some way. But yes for the most part you don't choose how you look and you can't control it. But you know neither do you choose being smart for the most part. You don't really choose your IQ or understanding of math it's just how it is. Sure some people work really hard to try to become smarter or whatever but so do people trying to become attractive. And the difference between race and beauty in my opinion is that beauty is subjective and race is objective. You can say \"I don't really see the difference between male and female both are not changeable\" see the problem? And what I meant with it's stupid if there's a law on that it's illegal to only hire white people then I meant that if there's a law forcing you to hire less qualified people only because of their skin color then its stupid. I do understand what you're saying but I simply think \"beauty discrimination\" laws would be way too easy to abuse and would only harm people in this world.\n\nEvidence Pro: Id say race does not define you as a person at all but the culture you grow up in does. And overall when it comes to black/white it is usually a difference between culture. And if there is a owner that won't hire a attractive black women then its his loss. It makes his company lose money and if he want to loose money because he is retarded I think its fine. (If attraction would bring more money to the table). Again if you think this is morally wrong then it's up to you but I personally feel like this would not make a valid law and could get abused to ruin people's lives.\n\nEvidence Con: what do you think of places that hire only pretty girls like a restaurant, should we allow it because the owner will get more money from it & its his right? or should it be illegal because beauty is like a race since it cannot be changed?\n\nEvidence Con: i agree with you, but shouldnt it also apply for race? if an owner thinks that a white female will sell more then shouldnt he be allowed to hire only white people? & yet this is illegal\n\nEvidence Con: im not talking about charm, im talking about physical beauty like face features, & i dont see a difference between it & race, both are not changeable, so you think it should be ok to discriminate against black people? sounds like racism\n\nEvidence Con: i think you have a point, but can we really say that race doesnt defines the person at all? stereotypes? or people that generally dont find black women attractive? if there are people that dont find black women attractive then doesnt it falls into the category of beauty too?\n\nEvidence Con: i guess my mistake was in thinking that racial discrimination is wrong because they cannot change their race, but i guess its wrong because it is irrelevant as a job qualification, thanks for helping me understand ;)\n","DiscussionID":"00000111","Title":"beauty discrimination","CrawlDate":"2016/09/29 04:41:58","URL":"http://www.debate.org/debates/beauty-discrimination/1/"},"ArgumentList":[{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000002","PremiseStartPos":[173],"prevID":"00000000","Premise":["So if a restaurant only want to only hire attractive girls to get more customers, higher tips or just want the customers to have a better time then I think it's completely fine. The reason for this is because if having attractive females boosts your sales then it means the attractive women are more qualified then other less attractive females or men would be. This is almost like complaining about model jobs are mainly open for more attractive people. I honestly think it should be up to the owner who he hires and who he doesn't hire. If you think this is morally wrong that is up to you but I feel you hire the person that is best suitable for the job no matter what."],"PremiseEndPos":[846],"ArgumentID":"00000001","Conclusion":"beauty discrimination","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000003","PremiseStartPos":[861],"prevID":"00000001","Premise":["I'm not too good with law but are you sure its illegal to only hire white people? If so I think that's somewhat of a stupid law. Also race and beauty are not very much connected, race is completely based on genes and beauty is partially genetic but also has a lot to do with how you treat your body, personality, your charm etc. Beauty or charm is a trait which is subjective and race is concrete."],"PremiseEndPos":[1259],"ArgumentID":"00000002","Conclusion":"beauty discrimination","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000004","PremiseStartPos":[1274],"prevID":"00000002","Premise":["Beauty defines the person in some way race don't. A black person can be attractive a white person can be attractive an Asian can be attractive. Beauty for the most part lies in your body such as stomach, teeth, hair etc which are all changeable in some way. But yes for the most part you don't choose how you look and you can't control it. But you know neither do you choose being smart for the most part. You don't really choose your IQ or understanding of math it's just how it is. Sure some people work really hard to try to become smarter or whatever but so do people trying to become attractive. And the difference between race and beauty in my opinion is that beauty is subjective and race is objective. You can say \"I don't really see the difference between male and female both are not changeable\" see the problem? And what I meant with it's stupid if there's a law on that it's illegal to only hire white people then I meant that if there's a law forcing you to hire less qualified people only because of their skin color then its stupid. I do understand what you're saying but I simply think \"beauty discrimination\" laws would be way too easy to abuse and would only harm people in this world."],"PremiseEndPos":[2478],"ArgumentID":"00000003","Conclusion":"beauty discrimination","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000005","PremiseStartPos":[2493],"prevID":"00000003","Premise":["Id say race does not define you as a person at all but the culture you grow up in does. And overall when it comes to black/white it is usually a difference between culture. And if there is a owner that won't hire a attractive black women then its his loss. It makes his company lose money and if he want to loose money because he is retarded I think its fine. (If attraction would bring more money to the table). Again if you think this is morally wrong then it's up to you but I personally feel like this would not make a valid law and could get abused to ruin people's lives."],"PremiseEndPos":[3071],"ArgumentID":"00000004","Conclusion":"beauty discrimination","PremiseStance":["Pro"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000006","PremiseStartPos":[3086],"prevID":"00000004","Premise":["what do you think of places that hire only pretty girls like a restaurant, should we allow it because the owner will get more money from it & its his right? or should it be illegal because beauty is like a race since it cannot be changed?"],"PremiseEndPos":[3325],"ArgumentID":"00000005","Conclusion":"beauty discrimination","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000007","PremiseStartPos":[3340],"prevID":"00000005","Premise":["i agree with you, but shouldnt it also apply for race? if an owner thinks that a white female will sell more then shouldnt he be allowed to hire only white people? & yet this is illegal"],"PremiseEndPos":[3526],"ArgumentID":"00000006","Conclusion":"beauty discrimination","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000008","PremiseStartPos":[3541],"prevID":"00000006","Premise":["im not talking about charm, im talking about physical beauty like face features, & i dont see a difference between it & race, both are not changeable, so you think it should be ok to discriminate against black people? sounds like racism"],"PremiseEndPos":[3778],"ArgumentID":"00000007","Conclusion":"beauty discrimination","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000009","PremiseStartPos":[3793],"prevID":"00000007","Premise":["i think you have a point, but can we really say that race doesnt defines the person at all? stereotypes? or people that generally dont find black women attractive? if there are people that dont find black women attractive then doesnt it falls into the category of beauty too?"],"PremiseEndPos":[4069],"ArgumentID":"00000008","Conclusion":"beauty discrimination","PremiseStance":["Con"]}},{"Argument":{"ConclusionStartPos":100,"ConclusionEndPos":121,"nextID":"00000000","PremiseStartPos":[4084],"prevID":"00000008","Premise":["i guess my mistake was in thinking that racial discrimination is wrong because they cannot change their race, but i guess its wrong because it is irrelevant as a job qualification, thanks for helping me understand ;)"],"PremiseEndPos":[4301],"ArgumentID":"00000009","Conclusion":"beauty discrimination","PremiseStance":["Con"]}}]}